#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x2B0 (0x670 - 0x3C0)
// BlueprintGeneratedClass AdvancedEnemySpawner_StormMode.AdvancedEnemySpawner_StormMode_C
class AAdvancedEnemySpawner_StormMode_C : public AAdvancedEnemySpawner_C
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x3C0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                         EnemyNoSpawn;                                      // 0x3C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         CustomSpawner;                                     // 0x3C9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         NoPillarSpawner;                                   // 0x3CA(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3026[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class UClass*, float>                   EnemyPool;                                         // 0x3D0(0x50)(Edit, BlueprintVisible)
	float                                        Spawn_pool_Percetange;                             // 0x420(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         SetEnemyPoolPreset;                                // 0x424(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class Enum_StormModeArea                AreaEnemyPoolPreset;                               // 0x425(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_302B[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRandomStream                         MySeed;                                            // 0x428(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor)
	int32                                        SelectedEnemy;                                     // 0x430(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3030[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_Rune_Container_C*                  RuneContainer;                                     // 0x438(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Vampire_CanKick;                                   // 0x440(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, Interp, NoDestructor)
	bool                                         Vampire_RandomizeDiving;                           // 0x441(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3037[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Vampire_Diving_;                                   // 0x444(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Vampire_Diving;                                    // 0x448(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Vampire_KickAsFirstAttack;                         // 0x449(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Vampire_StartWithPounce;                           // 0x44A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Vampire_UseEatingAnimation;                        // 0x44B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	int32                                        LightBrigand_WeaponIndex;                          // 0x44C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        LightBrigand_SkeletalIndex;                        // 0x450(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsLightBrigSitting;                                // 0x454(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         IsLightBrigEatingRat;                              // 0x455(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3045[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimMontage*                          LightBrigand_BeforeAggroPose;                      // 0x458(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          LightBrigand_AggroMontage;                         // 0x460(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         LightBrigand_RandomizeSkeletal;                    // 0x468(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3051[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USkeletalMesh*                         LightBrigand_SkeletalMesh;                         // 0x470(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         LightBrigand_FirstAttackIsAmbush;                  // 0x478(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3054[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LightBrigand_AggroPosePlayRate;                    // 0x47C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LightBrigand_AggroNearbyBrigandsRadius;            // 0x480(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         LightBrigand_RandomizeWeapon;                      // 0x484(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class EBrigandWeapons                   LightBrigand_Weapon;                               // 0x485(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         LightBrigand_RandomizeHelmet;                      // 0x486(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         LightBrigand_RandomizeFireCultHelmet;              // 0x487(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class EBrigandHelmetMeshes              LightBrigand_Helmet;                               // 0x488(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         LightBrigand_RandomizePaleSkin;                    // 0x489(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         LightBrigand_UsePaleSkin;                          // 0x48A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3063[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LightBrigand_SecondAggroDistance;                  // 0x48C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LightBrigand_EnemyVisionRadius;                    // 0x490(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HeavyBrigand_UseBeakMask;                          // 0x494(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         IsHeavyBrigSitting;                                // 0x495(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_306D[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimMontage*                          HeavyBrigand_BeforeAggroPose;                      // 0x498(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          HeavyBrigand_AggroMontage;                         // 0x4A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HeavyBrigand_FirstAttackIsAmbush;                  // 0x4A8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3072[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HeavyBrigand_SecondAggroDistance;                  // 0x4AC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        HeavyBrigand_AggroPosePlayRate;                    // 0x4B0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3073[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UClass*>                        PatrolOnlyIf;                                      // 0x4B8(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FString                                SpawnedEnemyStringName;                            // 0x4C8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	bool                                         Underdog_IsMelee;                                  // 0x4D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3077[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Underdog_ThrowRange;                               // 0x4DC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        RotationRate;                                      // 0x4E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_307A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ABP_TriggerBox_Spawner_C*>      StormModePillarTriggers;                           // 0x4E8(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<class UClass*, float>                   FallgrimEnemyPoolPreset;                           // 0x4F8(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UClass*, float>                   FireTempleEnemyPoolPreset;                         // 0x548(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UClass*, float>                   CryptEnemyPoolPreset;                              // 0x598(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class UClass*, float>                   CathedralEnemyPoolPreset;                          // 0x5E8(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                        GrabSpawnTriggers_MaxDistance;                     // 0x638(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3081[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_Rune_Container_C*                  RuneContainer_Debug;                               // 0x640(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Rune_Container_C*                  RuneContainerAlt_Debug;                            // 0x648(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        GrabSpawnTriggers_MinDistance;                     // 0x650(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseCustomBillboard;                                // 0x654(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3088[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            Billboard;                                         // 0x658(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SeedID;                                            // 0x660(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_308F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_PatrollingSpline_C*                SpawnedSplinePatrolling;                           // 0x668(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class AAdvancedEnemySpawner_StormMode_C* GetDefaultObj();

	void AskRandomDarkFormUpgrade(struct FStruct_Rune* Rune);
	void AskRandomWeaponUpgrade(enum class Enum_Rune_Tier Tier, struct FStruct_Rune* Upgrade);
	void AskRandomUpgrade(struct FStruct_Rune* Upgrade);
	void AddSplinePatrollingActor(bool CallFunc_IsValid_ReturnValue, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class ABP_PatrollingSpline_C* CallFunc_FinishSpawningActor_ReturnValue);
