#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x5A2 (0x1544 - 0xFA2)
// BlueprintGeneratedClass GameplayPC_StormMode.GameplayPC_StormMode_C
class AGameplayPC_StormMode_C : public AGameplayPC_C
{
public:
	uint8                                        Pad_425B[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xFA8(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UStormModeNotifier_Component_C*        StormModeNotifierComponent;                        // 0xFB0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class URuneInventoryComponent_C*             RuneInventoryComponent;                            // 0xFB8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_Playtime_Run_Alpha_2D55EEF94095FA0E065F48BCC2F4A14D; // 0xFC0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                Timeline_Playtime_Run__Direction_2D55EEF94095FA0E065F48BCC2F4A14D; // 0xFC4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_425D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    Timeline_Playtime_Run;                             // 0xFC8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_Runes_SelectWindow_C*              UI_Runes_SelectWindow;                             // 0xFD0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         InRuneSkillTree;                                   // 0xFD8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         StopSavingGPData;                                  // 0xFD9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         StopSavingCheckpoints;                             // 0xFDA(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	enum class Enum_StormModeProgress            StormModeProgress;                                 // 0xFDB(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_425F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class Enum_StormModeArea, enum class Enum_StormModeAreaState> StormModeEntrancesState;                           // 0xFE0(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<enum class Enum_StormModeProgress, int32> StormModeAreasProgress;                            // 0x1030(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class ABP_AreaBlocker_C*>             FallgrimAreaBlockers;                              // 0x1080(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<enum class Enum_StormModeProgress, enum class Enum_StormModeGlandData> StormModeGlandsData;                               // 0x1090(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FStruct_StormModeSeeds                StormModeSeeds;                                    // 0x10E0(0x28)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EArmorTypes                       StormModeSelectedShell;                            // 0x1108(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EComboTypes                       StormModeSelectedWeapon;                           // 0x1109(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EComboTypes                       StormModeLoadedWeapon;                             // 0x110A(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EComboTypes                       StormModeSavedWeapon;                              // 0x110B(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         StormModeHasSelectedShell;                         // 0x110C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4260[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            StormMode_RunStart;                                // 0x1110(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                        StormModeTarRetain;                                // 0x1120(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        TarLostOnDeath;                                    // 0x1124(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SeedManager_C*                     SeedManager;                                       // 0x1128(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABarbarous_StormMode_C*                Barbarous_StormMode;                               // 0x1130(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            StormMode_RuneNotify;                              // 0x1138(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FDateTime                             RunPlaytime;                                       // 0x1148(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                        RunPlaytimeSeconds;                                // 0x1150(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EArmorTypes                       ShellFromSaveFile;                                 // 0x1154(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4262[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FStruct_StormModeRun_Data>     StormModeRunData;                                  // 0x1158(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TMap<struct FDateTime, struct FStruct_Rune>  ProgressRunesWithPlaytime;                         // 0x1168(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FString                                StormMode_CurrentLevel;                            // 0x11B8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	struct FStruct_Rune                          RuneForNotify;                                     // 0x11C8(0xD0)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class FName                                  OpenAreaID;                                        // 0x1298(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  ChaliceUnlockedID;                                 // 0x12A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CanUpdateCheckpoint;                               // 0x12A8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4267[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            Crypt_StartTransform;                              // 0x12B0(0x30)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                            FireLevel_StartTransform;                          // 0x12E0(0x30)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                            Cathedral_StartTransform;                          // 0x1310(0x30)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	FMulticastInlineDelegateProperty_            OnMilestoneUnlocked;                               // 0x1340(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FTransform                            FinalBoss_StartTransform;                          // 0x1350(0x30)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	int32                                        ConcurrentEnemies;                                 // 0x1380(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4268[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class UClass*, enum class Enum_StormModePlayerKiller> KillerMap;                                         // 0x1388(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ULargeTutorial_C*                      UI_StormModeTutorial;                              // 0x13D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        MaxHealthFromSaveGame;                             // 0x13E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        HealthFromSaveGame;                                // 0x13E4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, float>                     MU_Progress_Start;                                 // 0x13E8(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, float>                     MU_Progress_End;                                   // 0x1438(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UUI_StormMode_End_C*                   UI_StormMode_End;                                  // 0x1488(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, int32>                     MU_Progress_Tier_Start;                            // 0x1490(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FName, int32>                     MU_Progress_Tier_End;                              // 0x14E0(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UAudioComponent*                       SisterDialogueAudioComponent;                      // 0x1530(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bDebugSisterDialogues;                             // 0x1538(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         bIsSisterDialogue;                                 // 0x1539(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_426C[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  EquippedLute;                                      // 0x153C(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class AGameplayPC_StormMode_C* GetDefaultObj();

	void StormMode_GetEquippedLute(class FName* Lute);
	void StormMode_GetCurrentUpgradeForSlot(enum class Enum_RuneSlots_IDs Slot, class FName* ID, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, class FName CallFunc_Conv_StringToName_ReturnValue, const struct FStruct_Rune& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue);
	void StormMode_GetEndingProgress(class FName ID, float* Progress, float CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue);
	void StormMode_GetInitialProgress(class FName ID, float* Progress, float CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue);
	bool StormMode_IsSisterDialogue();
