#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x3D0 (0x600 - 0x230)
// WidgetBlueprintGeneratedClass LoadingScreen.LoadingScreen_C
class ULoadingScreen_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x230(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      Anim_FastTravelCurrentLevel_End;                   // 0x238(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      Anim_FastTravelCurrentLevel_Start;                 // 0x240(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      Anim_FadeOutToBlack;                               // 0x248(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      Anim_FadeIn;                                       // 0x250(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      Anim_FadeOut;                                      // 0x258(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UCircularThrobber*                     CircularThrobber_LoadingScreen;                    // 0x260(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_Background;                                  // 0x268(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_BG_Tile;                                     // 0x270(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_Gradient_Down;                               // 0x278(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_gradient_left;                               // 0x280(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_gradient_right;                              // 0x288(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_Gradient_Up;                                 // 0x290(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_Item_Icon_Art;                               // 0x298(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_Item_Icon_Background;                        // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              Overlay_LoadingScreen;                             // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              Overlay_LoadingScreenDetails;                      // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URetainerBox*                          RetainerBox_Pixelate;                              // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                        RichTextBlock_ItemDescription;                     // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                        RichTextBlock_ItemEffect;                          // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                             ScaleBox_Familiarity;                              // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                             ScaleBox_Text;                                     // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                               Spacer_Text;                                       // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            Text_Item_Category;                                // 0x2E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            Text_Item_Name;                                    // 0x2F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UFamiliarityWidget_C*                  UI_FamiliarityWidget;                              // 0x2F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          VerticalBox_Throbber;                              // 0x300(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                         FadeOut;                                           // 0x308(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_82D[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Fade;                                              // 0x30C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDHGenericDataTableID                 Preview;                                           // 0x310(0x10)(Edit, BlueprintVisible, NoDestructor)
	class UGameInfoInstance_C*                   GameInfoInstance;                                  // 0x320(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  TravelDestination;                                 // 0x328(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  MapToLoad;                                         // 0x330(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         SetTravelDestination;                              // 0x338(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_830[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          Items_RowNames;                                    // 0x340(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            CallTeleportPlayer;                                // 0x350(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            CallTeleportEnd;                                   // 0x360(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         bIsOnScreen;                                       // 0x370(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_832[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SaveSlot;                                          // 0x374(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UServerSaveGame_C*                     SaveGameReference;                                 // 0x378(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FServerSaveFile                       SaveFile;                                          // 0x380(0x270)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                         LoadItemFromSave;                                  // 0x5F0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_837[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ULargeTutorial_C*                      UI_StormModeTutorial;                              // 0x5F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class ULoadingScreen_C* GetDefaultObj();

	bool ShouldShowFirstTempleTut(class FName CallFunc_MakeLiteralName_ReturnValue, class FName CallFunc_MakeLiteralName_ReturnValue_1, bool CallFunc_IsTutorialUnlocked_Unlocked_, bool CallFunc_IsTutorialUnlocked_Unlocked__1, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, class FName CallFunc_MakeLiteralName_ReturnValue_2, bool CallFunc_IsTutorialUnlocked_Unlocked__2, bool CallFunc_Not_PreBool_ReturnValue_2, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1);
	void HandleStormModeTutorial_FirstTemple(bool* ShowTutorial_, class FName Local_TutToShow, bool CallFunc_ShouldShowFirstTempleTut_ReturnValue, const class FString& CallFunc_GetCurrentLevelName_ReturnValue, bool K2Node_SwitchString_CmpSuccess, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class ULargeTutorial_C* CallFunc_Create_ReturnValue);
	void HandleStormModeTutorial_FirstCycle(bool* ShowTutorial_, class FName Temp_name_Variable, class FName CallFunc_MakeLiteralName_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue, bool CallFunc_IsTutorialUnlocked_Unlocked_, class ULargeTutorial_C* CallFunc_Create_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void TryAddRandomWeaponUpgrade();
	void GetItemDataFromSave(struct FInventoryItem& Item, int32* Familiarity, class FString* Description, int32 CallFunc_GetItemFamiliarity_FromSave_Value, const class FString& CallFunc_CreateItemEffectDescription_FromSave_ReturnValue);
	void LoadSaveSlot(bool* Success, const class FString& CallFunc_GetSlotName_ReturnValue, const class FString& CallFunc_GetSlotName_ReturnValue_1, class UDHGameInstance* CallFunc_GetInstance_ReturnValue, class UDHGameInstance* CallFunc_GetInstance_ReturnValue_1, int32 CallFunc_GetPrimaryUserIndex_ReturnValue, int32 CallFunc_GetPrimaryUserIndex_ReturnValue_1, bool CallFunc_DoesSaveGameExist_ReturnValue, class USaveGame* CallFunc_DHLoadGameFromSlot_ReturnValue, class UServerSaveGame_C* K2Node_DynamicCast_AsServer_Save_Game, bool K2Node_DynamicCast_bSuccess);
	class FString GetSlotName(const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1);
	void HandleStormModeItems(TArray<class FName>& RowNames, const TArray<class FName>& Local_Remove, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class FName>& K2Node_MakeArray_Array, class FName CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Array_RemoveItem_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, class UGameInstance* CallFunc_GetGameInstance_ReturnValue, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface, bool K2Node_DynamicCast_bSuccess, TArray<class FName>& K2Node_MakeArray_Array_1, bool CallFunc_StormModeContentIsEnabled_Enabled_);
	void AddShadeAbility(class APlayerController* CallFunc_GetPlayerController_ReturnValue, TScriptInterface<class IBPI_StormMode_PC_C> K2Node_DynamicCast_AsBPI_Storm_Mode_PC, bool K2Node_DynamicCast_bSuccess);
	void Handle_StormMode_FadeOut(class ACharacter* CallFunc_GetPlayerCharacter_ReturnValue, TScriptInterface<class IBPI_StormMode_Character_C> K2Node_DynamicCast_AsBPI_Storm_Mode_Character, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue, bool CallFunc_HandleStormModeTutorial_FirstTemple_ShowTutorial_, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, bool CallFunc_HandleStormModeTutorial_FirstCycle_ShowTutorial_, class UGameInstance* CallFunc_GetGameInstance_ReturnValue, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface, bool K2Node_DynamicCast_bSuccess_1, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface_1, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_StormMode_GetHasJustStartedRun__Return, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface_2, bool K2Node_DynamicCast_bSuccess_3, bool CallFunc_StormModeIsActive_ReturnValue);
	void ForceReturnEnemies(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class AEnemyCharacter_C*>& CallFunc_GetAllActorsOfClass_OutActors, int32 CallFunc_Array_Length_ReturnValue, class AEnemyCharacter_C* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, const class FString& CallFunc_GetDisplayName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, TScriptInterface<class IEnemyCommonInterface_C> CallFunc_ForceReturn_self_CastInput, const class FString& CallFunc_Concat_StrStr_ReturnValue_1);
	bool HideFamiliarity(enum class EItemType ItemType, int32 Familiarity, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1);
	void ApplyUserSelectedResolutionScale(const class FString& CallFunc_Concat_StrStr_ReturnValue, bool CallFunc_IsValid_ReturnValue, const class FString& CallFunc_Conv_FloatToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, class APlayerController* CallFunc_GetPlayerController_ReturnValue);
	void SetCharacterAsInvulnerable(bool IsInvulnerable_, class ACharacter* CallFunc_GetPlayerCharacter_ReturnValue, bool CallFunc_IsValid_ReturnValue, TScriptInterface<class ICharacterUtilInterface_C> K2Node_DynamicCast_AsCharacter_Util_Interface, bool K2Node_DynamicCast_bSuccess);
	void RemoveUndiscoveredKeyItems(const TArray<class FName>& ItemsDiscovered, class FName Local_Name, int32 Temp_int_Array_Index_Variable, class APlayerController* CallFunc_GetPlayerController_ReturnValue, TScriptInterface<class IPCLoadingScreenInterface_C> K2Node_DynamicCast_AsPCLoading_Screen_Interface, bool K2Node_DynamicCast_bSuccess, const class FString& CallFunc_Conv_NameToString_ReturnValue, TArray<class FName>& CallFunc_PCLoadingScreen_GetItemsDiscovered_ItemsDiscovered, bool CallFunc_PCLoadingScreen_GetItemsDiscovered_Empty, bool CallFunc_Contains_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue_1, bool CallFunc_EqualEqual_NameName_ReturnValue_2, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_2, float CallFunc_RandomFloatInRange_ReturnValue, int32 CallFunc_Array_Find_ReturnValue, const struct FLinearColor& CallFunc_MakeColor_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, const class FString& CallFunc_Conv_NameToString_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue, bool CallFunc_Array_RemoveItem_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class FName CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue);
	void SetItemType(enum class EItemType Type, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue);
	void SetItemName(class FText ItemName, class FText CallFunc_CheckItemName_ReturnValue);
	void SetIcon(class UObject* Icon, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush);
	void FadeOutVolume();
	void FadeInVolume(class UGameInfoInstance_C* CallFunc_GetGameInstanceAsGameInfoInstance_AsGame_Info_Instance);
	void GetRandomItem(TArray<class FName>& Array, class FName* Output, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_RandomIntegerInRange_ReturnValue, class FName CallFunc_Array_Get_Item);
	void RemoveUnusedItems(TArray<class FName>& RowNames, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class FName>& K2Node_MakeArray_Array, class FName CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Array_RemoveItem_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void RemoveHadernContent(TArray<class FName>& RowNames, bool CallFunc_IsHadernContentEnabled_ReturnValue, class FName Temp_name_Variable, int32 CallFunc_Array_Find_ReturnValue);
	enum class ESlateVisibility GettemEffectVisibility(bool Temp_bool_Variable, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, bool CallFunc_IsEffectDescEmpty_ReturnValue, enum class ESlateVisibility K2Node_Select_Default);
	bool IsEffectDescEmpty(class FText CallFunc_MakeLiteralText_ReturnValue, class FText CallFunc_GetText_ReturnValue, bool CallFunc_EqualEqual_TextText_ReturnValue);
	void SetLoadingScreenItem(class FName RowName, bool Local_Discovered, const class FString& Local_EffectDescString, int32 Local_TimeToUnlockFamiliarity, const struct FInventoryItem& Local_Item, int32 Local_Familiarity, int32 Local_TimesUsed, class FText Local_DescWithFami, class FText Local_ExtDesc, class FText Local_EffectDesc, class FText Local_Description, enum class EItemType Local_ItemType, class FText Local_Name, class UTexture2D* Local_Icon, class FName Local_ID, const struct FInventoryItem& CallFunc_GetDataTableRowFromName_OutRow, bool CallFunc_GetDataTableRowFromName_ReturnValue, bool CallFunc_GetItemDiscovered_FromSave_Empty_, TArray<class FName>& CallFunc_GetItemDiscovered_FromSave_ItemDiscovered, int32 CallFunc_Array_Find_ReturnValue, int32 CallFunc_GetItemFamiliarity_Value, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_LoadSaveSlot_Success, int32 CallFunc_GetItemDataFromSave_Familiarity, const class FString& CallFunc_GetItemDataFromSave_Description, class UGameInstance* CallFunc_GetGameInstance_ReturnValue, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_GetCurrentSaveSlot_Slot, bool CallFunc_HideFamiliarity_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue, TScriptInterface<class IPCLoadingScreenInterface_C> K2Node_DynamicCast_AsPCLoading_Screen_Interface, bool K2Node_DynamicCast_bSuccess_1, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, TArray<class FName>& CallFunc_PCLoadingScreen_GetItemsDiscovered_ItemsDiscovered, bool CallFunc_PCLoadingScreen_GetItemsDiscovered_Empty, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_1, int32 CallFunc_Array_Find_ReturnValue_1, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_2, bool CallFunc_EqualEqual_IntInt_ReturnValue_1, bool Temp_bool_Variable, int32 Temp_int_Variable, bool Temp_bool_Variable_1, const class FString& CallFunc_Conv_NameToString_ReturnValue, int32 CallFunc_GetItemMaxFamiliarity_MaxFamiliarity, bool CallFunc_StartsWith_ReturnValue, int32 CallFunc_GetItemFamiliarity_FromSave_Value, bool CallFunc_IsEffectDescEmpty_ReturnValue, bool Temp_bool_Variable_2, class APlayerController* CallFunc_GetPlayerController_ReturnValue_1, int32 K2Node_Select_Default, TScriptInterface<class IPCLoadingScreenInterface_C> K2Node_DynamicCast_AsPCLoading_Screen_Interface_1, bool K2Node_DynamicCast_bSuccess_2, int32 CallFunc_GetAverageFamiliarity_ReturnValue, int32 CallFunc_PCLoadingScreen_GetLoadingScreenInfo_LocalFamiliarity, const class FString& CallFunc_PCLoadingScreen_GetLoadingScreenInfo_ItemEffectDescription, int32 K2Node_Select_Default_1, int32 K2Node_Select_Default_2, const class FString& CallFunc_CreateExtendedDescription_ReturnValue, bool CallFunc_CreateExtendedDescription_OutputPin, const class FString& CallFunc_ItemDetailBuildString_ItemEffects, const class FString& CallFunc_ItemDetailBuildString_ItemDescription, class FText CallFunc_Conv_StringToText_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue_1);
	void PreviewLoadingScreen();
	void FadeIn(class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);
	void SetLoadingScreenData(class FName Local_RowName, class UGameInfoInstance_C* CallFunc_GetGameInstanceAsGameInfoInstance_AsGame_Info_Instance, class FName CallFunc_GetRandomItem_Output, TArray<class FName>& CallFunc_GetDataTableRowNames_OutRowNames);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void HandleLevelChange(bool SetTravelDestination, class FName TravelDestination, class FName MapToLoad);
	void OnInitialized();
	void OnFadeCompleted();
	void OnFadeOutToBlackCompleted();
	void LoadingScreen_FadeIn();
	void LoadingScreen_FadeOutAndDestroy();
	void LoadingScreen_HandleLevelChange(bool Set_Travel_Destination, class FName Travel_Destination, class FName Map_To_Load);
	void LoadingScreen_OnBeginPlay();
	void HandleFastTravelCurrentLevel();
	void OnHandleFastTravelCurrentLevelStart_End();
	void OnHandleFastTravelCurrentLevelEnd_End();
	void LoadingScreen_FastTravelCurrentLevel();
	void DestroyWidget();
	void LoadingScreen_ShouldLoadItemFromSave(bool Load_);
	void OnStormModeStart();
	void FadeOutAndDestroy();
	void ExecuteUbergraph_LoadingScreen(int32 EntryPoint, class UGameInstance* CallFunc_GetGameInstance_ReturnValue, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface, bool K2Node_DynamicCast_bSuccess, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, bool K2Node_CustomEvent_SetTravelDestination, class FName K2Node_CustomEvent_TravelDestination, class FName K2Node_CustomEvent_MapToLoad, bool K2Node_Event_IsDesignTime, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, class UGameInstance* CallFunc_GetGameInstance_ReturnValue_1, bool K2Node_Event_Set_Travel_Destination, class FName K2Node_Event_Travel_Destination, class FName K2Node_Event_Map_To_Load, class UGameInfoInstance_C* K2Node_DynamicCast_AsGame_Info_Instance, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_SetGamePaused_ReturnValue, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_2, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_3, class UGameInfoInstance_C* CallFunc_GetGameInstanceAsGameInfoInstance_AsGame_Info_Instance, class ACharacter* CallFunc_GetPlayerCharacter_ReturnValue, TScriptInterface<class ICharacterUtilInterface_C> K2Node_DynamicCast_AsCharacter_Util_Interface, bool K2Node_DynamicCast_bSuccess_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, TScriptInterface<class ICharacterUtilInterface_C> K2Node_DynamicCast_AsCharacter_Util_Interface_1, bool K2Node_DynamicCast_bSuccess_3, TScriptInterface<class ICharacterUtilInterface_C> K2Node_DynamicCast_AsCharacter_Util_Interface_2, bool K2Node_DynamicCast_bSuccess_4, class USkeletalMeshComponent* CallFunc_0_Base_GetMesh_Mesh, class APlayerController* CallFunc_GetPlayerController_ReturnValue, TScriptInterface<class IGamePlayPCInterface_C> K2Node_DynamicCast_AsGame_Play_PCInterface, bool K2Node_DynamicCast_bSuccess_5, class APlayerController* CallFunc_GetPlayerController_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, TScriptInterface<class IGamePlayPCInterface_C> K2Node_DynamicCast_AsGame_Play_PCInterface_1, bool K2Node_DynamicCast_bSuccess_6, class UGameInstance* CallFunc_GetGameInstance_ReturnValue_2, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface_1, bool K2Node_DynamicCast_bSuccess_7, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, bool CallFunc_StormModeIsActive_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, bool K2Node_Event_Load_, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_4, class ACharacter* CallFunc_GetPlayerCharacter_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, TScriptInterface<class IBPI_StormMode_Character_C> K2Node_DynamicCast_AsBPI_Storm_Mode_Character, bool K2Node_DynamicCast_bSuccess_8, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_1, class UGameInstance* CallFunc_GetGameInstance_ReturnValue_3, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface_2, bool K2Node_DynamicCast_bSuccess_9, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, int32 CallFunc_GetCurrentSaveSlot_Slot);
	void CallTeleportEnd__DelegateSignature();
	void CallTeleportPlayer__DelegateSignature();
};

}


