#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xA30 (0xAE0 - 0xB0)
// BlueprintGeneratedClass RuneRandomizerComponent.RuneRandomizerComponent_C
class URuneRandomizerComponent_C : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xB0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	enum class Enum_Rune_Category_Randomizer     Category_Temp;                                     // 0xB8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class Enum_Rune_Category_Randomizer     Category_Selected;                                 // 0xB9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_39F1[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnUpgradesSelected;                                // 0xC0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FStruct_Rune>                  Runes_Array;                                       // 0xD0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FStruct_Rune>                  Runes_Misc_Array;                                  // 0xE0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	enum class Enum_StormModeArea                Rune_Area;                                         // 0xF0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_39F7[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FStruct_Rune                          Rune_InSlot;                                       // 0xF8(0xD0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                         HasRuneInSlot;                                     // 0x1C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class Enum_Rune_Tier                    Rune_Tier;                                         // 0x1C9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_39FB[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Rune_Level;                                        // 0x1CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_Rune                          Rune_Temp;                                         // 0x1D0(0xD0)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	enum class Enum_Rune_Type                    Rune_Type;                                         // 0x2A0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3A01[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FStruct_Rune                          Rune_1;                                            // 0x2A8(0xD0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStruct_Rune                          Rune_2;                                            // 0x378(0xD0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStruct_Rune                          Rune_3;                                            // 0x448(0xD0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UUI_Runes_SelectWindow_C*              UI_Runes_SelectWindow;                             // 0x518(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HasBonusRune;                                      // 0x520(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3A0B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FStruct_Rune                          Rune_Bonus;                                        // 0x528(0xD0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStruct_Rune                          Rune_DarkForm;                                     // 0x5F8(0xD0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class URuneInventoryComponent_C*             RuneInventory;                                     // 0x6C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UDataTable*                            DataTable_Percentages;                             // 0x6D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Randomizer_Runes_Lenght;                           // 0x6D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                         MySeed;                                            // 0x6DC(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor)
	bool                                         HideToolTip;                                       // 0x6E4(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3A19[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_Rune_Container_C*                  BP_Rune_Container;                                 // 0x6E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AConfigurable_Glowing_Pickup_StormMode_C* BP_Glowing_Pickup;                                 // 0x6F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            OnSeedInitialized;                                 // 0x6F8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class AZero_Base_C*                          ZeroBase;                                          // 0x708(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Offered3MiscRunes;                                 // 0x710(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3A27[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SameTierForLevelUpAmount;                          // 0x714(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FStruct_Rune>                  Runes_CanLevelUp;                                  // 0x718(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class FName>                          Runes_CanLevelUpIDs;                               // 0x728(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<int32>                                Runes_CanLevelUpIndex;                             // 0x738(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStruct_Rune                          Rune_UpgradeTemp_1;                                // 0x748(0xD0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FStruct_Rune                          Rune_UpgradeTemp_2;                                // 0x818(0xD0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                        RandomRuneToUpgrade_Index;                         // 0x8E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class Enum_UpgradeType                  UpgradeType_1;                                     // 0x8EC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class Enum_UpgradeType                  UpgradeType_2;                                     // 0x8ED(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class Enum_UpgradeType                  UpgradeType_3;                                     // 0x8EE(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class Enum_UpgradeType                  UpgradeType_Bonus;                                 // 0x8EF(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class Enum_Rune_Category_Randomizer     Category_Chosen;                                   // 0x8F0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         WorldItem_;                                        // 0x8F1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	enum class Enum_RuneSlots_IDs                RuneInSlot_ID;                                     // 0x8F2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3A3F[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FStruct_Rune                          Rune_InSlot_PreLevelUp;                            // 0x8F8(0xD0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	int32                                        LevelUp_Increment_X_;                              // 0x9C8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        LevelUp_Increment_X;                               // 0x9CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStruct_Rune                          Rune_Random;                                       // 0x9D0(0xD0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<class FName>                          RiposteUpgrades;                                   // 0xAA0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                         BossDefeatedWindow;                                // 0xAB0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3A43[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FStruct_Rune>                  Runes_DarkForm;                                    // 0xAB8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                         IsSeedScreen;                                      // 0xAC8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3A47[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnSeedFound;                                       // 0xAD0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

	static class UClass* StaticClass();
	static class URuneRandomizerComponent_C* GetDefaultObj();

	void AskRandomDarkFormUpgrade(struct FStruct_Rune* Rune, bool CallFunc_GetAllDarkFormUpgrades_Success, const struct FStruct_Rune& CallFunc_RandomizeDarkFormRune_Rune, bool CallFunc_SelectDarkFormUpgrade_Success);
