#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x210 (0x440 - 0x230)
// WidgetBlueprintGeneratedClass UI_InputDetector.UI_InputDetector_C
class UUI_InputDetector_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x230(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class FName                                  InputAxisNameToBeChanged;                          // 0x238(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                Rebind_KeyType;                                    // 0x240(0x10)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class FString                                Rebind_InputType;                                  // 0x250(0x10)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UWBP_KeyBind_New_C*                    UI_KeyBind;                                        // 0x260(0x8)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UUI_Options_Controls_C*                UI_Controls;                                       // 0x268(0x8)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         InputEnabled;                                      // 0x270(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2096[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  InputActionNameToBeChanged;                        // 0x274(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_209F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FInputAction                          InputAction_Detected;                              // 0x280(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FInputAction                          InputAction_New;                                   // 0x2C0(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FInputAction                          InputAction_Current;                               // 0x300(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FInputAction>                  ActionsThatAreUsingTheSameButton;                  // 0x340(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<struct FInputAxis>                    AxisKBM;                                           // 0x350(0x10)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<struct FInputAction>                  Actions;                                           // 0x360(0x10)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	struct FTimerHandle                          GamepadCheck_Timer;                                // 0x370(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FInputAxis                            InputAxis_Detected;                                // 0x378(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FInputAxis                            InputAxis_Current;                                 // 0x3B8(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FInputAxis                            InputAxis_New;                                     // 0x3F8(0x40)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UPCInputDispatcherComponent_C*         InputDispatcherComponent;                          // 0x438(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UUI_InputDetector_C* GetDefaultObj();

	void Set_InputAxis_KBM_New(const class FString& CallFunc_Conv_NameToString_ReturnValue, const struct FInputAxis& K2Node_MakeStruct_InputAxis);
	void Set_InputAction_Controller_New(const class FString& CallFunc_Conv_NameToString_ReturnValue, const struct FInputAction& K2Node_MakeStruct_InputAction);
	void Set_InputAction_Controller_Old(const class FString& CallFunc_Conv_NameToString_ReturnValue, const struct FInputAction& K2Node_MakeStruct_InputAction);
	void ChangeOtherKey(bool Gamepad, const class FString& OldKeyAsString, const struct FKey& OldKey, const class FString& NewKeyAsString, const struct FKey& NewKey, bool Local_Gamepad, const class FString& Local_NewKeyAsString, const class FString& Local_OldKeyAsString, const struct FKey& Local_OldKey, const struct FKey& Local_NewKey, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, const class FString& CallFunc_Conv_NameToString_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, int32 Temp_int_Array_Index_Variable_1, bool CallFunc_Less_IntInt_ReturnValue, const struct FInputAction& CallFunc_Array_Get_Item, bool CallFunc_Key_IsGamepadKey_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, const struct FInputAction& K2Node_MakeStruct_InputAction, bool CallFunc_EqualEqual_StrStr_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, bool Temp_bool_Variable, bool Temp_bool_Variable_1, bool K2Node_Select_Default, const class FString& CallFunc_Conv_NameToString_ReturnValue_1, const struct FInputAxis& CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, const struct FInputAxis& K2Node_MakeStruct_InputAxis, bool CallFunc_Key_IsGamepadKey_ReturnValue_1, bool CallFunc_EqualEqual_KeyKey_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_2, bool K2Node_Select_Default_1, bool CallFunc_EqualEqual_StrStr_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_3);
	void SwapKeys(bool Gamepad, const class FString& OldKeyAsString, const struct FKey& OldKey, const class FString& NewKeyAsString, const struct FKey& NewKey, bool Local_Gamepad, const class FString& Local_NewKeyAsString, const class FString& Local_OldKeyAsString, const struct FKey& Local_OldKey, const struct FKey& Local_NewKey, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, const class FString& CallFunc_Conv_NameToString_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, int32 Temp_int_Array_Index_Variable_1, bool CallFunc_Less_IntInt_ReturnValue, const struct FInputAction& CallFunc_Array_Get_Item, bool CallFunc_Key_IsGamepadKey_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, const struct FInputAction& K2Node_MakeStruct_InputAction, bool CallFunc_EqualEqual_StrStr_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, bool Temp_bool_Variable, bool Temp_bool_Variable_1, bool K2Node_Select_Default, const class FString& CallFunc_Conv_NameToString_ReturnValue_1, const struct FInputAxis& CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_Abs_ReturnValue, const struct FInputAxis& K2Node_MakeStruct_InputAxis, bool CallFunc_Greater_FloatFloat_ReturnValue, bool CallFunc_Key_IsGamepadKey_ReturnValue_1, bool CallFunc_EqualEqual_KeyKey_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_2, bool K2Node_Select_Default_1, bool CallFunc_EqualEqual_StrStr_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue);
	void DebugNewAxisBinding(struct FInputAxis& CurrentButton, struct FInputAxis& NewButton, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Conv_FloatToString_ReturnValue, const class FString& CallFunc_Conv_FloatToString_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, bool CallFunc_EqualEqual_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, const class FString& CallFunc_SelectString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, bool CallFunc_EqualEqual_StrStr_ReturnValue_1, const class FString& CallFunc_SelectString_ReturnValue_1, const class FString& CallFunc_Conv_NameToString_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_5, const class FString& CallFunc_Concat_StrStr_ReturnValue_6, const class FString& CallFunc_Concat_StrStr_ReturnValue_7, const class FString& CallFunc_Concat_StrStr_ReturnValue_8, const class FString& CallFunc_Concat_StrStr_ReturnValue_9, const class FString& CallFunc_Concat_StrStr_ReturnValue_10, const class FString& CallFunc_Concat_StrStr_ReturnValue_11, const class FString& CallFunc_Concat_StrStr_ReturnValue_12, const class FString& CallFunc_Concat_StrStr_ReturnValue_13, const class FString& CallFunc_Concat_StrStr_ReturnValue_14, const class FString& CallFunc_Concat_StrStr_ReturnValue_15, const class FString& CallFunc_Concat_StrStr_ReturnValue_16);
	void Set_InputAxis_KBM_Old(const class FString& CallFunc_Conv_NameToString_ReturnValue, const struct FInputAxis& K2Node_MakeStruct_InputAxis);
	void Set_InputAction_KBM_New(const class FString& CallFunc_Conv_NameToString_ReturnValue, const struct FInputAction& K2Node_MakeStruct_InputAction);
	void Set_InputAction_KBM_Old(const class FString& CallFunc_Conv_NameToString_ReturnValue, const struct FInputAction& K2Node_MakeStruct_InputAction);
	bool FilterKeyboardKeys(const struct FKey& Key, bool CallFunc_EqualEqual_KeyKey_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue_1, bool CallFunc_EqualEqual_KeyKey_ReturnValue_2, bool CallFunc_EqualEqual_KeyKey_ReturnValue_3, bool CallFunc_EqualEqual_KeyKey_ReturnValue_4, bool CallFunc_EqualEqual_KeyKey_ReturnValue_5, bool CallFunc_EqualEqual_KeyKey_ReturnValue_6, bool CallFunc_EqualEqual_KeyKey_ReturnValue_7, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue_4, bool CallFunc_BooleanOR_ReturnValue_5, bool CallFunc_BooleanOR_ReturnValue_6);
	bool FilterControllerKeys(const struct FKey& Key, bool CallFunc_EqualEqual_KeyKey_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue_1, bool CallFunc_EqualEqual_KeyKey_ReturnValue_2, bool CallFunc_EqualEqual_KeyKey_ReturnValue_3, bool CallFunc_EqualEqual_KeyKey_ReturnValue_4, bool CallFunc_EqualEqual_KeyKey_ReturnValue_5, bool CallFunc_EqualEqual_KeyKey_ReturnValue_6, bool CallFunc_EqualEqual_KeyKey_ReturnValue_7, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue_4, bool CallFunc_BooleanOR_ReturnValue_5, bool CallFunc_BooleanOR_ReturnValue_6);
	void InvalidKeySound();
	struct FEventReply OnMouseButtonDown(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent, const struct FPointerEvent& Local_MouseEvent, const struct FInputAxis& CallFunc_GetInputAxisFromMouseButtonEvent_ReturnValue, const struct FInputAction& CallFunc_GetInputActionFromMouseButtonEvent_ReturnValue, const struct FEventReply& CallFunc_Unhandled_ReturnValue);
	void DebugNewActionBinding(struct FInputAction& CurrentButton, struct FInputAction& NewButton, bool Swap, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, bool CallFunc_EqualEqual_StrStr_ReturnValue, bool CallFunc_EqualEqual_StrStr_ReturnValue_1, const class FString& CallFunc_SelectString_ReturnValue, const class FString& CallFunc_SelectString_ReturnValue_1, const class FString& CallFunc_Conv_TextToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_5, const class FString& CallFunc_Concat_StrStr_ReturnValue_6, const class FString& CallFunc_Concat_StrStr_ReturnValue_7, const class FString& CallFunc_SelectString_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_8, const class FString& CallFunc_Concat_StrStr_ReturnValue_9, const class FString& CallFunc_Concat_StrStr_ReturnValue_10, const class FString& CallFunc_Concat_StrStr_ReturnValue_11, const class FString& CallFunc_Concat_StrStr_ReturnValue_12);
	void Rebind_Set(const struct FInputAction& InputAction, const struct FInputAxis& InputAxis, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool K2Node_SwitchString_CmpSuccess, bool CallFunc_Key_IsGamepadKey_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Key_IsGamepadKey_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_FilterControllerKeys_ReturnValue, bool CallFunc_Key_IsGamepadKey_ReturnValue_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_2, bool K2Node_SwitchString_CmpSuccess_1, bool K2Node_SwitchString_CmpSuccess_2);
	struct FEventReply OnKeyDown(const struct FGeometry& MyGeometry, const struct FKeyEvent& InKeyEvent, const struct FKeyEvent& Local_KeyEvent, const struct FInputAxis& CallFunc_GetInputAxisFromKeyEvent_ReturnValue, const struct FInputAction& CallFunc_GetInputActionFromKeyEvent_ReturnValue, const struct FEventReply& CallFunc_Unhandled_ReturnValue);
	void Construct();
	void OnEnabled();
	void KBMKeyChanged();
	void ControllerKeyChanged();
	void OnPauseMenuCloses(bool Close);
	void OnMouseEnter(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);
	void GamepadDisconnectedCheck();
	void Destruct();
	void ExecuteUbergraph_UI_InputDetector(int32 EntryPoint, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool Temp_bool_Has_Been_Initd_Variable, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_1, bool K2Node_CustomEvent_Close, class UGameInfoInstance_C* CallFunc_GetGameInstanceAsGameInfoInstance_AsGame_Info_Instance, bool CallFunc_IsVisible_ReturnValue, const struct FGeometry& K2Node_Event_MyGeometry, const struct FPointerEvent& K2Node_Event_MouseEvent, bool CallFunc_IsVisible_ReturnValue_1, class APlayerController* CallFunc_GetPlayerController_ReturnValue, bool CallFunc_IsGamepadAttached_ReturnValue, bool K2Node_SwitchString_CmpSuccess, bool Temp_bool_IsClosed_Variable, class APlayerController* CallFunc_GetPlayerController_ReturnValue_1, class UPCInputDispatcherComponent_C* CallFunc_GetComponentByClass_ReturnValue);
};

}


