#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x524 (0x754 - 0x230)
// WidgetBlueprintGeneratedClass UI_StormMode_SettingsWindow.UI_StormMode_SettingsWindow_C
class UUI_StormMode_SettingsWindow_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x230(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      Anim_FadeOut;                                      // 0x238(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      Anim_FadeIn;                                       // 0x240(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUI_StormMode_Menu_SeedButton_C*       UI_Button_CustomSeed;                              // 0x248(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_StormMode_Menu_SettingButton_C*    UI_Button_Difficulty;                              // 0x250(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_StormMode_Menu_SettingButton_C*    UI_Button_Notify_Instinct_Duration;                // 0x258(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_StormMode_Menu_SettingButton_C*    UI_Button_Notify_Instinct_Visibility;              // 0x260(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_StormMode_Menu_SettingButton_C*    UI_Button_Notify_RunFam_Duration;                  // 0x268(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUI_StormMode_Menu_SettingButton_C*    UI_Button_Notify_RunFam_Visibility;                // 0x270(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          VerticalBox_Difficulty;                            // 0x278(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class FString                                Seed_String;                                       // 0x280(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                        Seed_Int;                                          // 0x290(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Input_Consume;                                     // 0x294(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2884[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Index_Current;                                     // 0x298(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsFromMainMenu;                                    // 0x29C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_288F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FStruct_StormModeSave                 StormModeSave;                                     // 0x2A0(0x458)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	uint8                                        Pad_2899[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                SlotName;                                          // 0x700(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	int32                                        SaveSlot;                                          // 0x710(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_28A4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AStormMode_NPC_C*                      StormModeNPC;                                      // 0x718(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ABP_SeedManager_C*                     SeedManager;                                       // 0x720(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class Enum_StormMode_CustomSeedMenu     CustomSeedState;                                   // 0x728(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_28BA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UWidget*                               WidgetParent;                                      // 0x730(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUI_StormMode_Menu_C*                  UI_StormMode_Menu;                                 // 0x738(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UServerSaveGame_C*                     SaveGameReference;                                 // 0x740(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                           UI_ButtonSelected;                                 // 0x748(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Index_Temp;                                        // 0x750(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UUI_StormMode_SettingsWindow_C* GetDefaultObj();

	void GetSelectedCharacter(enum class EArmorTypes* Character);
	void GetVerticalIndex(int32* Index);
	void GetSettings(class UGameInstance* CallFunc_GetGameInstance_ReturnValue, class UGameInstance* CallFunc_GetGameInstance_ReturnValue_1, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface, bool K2Node_DynamicCast_bSuccess, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface_1, bool K2Node_DynamicCast_bSuccess_1, enum class Enum_Notify_StormMode_Duration CallFunc_StormMode_Notify_RunicFam_GetDuration_Duration, enum class Enum_Notify_StormMode_Visibility CallFunc_StormMode_Notify_RunicFam_GetVisibility_Visibility, int32 CallFunc_Conv_ByteToInt_ReturnValue, int32 CallFunc_Conv_ByteToInt_ReturnValue_1, TScriptInterface<class IBPI_StormModeMenuButton_C> CallFunc_OverrideCurrentValue_self_CastInput, TScriptInterface<class IBPI_StormModeMenuButton_C> CallFunc_OverrideCurrentValue_self_CastInput_1, class UGameInstance* CallFunc_GetGameInstance_ReturnValue_2, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface_2, bool K2Node_DynamicCast_bSuccess_2, class UGameInstance* CallFunc_GetGameInstance_ReturnValue_3, enum class Enum_Notify_StormMode_Visibility CallFunc_StormMode_Notify_Instinct_GetVisibility_Visibility, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface_3, bool K2Node_DynamicCast_bSuccess_3, enum class Enum_Notify_StormMode_Duration CallFunc_StormMode_Notify_Instinct_GetDuration_Duration, int32 CallFunc_Conv_ByteToInt_ReturnValue_2, TScriptInterface<class IBPI_StormModeMenuButton_C> CallFunc_OverrideCurrentValue_self_CastInput_2, int32 CallFunc_Conv_ByteToInt_ReturnValue_3, TScriptInterface<class IBPI_StormModeMenuButton_C> CallFunc_OverrideCurrentValue_self_CastInput_3, class UGameInstance* CallFunc_GetGameInstance_ReturnValue_4, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface_4, bool K2Node_DynamicCast_bSuccess_4, int32 CallFunc_StormMode_GetDifficulty_ReturnValue, TScriptInterface<class IBPI_StormModeMenuButton_C> CallFunc_OverrideCurrentValue_self_CastInput_4);
	void ResetSeedButton(bool PlaySound, bool K2Node_SwitchEnum_CmpSuccess);
	void GetSeedButtons(TArray<class UUI_StormMode_SeedButton_C*>* Array, TArray<class UUI_StormMode_SeedButton_C*>& CallFunc_GetSeedButtons_Array);
	bool GetIsAscended(int32 Local_Ascended, TScriptInterface<class IBPI_StormModeMenuButton_C> CallFunc_EnableOrDisableButton_self_CastInput, TScriptInterface<class IBPI_StormModeMenuButton_C> CallFunc_EnableOrDisableButton_self_CastInput_1, bool K2Node_SwitchInteger_CmpSuccess, int32 CallFunc_IsAscendedFromSaveGame_Value, class FName CallFunc_GetAscensionName_ID, int32 CallFunc_GetNamedPCInt_Value);
	void IsAscendedFromSaveGame(int32* Value, class FName CallFunc_GetAscensionName_ID, int32 CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue);
	void GetSaveData(int32 SaveSlot, class UServerSaveGame_C* SaveGameReference, const class FString& SlotName);
	void GetParentWidget(class UWidget* WidgetParent, class UUI_StormMode_Menu_C* K2Node_DynamicCast_AsUI_Storm_Mode_Menu, bool K2Node_DynamicCast_bSuccess);
	void ResetSeedButtons_Value(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_EqualEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UUI_StormMode_SeedButton_C*>& CallFunc_GetSeedButtons_Array, class UUI_StormMode_SeedButton_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void ResetCurrentSeed(bool CallFunc_IsValid_ReturnValue, int32 CallFunc_Seed_ApplyInitial_Seed, bool CallFunc_NotEqual_IntInt_ReturnValue);
	void ConfirmCustomSeed(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UUI_StormMode_SeedButton_C*>& CallFunc_GetSeedButtons_Array, class UUI_StormMode_SeedButton_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, TScriptInterface<class IBPI_StormModeMenuButton_C> CallFunc_DeactivateButton_self_CastInput, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_1);
	void ResetSeedButtons_Highlight(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UUI_StormMode_SeedButton_C*>& CallFunc_GetSeedButtons_Array, class UUI_StormMode_SeedButton_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	void Sound_Confirm(float Min, float Max, float VolumeMultiplier, float CallFunc_RandomFloatInRange_ReturnValue);
	void GetCurrentSeed(bool Temp_bool_Variable, class FText Temp_text_Variable, bool CallFunc_IsValid_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue, class FText K2Node_Select_Default, TArray<class FText>& K2Node_MakeArray_Array, TScriptInterface<class IBPI_StormModeMenuButton_C> CallFunc_UpdateSettingValues_self_CastInput);
	void ResetSeedString();
	void ApplyCustomSeed(bool CallFunc_IsValid_ReturnValue);
	void NavUpDown(bool UseWidget, bool CustomIndex, bool SkipIndexCheck, bool SkipSound, int32 Delta, class UUserWidget* Widget, int32 Index, bool Local_UseWidget, bool Local_CustomIndex, bool Local_SkipIndexCheck, bool Local_SkipSound, class UUserWidget* Local_Button, class UUserWidget* Local_Widget, int32 Local_Delta, int32 Local_IndexSelected, int32 Temp_int_Array_Index_Variable, TArray<class UUserWidget*>& CallFunc_GetButtons_Array, TArray<class UUserWidget*>& CallFunc_GetButtons_Array_1, bool CallFunc_EqualEqual_IntInt_ReturnValue, int32 CallFunc_Array_LastIndex_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue, bool K2Node_SwitchInteger_CmpSuccess, int32 CallFunc_Clamp_ReturnValue, TArray<class UUserWidget*>& CallFunc_GetButtons_Array_2, class UUserWidget* CallFunc_Array_Get_Item, TScriptInterface<class IBPI_StormModeMenuButton_C> K2Node_DynamicCast_AsBPI_Storm_Mode_Menu_Button, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue_2, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, bool CallFunc_EqualEqual_IntInt_ReturnValue_3, bool CallFunc_Not_PreBool_ReturnValue, TArray<class UUserWidget*>& CallFunc_GetButtons_Array_3, int32 CallFunc_Array_Find_ReturnValue, TScriptInterface<class IBPI_StormModeMenuButton_C> K2Node_DynamicCast_AsBPI_Storm_Mode_Menu_Button_1, bool K2Node_DynamicCast_bSuccess_1, class UUserWidget* CallFunc_Array_Get_Item_1, TScriptInterface<class IBPI_StormModeMenuButton_C> K2Node_DynamicCast_AsBPI_Storm_Mode_Menu_Button_2, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_IsButtonEnabled_Enabled_);
	void GetButtons(TArray<class UUserWidget*>* Array, TArray<class UUserWidget*>& K2Node_MakeArray_Array);
	void SetSeedString(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UUI_StormMode_SeedButton_C*>& CallFunc_GetSeedButtons_Array, class UUI_StormMode_SeedButton_C* CallFunc_Array_Get_Item, int32 CallFunc_Conv_StringToInt_ReturnValue, const class FString& CallFunc_GetTextAsIntString_Number, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue);
	void OnCharacterHighlighted(enum class EArmorTypes Character);
	void OnWeaponHighlighted(enum class EComboTypes Weapon);
	void NavBack();
	void OnClose();
	void OnCharacterSelected(enum class EArmorTypes Character);
	void OnSettingConfirmed(int32 Value);
	void OnWeaponSelected(enum class EComboTypes Weapon);
	void OnRiposteHighlighted(enum class ERiposteTypes Riposte);
	void OnRiposteSelected(enum class ERiposteTypes Riposte);
	void NavSpecialButton();
	void NavDown();
	void NavUp();
	void NavRight();
	void NavLeft();
	void OnOpen();
	void OnInitialized();
	void SetSaveGameRef(int32 Slot, class UServerSaveGame_C* SaveGame, const class FString& SlotName, class UMapState_C* MapStateSaveGame, const class FString& SlotName_MapState);
	void SetSeedManager(class ABP_SeedManager_C* SeedManager);
	void SetParentWidget(class UWidget* Widget);
	void NavConfirm();
	void BndEvt__UI_Button_Difficulty_K2Node_ComponentBoundEvent_0_OnSettingChanged__DelegateSignature(int32 NewValue);
	void BndEvt__UI_Button_Notify_Instinct_Duration_K2Node_ComponentBoundEvent_1_OnSettingChanged__DelegateSignature(int32 NewValue);
	void BndEvt__UI_Button_Notify_Instinct_Visibility_K2Node_ComponentBoundEvent_2_OnSettingChanged__DelegateSignature(int32 NewValue);
	void BndEvt__UI_Button_Notify_RunFam_Duration_K2Node_ComponentBoundEvent_3_OnSettingChanged__DelegateSignature(int32 NewValue);
	void BndEvt__UI_Button_Notify_RunFam_Visibility_K2Node_ComponentBoundEvent_4_OnSettingChanged__DelegateSignature(int32 NewValue);
	void OnButtonHovered(class UUserWidget* Widget);
	void ExecuteUbergraph_UI_StormMode_SettingsWindow(int32 EntryPoint, bool K2Node_SwitchEnum_CmpSuccess, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, enum class EArmorTypes K2Node_Event_Character_1, enum class EComboTypes K2Node_Event_Weapon_1, enum class EArmorTypes K2Node_Event_Character, int32 K2Node_Event_Value, enum class EComboTypes K2Node_Event_Weapon, enum class ERiposteTypes K2Node_Event_Riposte_1, enum class ERiposteTypes K2Node_Event_Riposte, bool K2Node_SwitchEnum_CmpSuccess_1, int32 K2Node_Event_Slot, class UServerSaveGame_C* K2Node_Event_SaveGame, const class FString& K2Node_Event_SlotName, class UMapState_C* K2Node_Event_MapStateSaveGame, const class FString& K2Node_Event_SlotName_MapState, class ABP_SeedManager_C* K2Node_Event_SeedManager, class UWidget* K2Node_Event_Widget_1, bool CallFunc_GetIsAscended_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_2, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_3, bool CallFunc_IsValid_ReturnValue, TScriptInterface<class IBPI_StormModeMenuButton_C> CallFunc_NavHorizontal_self_CastInput, TArray<class UUserWidget*>& CallFunc_GetButtons_Array, TArray<class UUserWidget*>& CallFunc_GetButtons_Array_1, class UUserWidget* CallFunc_Array_Get_Item, TScriptInterface<class IBPI_StormModeMenuButton_C> K2Node_DynamicCast_AsBPI_Storm_Mode_Menu_Button, bool K2Node_DynamicCast_bSuccess, class UUserWidget* CallFunc_Array_Get_Item_1, TScriptInterface<class IBPI_StormModeMenuButton_C> K2Node_DynamicCast_AsBPI_Storm_Mode_Menu_Button_1, bool K2Node_DynamicCast_bSuccess_1, int32 K2Node_ComponentBoundEvent_NewValue_4, class UGameInstance* CallFunc_GetGameInstance_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface, bool K2Node_DynamicCast_bSuccess_2, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface_1, bool K2Node_DynamicCast_bSuccess_3, TScriptInterface<class IBPI_StormModeMenuButton_C> CallFunc_NavHorizontal_self_CastInput_1, int32 K2Node_ComponentBoundEvent_NewValue_3, int32 K2Node_ComponentBoundEvent_NewValue_2, uint8 CallFunc_Conv_IntToByte_ReturnValue, uint8 CallFunc_Conv_IntToByte_ReturnValue_1, uint8 CallFunc_GetValidValue_ReturnValue, uint8 CallFunc_GetValidValue_ReturnValue_1, int32 K2Node_ComponentBoundEvent_NewValue_1, int32 K2Node_ComponentBoundEvent_NewValue, uint8 CallFunc_Conv_IntToByte_ReturnValue_2, uint8 CallFunc_Conv_IntToByte_ReturnValue_3, uint8 CallFunc_GetValidValue_ReturnValue_2, uint8 CallFunc_GetValidValue_ReturnValue_3, class UGameInstance* CallFunc_GetGameInstance_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface_2, bool K2Node_DynamicCast_bSuccess_4, TScriptInterface<class IBPI_StormModeMenuButton_C> CallFunc_NavVertical_self_CastInput, class UGameInstance* CallFunc_GetGameInstance_ReturnValue_2, class UGameInstance* CallFunc_GetGameInstance_ReturnValue_3, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface_3, bool K2Node_DynamicCast_bSuccess_5, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface_4, bool K2Node_DynamicCast_bSuccess_6, class UGameInstance* CallFunc_GetGameInstance_ReturnValue_4, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface_5, bool K2Node_DynamicCast_bSuccess_7, bool CallFunc_IsValid_ReturnValue_3, TScriptInterface<class IBPI_StormModeMenuButton_C> CallFunc_NavVertical_self_CastInput_1, class UGameInstance* CallFunc_GetGameInstance_ReturnValue_5, class UGameInstance* CallFunc_GetGameInstance_ReturnValue_6, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface_6, bool K2Node_DynamicCast_bSuccess_8, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface_7, bool K2Node_DynamicCast_bSuccess_9, class UGameInstance* CallFunc_GetGameInstance_ReturnValue_7, class UGameInstance* CallFunc_GetGameInstance_ReturnValue_8, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface_8, bool K2Node_DynamicCast_bSuccess_10, TScriptInterface<class IGameInstanceHUDInterface_C> K2Node_DynamicCast_AsGame_Instance_HUDInterface_9, bool K2Node_DynamicCast_bSuccess_11, bool CallFunc_IsValid_ReturnValue_4, bool K2Node_SwitchEnum_CmpSuccess_4, class UUserWidget* K2Node_Event_Widget, bool K2Node_SwitchEnum_CmpSuccess_5, TArray<class UUserWidget*>& CallFunc_GetButtons_Array_2, class UUserWidget* CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Length_ReturnValue, TScriptInterface<class IBPI_StormModeMenuButton_C> K2Node_DynamicCast_AsBPI_Storm_Mode_Menu_Button_2, bool K2Node_DynamicCast_bSuccess_12, bool CallFunc_Less_IntInt_ReturnValue);
};

}


