#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xC9 (0xC9 - 0x0)
// UserDefinedStruct UpgradeDisplayInfo.UpgradeDisplayInfo
struct FUpgradeDisplayInfo
{
public:
	class FText                                  Title_9_48C8B3434DDBECABB96D7ABB77111C64;          // 0x0(0x18)(Edit, BlueprintVisible)
	class FText                                  Description_10_449CCBEC41FCBB87F8FF0499D3B23EBE;   // 0x18(0x18)(Edit, BlueprintVisible)
	class FText                                  PromptLeft_18_382A092B4D32BC715C5F579A1F79DB55;    // 0x30(0x18)(Edit, BlueprintVisible)
	class FText                                  PromptRight_19_D5E721D94E146329B7CDCB8DCCAE1163;   // 0x48(0x18)(Edit, BlueprintVisible)
	class UTexture2D*                            Image_22_E031E5274EEAE1ACE8A0AA9AFFAA7CBA;         // 0x60(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            UpgradeItemImage_40_3009680240517EDFEC1E51B7579E39C9; // 0x68(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  FancyNotificationHeading_25_1819A4CE49346D8E1053E68E49FD8714; // 0x70(0x18)(Edit, BlueprintVisible)
	class FText                                  FancyNotificationText_27_D151B6FB4F2CA92939DF8183A5398383; // 0x88(0x18)(Edit, BlueprintVisible)
	TArray<struct FStruct_ControllerButton>      UI_ControllerButtons_34_59A8B41648BEDD4F36834D96E7DAC775; // 0xA0(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FText                                  TutorialTitle_37_295B3269494A97BA173ACEA310825006; // 0xB0(0x18)(Edit, BlueprintVisible)
	bool                                         TutorialAlwaysUnlocked_48_3895097B4AD9C7520748CE822B12362A; // 0xC8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}


