#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x35F (0x700 - 0x3A1)
// BlueprintGeneratedClass WaifuNPC.WaifuNPC_C
class AWaifuNPC_C : public AUsable_Branching_NPC_C
{
public:
	uint8                                        Pad_3D0C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x3A8(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UBoxComponent*                         InteractibleCollision;                             // 0x3B0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*              P_maskFire;                                        // 0x3B8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                   ActivationLight;                                   // 0x3C0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Eyes;                                              // 0x3C8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                   LightR;                                            // 0x3D0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                   LightL;                                            // 0x3D8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UStaticMeshComponent*                  Waifu_crown;                                       // 0x3E0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       RespawnTranform;                                   // 0x3E8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USpotLightComponent*                   SpotLight;                                         // 0x3F0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UCapsuleComponent*                     DmgCapsule;                                        // 0x3F8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                SkeletalMesh;                                      // 0x400(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UDHConsoleExtensionComponent*          DHConsoleExtension;                                // 0x408(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_1_Alpha_99A842604D9B2B800273AFAAD49D8C85; // 0x410(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                Timeline_1__Direction_99A842604D9B2B800273AFAAD49D8C85; // 0x414(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3D19[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    Timeline_1;                                        // 0x418(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_4_TexPan_656FDB3E4BB9D179984A59ACAF5759D0; // 0x420(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_4_CrownOpacity_656FDB3E4BB9D179984A59ACAF5759D0; // 0x424(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                Timeline_4__Direction_656FDB3E4BB9D179984A59ACAF5759D0; // 0x428(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3D1D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    Timeline_4;                                        // 0x430(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_2_activationEmission_4E3D998946C802DE096753B3298D8C25; // 0x438(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_2_fire_4E3D998946C802DE096753B3298D8C25;  // 0x43C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_2_eyesEmit_4E3D998946C802DE096753B3298D8C25; // 0x440(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_2_Light_4E3D998946C802DE096753B3298D8C25; // 0x444(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                Timeline_2__Direction_4E3D998946C802DE096753B3298D8C25; // 0x448(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3D24[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    Timeline_2;                                        // 0x450(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_0_activationEmission_265DF5464499EF89D9683180D505F367; // 0x458(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_0_fire_265DF5464499EF89D9683180D505F367;  // 0x45C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_0_eyesEmit_265DF5464499EF89D9683180D505F367; // 0x460(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_0_Light_265DF5464499EF89D9683180D505F367; // 0x464(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                Timeline_0__Direction_265DF5464499EF89D9683180D505F367; // 0x468(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3D2A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    Timeline_0;                                        // 0x470(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        FadeOut_Opacity_EEC2E9404EEB9DA0B60104901D090172;  // 0x478(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                FadeOut__Direction_EEC2E9404EEB9DA0B60104901D090172; // 0x47C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3D2E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    FadeOut;                                           // 0x480(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bStartTrade;                                       // 0x488(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3D30[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  OpenAbilityPanelOptionText;                        // 0x490(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  TradeOptionText;                                   // 0x4A8(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FDHDialogueLine>               DarkFormTalk;                                      // 0x4C0(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FDHDialogueLine>               FirstTalk;                                         // 0x4D0(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FDHDialogueLine>               Normal;                                            // 0x4E0(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FDHDialogueLine>               Declined;                                          // 0x4F0(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UShellUpgradePanel_C*                  ShellUpgradePanel;                                 // 0x500(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bFadedOut;                                         // 0x508(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3D3E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FDHDialogueLine>               AllMaxedOut;                                       // 0x510(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FDHDialogueLine>               CurrentMaxedOut;                                   // 0x520(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class FName                                  UniqueCheckpointID;                                // 0x530(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  AreaCheckpointName;                                // 0x538(0x18)(Edit, BlueprintVisible)
	bool                                         bActivated;                                        // 0x550(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3D44[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FDHDialogueLine>               NewGamePlus_FirstTalk;                             // 0x558(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UParticleSystemComponent*              Eyes_particleSystem;                               // 0x568(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*              NewVar_0_0;                                        // 0x570(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        WaifuWakeSoundFadeOutDuration;                     // 0x578(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_3D48[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAudioComponent*                       WaifuSound;                                        // 0x580(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMerchantPanel_C*                      UI_MerchantPanel;                                  // 0x588(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMerchantItem>                 Stock;                                             // 0x590(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                         LargeScaleWaifu;                                   // 0x5A0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3D4B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FDHDialogueLine>               LightShell_FirstTalk;                              // 0x5A8(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FDHDialogueLine>               Respawn_FirstTalk;                                 // 0x5B8(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FDHDialogueLine>               Respawn_EveryTime;                                 // 0x5C8(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                         PlayerRespawnedAtWaifu;                            // 0x5D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3D4F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FDHDialogueLine>               Declined_0;                                        // 0x5E0(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FDHDialogueLine>               Declined_1;                                        // 0x5F0(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FDHDialogueLine>               Declined_2;                                        // 0x600(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FDHDialogueLine>               Declined_3;                                        // 0x610(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FDHDialogueLine>               Accept_0;                                          // 0x620(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FDHDialogueLine>               Accept_1;                                          // 0x630(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FDHDialogueLine>               Accept_2;                                          // 0x640(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FDHDialogueLine>               Accept_3;                                          // 0x650(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FDHDialogueLine>               Accept_4;                                          // 0x660(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class UAudioComponent*                       Waifu_Awake_Audio;                                 // 0x670(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAudioComponent*                       Waifu_Asleep_Audio;                                // 0x678(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FDHDialogueLine>               DarkFormTalk_Short;                                // 0x680(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class ATriggerVolume*                        AudioOcclusionVolume;                              // 0x690(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Occlusion_LP_Freq;                                 // 0x698(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Current_LP_Freq;                                   // 0x69C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CachedLPFreq;                                      // 0x6A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        TokenCost;                                         // 0x6A4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            OnWaifuCheckpointSet;                              // 0x6A8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         MerchantTest;                                      // 0x6B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3D5F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FMerchantItem>                 Stock_NGP;                                         // 0x6C0(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TArray<struct FDHDialogueLine>               AllMaxedOut_Short;                                 // 0x6D0(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                         bManuallyRespawnEnemies;                           // 0x6E0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3D61[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSoftObjectPtr<class AAdvancedEnemySpawner_C>> AdvancedEnemySpawners;                             // 0x6E8(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash)
	class ABP_ControllerAudio_C*                 BP_ControllerAudio_Waifu_Awake;                    // 0x6F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class AWaifuNPC_C* GetDefaultObj();

	void CreateKnifeTutorial(class FName Temp_name_Variable, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class ULargeTutorial_C* CallFunc_Create_ReturnValue);
