#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1A51A (0x1AC0A - 0x6F0)
// AnimBlueprintGeneratedClass ABP_HMU_TP_Player.ABP_HMU_TP_Player_C
class UABP_HMU_TP_Player_C : public UNWXThirdPersonAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x6F0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimBlueprintGeneratedMutableData    __AnimBlueprintMutables;                           // 0x6F8(0x3F9)(HasGetValueTypeHash)
	uint8                                        Pad_8B48[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimSubsystemInstance                AnimBlueprintExtension_PropertyAccess;             // 0xAF8(0x8)(None)
	struct FAnimSubsystemInstance_NodeRelevancy  AnimBlueprintExtension_NodeRelevancy;              // 0xB00(0xA8)(None)
	struct FAnimSubsystemInstance                AnimBlueprintExtension_BlendSpaceGraph;            // 0xBA8(0x8)(None)
	struct FAnimSubsystemInstance                AnimBlueprintExtension_Base;                       // 0xBB0(0x8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_174;                   // 0xBB8(0x28)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_19;                 // 0xBE0(0xF0)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_18;                 // 0xCD0(0xF0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_173;                   // 0xDC0(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_77;                   // 0xDE8(0x48)(None)
	struct FAnimNode_Inertialization             AnimGraphNode_Inertialization_5;                   // 0xE30(0x110)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_172;                   // 0xF40(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_171;                   // 0xF68(0x28)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_9;                   // 0xF90(0x48)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_170;                   // 0xFD8(0x28)(None)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_10;           // 0x1000(0xD0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_169;                   // 0x10D0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_168;                   // 0x10F8(0x28)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_71;                   // 0x1120(0x80)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_35;                      // 0x11A0(0xC8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_167;                   // 0x1268(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_166;                   // 0x1290(0x28)(None)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_9;               // 0x12B8(0x38)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_165;                   // 0x12F0(0x28)(None)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_9;            // 0x1318(0xD0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_164;                   // 0x13E8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_163;                   // 0x1410(0x28)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_70;                   // 0x1438(0x80)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_8;                   // 0x14B8(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_69;                   // 0x1500(0x80)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_162;                   // 0x1580(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_161;                   // 0x15A8(0x28)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_30;                // 0x15D0(0x40)(None)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_8;               // 0x1610(0x38)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_68;                   // 0x1648(0x80)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_29;                // 0x16C8(0x40)(None)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_7;               // 0x1708(0x38)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_67;                   // 0x1740(0x80)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_11;                             // 0x17C0(0x20)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_19;                  // 0x17E0(0xB8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_76;                   // 0x1898(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_75;                   // 0x18E0(0x48)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_20;                  // 0x1928(0x48)(None)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_6;               // 0x1970(0x38)(None)
	struct FAnimNode_RefPose                     AnimGraphNode_LocalRefPose;                        // 0x19A8(0x10)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_13;                    // 0x19B8(0xC8)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_10;                             // 0x1A80(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_15;                       // 0x1AA0(0x128)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_14;                       // 0x1BC8(0x128)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_18;                  // 0x1CF0(0xB8)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_10;            // 0x1DA8(0x20)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_10;            // 0x1DC8(0x20)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_9;                              // 0x1DE8(0x20)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_179;                // 0x1E08(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_178;                // 0x1E30(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_177;                // 0x1E58(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_176;                // 0x1E80(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_175;                // 0x1EA8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_174;                // 0x1ED0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_173;                // 0x1EF8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_172;                // 0x1F20(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_171;                // 0x1F48(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_170;                // 0x1F70(0x28)(None)
	struct FAnimNode_BlendSpaceEvaluator         AnimGraphNode_BlendSpaceEvaluator_10;              // 0x1F98(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_105;                     // 0x2010(0x20)(None)
	struct FAnimNode_BlendSpaceEvaluator         AnimGraphNode_BlendSpaceEvaluator_9;               // 0x2030(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_104;                     // 0x20A8(0x20)(None)
	struct FAnimNode_BlendSpaceEvaluator         AnimGraphNode_BlendSpaceEvaluator_8;               // 0x20C8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_103;                     // 0x2140(0x20)(None)
	struct FAnimNode_BlendSpaceEvaluator         AnimGraphNode_BlendSpaceEvaluator_7;               // 0x2160(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_102;                     // 0x21D8(0x20)(None)
	struct FAnimNode_BlendSpaceEvaluator         AnimGraphNode_BlendSpaceEvaluator_6;               // 0x21F8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_101;                     // 0x2270(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_20;                     // 0x2290(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_100;                     // 0x2358(0x20)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_169;                // 0x2378(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_168;                // 0x23A0(0x28)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_28;                // 0x23C8(0x40)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_99;                      // 0x2408(0x20)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_27;                // 0x2428(0x40)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_98;                      // 0x2468(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_19;                     // 0x2488(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_97;                      // 0x2550(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_18;                     // 0x2570(0xC8)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_8;                              // 0x2638(0x20)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_17;                  // 0x2658(0xB8)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_9;             // 0x2710(0x20)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_43;                      // 0x2730(0x120)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_66;                   // 0x2850(0x80)(None)
	struct FAnimNode_TwoBoneIK                   AnimGraphNode_TwoBoneIK_1;                         // 0x28D0(0x280)(None)
	struct FAnimNode_TwoBoneIK                   AnimGraphNode_TwoBoneIK;                           // 0x2B50(0x280)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_13;                       // 0x2DD0(0x128)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_12;                       // 0x2EF8(0x128)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_9;             // 0x3020(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_160;                   // 0x3040(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_159;                   // 0x3068(0x28)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_19;                  // 0x3090(0x48)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_7;                              // 0x30D8(0x20)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_16;                  // 0x30F8(0xB8)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_15;                  // 0x31B0(0xB8)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_14;                  // 0x3268(0xB8)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_13;                  // 0x3320(0xB8)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_12;                  // 0x33D8(0xB8)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_11;                  // 0x3490(0xB8)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_167;                // 0x3548(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_166;                // 0x3570(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_165;                // 0x3598(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_164;                // 0x35C0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_163;                // 0x35E8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_162;                // 0x3610(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_161;                // 0x3638(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_160;                // 0x3660(0x28)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_42;                      // 0x3688(0x120)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_35;                    // 0x37A8(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_158;                   // 0x37F8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_157;                   // 0x3820(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_156;                   // 0x3848(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_155;                   // 0x3870(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_96;                      // 0x3898(0x20)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_41;                      // 0x38B8(0x120)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_34;                    // 0x39D8(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_154;                   // 0x3A28(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_153;                   // 0x3A50(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_152;                   // 0x3A78(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_151;                   // 0x3AA0(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_95;                      // 0x3AC8(0x20)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_40;                      // 0x3AE8(0x120)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_33;                    // 0x3C08(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_150;                   // 0x3C58(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_149;                   // 0x3C80(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_148;                   // 0x3CA8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_147;                   // 0x3CD0(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_94;                      // 0x3CF8(0x20)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_39;                      // 0x3D18(0x120)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_32;                    // 0x3E38(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_146;                   // 0x3E88(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_145;                   // 0x3EB0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_144;                   // 0x3ED8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_143;                   // 0x3F00(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_93;                      // 0x3F28(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_142;                   // 0x3F48(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_141;                   // 0x3F70(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_140;                   // 0x3F98(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_139;                   // 0x3FC0(0x28)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_38;                      // 0x3FE8(0x120)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_31;                    // 0x4108(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_92;                      // 0x4158(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_138;                   // 0x4178(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_137;                   // 0x41A0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_136;                   // 0x41C8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_135;                   // 0x41F0(0x28)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_37;                      // 0x4218(0x120)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_30;                    // 0x4338(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_91;                      // 0x4388(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_17;                     // 0x43A8(0xC8)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_65;                   // 0x4470(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_64;                   // 0x44F0(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_63;                   // 0x4570(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_62;                   // 0x45F0(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_61;                   // 0x4670(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_60;                   // 0x46F0(0x80)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_6;                              // 0x4770(0x20)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_10;                  // 0x4790(0xB8)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_9;                   // 0x4848(0xB8)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_8;                   // 0x4900(0xB8)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_7;                   // 0x49B8(0xB8)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_6;                   // 0x4A70(0xB8)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_5;                   // 0x4B28(0xB8)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_159;                // 0x4BE0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_158;                // 0x4C08(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_157;                // 0x4C30(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_156;                // 0x4C58(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_155;                // 0x4C80(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_154;                // 0x4CA8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_153;                // 0x4CD0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_152;                // 0x4CF8(0x28)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_36;                      // 0x4D20(0x120)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_134;                   // 0x4E40(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_133;                   // 0x4E68(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_132;                   // 0x4E90(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_131;                   // 0x4EB8(0x28)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_29;                    // 0x4EE0(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_90;                      // 0x4F30(0x20)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_35;                      // 0x4F50(0x120)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_130;                   // 0x5070(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_129;                   // 0x5098(0x28)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_28;                    // 0x50C0(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_128;                   // 0x5110(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_127;                   // 0x5138(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_89;                      // 0x5160(0x20)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_34;                      // 0x5180(0x120)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_126;                   // 0x52A0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_125;                   // 0x52C8(0x28)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_27;                    // 0x52F0(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_124;                   // 0x5340(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_123;                   // 0x5368(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_88;                      // 0x5390(0x20)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_33;                      // 0x53B0(0x120)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_122;                   // 0x54D0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_121;                   // 0x54F8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_120;                   // 0x5520(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_119;                   // 0x5548(0x28)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_26;                    // 0x5570(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_87;                      // 0x55C0(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_118;                   // 0x55E0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_117;                   // 0x5608(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_116;                   // 0x5630(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_115;                   // 0x5658(0x28)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_32;                      // 0x5680(0x120)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_25;                    // 0x57A0(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_86;                      // 0x57F0(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_114;                   // 0x5810(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_113;                   // 0x5838(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_112;                   // 0x5860(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_111;                   // 0x5888(0x28)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_31;                      // 0x58B0(0x120)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_24;                    // 0x59D0(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_85;                      // 0x5A20(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_16;                     // 0x5A40(0xC8)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_59;                   // 0x5B08(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_58;                   // 0x5B88(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_57;                   // 0x5C08(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_56;                   // 0x5C88(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_55;                   // 0x5D08(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_54;                   // 0x5D88(0x80)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_4;                   // 0x5E08(0xB8)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_53;                   // 0x5EC0(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_52;                   // 0x5F40(0x80)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_18;                  // 0x5FC0(0x48)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_34;                      // 0x6008(0xC8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_110;                   // 0x60D0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_109;                   // 0x60F8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_108;                   // 0x6120(0x28)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_5;                              // 0x6148(0x20)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_3;                   // 0x6168(0xB8)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_2;                   // 0x6220(0xB8)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_51;                   // 0x62D8(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_50;                   // 0x6358(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_49;                   // 0x63D8(0x80)(None)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_5;               // 0x6458(0x38)(None)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_4;               // 0x6490(0x38)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_48;                   // 0x64C8(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_47;                   // 0x6548(0x80)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_107;                   // 0x65C8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_106;                   // 0x65F0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_105;                   // 0x6618(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_104;                   // 0x6640(0x28)(None)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_8;            // 0x6668(0xD0)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_33;                      // 0x6738(0xC8)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_15;                             // 0x6800(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_46;                   // 0x6848(0x80)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_103;                   // 0x68C8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_102;                   // 0x68F0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_101;                   // 0x6918(0x28)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_17;                 // 0x6940(0xF0)(None)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_7;            // 0x6A30(0xD0)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_32;                      // 0x6B00(0xC8)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_14;                             // 0x6BC8(0x48)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_100;                   // 0x6C10(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_99;                    // 0x6C38(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_98;                    // 0x6C60(0x28)(None)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_6;            // 0x6C88(0xD0)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_31;                      // 0x6D58(0xC8)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_13;                             // 0x6E20(0x48)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_97;                    // 0x6E68(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_96;                    // 0x6E90(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_95;                    // 0x6EB8(0x28)(None)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_5;            // 0x6EE0(0xD0)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_30;                      // 0x6FB0(0xC8)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_12;                             // 0x7078(0x48)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_94;                    // 0x70C0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_93;                    // 0x70E8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_92;                    // 0x7110(0x28)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_29;                      // 0x7138(0xC8)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_11;                             // 0x7200(0x48)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_91;                    // 0x7248(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_90;                    // 0x7270(0x28)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_28;                      // 0x7298(0xC8)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_10;                             // 0x7360(0x48)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_89;                    // 0x73A8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_88;                    // 0x73D0(0x28)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_45;                   // 0x73F8(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_44;                   // 0x7478(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_43;                   // 0x74F8(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_42;                   // 0x7578(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_41;                   // 0x75F8(0x80)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose_1;                   // 0x7678(0xB8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_87;                    // 0x7730(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_86;                    // 0x7758(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_85;                    // 0x7780(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_84;                    // 0x77A8(0x28)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_12;                    // 0x77D0(0xC8)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_11;                    // 0x7898(0xC8)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_16;                 // 0x7960(0xF0)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_15;                 // 0x7A50(0xF0)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_14;                 // 0x7B40(0xF0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_83;                    // 0x7C30(0x28)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_13;                 // 0x7C58(0xF0)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_12;                 // 0x7D48(0xF0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_82;                    // 0x7E38(0x28)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_11;                 // 0x7E60(0xF0)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_10;                 // 0x7F50(0xF0)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_9;                              // 0x8040(0x48)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_9;                  // 0x8088(0xF0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_81;                    // 0x8178(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_80;                    // 0x81A0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_79;                    // 0x81C8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_78;                    // 0x81F0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_77;                    // 0x8218(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_76;                    // 0x8240(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_75;                    // 0x8268(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_74;                    // 0x8290(0x28)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_8;                  // 0x82B8(0xF0)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_4;                              // 0x83A8(0x20)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_26;                // 0x83C8(0x40)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_23;                    // 0x8408(0x50)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_25;                // 0x8458(0x40)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_3;                              // 0x8498(0x20)(None)
	struct FAnimNode_Inertialization             AnimGraphNode_Inertialization_4;                   // 0x84B8(0x110)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_40;                   // 0x85C8(0x80)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_30;                      // 0x8648(0x120)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_74;                   // 0x8768(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_39;                   // 0x87B0(0x80)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_73;                    // 0x8830(0x28)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_29;                      // 0x8858(0x120)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_72;                    // 0x8978(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_71;                    // 0x89A0(0x28)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_27;                      // 0x89C8(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_73;                   // 0x8A90(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_72;                   // 0x8AD8(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_71;                   // 0x8B20(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_70;                   // 0x8B68(0x48)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_17;                  // 0x8BB0(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_38;                   // 0x8BF8(0x80)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_69;                   // 0x8C78(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_68;                   // 0x8CC0(0x48)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_16;                  // 0x8D08(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_67;                   // 0x8D50(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_66;                   // 0x8D98(0x48)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_15;                  // 0x8DE0(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_37;                   // 0x8E28(0x80)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_65;                   // 0x8EA8(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_64;                   // 0x8EF0(0x48)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_14;                  // 0x8F38(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_36;                   // 0x8F80(0x80)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_63;                   // 0x9000(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_62;                   // 0x9048(0x48)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_13;                  // 0x9090(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_35;                   // 0x90D8(0x80)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_70;                    // 0x9158(0x28)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_26;                      // 0x9180(0xC8)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_25;                      // 0x9248(0xC8)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_24;                      // 0x9310(0xC8)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_23;                      // 0x93D8(0xC8)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_22;                    // 0x94A0(0x50)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_28;                      // 0x94F0(0x120)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_22;                      // 0x9610(0xC8)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_21;                      // 0x96D8(0xC8)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_20;                      // 0x97A0(0xC8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_69;                    // 0x9868(0x28)(None)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_4;            // 0x9890(0xD0)(None)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_3;            // 0x9960(0xD0)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_27;                      // 0x9A30(0x120)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_7;                   // 0x9B50(0x48)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_6;                   // 0x9B98(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_34;                   // 0x9BE0(0x80)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_68;                    // 0x9C60(0x28)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_33;                   // 0x9C88(0x80)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_67;                    // 0x9D08(0x28)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_32;                   // 0x9D30(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_31;                   // 0x9DB0(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_30;                   // 0x9E30(0x80)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_5;                   // 0x9EB0(0x48)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_4;                   // 0x9EF8(0x48)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_66;                    // 0x9F40(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_65;                    // 0x9F68(0x28)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_26;                      // 0x9F90(0x120)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_7;                  // 0xA0B0(0xF0)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_6;                  // 0xA1A0(0xF0)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_8;                              // 0xA290(0x48)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_64;                    // 0xA2D8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_63;                    // 0xA300(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_62;                    // 0xA328(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_61;                    // 0xA350(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_61;                   // 0xA378(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_60;                   // 0xA3C0(0x48)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_12;                  // 0xA408(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_29;                   // 0xA450(0x80)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_60;                    // 0xA4D0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_59;                    // 0xA4F8(0x28)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_11;                  // 0xA520(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_28;                   // 0xA568(0x80)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_10;                  // 0xA5E8(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_27;                   // 0xA630(0x80)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_59;                   // 0xA6B0(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_58;                   // 0xA6F8(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_57;                   // 0xA740(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_56;                   // 0xA788(0x48)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_58;                    // 0xA7D0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_57;                    // 0xA7F8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_56;                    // 0xA820(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_55;                    // 0xA848(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_54;                    // 0xA870(0x28)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_24;                // 0xA898(0x40)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_9;                   // 0xA8D8(0x48)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_23;                // 0xA920(0x40)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_26;                   // 0xA960(0x80)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_22;                // 0xA9E0(0x40)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_8;                   // 0xAA20(0x48)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_21;                // 0xAA68(0x40)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_25;                   // 0xAAA8(0x80)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_53;                    // 0xAB28(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_52;                    // 0xAB50(0x28)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_10;                    // 0xAB78(0xC8)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_3;                   // 0xAC40(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_55;                   // 0xAC88(0x48)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_5;                  // 0xACD0(0xF0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_24;                   // 0xADC0(0x80)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_51;                    // 0xAE40(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_50;                    // 0xAE68(0x28)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_23;                   // 0xAE90(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_22;                   // 0xAF10(0x80)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_19;                      // 0xAF90(0xC8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_49;                    // 0xB058(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_48;                    // 0xB080(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_47;                    // 0xB0A8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_46;                    // 0xB0D0(0x28)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_21;                   // 0xB0F8(0x80)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_45;                    // 0xB178(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_44;                    // 0xB1A0(0x28)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_20;                   // 0xB1C8(0x80)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_7;                   // 0xB248(0x48)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_83;                 // 0xB290(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_82;                 // 0xB300(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_81;                 // 0xB370(0x70)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_4;                  // 0xB3E0(0xF0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_43;                    // 0xB4D0(0x28)(None)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_3;               // 0xB4F8(0x38)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_19;                   // 0xB530(0x80)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_42;                    // 0xB5B0(0x28)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_18;                   // 0xB5D8(0x80)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_18;                      // 0xB658(0xC8)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_17;                      // 0xB720(0xC8)(None)
	struct FAnimNode_Inertialization             AnimGraphNode_Inertialization_3;                   // 0xB7E8(0x110)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_17;                   // 0xB8F8(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_16;                   // 0xB978(0x80)(None)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_2;               // 0xB9F8(0x38)(None)
	struct FAnimNode_Inertialization             AnimGraphNode_Inertialization_2;                   // 0xBA30(0x110)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_9;                     // 0xBB40(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_54;                   // 0xBC08(0x48)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_2;                   // 0xBC50(0x48)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_25;                      // 0xBC98(0x120)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_16;                      // 0xBDB8(0xC8)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_15;                      // 0xBE80(0xC8)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_11;                       // 0xBF48(0x128)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8;             // 0xC070(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_8;             // 0xC090(0x20)(None)
	struct FAnimNode_Fabrik                      AnimGraphNode_Fabrik_1;                            // 0xC0B0(0x1F0)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_10;                       // 0xC2A0(0x128)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_41;                    // 0xC3C8(0x28)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_15;                   // 0xC3F0(0x80)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_40;                    // 0xC470(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_39;                    // 0xC498(0x28)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_14;                      // 0xC4C0(0xC8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_38;                    // 0xC588(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_37;                    // 0xC5B0(0x28)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_14;                   // 0xC5D8(0x80)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_36;                    // 0xC658(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_35;                    // 0xC680(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_34;                    // 0xC6A8(0x28)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_13;                   // 0xC6D0(0x80)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_33;                    // 0xC750(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_32;                    // 0xC778(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_31;                    // 0xC7A0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_30;                    // 0xC7C8(0x28)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_7;                              // 0xC7F0(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_12;                   // 0xC838(0x80)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_29;                    // 0xC8B8(0x28)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_1;                   // 0xC8E0(0x48)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_6;                   // 0xC928(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_53;                   // 0xC970(0x48)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_28;                    // 0xC9B8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_27;                    // 0xC9E0(0x28)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_11;                   // 0xCA08(0x80)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_26;                    // 0xCA88(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_25;                    // 0xCAB0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_24;                    // 0xCAD8(0x28)(None)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive_1;               // 0xCB00(0x38)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_52;                   // 0xCB38(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_51;                   // 0xCB80(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_50;                   // 0xCBC8(0x48)(None)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt;                      // 0xCC10(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_49;                   // 0xCC58(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_48;                   // 0xCCA0(0x48)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_5;                   // 0xCCE8(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_10;                   // 0xCD30(0x80)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_2;                              // 0xCDB0(0x20)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_151;                // 0xCDD0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_150;                // 0xCDF8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_149;                // 0xCE20(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_148;                // 0xCE48(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_147;                // 0xCE70(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_146;                // 0xCE98(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_145;                // 0xCEC0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_144;                // 0xCEE8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_143;                // 0xCF10(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_142;                // 0xCF38(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_141;                // 0xCF60(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_140;                // 0xCF88(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_139;                // 0xCFB0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_138;                // 0xCFD8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_137;                // 0xD000(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_136;                // 0xD028(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_135;                // 0xD050(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_134;                // 0xD078(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_133;                // 0xD0A0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_132;                // 0xD0C8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_131;                // 0xD0F0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_130;                // 0xD118(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_129;                // 0xD140(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_128;                // 0xD168(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_47;                   // 0xD190(0x48)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_13;                      // 0xD1D8(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_46;                   // 0xD2A0(0x48)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_8;                     // 0xD2E8(0xC8)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_80;                 // 0xD3B0(0x70)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_84;                      // 0xD420(0x20)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_45;                   // 0xD440(0x48)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_83;                      // 0xD488(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_15;                     // 0xD4A8(0xC8)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_24;                      // 0xD570(0x120)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_82;                      // 0xD690(0x20)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_23;                      // 0xD6B0(0x120)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_127;                // 0xD7D0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_126;                // 0xD7F8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_125;                // 0xD820(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_124;                // 0xD848(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_123;                // 0xD870(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_122;                // 0xD898(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_121;                // 0xD8C0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_120;                // 0xD8E8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_119;                // 0xD910(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_118;                // 0xD938(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_117;                // 0xD960(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_116;                // 0xD988(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_115;                // 0xD9B0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_114;                // 0xD9D8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_113;                // 0xDA00(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_112;                // 0xDA28(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_111;                // 0xDA50(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_110;                // 0xDA78(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_109;                // 0xDAA0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_108;                // 0xDAC8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_107;                // 0xDAF0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_106;                // 0xDB18(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_105;                // 0xDB40(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_104;                // 0xDB68(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_103;                // 0xDB90(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_102;                // 0xDBB8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_101;                // 0xDBE0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_100;                // 0xDC08(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_99;                 // 0xDC30(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_98;                 // 0xDC58(0x28)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7;             // 0xDC80(0x20)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7;             // 0xDCA0(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_9;                        // 0xDCC0(0x128)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_44;                   // 0xDDE8(0x48)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_81;                      // 0xDE30(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;             // 0xDE50(0x20)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;             // 0xDE70(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_8;                        // 0xDE90(0x128)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_43;                   // 0xDFB8(0x48)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_80;                      // 0xE000(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0xE020(0x20)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0xE040(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_7;                        // 0xE060(0x128)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_42;                   // 0xE188(0x48)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_79;                      // 0xE1D0(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0xE1F0(0x20)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0xE210(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_6;                        // 0xE230(0x128)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_41;                   // 0xE358(0x48)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_78;                      // 0xE3A0(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_79;                 // 0xE3C0(0x70)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_77;                      // 0xE430(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_78;                 // 0xE450(0x70)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_76;                      // 0xE4C0(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_77;                 // 0xE4E0(0x70)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_75;                      // 0xE550(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_76;                 // 0xE570(0x70)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_74;                      // 0xE5E0(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_75;                 // 0xE600(0x70)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_73;                      // 0xE670(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_74;                 // 0xE690(0x70)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_72;                      // 0xE700(0x20)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_40;                   // 0xE720(0x48)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_71;                      // 0xE768(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_14;                     // 0xE788(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_70;                      // 0xE850(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_73;                 // 0xE870(0x70)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_69;                      // 0xE8E0(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_13;                     // 0xE900(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_68;                      // 0xE9C8(0x20)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_22;                      // 0xE9E8(0x120)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_97;                 // 0xEB08(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_96;                 // 0xEB30(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_95;                 // 0xEB58(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_94;                 // 0xEB80(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_93;                 // 0xEBA8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_92;                 // 0xEBD0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_91;                 // 0xEBF8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_90;                 // 0xEC20(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_89;                 // 0xEC48(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_88;                 // 0xEC70(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_87;                 // 0xEC98(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_86;                 // 0xECC0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_85;                 // 0xECE8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_84;                 // 0xED10(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_83;                 // 0xED38(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_82;                 // 0xED60(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_81;                 // 0xED88(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_80;                 // 0xEDB0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_79;                 // 0xEDD8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_78;                 // 0xEE00(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_77;                 // 0xEE28(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_76;                 // 0xEE50(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_75;                 // 0xEE78(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_74;                 // 0xEEA0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_73;                 // 0xEEC8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_72;                 // 0xEEF0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_71;                 // 0xEF18(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_70;                 // 0xEF40(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_69;                 // 0xEF68(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_68;                 // 0xEF90(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_67;                 // 0xEFB8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_66;                 // 0xEFE0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_65;                 // 0xF008(0x28)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_72;                 // 0xF030(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_71;                 // 0xF0A0(0x70)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_21;                    // 0xF110(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_67;                      // 0xF160(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_70;                 // 0xF180(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_69;                 // 0xF1F0(0x70)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_20;                    // 0xF260(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_66;                      // 0xF2B0(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_68;                 // 0xF2D0(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_67;                 // 0xF340(0x70)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_19;                    // 0xF3B0(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_65;                      // 0xF400(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_66;                 // 0xF420(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_65;                 // 0xF490(0x70)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_18;                    // 0xF500(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_64;                      // 0xF550(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_64;                 // 0xF570(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_63;                 // 0xF5E0(0x70)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_17;                    // 0xF650(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_63;                      // 0xF6A0(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_62;                 // 0xF6C0(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_61;                 // 0xF730(0x70)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_16;                    // 0xF7A0(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_62;                      // 0xF7F0(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_60;                 // 0xF810(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_59;                 // 0xF880(0x70)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_15;                    // 0xF8F0(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_61;                      // 0xF940(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_58;                 // 0xF960(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_57;                 // 0xF9D0(0x70)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_14;                    // 0xFA40(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_60;                      // 0xFA90(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_56;                 // 0xFAB0(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_55;                 // 0xFB20(0x70)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_13;                    // 0xFB90(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_59;                      // 0xFBE0(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_54;                 // 0xFC00(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_53;                 // 0xFC70(0x70)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_12;                    // 0xFCE0(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_58;                      // 0xFD30(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_52;                 // 0xFD50(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_51;                 // 0xFDC0(0x70)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_11;                    // 0xFE30(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_57;                      // 0xFE80(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_50;                 // 0xFEA0(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_49;                 // 0xFF10(0x70)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_10;                    // 0xFF80(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_56;                      // 0xFFD0(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_48;                 // 0xFFF0(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_47;                 // 0x10060(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_46;                 // 0x100D0(0x70)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_9;                     // 0x10140(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_55;                      // 0x10190(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_45;                 // 0x101B0(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_44;                 // 0x10220(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_43;                 // 0x10290(0x70)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_8;                     // 0x10300(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_54;                      // 0x10350(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_42;                 // 0x10370(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_41;                 // 0x103E0(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_40;                 // 0x10450(0x70)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_7;                     // 0x104C0(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_53;                      // 0x10510(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_39;                 // 0x10530(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_38;                 // 0x105A0(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_37;                 // 0x10610(0x70)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_6;                     // 0x10680(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_52;                      // 0x106D0(0x20)(None)
	struct FAnimNode_BlendSpaceEvaluator         AnimGraphNode_BlendSpaceEvaluator_5;               // 0x106F0(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_51;                      // 0x10768(0x20)(None)
	struct FAnimNode_BlendSpaceEvaluator         AnimGraphNode_BlendSpaceEvaluator_4;               // 0x10788(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_50;                      // 0x10800(0x20)(None)
	struct FAnimNode_BlendSpaceEvaluator         AnimGraphNode_BlendSpaceEvaluator_3;               // 0x10820(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_49;                      // 0x10898(0x20)(None)
	struct FAnimNode_BlendSpaceEvaluator         AnimGraphNode_BlendSpaceEvaluator_2;               // 0x108B8(0x78)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_48;                      // 0x10930(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_12;                     // 0x10950(0xC8)(None)
	struct FAnimNode_Inertialization             AnimGraphNode_Inertialization_1;                   // 0x10A18(0x110)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_21;                      // 0x10B28(0x120)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_47;                      // 0x10C48(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_36;                 // 0x10C68(0x70)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_46;                      // 0x10CD8(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_11;                     // 0x10CF8(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_45;                      // 0x10DC0(0x20)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_64;                 // 0x10DE0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_23;                    // 0x10E08(0x28)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_20;                      // 0x10E30(0x120)(None)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_2;            // 0x10F50(0xD0)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_12;                      // 0x11020(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_39;                   // 0x110E8(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_38;                   // 0x11130(0x48)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_44;                      // 0x11178(0x20)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_63;                 // 0x11198(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_62;                 // 0x111C0(0x28)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_19;                      // 0x111E8(0x120)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_11;                      // 0x11308(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_37;                   // 0x113D0(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_36;                   // 0x11418(0x48)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_43;                      // 0x11460(0x20)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_18;                      // 0x11480(0x120)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_10;                      // 0x115A0(0xC8)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_20;                // 0x11668(0x40)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_19;                // 0x116A8(0x40)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_9;                       // 0x116E8(0xC8)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_7;                     // 0x117B0(0xC8)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_35;                 // 0x11878(0x70)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_61;                 // 0x118E8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_60;                 // 0x11910(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_59;                 // 0x11938(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_58;                 // 0x11960(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_57;                 // 0x11988(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_35;                   // 0x119B0(0x48)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_42;                      // 0x119F8(0x20)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_34;                   // 0x11A18(0x48)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_41;                      // 0x11A60(0x20)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_8;                       // 0x11A80(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_33;                   // 0x11B48(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_32;                   // 0x11B90(0x48)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_40;                      // 0x11BD8(0x20)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_7;                       // 0x11BF8(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_31;                   // 0x11CC0(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_30;                   // 0x11D08(0x48)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_39;                      // 0x11D50(0x20)(None)
	struct FAnimNode_PoseSnapshot                AnimGraphNode_PoseSnapshot_1;                      // 0x11D70(0x90)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_38;                      // 0x11E00(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_10;                     // 0x11E20(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_37;                      // 0x11EE8(0x20)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_6;                     // 0x11F08(0xC8)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_34;                 // 0x11FD0(0x70)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_6;                       // 0x12040(0xC8)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_18;                // 0x12108(0x40)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_17;                // 0x12148(0x40)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_5;                       // 0x12188(0xC8)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_17;                      // 0x12250(0x120)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_4;                       // 0x12370(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_29;                   // 0x12438(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_28;                   // 0x12480(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_27;                   // 0x124C8(0x48)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_3;                       // 0x12510(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_36;                      // 0x125D8(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_22;                    // 0x125F8(0x28)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_16;                      // 0x12620(0x120)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_35;                      // 0x12740(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_9;                      // 0x12760(0xC8)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_56;                 // 0x12828(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_55;                 // 0x12850(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_54;                 // 0x12878(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_53;                 // 0x128A0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_52;                 // 0x128C8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_51;                 // 0x128F0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_50;                 // 0x12918(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_49;                 // 0x12940(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_48;                 // 0x12968(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_47;                 // 0x12990(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_46;                 // 0x129B8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_45;                 // 0x129E0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_44;                 // 0x12A08(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_43;                 // 0x12A30(0x28)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_15;                      // 0x12A58(0x120)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_16;                // 0x12B78(0x40)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_34;                      // 0x12BB8(0x20)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_42;                 // 0x12BD8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_41;                 // 0x12C00(0x28)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_33;                 // 0x12C28(0x70)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_33;                      // 0x12C98(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_32;                 // 0x12CB8(0x70)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_32;                      // 0x12D28(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_21;                    // 0x12D48(0x28)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_14;                      // 0x12D70(0x120)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_31;                      // 0x12E90(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_20;                    // 0x12EB0(0x28)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_13;                      // 0x12ED8(0x120)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_30;                      // 0x12FF8(0x20)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_29;                      // 0x13018(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_8;                      // 0x13038(0xC8)(None)
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_10;                  // 0x13100(0xC8)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x131C8(0x20)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0x131E8(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_5;                        // 0x13208(0x128)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_31;                 // 0x13330(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_23;           // 0x133A0(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_30;                 // 0x133C0(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_22;           // 0x13430(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_29;                 // 0x13450(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_21;           // 0x134C0(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_28;                 // 0x134E0(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_20;           // 0x13550(0x20)(None)
	struct FAnimNode_BlendSpaceGraph             AnimGraphNode_BlendSpaceGraph_5;                   // 0x13570(0x68)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_2;                       // 0x135D8(0xC8)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_26;                   // 0x136A0(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_25;                   // 0x136E8(0x48)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_27;                 // 0x13730(0x70)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_5;                     // 0x137A0(0xC8)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_26;                 // 0x13868(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_19;           // 0x138D8(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_25;                 // 0x138F8(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_18;           // 0x13968(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_24;                 // 0x13988(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_17;           // 0x139F8(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_23;                 // 0x13A18(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_16;           // 0x13A88(0x20)(None)
	struct FAnimNode_BlendSpaceGraph             AnimGraphNode_BlendSpaceGraph_4;                   // 0x13AA8(0x68)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_22;                 // 0x13B10(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_15;           // 0x13B80(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_21;                 // 0x13BA0(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_14;           // 0x13C10(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_20;                 // 0x13C30(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_13;           // 0x13CA0(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_19;                 // 0x13CC0(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_12;           // 0x13D30(0x20)(None)
	struct FAnimNode_BlendSpaceGraph             AnimGraphNode_BlendSpaceGraph_3;                   // 0x13D50(0x68)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_18;                 // 0x13DB8(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_11;           // 0x13E28(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_17;                 // 0x13E48(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_10;           // 0x13EB8(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_16;                 // 0x13ED8(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_9;            // 0x13F48(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_15;                 // 0x13F68(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_8;            // 0x13FD8(0x20)(None)
	struct FAnimNode_BlendSpaceGraph             AnimGraphNode_BlendSpaceGraph_2;                   // 0x13FF8(0x68)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_14;                 // 0x14060(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_7;            // 0x140D0(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_13;                 // 0x140F0(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_6;            // 0x14160(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_12;                 // 0x14180(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_5;            // 0x141F0(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_11;                 // 0x14210(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_4;            // 0x14280(0x20)(None)
	struct FAnimNode_BlendSpaceGraph             AnimGraphNode_BlendSpaceGraph_1;                   // 0x142A0(0x68)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_10;                 // 0x14308(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_3;            // 0x14378(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_9;                  // 0x14398(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_2;            // 0x14408(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_8;                  // 0x14428(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult_1;            // 0x14498(0x20)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_7;                  // 0x144B8(0x70)(None)
	struct FAnimNode_BlendSpaceSampleResult      AnimGraphNode_BlendSpaceSampleResult;              // 0x14528(0x20)(None)
	struct FAnimNode_BlendSpaceGraph             AnimGraphNode_BlendSpaceGraph;                     // 0x14548(0x68)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_28;                      // 0x145B0(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_7;                      // 0x145D0(0xC8)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_40;                 // 0x14698(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_39;                 // 0x146C0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_38;                 // 0x146E8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_37;                 // 0x14710(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_36;                 // 0x14738(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_35;                 // 0x14760(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_34;                 // 0x14788(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_33;                 // 0x147B0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_32;                 // 0x147D8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_31;                 // 0x14800(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_30;                 // 0x14828(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_29;                 // 0x14850(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_19;                    // 0x14878(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_24;                   // 0x148A0(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_23;                   // 0x148E8(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_22;                   // 0x14930(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_21;                   // 0x14978(0x48)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_5;                     // 0x149C0(0x50)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_4;                     // 0x14A10(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_27;                      // 0x14AD8(0x20)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_28;                 // 0x14AF8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_18;                    // 0x14B20(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_20;                   // 0x14B48(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_19;                   // 0x14B90(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_18;                   // 0x14BD8(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_17;                   // 0x14C20(0x48)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_4;                     // 0x14C68(0x50)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_3;                     // 0x14CB8(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_26;                      // 0x14D80(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_17;                    // 0x14DA0(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_16;                   // 0x14DC8(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_15;                   // 0x14E10(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_14;                   // 0x14E58(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_13;                   // 0x14EA0(0x48)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_3;                     // 0x14EE8(0x50)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_2;                     // 0x14F38(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_25;                      // 0x15000(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_16;                    // 0x15020(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_24;                      // 0x15048(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_15;                    // 0x15068(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_23;                      // 0x15090(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_14;                    // 0x150B0(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_12;                   // 0x150D8(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_11;                   // 0x15120(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_10;                   // 0x15168(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9;                    // 0x151B0(0x48)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_2;                     // 0x151F8(0x50)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_1;                     // 0x15248(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_22;                      // 0x15310(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_6;                      // 0x15330(0xC8)(None)
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_9;                   // 0x153F8(0xC8)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x154C0(0x20)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0x154E0(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_4;                        // 0x15500(0x128)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_6;                  // 0x15628(0x70)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_15;                // 0x15698(0x40)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_1;                       // 0x156D8(0xC8)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_5;                  // 0x157A0(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_4;                  // 0x15810(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_3;                  // 0x15880(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_2;                  // 0x158F0(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_1;                  // 0x15960(0x70)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer;                    // 0x159D0(0x70)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive;                       // 0x15A40(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_21;                      // 0x15B08(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_5;                      // 0x15B28(0xC8)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_27;                 // 0x15BF0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_26;                 // 0x15C18(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_25;                 // 0x15C40(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_24;                 // 0x15C68(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_23;                 // 0x15C90(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_22;                 // 0x15CB8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_21;                 // 0x15CE0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_20;                 // 0x15D08(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_13;                    // 0x15D30(0x28)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_14;                // 0x15D58(0x40)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_13;                // 0x15D98(0x40)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_3;                  // 0x15DD8(0xF0)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_12;                      // 0x15EC8(0x120)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_20;                      // 0x15FE8(0x20)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8;                    // 0x16008(0x48)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_11;                      // 0x16050(0x120)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_19;                      // 0x16170(0x20)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7;                    // 0x16190(0x48)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_10;                      // 0x161D8(0x120)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_18;                      // 0x162F8(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_12;                    // 0x16318(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_17;                      // 0x16340(0x20)(None)
	struct FAnimNode_BlendSpaceEvaluator         AnimGraphNode_BlendSpaceEvaluator_1;               // 0x16360(0x78)(None)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive_1;            // 0x163D8(0xD0)(None)
	struct FAnimNode_BlendSpaceEvaluator         AnimGraphNode_BlendSpaceEvaluator;                 // 0x164A8(0x78)(None)
	struct FAnimNode_MakeDynamicAdditive         AnimGraphNode_MakeDynamicAdditive;                 // 0x16520(0x38)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_9;                       // 0x16558(0x120)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_6;                              // 0x16678(0x48)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_8;                       // 0x166C0(0x120)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6;                    // 0x167E0(0x48)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_16;                      // 0x16828(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_4;                      // 0x16848(0xC8)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_5;                              // 0x16910(0x48)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_4;                              // 0x16958(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_9;                    // 0x169A0(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_8;                    // 0x16A20(0x80)(None)
	struct FAnimNode_Inertialization             AnimGraphNode_Inertialization;                     // 0x16AA0(0x110)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_19;                 // 0x16BB0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_18;                 // 0x16BD8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_17;                 // 0x16C00(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_16;                 // 0x16C28(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_15;                 // 0x16C50(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_14;                 // 0x16C78(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_13;                 // 0x16CA0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_12;                 // 0x16CC8(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5;                    // 0x16CF0(0x48)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_7;                       // 0x16D38(0x120)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_15;                      // 0x16E58(0x20)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4;                    // 0x16E78(0x48)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_6;                       // 0x16EC0(0x120)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_14;                      // 0x16FE0(0x20)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_11;                 // 0x17000(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_10;                 // 0x17028(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9;                  // 0x17050(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8;                  // 0x17078(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_11;                    // 0x170A0(0x28)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_12;                // 0x170C8(0x40)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_11;                // 0x17108(0x40)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_4;                   // 0x17148(0x48)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_10;                // 0x17190(0x40)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_3;                   // 0x171D0(0x48)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_9;                 // 0x17218(0x40)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_1;                     // 0x17258(0x50)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_8;                 // 0x172A8(0x40)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_7;                 // 0x172E8(0x40)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_2;                  // 0x17328(0xF0)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_5;                       // 0x17418(0x120)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_13;                      // 0x17538(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_10;                    // 0x17558(0x28)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_6;                 // 0x17580(0x40)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_5;                 // 0x175C0(0x40)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_2;                   // 0x17600(0x48)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_4;                 // 0x17648(0x40)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_1;                   // 0x17688(0x48)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_3;                 // 0x176D0(0x40)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend;                       // 0x17710(0x50)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_2;                 // 0x17760(0x40)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_1;                 // 0x177A0(0x40)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_1;                  // 0x177E0(0xF0)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_4;                       // 0x178D0(0x120)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_12;                      // 0x179F0(0x20)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_3;                       // 0x17A10(0x120)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_9;                     // 0x17B30(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_11;                      // 0x17B58(0x20)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_2;                       // 0x17B78(0x120)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_8;                     // 0x17C98(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_10;                      // 0x17CC0(0x20)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7;                  // 0x17CE0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6;                  // 0x17D08(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_7;                     // 0x17D30(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_9;                       // 0x17D58(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_3;                      // 0x17D78(0xC8)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_8;                       // 0x17E40(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_6;                     // 0x17E60(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_7;                       // 0x17E88(0x20)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator;                   // 0x17EA8(0x40)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve_1;                       // 0x17EE8(0x120)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_3;                              // 0x18008(0x48)(None)
	struct FAnimNode_ModifyCurve                 AnimGraphNode_ModifyCurve;                         // 0x18050(0x120)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_6;                       // 0x18170(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_2;                      // 0x18190(0xC8)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_7;                    // 0x18258(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_6;                    // 0x182D8(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_5;                    // 0x18358(0x80)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_4;                    // 0x183D8(0x80)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_2;                              // 0x18458(0x48)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_1;                              // 0x184A0(0x20)(None)
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_8;                   // 0x184C0(0xC8)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend;                    // 0x18588(0xF0)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_1;                              // 0x18678(0x48)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_LinkedInputPose;                     // 0x186C0(0xB8)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0x18778(0x20)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_3;                    // 0x18798(0x80)(None)
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_7;                   // 0x18818(0xC8)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum;                     // 0x188E0(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5;                  // 0x18928(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4;                  // 0x18950(0x28)(None)
	struct FAnimNode_PoseSnapshot                AnimGraphNode_PoseSnapshot;                        // 0x18978(0x90)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_5;                       // 0x18A08(0x20)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3;                    // 0x18A28(0x48)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4;                       // 0x18A70(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_1;                      // 0x18A90(0xC8)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot;                                // 0x18B58(0x48)(None)
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_6;                   // 0x18BA0(0xC8)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_3;                        // 0x18C68(0x128)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_2;                        // 0x18D90(0x128)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_1;                        // 0x18EB8(0x128)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone;                          // 0x18FE0(0x128)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_5;                     // 0x19108(0x28)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0x19130(0x20)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend;                         // 0x19150(0xC8)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x19218(0x20)(None)
	struct FAnimNode_CopyBone                    AnimGraphNode_CopyBone;                            // 0x19238(0xF0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_4;                     // 0x19328(0x28)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_2;                    // 0x19350(0x80)(None)
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_5;                   // 0x193D0(0xC8)(None)
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_4;                   // 0x19498(0xC8)(None)
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_3;                   // 0x19560(0xC8)(None)
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_2;                   // 0x19628(0xC8)(None)
	struct FAnimNode_ApplyMeshSpaceAdditive      AnimGraphNode_ApplyMeshSpaceAdditive;              // 0x196F0(0xD0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_3;                     // 0x197C0(0x28)(None)
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer_1;                   // 0x197E8(0xC8)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_2;                     // 0x198B0(0x28)(None)
	struct FAnimNode_LinkedAnimLayer             AnimGraphNode_LinkedAnimLayer;                     // 0x198D8(0xC8)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3;                  // 0x199A0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2;                  // 0x199C8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1;                  // 0x199F0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult;                    // 0x19A18(0x28)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_2;                    // 0x19A40(0x48)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3;                       // 0x19A88(0x20)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1;                    // 0x19AA8(0x48)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2;                       // 0x19AF0(0x20)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer;                      // 0x19B10(0x48)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1;                       // 0x19B58(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_1;                     // 0x19B78(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult;                         // 0x19BA0(0x20)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine;                        // 0x19BC0(0xC8)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_1;                    // 0x19C88(0x80)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0x19D08(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x19D28(0x20)(None)
	uint8                                        Pad_8BF5[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_Fabrik                      AnimGraphNode_Fabrik;                              // 0x19D50(0x1F0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose;                       // 0x19F40(0x28)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool;                     // 0x19F68(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose;                      // 0x19FB0(0x80)(None)
	class UAnimSequence*                         K2Node_PropertyAccess_76;                          // 0x1A030(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         K2Node_PropertyAccess_75;                          // 0x1A038(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         K2Node_PropertyAccess_74;                          // 0x1A040(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         K2Node_PropertyAccess_73;                          // 0x1A048(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         K2Node_PropertyAccess_72;                          // 0x1A050(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         K2Node_PropertyAccess_71;                          // 0x1A058(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UAnimSequence*                         K2Node_PropertyAccess_70;                          // 0x1A060(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	enum class ERALS_Stance                      K2Node_PropertyAccess_69;                          // 0x1A068(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALS_Gait                        K2Node_PropertyAccess_68;                          // 0x1A069(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALS_MovementAction              K2Node_PropertyAccess_67;                          // 0x1A06A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_66;                          // 0x1A06B(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8BF9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       K2Node_PropertyAccess_65;                          // 0x1A070(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              K2Node_PropertyAccess_64;                          // 0x1A078(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class EAlertnessLevelType               K2Node_PropertyAccess_63;                          // 0x1A090(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EAlertnessLevelType               K2Node_PropertyAccess_62;                          // 0x1A091(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_61;                          // 0x1A092(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_PropertyAccess_60;                          // 0x1A093(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8BFB[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            K2Node_PropertyAccess_59;                          // 0x1A0A0(0x60)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            K2Node_PropertyAccess_58;                          // 0x1A100(0x60)(IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              K2Node_PropertyAccess_57;                          // 0x1A160(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	struct FVector                               K2Node_PropertyAccess_56;                          // 0x1A178(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        K2Node_PropertyAccess_55;                          // 0x1A190(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EAlertnessLevelType               K2Node_PropertyAccess_54;                          // 0x1A194(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_PropertyAccess_53;                          // 0x1A195(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALS_RotationMode                K2Node_PropertyAccess_52;                          // 0x1A196(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_PropertyAccess_51;                          // 0x1A197(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALS_RotationMode                K2Node_PropertyAccess_50;                          // 0x1A198(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALS_RotationMode                K2Node_PropertyAccess_49;                          // 0x1A199(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_48;                          // 0x1A19A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_47;                          // 0x1A19B(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_46;                          // 0x1A19C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_45;                          // 0x1A19D(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_44;                          // 0x1A19E(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_43;                          // 0x1A19F(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_42;                          // 0x1A1A0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_41;                          // 0x1A1A1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_40;                          // 0x1A1A2(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_39;                          // 0x1A1A3(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_38;                          // 0x1A1A4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_37;                          // 0x1A1A5(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_36;                          // 0x1A1A6(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_35;                          // 0x1A1A7(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_34;                          // 0x1A1A8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_33;                          // 0x1A1A9(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALS_RotationMode                K2Node_PropertyAccess_32;                          // 0x1A1AA(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALS_RotationMode                K2Node_PropertyAccess_31;                          // 0x1A1AB(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALS_RotationMode                K2Node_PropertyAccess_30;                          // 0x1A1AC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8BFF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              K2Node_PropertyAccess_29;                          // 0x1A1B0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	double                                       K2Node_PropertyAccess_28;                          // 0x1A1C8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_PropertyAccess_27;                          // 0x1A1D0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        K2Node_PropertyAccess_26;                          // 0x1A1D8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        K2Node_PropertyAccess_25;                          // 0x1A1DC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              K2Node_PropertyAccess_24;                          // 0x1A1E0(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ERALS_RotationMode                K2Node_PropertyAccess_23;                          // 0x1A1F8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALS_RotationMode                K2Node_PropertyAccess_22;                          // 0x1A1F9(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_4;                           // 0x1A1FA(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_3;                           // 0x1A1FB(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_2;                           // 0x1A1FC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                K2Node_PropertyAccess_1;                           // 0x1A1FD(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EAlertnessLevelType               K2Node_PropertyAccess;                             // 0x1A1FE(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C01[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               RelativeVelocityDirection;                         // 0x1A200(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         RALS_IsMoving;                                     // 0x1A218(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C02[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       RALS_Speed;                                        // 0x1A220(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MovementInputAmount;                               // 0x1A228(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALS_GroundedEntryState          GroundedEntryState;                                // 0x1A230(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALS_MovementDirection           MovementDirection;                                 // 0x1A231(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALS_HipsDirection               TrackedHipsDirection;                              // 0x1A232(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C03[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               RelativeAccelerationAmount;                        // 0x1A238(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ShouldMove;                                        // 0x1A250(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Rotate_L;                                          // 0x1A251(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Rotate_R;                                          // 0x1A252(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Pivot;                                             // 0x1A253(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C04[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       RotateRate;                                        // 0x1A258(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RotationScale;                                     // 0x1A260(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       DiagonalScaleAmount;                               // 0x1A268(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       WalkRunBlend;                                      // 0x1A270(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       StandingPlayRate;                                  // 0x1A278(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CrouchingPlayRate;                                 // 0x1A280(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       StrideBlend;                                       // 0x1A288(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRALS_VelocityBlend                   VelocityBlend;                                     // 0x1A290(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRALS_LeanAmount                      LeanAmount;                                        // 0x1A2A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                           DiagonalScaleAmountCurve;                          // 0x1A2A8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                           StrideBlend_N_Walk;                                // 0x1A2B0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                           StrideBlend_N_Run;                                 // 0x1A2B8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                           StrideBlend_C_Walk;                                // 0x1A2C0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              SmoothedAimingRotation;                            // 0x1A2C8(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                              SpineRotation;                                     // 0x1A2E0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector2D                             AimingAngle;                                       // 0x1A2F8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                             SmoothedAimingAngle;                               // 0x1A308(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AimSweepTime;                                      // 0x1A318(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ZoomAmount;                                        // 0x1A320(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Jumped;                                            // 0x1A328(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C06[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       JumpPlayRate;                                      // 0x1A330(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       FallSpeed;                                         // 0x1A338(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       LandPrediction;                                    // 0x1A340(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                           LandPredictionCurve;                               // 0x1A348(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveFloat*                           LeanInAirCurve;                                    // 0x1A350(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                        OverlayOverrideState;                              // 0x1A358(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C08[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Enable_AimOffset;                                  // 0x1A360(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       FootLock_L_Alpha;                                  // 0x1A368(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       FootLock_R_Alpha;                                  // 0x1A370(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               FootLock_L_Location;                               // 0x1A378(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               FootLock_R_Location;                               // 0x1A390(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              FootLock_L_Rotation;                               // 0x1A3A8(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                              FootLock_R_Rotation;                               // 0x1A3C0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                               FootOffset_L_Location;                             // 0x1A3D8(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               FootOffset_R_Location;                             // 0x1A3F0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              FootOffset_L_Rotation;                             // 0x1A408(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                              FootOffset_R_Rotation;                             // 0x1A420(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	double                                       DeltaTimeX;                                        // 0x1A438(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       TurnCheckMinAngle;                                 // 0x1A440(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Turn180Threshold;                                  // 0x1A448(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AimYawRateLimit;                                   // 0x1A450(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ElapsedDelayTime;                                  // 0x1A458(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALSMovementState                PrevMovementState;                                 // 0x1A460(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALS_MovementAction              MovementAction;                                    // 0x1A461(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALS_Gait                        Gait;                                              // 0x1A462(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ERALS_Stance                      Stance;                                            // 0x1A463(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C09[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       BasePose_N;                                        // 0x1A468(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       BasePose_CLF;                                      // 0x1A470(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Arm_L;                                             // 0x1A478(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Arm_L_Add;                                         // 0x1A480(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Arm_L_LS;                                          // 0x1A488(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Arm_L_MS;                                          // 0x1A490(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Arm_R;                                             // 0x1A498(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Arm_R_Add;                                         // 0x1A4A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Arm_R_LS;                                          // 0x1A4A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Arm_R_MS;                                          // 0x1A4B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Hand_l;                                            // 0x1A4B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Hand_r;                                            // 0x1A4C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Legs;                                              // 0x1A4C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Legs_Add;                                          // 0x1A4D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Pelvis;                                            // 0x1A4D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Pelvis_Add;                                        // 0x1A4E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Spine;                                             // 0x1A4E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Spine_Add;                                         // 0x1A4F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Head;                                              // 0x1A4F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Head_Add;                                          // 0x1A500(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCurveVector*                          YawOffset_FB;                                      // 0x1A508(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UCurveVector*                          YawOffset_LR;                                      // 0x1A510(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       FYaw;                                              // 0x1A518(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       BYaw;                                              // 0x1A520(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       LYaw;                                              // 0x1A528(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RYaw;                                              // 0x1A530(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       InputYawOffsetTime;                                // 0x1A538(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ForwardYawTime;                                    // 0x1A540(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       LeftYawTime;                                       // 0x1A548(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RightYawTime;                                      // 0x1A550(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MinAngleDelay;                                     // 0x1A558(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MaxAngleDelay;                                     // 0x1A560(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RotateMinThreshold;                                // 0x1A568(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RotateMaxThreshold;                                // 0x1A570(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRALS_TurnInPlace_Asset               N_TurnIP_L90;                                      // 0x1A578(0x19)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C10[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRALS_TurnInPlace_Asset               N_TurnIP_R90;                                      // 0x1A598(0x19)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C11[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRALS_TurnInPlace_Asset               N_TurnIP_L180;                                     // 0x1A5B8(0x19)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C21[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRALS_TurnInPlace_Asset               N_TurnIP_R180;                                     // 0x1A5D8(0x19)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C22[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       AimYawRateMinRange;                                // 0x1A5F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AimYawRateMaxRange;                                // 0x1A600(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MinRotatePlayRate_;                                // 0x1A608(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MaxRotatePlayRate_;                                // 0x1A610(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRALS_TurnInPlace_Asset               CLF_TurnIP_L90;                                    // 0x1A618(0x19)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C23[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRALS_TurnInPlace_Asset               CLF_TurnIP_R90;                                    // 0x1A638(0x19)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C24[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRALS_TurnInPlace_Asset               CLF_TurnIP_L180;                                   // 0x1A658(0x19)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C25[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRALS_TurnInPlace_Asset               CLF_TurnIP_R180;                                   // 0x1A678(0x19)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C26[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       FlailRate;                                         // 0x1A698(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Enable_HandIK_L;                                   // 0x1A6A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Enable_HandIK_R;                                   // 0x1A6A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AnimatedSprintSpeed;                               // 0x1A6B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AnimatedCrouchSpeed;                               // 0x1A6B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       VelocityBlendInterpSpeed;                          // 0x1A6C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       GroundedLeanInterpSpeed;                           // 0x1A6C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       InAirLeanInterpSpeed;                              // 0x1A6D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SmoothedAimingRotationInterpSpeed;                 // 0x1A6D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       InputYawOffsetInterpSpeed;                         // 0x1A6E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       TriggerPivotSpeedLimit;                            // 0x1A6E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       IK_TraceDistanceAboveFoot;                         // 0x1A6F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       IK_TraceDistanceBelowFoot;                         // 0x1A6F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              CharacterRotation;                                 // 0x1A700(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class ABP_AnimCharacter_C*                   AnimCharacter;                                     // 0x1A718(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         HasVirtualBone_;                                   // 0x1A720(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C29[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UOverlay_AnimB_Base_C>   LastRequestedOverlayBank;                          // 0x1A728(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UOverlay_AnimB_Base_C*                 OverlayAnimBank_A;                                 // 0x1A750(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UOverlay_AnimB_Base_C*                 OverlayAnimBank_B;                                 // 0x1A758(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	enum class EABDesignationType                ActiveOverlayAnimBank;                             // 0x1A760(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C2C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UOverlay_AnimB_Base_C*                 ActiveOverlayBank;                                 // 0x1A768(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimB_Base_C*                         ActiveLocomotionBank;                              // 0x1A770(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         HasOverlayJumpAnimation;                           // 0x1A778(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HasOverlayDescendingAnimation;                     // 0x1A779(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HasOverlayAscendingAnimation;                      // 0x1A77A(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HasBaseStopAnims;                                  // 0x1A77B(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C2D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimB_Base_C*                         BaseLocoBank_A;                                    // 0x1A780(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimB_Base_C*                         BaseLocoBank_B;                                    // 0x1A788(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	enum class EABDesignationType                ActiveBaseLocoBank;                                // 0x1A790(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C2E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OverlayBankChanged;                                // 0x1A798(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            BaseLocomotionBankChanged;                         // 0x1A7A8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	enum class EFootStanceType                   FromStance;                                        // 0x1A7B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EFootStanceType                   ToStance;                                          // 0x1A7B9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsChangingStance;                                  // 0x1A7BA(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsTraversalActive_;                                // 0x1A7BB(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HasExitedClimbing;                                 // 0x1A7BC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ClimbStepInProgress;                               // 0x1A7BD(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ClimbStepActivated;                                // 0x1A7BE(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsInMountingAnimation;                             // 0x1A7BF(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ToClimbDirection;                                  // 0x1A7C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       FromClimbDirection;                                // 0x1A7C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ClimbStepDistance;                                 // 0x1A7D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ClimbIdleDirection;                                // 0x1A7D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         A_HasOverlayArmsRunAnim;                           // 0x1A7E0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         A_HasOverlayArmsSprintAnim;                        // 0x1A7E1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         A_HasOverlaySweepAnim;                             // 0x1A7E2(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         A_HasOverlaySweepCrouchingAnim;                    // 0x1A7E3(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         B_HasOverlayArmsRunAnim;                           // 0x1A7E4(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         B_HasOverlayArmsSprintAnim;                        // 0x1A7E5(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         B_HasOverlaySweepAnim;                             // 0x1A7E6(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         B_HasOverlaySweepCrouchingAnim;                    // 0x1A7E7(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Gait_Weight;                                       // 0x1A7E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsDowned_;                                         // 0x1A7F0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         EnableInventoryMode;                               // 0x1A7F1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C32[0xE];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItemDataReference                    UnarmedItemReference;                              // 0x1A800(0x80)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	float                                        RelativeMoveAngle;                                 // 0x1A880(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        InterpRelativeMoveAngle;                           // 0x1A884(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               GlideRotationPivotOffset;                          // 0x1A888(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       GlideDelayedPitchValue;                            // 0x1A8A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       GlideDelayedRollValue;                             // 0x1A8A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFloatSpringState                     GlidePitchSpringState;                             // 0x1A8B0(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FFloatSpringState                     GlideRollSpringState;                              // 0x1A8BC(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	double                                       GlideFreefallScalar;                               // 0x1A8C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       GlidingLandPoseWeight;                             // 0x1A8D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C34[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FQuat                                 GlideSwingQuat;                                    // 0x1A8E0(0x20)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FQuaternionSpringState                GlideSwingQuatSpringState;                         // 0x1A900(0x40)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FVector                               GlideSwingLazyVelocity;                            // 0x1A940(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       GlideSwingLength;                                  // 0x1A958(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            PropOverrideTransform_L;                           // 0x1A960(0x60)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            PropOverrideTransform_R;                           // 0x1A9C0(0x60)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            PropHandOverrideTransform_L;                       // 0x1AA20(0x60)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            PropHandOverrideTransform_R;                       // 0x1AA80(0x60)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTransform                            Sweep_RProp_Transform;                             // 0x1AAE0(0x60)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Overlay_Hand_L_Rel_Alpha;                          // 0x1AB40(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Overlay_Hand_R_Rel_Alpha;                          // 0x1AB44(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C36[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            Sweep_LProp_Transform;                             // 0x1AB50(0x60)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        OverlayAimNegationScalar;                          // 0x1ABB0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        OverrideWeight;                                    // 0x1ABB4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         A_HasOverlayMantle100Anim;                         // 0x1ABB8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         A_HasOverlayMantle200Anim;                         // 0x1ABB9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         B_HasOverlayMantle100Anim;                         // 0x1ABBA(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         B_HasOverlayMantle200Anim;                         // 0x1ABBB(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         OffhandEquipped;                                   // 0x1ABBC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         OffhandHidden;                                     // 0x1ABBD(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C37[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UOverlay_AnimB_Base_C>   LastRequestedOffhandOverlayBank;                   // 0x1ABC0(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	class UOverlay_AnimB_Base_C*                 OffhandOverlayAnimBank;                            // 0x1ABE8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         IsInThirdPerson;                                   // 0x1ABF0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bIsDead;                                           // 0x1ABF1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bIsRespawning;                                     // 0x1ABF2(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EBodyType                         BodyType;                                          // 0x1ABF3(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         OffhandIsUnarmed;                                  // 0x1ABF4(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EAlertnessLevelType               OverrideAlertness;                                 // 0x1ABF5(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         OverrideAlertnessActive;                           // 0x1ABF6(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8C3A[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UOverlay_AnimB_Base_C*                 QueuedOverlayBank;                                 // 0x1ABF8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          QuededOverlayTimer;                                // 0x1AC00(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         OffhandHasArmsRunAnim;                             // 0x1AC08(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         BypassOffhandOverlay;                              // 0x1AC09(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UABP_HMU_TP_Player_C* GetDefaultObj();

	void OffhandLayer(const struct FPoseLink& PreOffhand, struct FPoseLink* OffhandLayer);
	void BodyMorph(const struct FPoseLink& InPose_0, struct FPoseLink* BodyMorph);
	void EyeMorph(const struct FPoseLink& Pose, struct FPoseLink* EyeMorph);
	void AimOffsetBehaviors(struct FPoseLink* AimOffsetBehaviors);
	void Foot_IK(const struct FPoseLink& InPose, struct FPoseLink* Foot_IK);
	void _CLF__CycleBlending(const struct FPoseLink& F, const struct FPoseLink& B, const struct FPoseLink& LF, const struct FPoseLink& LB, const struct FPoseLink& RF, const struct FPoseLink& RB, struct FPoseLink* _CLF__CycleBlending);
