#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x8C8 (0x968 - 0xA0)
// BlueprintGeneratedClass BP_CharacterCustomization_Component.BP_CharacterCustomization_Component_C
class UBP_CharacterCustomization_Component_C : public UCharacterCustomizationComponent
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xA0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class USkeletalMeshComponent*                TP_Clothes__Torso_;                                // 0xA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                TP_Clothes__Head_;                                 // 0xB0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                TP_Clothes__Bottom_;                               // 0xB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                TP_Clothes__Gloves_;                               // 0xC0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                TP_Clothes__Boots_;                                // 0xC8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                TP_Head__Hair_;                                    // 0xD0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                TP_Head__Facial_Hair_;                             // 0xD8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                TP_Clothes__Gear_;                                 // 0xE0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                SK_Body;                                           // 0xE8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                FP_Fullbody_Clothes__Torso_;                       // 0xF0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                FP_Fullbody_Clothes__Bottom_;                      // 0xF8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                FP_Fullbody_Clothes__Gloves_;                      // 0x100(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                FP_Fullbody_Clothes__Boots_;                       // 0x108(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                FP_Fullbody_Clothes__Gear_;                        // 0x110(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                FP_FullbodyMesh;                                   // 0x118(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                   DefaultAppearance;                                 // 0x120(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FDataTableRowHandle                   ExistingAppearance;                                // 0x130(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<class UBP_CollectedVisualMeshData_C*> DefaultCollectedVisualMeshes;                      // 0x140(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         bHasReceivedEquippedVisualMeshes;                  // 0x150(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_87E4[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FEquippedVisualMesh>           EquippedVisualMeshes;                              // 0x158(0x10)(Edit, BlueprintVisible, Net, DisableEditOnInstance, RepNotify)
	class AActor*                                OwningActor;                                       // 0x168(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AController*                           OwnerController;                                   // 0x170(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         bHasBegunPlay;                                     // 0x178(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bHasReceivedDefaultAppearance;                     // 0x179(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EBodyType                         BodyType;                                          // 0x17A(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_87E7[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSet<enum class E_EquipSlotType>             RequiredTPSlots;                                   // 0x180(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSet<enum class E_EquipSlotType>             RequiredFPSlots;                                   // 0x1D0(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSet<enum class E_EquipSlotType>             TotallyHiddenTPSlots;                              // 0x220(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSet<enum class E_EquipSlotType>             TotallyHiddenFPArmsSlots;                          // 0x270(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UBP_CollectedVisualMeshData_C*> EquippedCollectedVisualMeshes;                     // 0x2C0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USkeletalMeshComponent*                FP_Arms;                                           // 0x2D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                FP_Arms_Clothes__Torso_;                           // 0x2D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                FP_Arms_Clothes__Gloves_;                          // 0x2E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class USkeletalMeshComponent*                FP_Arms_Clothes__Gear_;                            // 0x2E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	class UBP_AsyncAssetLoader_C*                AsyncLoader;                                       // 0x2F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<enum class E_EquipSlotType, struct FItemData_RegionHiding> RegionHidingBySlotTP;                              // 0x2F8(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<enum class E_EquipSlotType, struct FItemData_RegionHiding> RegionHidingBySlotFPArms;                          // 0x348(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         bNeedsUpdate;                                      // 0x398(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_87EA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       InitialLoadStartTimeout;                           // 0x3A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       LoadTimeout;                                       // 0x3A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MaxLoadTimeoutDelay;                               // 0x3B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       LoadTimeoutDelay;                                  // 0x3B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          LoadTimeoutTimer;                                  // 0x3C0(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          InitialLoadStartTimeoutTimer;                      // 0x3C8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         bHasWarnedAboutDelay;                              // 0x3D0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bHasStartedInitialLoad;                            // 0x3D1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_LoadingState                    CurrentLoadingState;                               // 0x3D2(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bHasDoneFirstUpdate;                               // 0x3D3(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_87ED[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSet<enum class E_EquipSlotType>             ValidThirdPersonSlots;                             // 0x3D8(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TSet<enum class E_EquipSlotType>             ValidFirstPersonBodyMeshSlots;                     // 0x428(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TSet<enum class E_EquipSlotType>             ValidFirstPersonArmsMeshSlots;                     // 0x478(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	TSet<class FName>                            IgnoredMaterialSlotNames;                          // 0x4C8(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance)
	struct FDataTableRowHandle                   SkinColorValue;                                    // 0x518(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBP_CharacterAppearanceComponent_C*    AppearanceComponent;                               // 0x528(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, double>                    DefaultBodyMorphTargets;                           // 0x530(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UTexture2D>             AMMRMask;                                          // 0x580(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>             NHMask;                                            // 0x5A8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	class USkeletalMeshComponent*                TP_Clothes__Back_;                                 // 0x5D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>             FaceSwatch;                                        // 0x5D8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>             HandSwatch;                                        // 0x600(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	struct FEyeAppearance                        LeftEyeData;                                       // 0x628(0x78)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FEyeAppearance                        RightEyeData;                                      // 0x6A0(0x78)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FTeethAppearance                      TeethData;                                         // 0x718(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	uint8                                        Pad_87F2[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            AMMRMask_Loaded;                                   // 0x728(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UTexture2D*                            NHMask_Loaded;                                     // 0x730(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UTexture2D*                            FaceSwatch_Loaded;                                 // 0x738(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UTexture2D*                            HandSwatch_Loaded;                                 // 0x740(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	TArray<struct FAppearanceMorphTarget>        AppliedBodyMorphTargets;                           // 0x748(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                               EyeOffset;                                         // 0x758(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAppearanceAncestorData>       AncestorData;                                      // 0x770(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                       AgeValue;                                          // 0x780(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bEnableProximityHiding;                            // 0x788(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bHasHat;                                           // 0x789(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EHatType                          CurrentHatType;                                    // 0x78A(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_87F8[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FEyeLashAppearance                    LeftEyeLashData;                                   // 0x790(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	struct FEyeLashAppearance                    RightEyeLashData;                                  // 0x7E0(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                         bProximityOutOfRange;                              // 0x830(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_87FA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class EHairAssetType, struct FHairData> CurrentHairDatum;                                  // 0x838(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<enum class EHairAssetType, struct FLinearColor> CurrentHairColorDatum;                             // 0x888(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	class USkeletalMeshComponent*                TP_Head__Eyebrows_;                                // 0x8D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TMap<enum class EHairAssetType, struct FLinearColor> CurrentHairSecondaryColorDatum;                    // 0x8E0(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	double                                       CurrentEyeScale;                                   // 0x930(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>             BaseColor;                                         // 0x938(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	class UTexture2D*                            BaseColor_Loaded;                                  // 0x960(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UBP_CharacterCustomization_Component_C* GetDefaultObj();

	void GetClothes_Back(class USkeletalMeshComponent** BackComponent);
	void GetClothes_Jewelry(class USkeletalMeshComponent** JewelryComponent);
	void GetClothes_Glasses(class USkeletalMeshComponent** GlassesComponent);
	void GetBodyPart_Teeth(class USkeletalMeshComponent** TeethComponent);
	void GetBodyPart_Eyebrows(class USkeletalMeshComponent** EyebrowsComponent);
	void GetBodyPart_FacialHair(class USkeletalMeshComponent** FacialHairComponent);
	void GetClothes_Torso(class USkeletalMeshComponent** TorsoComponent);
	void GetClothes_Bottom(class USkeletalMeshComponent** PantsComponent);
	void GetClothes_Boots(class USkeletalMeshComponent** ShoesComponent);
