#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xB8 (0x1B0 - 0xF8)
// BlueprintGeneratedClass BP_HUDGoalTrackingComponent.BP_HUDGoalTrackingComponent_C
class UBP_HUDGoalTrackingComponent_C : public UPersistentDataComponent
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xF8(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	TMap<class FName, struct FS_UI_HUD_GoalTrackGroup> QuestTracks;                                       // 0x100(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<struct FS_UI_HUD_GoalTrackGroup>      StructureTracks;                                   // 0x150(0x10)(Edit, BlueprintVisible, Net, DisableEditOnInstance, SaveGame, RepNotify, ContainsInstancedReference)
	int32                                        MaxStructureTrackCount;                            // 0x160(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_42CB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FS_UI_HUD_GoalTrackGroup>      RecipeTracks;                                      // 0x168(0x10)(Edit, BlueprintVisible, Net, DisableEditOnInstance, SaveGame, RepNotify, ContainsInstancedReference)
	int32                                        MaxRecipeTrackCount;                               // 0x178(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_42CE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            QuestTracksUpdated;                                // 0x180(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            StructureTracksUpdated;                            // 0x190(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            RecipeTracksUpdated;                               // 0x1A0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

	static class UClass* StaticClass();
	static class UBP_HUDGoalTrackingComponent_C* GetDefaultObj();

	void IsCardNotificationQueueEmpty(bool* bIsEmpty);
	void IsEntityPinned(class FName ID, bool* IsPinned, bool CallFunc_IsStructureTracked_bIsTracked, int32 CallFunc_IsStructureTracked_TrackGroupIndex, bool CallFunc_IsRecipeTracked_bIsTracked, int32 CallFunc_IsRecipeTracked_TrackGroupIndex, bool CallFunc_Map_Contains_ReturnValue);
	void GetTrackedStructureCounts(int32* CurrentTrackedQty, int32* MaxTrackedQty, int32 CallFunc_Array_Length_ReturnValue);
	void GetTrackedRecipeCounts(int32* CurrentTrackedQty, int32* MaxTrackedQty, int32 CallFunc_Array_Length_ReturnValue);
	void GetStructureTracks(TArray<struct FS_UI_HUD_GoalTrackGroup>* StructureTracks);
