#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1A0 (0x5A8 - 0x408)
// BlueprintGeneratedClass BP_ResourceNode_IIM.BP_ResourceNode_IIM_C
class ABP_ResourceNode_IIM_C : public ABP_ResourceNodeIIMBase_C
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x408(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UBP_InteractableComponent_C*           BP_InteractableComponent;                          // 0x410(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_FloatyTextComponent_C*             BP_FloatyTextComponent;                            // 0x418(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UInstancedResourceNodeComponent*       IIMComponent;                                      // 0x420(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                   Billboard;                                         // 0x428(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TMap<class FName, class FName>               GameplayResourceToGrantedItem;                     // 0x430(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<int32, double>                          RecentIndexes;                                     // 0x480(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         PreventResourceSpawning;                           // 0x4D0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_864B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       MaxRecentDuration;                                 // 0x4D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<int32, int32>                           InstancesCutDownTurn;                              // 0x4E0(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_SimulationStateManager_C*          SimStateManager;                                   // 0x530(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                        ResourceRegrowTime;                                // 0x538(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8653[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            InstanceRegrown;                                   // 0x540(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            SpawnedResource;                                   // 0x550(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	enum class E_UI_FloatyType                   FloatyType_Current;                                // 0x560(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DrawAudioDebugSpheres;                             // 0x561(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_8656[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            InstanceStateChanged;                              // 0x568(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FName                                  CurrentClusterTheme;                               // 0x578(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                          LargeTag;                                          // 0x580(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                 SkipChaosTags;                                     // 0x588(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class ABP_ResourceNode_IIM_C* GetDefaultObj();

	void OnAllResourcesGranted(class AActor* Instigator, struct FIIMInstance& IIMInstance, class UBP_PerksComponent_C* InstigatorPerksComponent, class UBP_PerksComponent_C* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1);
	void GetResourceNodeInteractionInterface(TScriptInterface<class IBPI_ResourceInteraction_C>* ResourceInteraction, class UBP_InteractionObject_Harvest_C* CallFunc_GetDefaultObject_ReturnValue);
	class UObject* GetInteractable(struct FInteractionData& InteractionData);
	struct FTransform GetInteractableTransform(struct FInteractionData& InteractionData, const struct FIIMInstance& CallFunc_GetInstanceFromInteractionData_IIMInstance);
