#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x301 (0x8B1 - 0x5B0)
// BlueprintGeneratedClass BPTA_Placeable_Structure.BPTA_Placeable_Structure_C
class ABPTA_Placeable_Structure_C : public ABPTA_Placeable_C
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x5B0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UBillboardComponent*                   Billboard;                                         // 0x5B8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TSet<class UObject*>                         CurrentFeedbackConnections;                        // 0x5C0(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UStaticMeshComponent*                  BoxFeedback;                                       // 0x610(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOverlapResultWraper>          BlockingHits;                                      // 0x618(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class ABP_ClientResourceProxy_C*, struct FOverlapResultWraper> FoliageClientProxy;                                // 0x628(0x50)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance, ContainsInstancedReference)
	class UBillboardComponent*                   RotationFeedback;                                  // 0x678(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	TArray<class UBillboardComponent*>           SnapPointIcons;                                    // 0x680(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                        SnapPointIconCacheSize;                            // 0x690(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SnapPointOptionOffset;                             // 0x694(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        PreviousSnapPointOptionOffset;                     // 0x698(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2155[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FStructureAssetReference              PlaceableStructureRef;                             // 0x6A0(0x80)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	TSet<class UObject*>                         CachedTraitObjects;                                // 0x720(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class USplineComponent*, class USplineMeshComponent*> SplineToMeshesMap;                                 // 0x770(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class UObject*, class USplineComponent*> ObjectToSplineMap;                                 // 0x7C0(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class UObject*, class UWidgetComponent*> WidgetComponents;                                  // 0x810(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<struct FStructureTrait, class AActor*>  TraitToLastInflicter;                              // 0x860(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                         TraitFeedbackHidden;                               // 0x8B0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class ABPTA_Placeable_Structure_C* GetDefaultObj();

