#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x70 (0xB8 - 0x48)
// Class NWX.SkillDataAsset
class USkillDataAsset : public UUniquelyIdentifiableDataAsset
{
public:
	uint8                                        Pad_183[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSkillPresentationData                UIData;                                            // 0x50(0x58)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSkillReferenceContainer              SkillUnlockables;                                  // 0xA8(0x10)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class USkillDataAsset* GetDefaultObj();

};

// 0x130 (0x178 - 0x48)
// Class NWX.CraftingRecipeAsset
class UCraftingRecipeAsset : public UUniquelyIdentifiableDataAsset
{
public:
	uint8                                        Pad_186[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsUnlockable;                                     // 0x50(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_189[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCraftingRecipe                       Recipe;                                            // 0x58(0x120)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCraftingRecipeAsset* GetDefaultObj();

};

// 0x3F8 (0x440 - 0x48)
// Class NWX.StructureDataAsset
class UStructureDataAsset : public UUniquelyIdentifiableDataAsset
{
public:
	uint8                                        Pad_195[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsUnlockable;                                     // 0x50(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_196[0xF];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FStructureData                        Data;                                              // 0x60(0x3E0)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UStructureDataAsset* GetDefaultObj();

	bool IsSupported();
	struct FGuid GetUniqueStructureID();
	class FName GetAssetName();
};

// 0x88 (0xD0 - 0x48)
// Class NWX.EmoteDataAsset
class UEmoteDataAsset : public UUniquelyIdentifiableDataAsset
{
public:
	uint8                                        Pad_19A[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  DisplayName;                                       // 0x50(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x68(0x18)(Edit, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             Icon;                                              // 0x80(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>           AnimationMontage;                                  // 0xA8(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UEmoteDataAsset* GetDefaultObj();

};

// 0x40 (0xC0 - 0x80)
// Class NWX.AbilityTask_NWXWaitTargetData
class UAbilityTask_NWXWaitTargetData : public UAbilityTask
{
public:
	FMulticastInlineDelegateProperty_            ValidData;                                         // 0x80(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            Cancelled;                                         // 0x90(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class AGameplayAbilityTargetActor> TargetClass;                                       // 0xA0(0x8)(ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AGameplayAbilityTargetActor*           TargetActor;                                       // 0xA8(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1BF[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_NWXWaitTargetData* GetDefaultObj();

	void OnTargetDataReplicatedCancelledCallback();
	void OnTargetDataReplicatedCallback(struct FGameplayAbilityTargetDataHandle& Data, const struct FGameplayTag& ActivationTag);
	void OnTargetDataReadyCallback(struct FGameplayAbilityTargetDataHandle& Data);
	void OnTargetDataCancelledCallback(struct FGameplayAbilityTargetDataHandle& Data);
	class UAbilityTask_NWXWaitTargetData* NWXWaitTargetData(class UGameplayAbility* OwningAbility, class FName& TaskInstanceName, enum class ENWXGameplayTargetConfirmation ConfirmationType, TSubclassOf<class AGameplayAbilityTargetActor> Class);
	void FinishSpawningActor(class UGameplayAbility* OwningAbility, class AGameplayAbilityTargetActor* SpawnedActor);
	bool BeginSpawningActor(class UGameplayAbility* OwningAbility, TSubclassOf<class AGameplayAbilityTargetActor> Class, class AGameplayAbilityTargetActor** SpawnedActor);
};

// 0x30 (0xD8 - 0xA8)
// Class NWX.AbilityTask_WaitGameplayTagsAdded
class UAbilityTask_WaitGameplayTagsAdded : public UAbilityTask_WaitGameplayTag
{
public:
	FMulticastInlineDelegateProperty_            Added;                                             // 0xA8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1C2[0x20];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_WaitGameplayTagsAdded* GetDefaultObj();

	class UAbilityTask_WaitGameplayTagsAdded* WaitGameplayTagsAdd(class UGameplayAbility* OwningAbility, struct FGameplayTagContainer& Tags, class AActor* InOptionalExternalTarget, bool OnlyTriggerOnce);
};

// 0x30 (0xD8 - 0xA8)
// Class NWX.AbilityTask_WaitGameplayTagsRemoved
class UAbilityTask_WaitGameplayTagsRemoved : public UAbilityTask_WaitGameplayTag
{
public:
	FMulticastInlineDelegateProperty_            Removed;                                           // 0xA8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CC[0x20];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAbilityTask_WaitGameplayTagsRemoved* GetDefaultObj();

	class UAbilityTask_WaitGameplayTagsRemoved* WaitGameplayTagsRemove(class UGameplayAbility* OwningAbility, struct FGameplayTagContainer& Tags, class AActor* InOptionalExternalTarget, bool OnlyTriggerOnce);
};

// 0x0 (0x28 - 0x28)
// Class NWX.AbstractPlayerStartStrategy
class UAbstractPlayerStartStrategy : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAbstractPlayerStartStrategy* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.AccumulationAccessInterface
class IAccumulationAccessInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAccumulationAccessInterface* GetDefaultObj();

	bool TryUpdateAccumulationInstance(struct FAccumulationHandle& Handle, float NewValue);
	bool TryGetHandleForAsset(TSoftObjectPtr<class UAccumulationDataAsset>& Asset, struct FAccumulationHandle* OutHandle);
	bool TryGetAllAccumulationHandles(TArray<struct FAccumulationHandle>* OutHandles);
	bool TryGetAccumulationInstanceValue(struct FAccumulationHandle& Handle, float* OutValue);
	bool TryGetAccumulationInstanceUIData(struct FAccumulationHandle& Handle, struct FAccumulationUIData* OutData);
	bool TryAddAccumulationInstance(TSoftObjectPtr<class UAccumulationDataAsset>& ReferenceAsset, struct FAccumulationHandle* OutHandle);
	void RegisterForAccumulationInstanceUpdated(FDelegateProperty_& Delegate);
	void RegisterForAccumulationInstanceCompleted(FDelegateProperty_& Delegate);
	void RegisterForAccumulationInstanceAdded(FDelegateProperty_& Delegate);
};

// 0x38 (0x68 - 0x30)
// Class NWX.AccumulationDataAsset
class UAccumulationDataAsset : public UDataAsset
{
public:
	struct FAccumulationUIData                   UIData;                                            // 0x30(0x38)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAccumulationDataAsset* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.ActionBindingBPFunctionLibrary
class UActionBindingBPFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UActionBindingBPFunctionLibrary* GetDefaultObj();

	void UpdateExistingActionBindingRow(class UDataTable* DataTable, class FName& RowName, struct FS_ActionKeyBinding& UserKeyBinding, struct FInputChord& SelectedKey);
	bool SaveActionKeyBindingMap(class UDataTable* DataTable, const class FString& SlotName, int32 UserIndex);
	void ResetActionBindingsToDefault(class UDataTable* DataTable, class UOptionsControls* OptionsControls);
	bool LoadActionKeyBindingMap(class UDataTable* DataTable, const class FString& SlotName, int32 UserIndex);
	bool Equals(struct FS_ActionKeyBinding& A, struct FS_ActionKeyBinding& B);
	void ApplyActionKeyBindings(class UDataTable* DataTable, const class FString& SlotName, int32 UserIndex, bool* bIsSuccess);
};

// 0x30 (0x60 - 0x30)
// Class NWX.ActivationVolumeDataAsset
class UActivationVolumeDataAsset : public UDataAsset
{
public:
	class URequirement*                          TriggerRequirements;                               // 0x30(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoClear, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanBeActivatedMultipleTimes;                      // 0x38(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseClientPredictedAVFX;                           // 0x39(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F3[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UVolumeAVFXDataAsset*                  LoopAVFX;                                          // 0x40(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVolumeAVFXDataAsset*                  TriggeredAVFX;                                     // 0x48(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVolumeAVFXDataAsset*                  ReturnToIdleAVFX;                                  // 0x50(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVolumeTelemetryDataAsset*             TriggeredTelemetry;                                // 0x58(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UActivationVolumeDataAsset* GetDefaultObj();

};

// 0x70 (0x310 - 0x2A0)
// Class NWX.ActivationVolume
class AActivationVolume : public AActor
{
public:
	uint8                                        Pad_1FB[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UActivationVolumeDataAsset*            DataAsset;                                         // 0x2B8(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x2C0(0x8)(ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBoxComponent*                         CollisionVolume;                                   // 0x2C8(0x8)(Edit, ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVolumeAVFXComponent*                  VolumeAVFX;                                        // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsDisabled;                                       // 0x2D8(0x1)(Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1FC[0x37];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AActivationVolume* GetDefaultObj();

	void RegisterToActivationEvent(FDelegateProperty_& Delegate);
	void OnOverlapEnd(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnOverlapBegin(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void Multicast_PlayTriggeredAVFX();
	void Multicast_PlayReturnToIdleAVFX();
	class UVolumeAVFXComponent* GetVolumeAVFXComponent();
	void DeregisterFromActivationEvent(FDelegateProperty_& Delegate);
};

// 0x50 (0x80 - 0x30)
// Class NWX.ActivityGameInstanceSubsystem
class UActivityGameInstanceSubsystem : public UGameInstanceSubsystem
{
public:
	FMulticastInlineDelegateProperty_            OnActivityRequestedEvent;                          // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1FE[0x40];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UActivityGameInstanceSubsystem* GetDefaultObj();

	void TerminateAllActivityTasks();
	void StartLocalActivity(enum class EActivityTask& ETask);
	void ResumeActivity(enum class EActivityTask& ETask, bool bSuccess);
	void ResetIsActivityRequested();
	bool GetIsActivityRequested();
	void EndLocalActivity(enum class EActivityTask& ETask, bool bSuccess);
};

// 0x128 (0x1C8 - 0xA0)
// Class NWX.AddResourcesComponent
class UAddResourcesComponent : public UActorComponent
{
public:
	uint8                                        Pad_200[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnClientResourcesUpdated;                          // 0xA8(0x10)(ZeroConstructor, InstancedReference, NativeAccessSpecifierPublic)
	struct FStructureCompositeRequirementsTrackers RequirementsTrackers;                              // 0xB8(0x30)(Net, SaveGame, RepNotify, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FStructureCompositeRequirementsTrackers ClientRequirementsTrackers;                        // 0xE8(0x30)(ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TMap<int32, class UStructureResourcesManagerObject*> ResourcesManagers;                                 // 0x118(0x50)(Protected, NativeAccessSpecifierProtected)
	struct FStructureAddResourcesContext         LastAddedResourceContext;                          // 0x168(0x28)(NativeAccessSpecifierPrivate)
	struct FStructureRemoveResourcesContext      LastRemovedResourceContext;                        // 0x190(0x20)(NativeAccessSpecifierPrivate)
	bool                                         bIsPostConstructionComponent;                      // 0x1B0(0x1)(Net, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_201[0x17];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAddResourcesComponent* GetDefaultObj();

	void OnRep_RequirementsTracker();
	class UStructureResourcesManagerObject* GetResourcesManager(int32 TrackerId);
};

// 0x8 (0x30 - 0x28)
// Class NWX.AIActionBase
class UAIActionBase : public UObject
{
public:
	uint8                                        Pad_205[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIActionBase* GetDefaultObj();

	void SetDebugString(const class FString& String);
	bool Initialize();
	class APawn* GetOwnerPawn();
	class AAIController* GetOwnerAIController();
	class UAIActionComponent* GetOwner();
	bool CheckTargetRequirements(class AActor* Target);
	bool CheckStaticTargetRequirements(class AActor* Target);
	bool CheckOwnerRequirements();
};

// 0x38 (0x68 - 0x30)
// Class NWX.AIAction
class UAIAction : public UAIActionBase
{
public:
	TSubclassOf<class UAIActionCategory>         Category;                                          // 0x30(0x8)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBehaviorTree*                         BehaviorTree;                                      // 0x38(0x8)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bRestartBTreeOnTargetChange;                       // 0x40(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCancelIfRequirementsFail;                         // 0x41(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_20B[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSubclassOf<class UAIActionRequirement>> SharedRequirements;                                // 0x48(0x10)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	float                                        EvaluationDelay;                                   // 0x58(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ETicketType                       RequiredTicketType;                                // 0x5C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ETicketType                       AwaitedTicketType;                                 // 0x5D(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCancelImmediatelyOnTicketLost;                    // 0x5E(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bRegisterFlanker;                                  // 0x5F(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCanPause;                                         // 0x60(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_20C[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIAction* GetDefaultObj();

	void Stop(class AActor* Target);
	void Start(class AActor* Target);
	bool ShouldRestartBTreeOnTargetChange();
	bool ShouldRegisterFlanker();
	bool ShouldCancelImmediatelyOnTicketLost();
	bool ShouldCancelIfRequirementsFail();
	void OnTargetChanged(class AActor* OldTarget, class AActor* NewTarget);
	int32 GetTicketPriority(class AActor* Target);
	TArray<TSubclassOf<class UAIActionRequirement>> GetSharedRequirementClasses();
	float GetScore(class AActor* Target);
	float GetRunPriority(class AActor* Target);
	enum class ETicketType GetRequiredTicketType();
	float GetNormalizedScore(class AActor* Target);
	float GetNormalizedRunPriority(class AActor* Target);
	float GetEvaluationDelay();
	TSubclassOf<class UAIActionCategory> GetCategoryClass();
	class UAIActionCategory* GetCategory();
	class UBehaviorTree* GetBehaviorTree();
	enum class ETicketType GetAwaitedTicketType();
	bool CanPause();
};

// 0x28 (0x50 - 0x28)
// Class NWX.AIActionCategory
class UAIActionCategory : public UObject
{
public:
	float                                        MinimumScore;                                      // 0x28(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaximumScore;                                      // 0x2C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MinimumPriority;                                   // 0x30(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaximumPriority;                                   // 0x34(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        EvaluationDelay;                                   // 0x38(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_20D[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSubclassOf<class UAIActionRequirement>> SharedRequirements;                                // 0x40(0x10)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAIActionCategory* GetDefaultObj();

	TArray<TSubclassOf<class UAIActionRequirement>> GetSharedRequirementClasses();
	float GetMinimumScore();
	float GetMinimumPriority();
	float GetMaximumScore();
	float GetMaximumPriority();
	float GetEvaluationDelay();
};

// 0x3A0 (0x440 - 0xA0)
// Class NWX.AIActionComponent
class UAIActionComponent : public UActorComponent
{
public:
	TArray<TSubclassOf<class UAIAction>>         ActionClasses;                                     // 0xA0(0x10)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UBehaviorTree*                         FallbackBehavior;                                  // 0xB0(0x8)(Edit, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  TargetKeyName;                                     // 0xB8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        UpdateInterval;                                    // 0xC0(0x4)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FFloatRange                           InitialWaitTime;                                   // 0xC4(0x10)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxEvaluationsPerTick;                             // 0xD4(0x4)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	double                                       MaxTimeSlicePerTick;                               // 0xD8(0x8)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MinEvaluationsPerTimeSliceCheck;                   // 0xE0(0x4)(Edit, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_22E[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnActionChanged;                                   // 0xE8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class UAIActionRequirement>, class UAIActionRequirement*> SharedRequirements;                                // 0xF8(0x50)(Protected, NativeAccessSpecifierProtected)
	TArray<class UAIAction*>                     Actions;                                           // 0x148(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UNWXSquadMemberAction*>         SquadMemberActions;                                // 0x158(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<TSubclassOf<class UAIAction>, struct FTargetedAIAction> TargetedActions;                                   // 0x168(0x50)(Protected, NativeAccessSpecifierProtected)
	TSet<TSubclassOf<class UAIAction>>           ActionClassesToAdd;                                // 0x1B8(0x50)(Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TSet<class AActor*>                          TargetsToAdd;                                      // 0x208(0x50)(Protected, NativeAccessSpecifierProtected)
	TSet<class AActor*>                          TargetsToRemove;                                   // 0x258(0x50)(Protected, NativeAccessSpecifierProtected)
	TSet<class AActor*>                          KnownActors;                                       // 0x2A8(0x50)(Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_234[0x90];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class UAIActionCategory*, struct FCachedCategoryRequirementChecks> CategoryRequirementsCache;                         // 0x388(0x50)(Protected, NativeAccessSpecifierProtected)
	TMap<class UAIAction*, struct FCachedRequirementCheck> OwnerRequirementsCache;                            // 0x3D8(0x50)(Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_235[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIActionComponent* GetDefaultObj();

	void Stop();
	void SetSuppressedTargetPattern(const class FString& Pattern);
	void SetSuppressedActionPattern(const class FString& Pattern);
	void SetSquad(class UNWXSquadComponent* SquadComponent);
	void SetForcedTargetPattern(const class FString& Pattern);
	void SetForcedActionPattern(const class FString& Pattern);
	void Restart();
	bool RemoveActionClass(TSubclassOf<class UAIAction> ActionClass);
	void OnTicketReleased(enum class ETicketType TicketType, class AActor* Target);
	void OnTargetTicketReturned(enum class ETicketType TicketType);
	void OnSquadPerceptionUpdated(class AActor* Target, bool WasSensed);
	void OnAIPerceptionUpdated(class AActor* Target, const struct FAIStimulus& Stimulus);
	bool IsStopped();
	bool HasAction(TSubclassOf<class UAIAction> Action);
	float GetUpdateInterval();
	float GetLastQueueUpdateTime();
	int32 GetEvaluationQueueSize();
	class AActor* GetCurrentTarget();
	class UAIAction* GetCurrentAction();
	TSet<TSubclassOf<class UAIAction>> GetActionClasses();
	void ForceFullEvaluationBeforeStartingAction();
	void CancelCurrentAction(bool bAllowRetry, bool bImmediate, bool bStartBest);
	bool AddActionClass(TSubclassOf<class UAIAction> ActionClass);
};

// 0x60 (0x90 - 0x30)
// Class NWX.AIActionRequirement
class UAIActionRequirement : public UAIActionBase
{
public:
	float                                        CacheLength;                                       // 0x30(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ERequirementContext               Context;                                           // 0x34(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_239[0x5B];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIActionRequirement* GetDefaultObj();

};

// 0x10 (0xC8 - 0xB8)
// Class NWX.AIActionTargetComponent
class UAIActionTargetComponent : public UAIPerceptionStimuliSourceComponent
{
public:
	TArray<TSubclassOf<class UAIAction>>         TargetedActionClasses;                             // 0xB8(0x10)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAIActionTargetComponent* GetDefaultObj();

};

// 0x110 (0x1A0 - 0x90)
// Class NWX.AIAR_AggressiveToTarget
class UAIAR_AggressiveToTarget : public UAIActionRequirement
{
public:
	class ANWXAIController*                      NWXAIController;                                   // 0x90(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ANWXAICharacter*                       Creature;                                          // 0x98(0x8)(BlueprintVisible, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAbilitySystemComponent*               AbilitySystem;                                     // 0xA0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        AggressionCenterOffsetPercentage;                  // 0xA8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ConeAngle;                                         // 0xAC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        AggressionSphereConeSizePercentage;                // 0xB0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        AggressionMemoryTimeout;                           // 0xB4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2E0[0xE8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIAR_AggressiveToTarget* GetDefaultObj();

	void SetNWXAIController(class ANWXAIController* AIController);
	void SetCreature(class ANWXAICharacter* NWXCreature);
	void SetAbilitySystem(class UAbilitySystemComponent* NWXAbilitySystem);
	bool IsHostileTowardsTarget(class AActor* TargetActor, class AActor* InCreature);
	bool IsForceAggressiveToTarget(class AActor* TargetActor, class ANWXAICharacter* InCreature);
	bool IsAggressiveAfterModifyingAggressionRange(class AActor* Target, class ANWXAICharacter* InCreature, float AggressionRange);
	class ANWXAIController* GetNWXAIController();
	class ANWXAICharacter* GetCreature();
	class UAbilitySystemComponent* GetAbilitySystem();
	bool CheckAggresiveToTarget(class AActor* TargetActor, class ANWXAICharacter* InCreature);
	bool CanBeAggressiveToTarget(class AActor* TargetActor, class ANWXAICharacter* InCreature);
	float CalculateAggressionModifier(class AActor* Target, class ANWXAICharacter* InCreature);
	bool AggressiveIfSquadInCombatWithTarget(class AActor* TargetActor, class ANWXAICharacter* InCreature, class ANWXAISpawner* Spawner, float AggressionRange);
};

// 0x18 (0xA8 - 0x90)
// Class NWX.AIAR_TargetInRange_Base
class UAIAR_TargetInRange_Base : public UAIActionRequirement
{
public:
	uint8                                        Pad_2ED[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIAR_TargetInRange_Base* GetDefaultObj();

};

// 0x0 (0xA8 - 0xA8)
// Class NWX.AIAR_TargetInMeleeRange
class UAIAR_TargetInMeleeRange : public UAIAR_TargetInRange_Base
{
public:

	static class UClass* StaticClass();
	static class UAIAR_TargetInMeleeRange* GetDefaultObj();

};

// 0x0 (0xA8 - 0xA8)
// Class NWX.AIAR_TargetInRangedRange
class UAIAR_TargetInRangedRange : public UAIAR_TargetInRange_Base
{
public:

	static class UClass* StaticClass();
	static class UAIAR_TargetInRangedRange* GetDefaultObj();

};

// 0x0 (0x90 - 0x90)
// Class NWX.AIAR_TargetReachableOnNavMesh
class UAIAR_TargetReachableOnNavMesh : public UAIActionRequirement
{
public:

	static class UClass* StaticClass();
	static class UAIAR_TargetReachableOnNavMesh* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.AICCreatureDataInterface
class IAICCreatureDataInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAICCreatureDataInterface* GetDefaultObj();

	void SetAICCreatureDataFromStruct(struct FAICCreatureData& CreatureData);
	float GetSleepDurationMin();
	float GetSleepDurationMax();
	float GetRunningMeleeAttackDistance();
	float GetRangedCombatRangeMin();
	float GetRangedCombatRangeMax();
	float GetRangedCombatDistance();
	float GetRangedAttackCooldown();
	TSoftObjectPtr<class ULiveServicesDataTable> GetPhaseMap();
	TSubclassOf<class UNavigationQueryFilter> GetNavFilter();
	float GetMeleeCombatRangeMin();
	float GetMeleeCombatRangeMax();
	float GetMeleeCombatDistance();
	float GetMeleeAttackCooldown();
	float GetLoiterDurationMin();
	float GetLoiterDurationMax();
	float GetFleeCombatRangeMin();
	float GetFleeCombatRangeMax();
	float GetEvadeChance();
	float GetEnemyAlertDistance();
	float GetCreatureRunDistance();
	float GetCreatureDispersionRadius();
	struct FCarTurnData GetCarTurnsData();
	struct FAICCreatureData GetAICCreatureDataFromStruct();
	TArray<TSoftClassPtr<class UAIAction>> GetAIActions();
	float GetAggressionRangeWhileMaxHealth();
};

// 0x0 (0x28 - 0x28)
// Class NWX.AiCheats
class UAiCheats : public UCheatManagerExtension
{
public:

	static class UClass* StaticClass();
	static class UAiCheats* GetDefaultObj();

	void ToggleInfiniteTickets();
	void ToggleDebugACA();
	void ToggleACA();
	void SuppressAIActionTarget(const class FString& Pattern);
	void SuppressAIAction(const class FString& Pattern);
	void SetSignificance(float SigLevel);
	void SetInvisible(bool IsInvisible);
	void SetCarTurnsEnabled(bool CarTurnsOverride);
	void ListAIActions();
	void KillAllWildlife();
	void KillAllNPCs();
	void KillAllEncounterAI();
	void KillAllCritters();
	void KillAllAI();
	void FreezeAI(bool bFreezeAI);
	void ForceAIActionTarget(const class FString& Pattern);
	void ForceAIAction(const class FString& Pattern);
	void DumpSignificance();
};

// 0xB0 (0x150 - 0xA0)
// Class NWX.AICompanionComponent
class UAICompanionComponent : public UActorComponent
{
public:
	uint8                                        Pad_563[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnCompanionCanBeRecruited;                         // 0xA8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCompanionRecruited;                              // 0xB8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCompanionDismissed;                              // 0xC8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                        FollowRadius;                                      // 0xD8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TeleportRadius;                                    // 0xDC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                LastLeaderPlayerID;                                // 0xE0(0x10)(BlueprintVisible, Net, ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AController*                           LeaderController;                                  // 0xF0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                LeaderPlayerID;                                    // 0xF8(0x10)(Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bCompanionDisabled;                                // 0x108(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_579[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bCanBeRecruited;                                   // 0x10A(0x1)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_57C[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                HomeRealmID;                                       // 0x110(0x10)(BlueprintVisible, Net, ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_57D[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CompanionTimeoutDuration;                          // 0x130(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_57E[0x1C];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAICompanionComponent* GetDefaultObj();

	bool ShouldSpawnDeathChest();
	void SetLeader(class AController* NewLeader);
	void SetHomeRealmID(const class FString& InHomeRealmID);
	void SetCanBeRecruited(bool InCanBeRecruited);
	void RemoveLeader();
	void OnRep_LeaderPlayer(const class FString& PreviousLeaderPlayer);
	void OnRep_CompanionDisabled();
	void OnRep_CanBeRecruited(bool PreviousCanBeRecruited);
	void OnLeaderRespawn(class ANWXCharacter* PlayerCharacter);
	bool IsPreviousLeader(class AActor* DesiredLeader);
	bool IsInHomeRealm();
	bool IsCompanionDisabled();
	bool IsCompanion();
	bool GetLeaderName(class FString* LeaderName);
	class AController* GetLeaderController();
	class ANWXCharacter* GetLeader();
	class FString GetHomeRealmID();
	bool GetCanBeRecruited();
};

// 0x0 (0x28 - 0x28)
// Class NWX.AICompanionInterface
class IAICompanionInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAICompanionInterface* GetDefaultObj();

	void TryReviveCompanion();
	bool TryRecruitCompanion(class AController* Recruiter);
	bool TryDismissCompanion(class AController* Recruiter);
	void ResetInventory();
	void ReloadPersistenceCache(struct FCompanionPersistenceData& PersistenceCache);
	void PreReloadPersistenceCache(struct FCompanionPersistenceData& PersistenceCache);
	bool HasLeader();
	bool GetLeaderName(class FString* LeaderName);
	class ANWXCharacter* GetLeader();
	struct FVector GetHomeLocation();
	class AEquippableItem* GetEquippedItem();
	float GetDistanceToHome(struct FVector& Location);
	class FString GetAIFaction();
	void FillPersistenceCache(struct FCompanionPersistenceData* PersistenceCache);
	void EmptyInventory();
	bool CanBeRecruited(class AActor* DesiredLeader, enum class ERecruitmentFailureReason* OutFailureReason);
	bool CanBeDismissed(class AController* Recruiter);
	void AssignOnCompanionRecruitedDelegate(FDelegateProperty_& InDelegate);
	void AssignOnCompanionDismissedDelegate(FDelegateProperty_& InDelegate);
	float AdjustMaxDistance(float DesiredDistance);
};

// 0x80 (0x120 - 0xA0)
// Class NWX.AILoadoutComponentBase
class UAILoadoutComponentBase : public UActorComponent
{
public:
	uint8                                        Pad_AA8[0x30];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnInitialized;                                     // 0xD0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                         EquippedItemIDs;                                   // 0xE0(0x10)(BlueprintVisible, ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	class AActor*                                LoadoutOwner;                                      // 0xF0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULoadoutComponentBase*                 AILoadout;                                         // 0xF8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInWorldItemContainerComponent*        AIInventory;                                       // 0x100(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FInventoryEntryIdAndQuantity>  TargetInventoryEntries;                            // 0x108(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_ABC[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAILoadoutComponentBase* GetDefaultObj();

	bool WithdrawItemFromContainerByTag(TScriptInterface<class IItemContainer>& ItemContainer, struct FGameplayTag& GameplayTag);
	bool UnequipEquippedItem(bool ClearInventory, struct FGameplayTag& SlotTag);
	void TryUnequipItem(struct FInventoryEntry& Item, bool RemoveFromInventory);
	bool TransferHeldItemFromPlayerToCreature(class APawn* PlayerPawn);
	bool TransferBetweenWorldItemContainerActors(bool TransferToOtherActor, class AActor* OtherActor, class AEquippableItem* Item);
	bool TransferBetweenContainers(TScriptInterface<class IItemContainer> SourceContainer, TScriptInterface<class IItemContainer> DestinationContainer, struct FGuid& ItemIDToTransfer);
	bool TargetInventoryEntryCooldown(double Cooldown);
	bool SpawnLoadoutItem(struct FInventoryEntry& ItemEntry, struct FGameplayTag& SlotTag, class AEquippableItem** OutGrantedItem);
	void SetTargetInventoryEntries(TArray<struct FInventoryEntryIdAndQuantity>& InTargetEntries);
	void SetAndEquipCachedItemIDs(TArray<struct FGuid>& ItemInstanceIDs);
	bool RetrieveTargetItemsFromContainer(TScriptInterface<class IItemContainer>& IItemContainer);
	void PrintComponent(const class FString& Message, enum class ENWXLogLevel NWXLogLevel, enum class ELogCategory LogCategory);
	bool PickUpItemProxy(class AItemProxyBase* ItemProxyActor);
	bool IsInitialized();
	bool HasAnyResource();
	bool GrantItemToLoadout(struct FGameplayTag& SlotTag, struct FInventoryEntry& ItemEntry, struct FGameplayTag* OutEquippedSlot, class AEquippableItem** OutGrantedItem);
	class AActor* GetLoadoutOwner();
	class ULoadoutComponentBase* GetAILoadout();
	class UInWorldItemContainerComponent* GetAIInventory();
	bool EquipItemByItemID(struct FItemDataReference& ItemId);
	bool EquipItemByInstanceID(struct FGuid& InstanceID);
	bool EquipItemByEntry(struct FInventoryEntry& Entry);
	bool DepositResourcesInContainer(TScriptInterface<class IItemContainer>& IItemContainer);
	void CreateAndEquipItemByItemID(struct FItemDataReference& ItemReference, struct FDynamicTypedStructs& InstancedData);
	void ClearSlotWithTag(struct FGameplayTag& SlotTag);
	void AddItemAndEquipByEntry(struct FInventoryEntry& Entry);
};

// 0x0 (0x28 - 0x28)
// Class NWX.AIPersistenceFunctionLibrary
class UAIPersistenceFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAIPersistenceFunctionLibrary* GetDefaultObj();

	void RawNPCNameToStringTableRef(class FText& NPCName, struct FStringTableEntryHandle* OutNameHandle);
};

// 0x0 (0x28 - 0x28)
// Class NWX.AIPPOIInteractionInterface
class IAIPPOIInteractionInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAIPPOIInteractionInterface* GetDefaultObj();

	void UpdateActorsLocation(class AActor* Actor, struct FVector& Location);
	void RemoveActorFromPOI(class AActor* Actor);
	void HandleNewLocation(class UObject* Target, struct FVector& Location, bool FoundLocation, int32 QueryID);
	void GetPotentialNewLocationForObject(class UObject* QueryOwner, float Radius, bool bGenerateInitialRandomLocation, int32* QueryID);
	class AActor* GetPOIOwner();
	int32 GetNumberOfActors();
	class UEnvQuery* GetLoiterEQSQueryForSpawner(class UObject* Spawner);
	bool GetLocationForActor(class AActor* Actor, struct FVector* Location);
	class UNWXAIPOI_Component* GetCurrentPOIImplementer();
	void GetCurrentActors(TSet<class AActor*>* CurrentActors);
	void GetCurrentActorLocations(TArray<struct FVector>* CurrentLocations);
	void AddActorToPOI(class AActor* Actor, struct FVector& Location);
};

// 0x0 (0x28 - 0x28)
// Class NWX.AISpawnerInterface
class IAISpawnerInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAISpawnerInterface* GetDefaultObj();

	int32 GetMaxAICount();
	TArray<class AActor*> GetDamagers();
	int32 GetAICount();
	void AddCreatureToSpawner(class ANWXAICharacter* AICharacter);
};

// 0x0 (0x28 - 0x28)
// Class NWX.AIStructureTargetProvider
class IAIStructureTargetProvider : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAIStructureTargetProvider* GetDefaultObj();

	bool GetClosestDamagedTargetData(class APawn* AIPawn, struct FAIStructureTargetData* OutTargetData);
};

// 0x0 (0x28 - 0x28)
// Class NWX.AITargetingInterface
class IAITargetingInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAITargetingInterface* GetDefaultObj();

	void GetAIRootmotionTargetTransform(struct FTransform* TargetTransform);
};

// 0x0 (0x28 - 0x28)
// Class NWX.AIUIData
class IAIUIData : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAIUIData* GetDefaultObj();

	class FText GetAIName();
};

// 0x18 (0xB8 - 0xA0)
// Class NWX.AlertnessComponent
class UAlertnessComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnAlertnessChanged;                                // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	enum class EAlertnessLevelType               Alertness;                                         // 0xB0(0x1)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_EA2[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAlertnessComponent* GetDefaultObj();

	void SetAlertness(enum class EAlertnessLevelType NewAlertness);
	void OnRep_Alertness(enum class EAlertnessLevelType& OldAlertness);
	enum class EAlertnessLevelType GetAlertness();
};

// 0xA0 (0x140 - 0xA0)
// Class NWX.AmbienceManager
class UAmbienceManager : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnWindOneShot;                                     // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                         WindSurfaceOneShotEvent;                           // 0xB0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkRtpc*                               WindSpeedSurfaceRTPC;                              // 0xB8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class AActor*, struct FIIMInstanceFilterCache> CachedFilteredLocalInstances;                      // 0xC0(0x50)(BlueprintVisible, Transient, NativeAccessSpecifierPublic)
	uint8                                        Pad_115D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TimeOfDay;                                         // 0x114(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_115E[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnSpyglassState_WildlifeEnter;                     // 0x120(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_            OnSpyglassState_WildlifeExit;                      // 0x130(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAmbienceManager* GetDefaultObj();

	void SetTimeOfDay(float Value);
	void SetSeason(float Value);
	void SetIsPlayerInCombat(bool IsInCombat);
	void RemoveRiverPointSmallSlow(class AActor* RiverWaterAudio);
	void RemoveRiverPointSmallMedium(class AActor* RiverWaterAudio);
	void RemoveRiverPointSmallFast(class AActor* RiverWaterAudio);
	void RemoveRiverPointMediumSlow(class AActor* RiverWaterAudio);
	void RemoveRiverPointMediumMedium(class AActor* RiverWaterAudio);
	void RemoveRiverPointMediumFast(class AActor* RiverWaterAudio);
	void RemoveRiverPointLargeSlow(class AActor* RiverWaterAudio);
	void RemoveRiverPointLargeMedium(class AActor* RiverWaterAudio);
	void RemoveRiverPointLargeFast(class AActor* RiverWaterAudio);
	float GetWindSpeed();
	float GetTreeStandardDensityInner();
	float GetTimeOfDay();
	bool GetShowTreeFeelingDebug();
	bool GetShowRiverAudioDebug();
	float GetSeason();
	float GetPrecipitationAmount();
	bool GetIsPlayerInCombat();
	class UAkComponent* GetAk2DComponent();
	void AddRiverPointSmallSlow(class AActor* RiverWaterAudio);
	void AddRiverPointSmallMedium(class AActor* RiverWaterAudio);
	void AddRiverPointSmallFast(class AActor* RiverWaterAudio);
	void AddRiverPointMediumSlow(class AActor* RiverWaterAudio);
	void AddRiverPointMediumMedium(class AActor* RiverWaterAudio);
	void AddRiverPointMediumFast(class AActor* RiverWaterAudio);
	void AddRiverPointLargeSlow(class AActor* RiverWaterAudio);
	void AddRiverPointLargeMedium(class AActor* RiverWaterAudio);
	void AddRiverPointLargeFast(class AActor* RiverWaterAudio);
	void AddAmbientBird(class AActor* AmbientBird);
};

// 0x68 (0x90 - 0x28)
// Class NWX.RadialMenuEntry
class URadialMenuEntry : public UObject
{
public:
	uint8                                        Pad_1251[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            IconTexture;                                       // 0x30(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsEnabled;                                        // 0x38(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1259[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  EntryName;                                         // 0x40(0x18)(BlueprintVisible, BlueprintReadOnly, Protected, ExposeOnSpawn, NativeAccessSpecifierProtected)
	class FText                                  EntryDescription;                                  // 0x58(0x18)(BlueprintVisible, BlueprintReadOnly, Protected, ExposeOnSpawn, NativeAccessSpecifierProtected)
	class FText                                  DisabledDescription;                               // 0x70(0x18)(BlueprintVisible, BlueprintReadOnly, Protected, ExposeOnSpawn, NativeAccessSpecifierProtected)
	enum class ERadialButtonType                 ButtonType;                                        // 0x88(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1267[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class URadialMenuEntry* GetDefaultObj();

	void SetName(class FText& InName);
	void SetIconTexture(class UTexture2D* InTexture);
	void SetEnabled(bool InIsEnabled);
	void SetDisabledDescription(class FText& InDescription);
	void SetDescription(class FText& InDescription);
	void SetButtonType(enum class ERadialButtonType InButtonType);
};

// 0x3A0 (0x430 - 0x90)
// Class NWX.AmmoRadialMenuEntry
class UAmmoRadialMenuEntry : public URadialMenuEntry
{
public:
	FMulticastInlineDelegateProperty_            OnAmmoChanged;                                     // 0x90(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1294[0x90];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FInventoryEntry                       AmmoEntry;                                         // 0x130(0x2F0)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1295[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAmmoRadialMenuEntry* GetDefaultObj();

};

// 0x40 (0x70 - 0x30)
// Class NWX.AnimNotifyState_AISocketTrace
class UAnimNotifyState_AISocketTrace : public UAnimNotifyState
{
public:
	uint8                                        Pad_1394[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 TraceGuid;                                         // 0x38(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStatusEffectDataAsset*                StatusEffect;                                      // 0x48(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStatusEffectDOT                      StatusEffectDOT;                                   // 0x50(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        StatusLevel;                                       // 0x68(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13A7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        StatusDuration;                                    // 0x6C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotifyState_AISocketTrace* GetDefaultObj();

	bool TargetIsFriendly(class ANWXAICharacter* AICharacter, class AActor* Target);
	void HandleHits(class ANWXAICharacter* AICharacter, TArray<struct FHitResult>& HitResults);
	void HandleHitActor(struct FHitResult& HitResult, class ANWXAICharacter* AICharacter, class AActor* HitActor, TArray<struct FHitResult>& AllHits);
	void ApplyStatusEffectDotToTarget(class ANWXAICharacter* AICharacter, class AActor* Target, struct FStatusEffectDOT& StatusEffectDOTs);
};

// 0x8 (0x38 - 0x30)
// Class NWX.AnimNotifyState_FPTP
class UAnimNotifyState_FPTP : public UAnimNotifyState
{
public:
	bool                                         bAlwaysAllowNotifyEnd;                             // 0x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_13C2[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotifyState_FPTP* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class NWX.AnimNotifyState_MotionWarpTrackTarget
class UAnimNotifyState_MotionWarpTrackTarget : public UAnimNotifyState
{
public:
	uint8                                        Pad_13FD[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotifyState_MotionWarpTrackTarget* GetDefaultObj();

};

// 0x8 (0x38 - 0x30)
// Class NWX.AnimNotifyState_SquashTranslation
class UAnimNotifyState_SquashTranslation : public UAnimNotifyState
{
public:
	bool                                         AlignRotationToFaceTargetLocation;                 // 0x30(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EMovementMode                     MovementMode;                                      // 0x31(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1419[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxSpeedMultiplier;                                // 0x34(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAnimNotifyState_SquashTranslation* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class NWX.AnimNotifyState_SquashRotation
class UAnimNotifyState_SquashRotation : public UAnimNotifyState
{
public:

	static class UClass* StaticClass();
	static class UAnimNotifyState_SquashRotation* GetDefaultObj();

};

// 0x8 (0x38 - 0x30)
// Class NWX.AnimNotifyState_TimeRemaining
class UAnimNotifyState_TimeRemaining : public UAnimNotifyState
{
public:
	float                                        Duration;                                          // 0x30(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeRemaining;                                     // 0x34(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotifyState_TimeRemaining* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.NWXRagdollInterface
class INWXRagdollInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class INWXRagdollInterface* GetDefaultObj();

	void UpdateRagdollTransition(float RagdollPercentage);
	void FinishRagdollTransition();
	void BeginRagdollTransition(float RagdollBlendTime);
};

// 0x8 (0x38 - 0x30)
// Class NWX.AnimNotifyState_TransitionToRagdoll
class UAnimNotifyState_TransitionToRagdoll : public UAnimNotifyState
{
public:
	float                                        NotifyStateDuration;                               // 0x30(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CurrentDuration;                                   // 0x34(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotifyState_TransitionToRagdoll* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class NWX.AnimNotifyState_TryActivateAbility
class UAnimNotifyState_TryActivateAbility : public UAnimNotifyState
{
public:
	struct FGameplayTag                          BeginGamePlayTag;                                  // 0x30(0x8)(Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          EndGamePlayTag;                                    // 0x38(0x8)(Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotifyState_TryActivateAbility* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class NWX.AnimNotify_FPTP
class UAnimNotify_FPTP : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_FPTP* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class NWX.AnimNotify_FootstepBase
class UAnimNotify_FootstepBase : public UAnimNotify_FPTP
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_FootstepBase* GetDefaultObj();

	void SpawnVFXDisplay(class AActor* SteppingActor, class USkeletalMeshComponent* MeshComp, const struct FGameplayTag& FootstepTypeTag, float WaterDepth, const struct FVector& WaterHitNormal, const struct FVector& WaterHitLocation);
	void ScheduleCallToVFXDisplay(float Delay, class AActor* SteppingActor, class USkeletalMeshComponent* MeshComp, struct FGameplayTag& FootstepTypeTag, float WaterDepth, struct FVector& WaterHitNormal, struct FVector& WaterHitLocation);
};

// 0x30 (0x68 - 0x38)
// Class NWX.AnimNotify_NPCDamageAction
class UAnimNotify_NPCDamageAction : public UAnimNotify
{
public:
	int32                                        DamageTargetTypes;                                 // 0x38(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1601[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 GameplayEffectTags;                                // 0x40(0x20)(Edit, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                         bIncludeAbilitySystemTags;                         // 0x60(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseHitComponent;                                  // 0x61(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_160B[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DefaultDamage;                                     // 0x64(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotify_NPCDamageAction* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class NWX.AnimNotify_RootMotionMatchTime
class UAnimNotify_RootMotionMatchTime : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_RootMotionMatchTime* GetDefaultObj();

};

// 0x50 (0xF0 - 0xA0)
// Class NWX.ApexMusicComponent
class UApexMusicComponent : public UActorComponent
{
public:
	class UAkStateValue*                         ApexTensionState;                                  // 0xA0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkAudioEvent*                         AmbientStingerEvent;                               // 0xA8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkRtpc*                               ApexStingerDistanceRTPC;                           // 0xB0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAkRtpc*                               ApexStingerAzimuthRTPC;                            // 0xB8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinTimeBetweenStingers;                            // 0xC0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxTimeBetweenStingers;                            // 0xC4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PlayerTriggerDistance;                             // 0xC8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1782[0x24];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UApexMusicComponent* GetDefaultObj();

	bool TryPlayAmbientStinger();
	bool TryApplyApexTensionState();
	void RemoveApexTensionState();
	bool IsPCInRangeForStingers();
	bool IsApexCreatureOutOfCombat();
	bool IsApexCreatureAlive();
	void HandleDeath(struct FGameplayTag& Tag, int32 Count);
	class APlayerController* GetLocalPC();
	class UMusicManager* GetLocalMusicManager();
};

// 0x8 (0x2B8 - 0x2B0)
// Class NWX.POISocketVisualizer
class APOISocketVisualizer : public AStaticMeshActor
{
public:
	int32                                        SocketRadius;                                      // 0x2B0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESocketShape                      SocketShape;                                       // 0x2B4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_17B8[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class APOISocketVisualizer* GetDefaultObj();

};

// 0x48 (0x420 - 0x3D8)
// Class NWX.NWXGameplayAbility
class UNWXGameplayAbility : public UGameplayAbility
{
public:
	TArray<struct FAbilityEffectTriggerData>     EffectTagTriggers;                                 // 0x3D8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                         AllowMultipleGrants;                               // 0x3E8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_19AD[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 SourceCancellationTags;                            // 0x3F0(0x20)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                        Pad_19B1[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UNWXGameplayAbility* GetDefaultObj();

	bool ValidateTriggeredAbilities(class UClass* AbilityClass, class FString* Error);
	bool ValidateActivateHierarchyNodes(class UClass* AbilityClass);
	void RemoveGameplayCueFromActor(class AActor* Actor, struct FGameplayTag& GameplayCueTag);
	bool HasAbilityTag(struct FGameplayTag& Tag, bool bExactMatch);
	TSubclassOf<class UGameplayEffect> GetCostGameplayEffectClass();
	void ExecuteGameplayCueWithParamsOnActor(class AActor* Actor, struct FGameplayTag& GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameters);
	void ExecuteGameplayCueOnActor(class AActor* Actor, struct FGameplayTag& GameplayCueTag, struct FGameplayEffectContextHandle& Context);
	void AddGameplayCueWithParamsToActor(class AActor* Actor, const struct FGameplayTag& GameplayCueTag, struct FGameplayCueParameters& GameplayCueParameter, bool bRemoveOnAbilityEnd);
	void AddGameplayCueToActor(class AActor* Actor, const struct FGameplayTag& GameplayCueTag, const struct FGameplayEffectContextHandle& Context, bool bRemoveOnAbilityEnd);
};

// 0x0 (0x420 - 0x420)
// Class NWX.ApplyAbilityDamage
class UApplyAbilityDamage : public UNWXGameplayAbility
{
public:

	static class UClass* StaticClass();
	static class UApplyAbilityDamage* GetDefaultObj();

};

// 0x8 (0xA8 - 0xA0)
// Class NWX.SyncAssetLoaderComponent
class USyncAssetLoaderComponent : public UActorComponent
{
public:
	uint8                                        Pad_1A1C[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USyncAssetLoaderComponent* GetDefaultObj();

};

// 0x8 (0xA8 - 0xA0)
// Class NWX.AsyncAssetLoaderComponent
class UAsyncAssetLoaderComponent : public UActorComponent
{
public:
	uint8                                        Pad_1A37[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAsyncAssetLoaderComponent* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.AssetLoaderFunctions
class UAssetLoaderFunctions : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAssetLoaderFunctions* GetDefaultObj();

	void LoadSingle(TScriptInterface<class IAssetLoaderProvider>& LoaderProvider, TSoftObjectPtr<class UObject>& AssetPtr, FDelegateProperty_& OnLoadComplete);
	void LoadMany(TScriptInterface<class IAssetLoaderProvider>& LoaderProvider, TArray<TSoftObjectPtr<class UObject>>& AssetPtrs, FDelegateProperty_& OnLoadComplete);
};

// 0x0 (0x28 - 0x28)
// Class NWX.AssetLoaderProvider
class IAssetLoaderProvider : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAssetLoaderProvider* GetDefaultObj();

};

// 0x40 (0x68 - 0x28)
// Class NWX.AttributeAboveThresholdRequirement
class UAttributeAboveThresholdRequirement : public URequirement
{
public:
	struct FGameplayAttribute                    Attribute;                                         // 0x28(0x38)(Edit, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Threshold;                                         // 0x60(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1B3F[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAttributeAboveThresholdRequirement* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.AttributeChangedInterface
class IAttributeChangedInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAttributeChangedInterface* GetDefaultObj();

	void OnStaminaMaxChanged(float Delta);
	void OnStaminaDepleted();
	void OnStaminaChanged(float Delta);
	void OnRestedMaxChanged(float Delta);
	void OnRestedChanged(float Delta);
	void OnReachedMinSchematicTimeout();
	void OnQuestScoreChanged(float Delta);
	void OnMaxSpeedWalkFastChanged(float Delta);
	void OnMaxSpeedWalkChanged(float Delta);
	void OnMaxSpeedRunChanged(float Delta);
	void OnMaxSpeedBonusChanged(float Delta);
	void OnLoadoutLevelChanged(float Delta);
	void OnHopeMinChanged(float Delta);
	void OnHopeMaxChanged(float Delta);
	void OnHopeChanged(float Delta);
	void OnHealthMaxChanged(float Delta);
	void OnHealthChanged(float Delta);
	void OnFuelChanged(float Delta);
	void OnFedMaxChanged(float Delta);
	void OnFedChanged(float Delta);
	void OnEstateScoreChanged(float Delta);
	void OnCraftQualityChanged(float Delta);
	void OnCraftIntegrityChanged(float Delta);
	void OnCraftBuildPointsChanged(float Delta);
	void OnCharacterWeightMaxChanged(float Delta);
	void OnCharacterWeightChanged(float Delta);
	void OnCharacterUnderWeight();
	void OnCharacterOverWeight();
	void OnBuildProgressChanged(float Delta);
	void OnAnyAttributeChanged(struct FGameplayAttribute& Attribute);
};

// 0x0 (0x28 - 0x28)
// Class NWX.AttributeChangeHandler
class IAttributeChangeHandler : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAttributeChangeHandler* GetDefaultObj();

};

// 0x60 (0x90 - 0x30)
// Class NWX.AttributeUIDataRegistry
class UAttributeUIDataRegistry : public UDataAsset
{
public:
	TMap<struct FGameplayAttribute, struct FGameplayAttributeUIData> Registry;                                          // 0x30(0x50)(Edit, NativeAccessSpecifierPrivate)
	TArray<struct FGameplayAttribute>            AttributeOrdering;                                 // 0x80(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAttributeUIDataRegistry* GetDefaultObj();

	void TryGetAttributeUIData(struct FGameplayAttribute& Attribute, struct FGameplayAttributeUIData* OutData, enum class EGetResult* OutBranches);
	void GetSortedAttributeValueAndUIData(TMap<struct FGameplayAttribute, float>& InUnsortedAttributeValuesMap, TArray<struct FAttributeValueAndUIData>* OutAttributeValueAndUIData);
};

// 0x20 (0xC0 - 0xA0)
// Class NWX.AudioFocusMixingComponent
class UAudioFocusMixingComponent : public UActorComponent
{
public:
	enum class EAudioFocusUpdateMode             UpdateMode;                                        // 0xA0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2231[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAkRtpc*                               FocusRTPC;                                         // 0xA8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UAkGameObject*>                 AkComponentsToUpdate;                              // 0xB0(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAudioFocusMixingComponent* GetDefaultObj();

	void HandleFocusScoreUpdated(float NewFocusScore, float NewNormalizedFocusScore);
};

// 0x20 (0x50 - 0x30)
// Class NWX.AVFXEnvironmentSubsystem
class UAVFXEnvironmentSubsystem : public UNWXWorldSubsystem
{
public:
	TArray<TWeakObjectPtr<class UWaterbodyAudioComponent>> WaterBodies;                                       // 0x30(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class URainScopedAkComponent>> RainEmitters;                                      // 0x40(0x10)(ExportObject, ZeroConstructor, Transient, ContainsInstancedReference, UObjectWrapper, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAVFXEnvironmentSubsystem* GetDefaultObj();

	bool TrySortCoastlinePointsToQuadrants(struct FVector& WorldPos, TArray<struct FVector>* OutForwardLeft, TArray<struct FVector>* OutForwardRight, TArray<struct FVector>* OutBackLeft, TArray<struct FVector>* OutBackRight, bool* IsPosInWater, float MinSearchDistanceMetres);
	bool GetCoastlinePointsNearest(struct FVector& WorldPosition, int32 NumPointsEitherSide, TArray<struct FVector>* OutputPoints);
};

// 0x58 (0xF8 - 0xA0)
// Class NWX.AVFXFocusComponent
class UAVFXFocusComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnFocusScoreUpdated;                               // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                        FocusScore;                                        // 0xB0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        NormalizedFocusScore;                              // 0xB4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAutoSubscribeToFocusScoring;                      // 0xB8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_23F2[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  FocusBucket;                                       // 0xBC(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        BaseFocusScore;                                    // 0xC4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FlatFocusScoreBonus;                               // 0xC8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAzimuthAndElevationAffectsFocusScore;             // 0xCC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2407[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinAzimuthAndElevationMultiplier;                  // 0xD0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDistanceAffectsFocusScore;                        // 0xD4(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2410[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinDistanceMultiplier;                             // 0xD8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxFocusDistance;                                  // 0xDC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_241B[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAVFXFocusComponent* GetDefaultObj();

	void UnsubscribeFromFocusScoring();
	void SubscribeToFocusScoring();
	float GetNormalizedFocusScore();
	float GetFocusScore();
	class FName GetFocusBucket();
	float CalculateFocusScore();
};

// 0x68 (0xA8 - 0x40)
// Class NWX.AVFXFocusSubsystem
class UAVFXFocusSubsystem : public UNWXTickableWorldSubsystem
{
public:
	TMap<class FName, struct FAVFXFocusBucket>   FocusScoreBuckets;                                 // 0x40(0x50)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_24DF[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UAVFXFocusComponent*>           FocusComponentUpdateList;                          // 0x98(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAVFXFocusSubsystem* GetDefaultObj();

	int32 GetGlobalFocusRank(class UAVFXFocusComponent* FocusComponent);
	int32 GetFocusRank(class UAVFXFocusComponent* FocusComponent);
};

// 0x28 (0xC8 - 0xA0)
// Class NWX.AVFXOscillatorComponent
class UAVFXOscillatorComponent : public UActorComponent
{
public:
	float                                        FrequencyHertz;                                    // 0xA0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EOscillatorBasicShape             Waveform;                                          // 0xA4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2537[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           CustomShape;                                       // 0xA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinOutput;                                         // 0xB0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxOutput;                                         // 0xB4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PulseWidth;                                        // 0xB8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2541[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAVFXOscillatorComponent* GetDefaultObj();

	float GetOutput(float PhaseOffset);
};

// 0x260 (0x290 - 0x30)
// Class NWX.AVFXSpatialSubsystem
class UAVFXSpatialSubsystem : public UNWXGameInstanceSubsystem
{
public:
	uint8                                        Pad_2642[0x260];                                   // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAVFXSpatialSubsystem* GetDefaultObj();

	void SetVerticalGain(float InVerticalGain);
	void RemoveCluster(int32 ClusterID);
	bool IsPointOccluded(struct FVector& Point);
	void GetComponentsInRange(struct FVector& Centre, float Radius, TArray<class UAVFXSpatialComponent*>& ComponentsInRange);
	int32 AddComponents(TArray<class UAVFXSpatialComponent*>& Components);
	int32 AddComponent(class UAVFXSpatialComponent* Component);
};

// 0x10 (0x2F0 - 0x2E0)
// Class NWX.AwaitableChildActorComponent
class UAwaitableChildActorComponent : public UChildActorComponent
{
public:
	uint8                                        Pad_267B[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UBasicAwaiter*                         ChildActorAwaiter;                                 // 0x2E8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAwaitableChildActorComponent* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.AxisBindingBPFunctionLibrary
class UAxisBindingBPFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAxisBindingBPFunctionLibrary* GetDefaultObj();

	void UpdateExistingAxisBindingRow(class UDataTable* DataTable, class FName& RowName, struct FS_AxisKeyBinding& UserKeyBinding, struct FKey& SelectedKey);
	bool SaveAxisKeyBindingMap(class UDataTable* DataTable, const class FString& SlotName, int32 UserIndex);
	void ResetAxisKeyToDefault(class UDataTable* DataTable, class FName* AxisName, const class FString& InputDeviceString);
	void ResetAxisBindingsToDefault(class UDataTable* DataTable, class UOptionsControls* OptionsControls);
	bool LoadAxisKeyBindingMap(class UDataTable* DataTable, const class FString& SlotName, int32 UserIndex);
	bool Equals(struct FS_AxisKeyBinding& A, struct FS_AxisKeyBinding& B);
	void ApplyAxisKeyBindings(class UDataTable* DataTable, const class FString& SlotName, int32 UserIndex, bool* bIsSuccess);
};

// 0x50 (0x80 - 0x30)
// Class NWX.BiomeUIDataRegistry
class UBiomeUIDataRegistry : public UDataAsset
{
public:
	TMap<enum class EBiomeID, struct FBiomeUIData> Registry;                                          // 0x30(0x50)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBiomeUIDataRegistry* GetDefaultObj();

	void TryGetBiomeUIData(enum class EBiomeID BiomeId, struct FBiomeUIData* OutData, enum class EGetResult* OutBranches);
};

// 0x0 (0x28 - 0x28)
// Class NWX.BlueprintAnalysisLibrary
class UBlueprintAnalysisLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UBlueprintAnalysisLibrary* GetDefaultObj();

};

// 0x48 (0xE8 - 0xA0)
// Class NWX.BoidsComponent
class UBoidsComponent : public UActorComponent
{
public:
	float                                        NoiseFloat;                                        // 0xA0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SepRadiusInMeters;                                 // 0xA4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CohRadiusInMeters;                                 // 0xA8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsEnabled;                                        // 0xAC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A08[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SepWeight;                                         // 0xB0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        AlignWeight;                                       // 0xB4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        CohWeight;                                         // 0xB8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        GoalWeight;                                        // 0xBC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class ACharacter*>                    Characters;                                        // 0xC0(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class ACharacter*                            Owner;                                             // 0xD0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UNWX_CharacterMovementComponent*       MoveComp;                                          // 0xD8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2A1E[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBoidsComponent* GetDefaultObj();

	void SetSquadMembers(TArray<class ACharacter*>& Members);
	void SetSepWeight(float NewSepWeight);
	void SetGoalWeight(float NewGoalWeight);
	void SetCohWeight(float NewCohWeight);
	void SetAlignWeight(float NewAlignWeight);
};

// 0x0 (0x28 - 0x28)
// Class NWX.BoneHierarchyInformationInterface
class IBoneHierarchyInformationInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IBoneHierarchyInformationInterface* GetDefaultObj();

	class FName GetSecondHighestBoneInHierarchy();
};

// 0x20 (0xC0 - 0xA0)
// Class NWX.BossCombatDetectionComponent
class UBossCombatDetectionComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnBossCombatChangedDelegate;                       // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class ANWXAICharacter*                       EnemyBoss;                                         // 0xB0(0x8)(Net, ZeroConstructor, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class APlayerController*                     OwnerController;                                   // 0xB8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBossCombatDetectionComponent* GetDefaultObj();

	void OnRep_EnemyBoss();
	void OnPossessedPawnChanged(class APawn* OldPawn, class APawn* NewPawn);
	void OnBossCombatStatusChanged(class ANWXAICharacter* NewBoss);
};

// 0x120 (0x160 - 0x40)
// Class NWX.BossCombatDetectionSubsystem
class UBossCombatDetectionSubsystem : public UNWXTickableWorldSubsystem
{
public:
	class ANWXCreatureManagerBase*               CreatureManager;                                   // 0x40(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class ANWXAICharacter*>               BossCreatures;                                     // 0x48(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<class APlayerController*, class ANWXAICharacter*> PlayersInBossFight;                                // 0x58(0x50)(NativeAccessSpecifierPrivate)
	TMap<class APlayerController*, FDelegateProperty_> PlayerListeners;                                   // 0xA8(0x50)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<class APlayerController*, class UCombatAnalyserComponent*> PlayerCombatAnalyzerComponentMapping;              // 0xF8(0x50)(ExportObject, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class APlayerController*>             Players;                                           // 0x148(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2C13[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBossCombatDetectionSubsystem* GetDefaultObj();

	void OnCreatureSpawned(class ANWXCreatureManagerBase* CreatureManager, class ANWXAICharacter* Creature);
	void OnBossDeath(class ANWXAICharacter* Boss);
};

// 0x60 (0xD0 - 0x70)
// Class NWX.BTService_SetTargetFromApproachAngle
class UBTService_SetTargetFromApproachAngle : public UBTService
{
public:
	struct FBlackboardKeySelector                TargetKey;                                         // 0x70(0x28)(Edit, Protected, NativeAccessSpecifierProtected)
	struct FBlackboardKeySelector                OutLocationKey;                                    // 0x98(0x28)(Edit, Protected, NativeAccessSpecifierProtected)
	TSubclassOf<class UNavigationQueryFilter>    FilterClass;                                       // 0xC0(0x8)(Edit, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        VerticalProjectionDistance;                        // 0xC8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxTrackingDistance;                               // 0xCC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBTService_SetTargetFromApproachAngle* GetDefaultObj();

};

// 0x198 (0x208 - 0x70)
// Class NWX.BTTask_BlackboardMoveTo
class UBTTask_BlackboardMoveTo : public UBTTaskNode
{
public:
	TSubclassOf<class UNavigationQueryFilter>    FilterClass;                                       // 0x70(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AcceptableRadius;                                  // 0x78(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxTrackMovingTargetDistance;                      // 0x7C(0x4)(Edit, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowStrafe : 1;                                  // Mask: 0x1, PropSize: 0x10x80(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bReachTestIncludesAgentRadius : 1;                 // Mask: 0x2, PropSize: 0x10x80(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bReachTestIncludesGoalRadius : 1;                  // Mask: 0x4, PropSize: 0x10x80(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowPartialPath : 1;                             // Mask: 0x8, PropSize: 0x10x80(0x1)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bTrackMovingGoal : 1;                              // Mask: 0x10, PropSize: 0x10x80(0x1)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bProjectGoalLocation : 1;                          // Mask: 0x20, PropSize: 0x10x80(0x1)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_81 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_2CCD[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                TargetKey;                                         // 0x88(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                FilterClassKey;                                    // 0xB0(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                AcceptableRadiusKey;                               // 0xD8(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                AllowStrafeKey;                                    // 0x100(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                ReachTestIncludesAgentRadiusKey;                   // 0x128(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                ReachTestIncludesGoalRadiusKey;                    // 0x150(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                AllowPartialPathKey;                               // 0x178(0x28)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                TrackMovingGoalKey;                                // 0x1A0(0x28)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                ProjectGoalLocationKey;                            // 0x1C8(0x28)(Edit, AdvancedDisplay, NativeAccessSpecifierPublic)
	float                                        ObservedBlackboardValueTolerance;                  // 0x1F0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bStopOnOverlapNeedsUpdate : 1;                     // Mask: 0x1, PropSize: 0x10x1F4(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bObserveBlackboardValue : 1;                       // Mask: 0x2, PropSize: 0x10x1F4(0x1)(Edit, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2CF6[0x13];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_BlackboardMoveTo* GetDefaultObj();

};

// 0x28 (0x98 - 0x70)
// Class NWX.BTTask_ClearBlackboardKey
class UBTTask_ClearBlackboardKey : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                BlackboardKey;                                     // 0x70(0x28)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTTask_ClearBlackboardKey* GetDefaultObj();

};

// 0x28 (0x98 - 0x70)
// Class NWX.BTTask_DepositAllResources
class UBTTask_DepositAllResources : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                TargetContainerKey;                                // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTTask_DepositAllResources* GetDefaultObj();

};

// 0xA0 (0x110 - 0x70)
// Class NWX.BTTask_GetStructureRepairLoc
class UBTTask_GetStructureRepairLoc : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                TargetKey;                                         // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                OutLocationKey;                                    // 0x98(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                OutFocusLocationKey;                               // 0xC0(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                OutTargetMeshKey;                                  // 0xE8(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTTask_GetStructureRepairLoc* GetDefaultObj();

};

// 0x28 (0x98 - 0x70)
// Class NWX.BTTask_TryDepositItemInContainer
class UBTTask_TryDepositItemInContainer : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                TargetContainerKey;                                // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_TryDepositItemInContainer* GetDefaultObj();

};

// 0x28 (0x98 - 0x70)
// Class NWX.BTTask_TryGetItemFromContainer
class UBTTask_TryGetItemFromContainer : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                TargetContainerKey;                                // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_TryGetItemFromContainer* GetDefaultObj();

};

// 0x0 (0xA8 - 0xA8)
// Class NWX.BTT_NWXMoveToWithAbilityBase
class UBTT_NWXMoveToWithAbilityBase : public UBTTask_BlueprintBase
{
public:

	static class UClass* StaticClass();
	static class UBTT_NWXMoveToWithAbilityBase* GetDefaultObj();

};

// 0x150 (0x1F0 - 0xA0)
// Class NWX.BuildingComponent
class UBuildingComponent : public UActorComponent
{
public:
	uint8                                        Pad_2FDA[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UGameplayAbility>          PlacementAbility;                                  // 0xA8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UGameplayAbility>          MovementAbility;                                   // 0xB0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UGameplayAbility>          CopyAbility;                                       // 0xB8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UGameplayAbility>          DeconstructAbility;                                // 0xC0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                    SchematicMaterial;                                 // 0xC8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                    ConfirmedMaterial;                                 // 0xD0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UMaterialInterface*                    MovementMaterial;                                  // 0xD8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class APawn>                  Pawn;                                              // 0xE0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TScriptInterface<class IBuildingEventInterface>> Listeners;                                         // 0xE8(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	struct FTimerHandle                          ServerPlacementCooldownTimerHandle;                // 0xF8(0x8)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsPlacementCooldownActive;                        // 0x100(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_3005[0xEF];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBuildingComponent* GetDefaultObj();

	void Server_StartDeconstruct(struct FStructurePointer& StructurePtr);
	void Server_RequestStartMovement(struct FStructurePointer& StructurePtr);
	void Server_RequestStartCopy(struct FStructurePointer& StructurePtr);
	void Server_GenerateBuildSessionId();
	void Server_CancelAllPlacement(enum class EBuildingFeedback FeedbackId);
	void Server_CancelAllBuilding(enum class EBuildingFeedback FeedbackId);
	void Server_CacheTargetData(struct FGameplayAbilityTargetDataHandle& TargetData);
	void OnServerPlacementCooldownComplete();
	void OnPossessedPawnChanged(class APawn* OldPawn, class APawn* NewPawn);
	void Client_StartMovement(struct FStructurePointer& StructurePtr);
	void Client_StartCopy(struct FStructurePointer& StructurePtr);
};

// 0x0 (0x28 - 0x28)
// Class NWX.BuildingEventInterface
class IBuildingEventInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IBuildingEventInterface* GetDefaultObj();

	void ServerOnly_OnSpawnStructure(struct FGameplayAbilityTargetDataHandle& TargetData, struct FStructureAssetReference& StructureReference, bool IgnoreStructureBudgets);
	void OnStructureSpawned(class UObject* SpawnedStructure);
	void OnStructureDeconstructed();
	void OnStartPlacing(struct FStructureAssetReference& StructureReference);
	void OnStartMovement(class UObject* Structure);
	void OnStartDeconstruct(class UObject* Structure);
	void OnStartCopy(class UObject* Structure);
	void OnStartBuilding();
	void OnPlacePreviewStructure(struct FGameplayAbilityTargetDataHandle& TargetData, struct FStructureAssetReference& StructureReference, bool IgnoreStructureBudgets);
	void OnPlacementConfirmed(bool bRefire);
	void OnPlacementCancelled(struct FStructureAssetReference& StructureReference, enum class EBuildingFeedback FeedbackId);
	void OnMovementConfirmed(class UObject* MovingStructure);
	void OnMovementCancelled(class UObject* MovingStructure, enum class EBuildingFeedback FeedbackId);
	void OnEndBuilding(enum class EBuildingFeedback FeedbackId);
	void OnDeconstructConfirmed();
	void OnDeconstructCancelled(enum class EBuildingFeedback FeedbackId);
	void OnCopyConfirmed();
	void OnCopyCancelled(enum class EBuildingFeedback FeedbackId);
};

// 0x50 (0x80 - 0x30)
// Class NWX.BuildingFeedbackDescriptions
class UBuildingFeedbackDescriptions : public UDataAsset
{
public:
	TMap<enum class EBuildingFeedback, class FText> Descriptions;                                      // 0x30(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBuildingFeedbackDescriptions* GetDefaultObj();

	class FText GetFeedbackDescription(enum class EBuildingFeedback FeedbackId);
};

// 0x0 (0x28 - 0x28)
// Class NWX.BuildingInterface
class IBuildingInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IBuildingInterface* GetDefaultObj();

	void StructureSpawned(class UObject* SpawnedStructure);
	void StructureDeconstructed();
	void StartPlacing(struct FStructureAssetReference& StructureReference, bool bRefire);
	void StartMovement(class UObject* Structure);
	void StartDeconstruct(class UObject* Structure);
	void StartCopy(class UObject* Structure);
	void StartBuilding();
	void RemoveBuildingEventListener(TScriptInterface<class IBuildingEventInterface> Listener);
	void PlacePreviewStructure(struct FGameplayAbilityTargetDataHandle& TargetData, struct FStructureAssetReference& StructureReference, bool IgnoreStructureBudgets);
	void PlacementConfirmed();
	void PlacementCancelled(struct FStructureAssetReference& StructureReference, enum class EBuildingFeedback FeedbackId);
	void MovementConfirmed(class UObject* MovingStructure);
	void MovementCancelled(class UObject* MovingStructure, enum class EBuildingFeedback FeedbackId);
	bool IsPlacing();
	bool IsPlacementActionActive();
	bool IsMoving();
	bool IsDeconstructing();
	bool IsCopying();
	bool IsBuildingActionActive();
	bool IsBuilding();
	class UObject* GetOriginalStructureInMovement();
	void EndBuilding(enum class EBuildingFeedback FeedbackId);
	void DeconstructConfirmed();
	void DeconstructCancelled(enum class EBuildingFeedback FeedbackId);
	void CopyConfirmed();
	void CopyCancelled(enum class EBuildingFeedback FeedbackId);
	void ClientOnly_TryStartMovement(class UObject* Structure);
	void ClientOnly_TryStartCopy(class UObject* Structure);
	bool CanStartPlacing(struct FStructureAssetReference& StructureReference, enum class EBuildingFeedback* OutFeedbackId);
	bool CanStartMovement(class UObject* Structure, enum class EBuildingFeedback* OutFeedbackId);
	bool CanStartDeconstruct(class UObject* Structure, enum class EBuildingFeedback* OutFeedbackId);
	bool CanStartCopy(class UObject* Structure, enum class EBuildingFeedback* OutFeedbackId);
	bool CanSpawnStructure();
	void CancelAllPlacement(enum class EBuildingFeedback FeedbackId);
	void CancelAllBuilding(enum class EBuildingFeedback FeedbackId);
	void CacheTargetData(struct FGameplayAbilityTargetDataHandle& TargetData);
	void AddBuildingEventListener(TScriptInterface<class IBuildingEventInterface> Listener);
};

// 0x0 (0xA0 - 0xA0)
// Class NWX.BuildModeFeedbackComponent
class UBuildModeFeedbackComponent : public UActorComponent
{
public:

	static class UClass* StaticClass();
	static class UBuildModeFeedbackComponent* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class NWX.BuildModeFeedbackDataEntryBase
class UBuildModeFeedbackDataEntryBase : public UObject
{
public:
	bool                                         bEnabled;                                          // 0x28(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EBuildModeInput                   Input;                                             // 0x29(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_36F4[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBuildModeFeedbackDataEntryBase* GetDefaultObj();

	void SetEnabled(bool bEnabledIn);
	bool IsEnabled();
	enum class EBuildModeInput GetInput();
};

// 0x50 (0x78 - 0x28)
// Class NWX.BuildModeFeedbackDataBase
class UBuildModeFeedbackDataBase : public UObject
{
public:
	TMap<enum class EBuildModeAction, class UBuildModeFeedbackDataEntryBase*> Mappings;                                          // 0x28(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBuildModeFeedbackDataBase* GetDefaultObj();

	bool SetActionEnabled(enum class EBuildModeAction Action, bool bIsEnabled);
	void AddMapping(class UBuildModeFeedbackDataEntryBase* Entry, enum class EBuildModeAction Action);
};

// 0x18 (0x630 - 0x618)
// Class NWX.Button_Network
class UButton_Network : public UButton
{
public:
	bool                                         bDisableAfterClicked;                              // 0x618(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_37B9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxDisabledDuration;                               // 0x61C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_37BE[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UButton_Network* GetDefaultObj();

	void SetIsFocusable(bool CanFocus);
	void OnServerResponseReceived();
};

// 0x0 (0x28 - 0x28)
// Class NWX.CameraProviderInterface
class ICameraProviderInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class ICameraProviderInterface* GetDefaultObj();

	class USpringArmComponent* GetCameraSpringArm(enum class ECameraType CameraType);
	class UCameraComponent* GetCamera(enum class ECameraType CameraType);
};

// 0x58 (0xF8 - 0xA0)
// Class NWX.CameraWaterAudioComponent
class UCameraWaterAudioComponent : public UActorComponent
{
public:
	enum class ECollisionChannel                 WaterTraceChannel;                                 // 0xA0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ECollisionChannel                 TraversalTraceChannel;                             // 0xA1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3854[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        UnderwaterTestDistance;                            // 0xA4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        UnderwaterOffset;                                  // 0xA8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3857[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAkAudioEvent*                         WaterEnteredAudioEvent;                            // 0xB0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkAudioEvent*                         WaterExitedAudioEvent;                             // 0xB8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkAudioEvent*                         PlayerAscentStartedAudioEvent;                     // 0xC0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkRtpc*                               VerticalSpeedRTPC;                                 // 0xC8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAkRtpc*                               CameraDepthRTPC;                                   // 0xD0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        UnderwaterDepth;                                   // 0xD8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PlayerVerticalSpeed;                               // 0xDC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsUnderWater;                                     // 0xE0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsRising;                                         // 0xE1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3872[0x16];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraWaterAudioComponent* GetDefaultObj();

	class UScopedAkComponent* FindAudioEventTarget();
};

// 0x0 (0x28 - 0x28)
// Class NWX.CanTraverseInterface
class ICanTraverseInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class ICanTraverseInterface* GetDefaultObj();

	bool CanTraverse();
	bool CanClimb();
};

// 0x0 (0x2A0 - 0x2A0)
// Class NWX.CavernChamber
class ACavernChamber : public AActor
{
public:

	static class UClass* StaticClass();
	static class ACavernChamber* GetDefaultObj();

};

// 0x0 (0x2B0 - 0x2B0)
// Class NWX.CavernChamberCollisionHull
class ACavernChamberCollisionHull : public AStaticMeshActor
{
public:

	static class UClass* StaticClass();
	static class ACavernChamberCollisionHull* GetDefaultObj();

};

// 0x38 (0x378 - 0x340)
// Class NWX.CavernModularLevelProxy
class ACavernModularLevelProxy : public ALevelInstance
{
public:
	enum class ECavernModularLevelProxyType      Type;                                              // 0x340(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_38F0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UPOIDefinitionAsset>    POIDefinition;                                     // 0x348(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        POIRegion;                                         // 0x370(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_38F5[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ACavernModularLevelProxy* GetDefaultObj();

};

// 0x38 (0x2D8 - 0x2A0)
// Class NWX.CavernSocket
class ACavernSocket : public AActor
{
public:
	TSoftObjectPtr<class ACavernModularLevelProxy> DynamicLevel;                                      // 0x2A0(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class ACavernSocket>>  ValidExits;                                        // 0x2C8(0x10)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ACavernSocket* GetDefaultObj();

};

// 0x10 (0x2B8 - 0x2A8)
// Class NWX.CavernWallSpline
class ACavernWallSpline : public ASpline
{
public:
	TArray<class UInstancedStaticMeshComponent*> MeshComponents;                                    // 0x2A8(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, ContainsInstancedReference, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ACavernWallSpline* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class NWX.CavernWallTemplate
class UCavernWallTemplate : public UPrimaryDataAsset
{
public:

	static class UClass* StaticClass();
	static class UCavernWallTemplate* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.CharacterCreateTelemetryFunctionLibrary
class UCharacterCreateTelemetryFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UCharacterCreateTelemetryFunctionLibrary* GetDefaultObj();

	void TelemetryCharacterCreateStart(const class FString& ProfileId, const class FString& SessionId, const class FString& StartingArchetype, bool bExistingCharacter);
	void TelemetryCharacterCreateFinish(const class FString& ProfileId, const class FString& SessionId, int32& TotalTimeSpent, bool bWasCancelled);
	void TelemetryCharacterCreateExitPanel(const class FString& ProfileId, const class FString& SessionId, const class FString& PanelName, TMap<class FString, struct FCharacterCreateTelemetryValuePairs>& Options, int32& TimeSpent);
};

// 0x0 (0xA0 - 0xA0)
// Class NWX.CharacterCustomizationComponent
class UCharacterCustomizationComponent : public UActorComponent
{
public:

	static class UClass* StaticClass();
	static class UCharacterCustomizationComponent* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.CharacterDissolveInterface
class ICharacterDissolveInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class ICharacterDissolveInterface* GetDefaultObj();

	void StartDissolve(bool bDissolveIn, enum class ECharacterDissolveType DissolveType);
};

// 0x8 (0xA8 - 0xA0)
// Class NWX.CharacterEmoteComponent
class UCharacterEmoteComponent : public UActorComponent
{
public:
	class UEmoteDataAsset*                       CurrentEmote;                                      // 0xA0(0x8)(ZeroConstructor, Transient, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UCharacterEmoteComponent* GetDefaultObj();

	void Server_UseEmote(TSoftObjectPtr<class UEmoteDataAsset>& EmoteDataAsset);
	void Server_OnEmoteFinished();
	void Server_InterruptEmote();
	void PerformInterruptEmote();
	void PerformEmoteAction(class UEmoteDataAsset* EmoteDataAsset);
	void OnMontageEnd(class UAnimMontage* Montage, bool bInterrupted);
	void OnMontageBegin(class UAnimMontage* Montage);
};

// 0x0 (0x28 - 0x28)
// Class NWX.CharacterEmoteInterface
class ICharacterEmoteInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class ICharacterEmoteInterface* GetDefaultObj();

	void UseEmote(TSoftObjectPtr<class UEmoteDataAsset>& Emote);
	void UnbindFrom_EmoteStartedDelegate(FDelegateProperty_& EmoteStartedDelegate);
	void UnbindFrom_EmoteEndedDelegate(FDelegateProperty_& EmoteEndedDelegate);
	void PrepareForEmotePlayback();
	void OnEmoteStarted(TSoftObjectPtr<class UEmoteDataAsset>& Emote);
	void OnEmoteEnded(TSoftObjectPtr<class UEmoteDataAsset>& Emote);
	bool IsUsingEmote();
	void InterruptCurrentEmote();
	void GetEmoteRadialMenuEntries(TArray<TScriptInterface<class IRadialMenuInterface>>* OutEmoteRadialMenuEntries);
	class UAnimInstance* GetAnimInstanceForEmotePlayback();
	bool CanUseEmote(TSoftObjectPtr<class UEmoteDataAsset>& Emote);
	bool CanUseAnyEmotes();
	void BindTo_EmoteStartedDelegate(FDelegateProperty_& EmoteStartedDelegate);
	void BindTo_EmoteEndedDelegate(FDelegateProperty_& EmoteEndedDelegate);
};

// 0x0 (0x28 - 0x28)
// Class NWX.CharacteristicDataReferenceFunctionLibrary
class UCharacteristicDataReferenceFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UCharacteristicDataReferenceFunctionLibrary* GetDefaultObj();

	bool NotEqual_FCharacteristicDataReference(struct FCharacteristicDataReference& A, struct FCharacteristicDataReference& B);
	struct FCharacteristicDataReference MakeCharacteristicReferenceFromAsset(TSoftObjectPtr<class UCharacteristicDataAsset>& Asset);
	bool IsValid(struct FCharacteristicDataReference& CharacteristicReference);
	void GetDebugStringFromCharacteristicDataReferenceArray(TArray<struct FCharacteristicDataReference>& CharacteristicReferences, class FString* OutString);
	bool EqualEqual_FCharacteristicDataReference(struct FCharacteristicDataReference& A, struct FCharacteristicDataReference& B);
};

// 0x0 (0xA0 - 0xA0)
// Class NWX.CharacterPerksComponent
class UCharacterPerksComponent : public UActorComponent
{
public:

	static class UClass* StaticClass();
	static class UCharacterPerksComponent* GetDefaultObj();

	void SendDamageEventInfo(struct FGameplayTagContainer& EventTags, struct FHitResult& HitResult);
};

// 0x58 (0xF8 - 0xA0)
// Class NWX.CharacterWeightComponent
class UCharacterWeightComponent : public UActorComponent
{
public:
	uint8                                        Pad_410D[0x58];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCharacterWeightComponent* GetDefaultObj();

	void OnContainerItemsChanged(TScriptInterface<class IItemContainer>& Source, struct FInventoryEntry& Item, int32 Quantity);
	void Initialize(class UAbilitySystemComponent* ASC, TScriptInterface<class IItemContainer>& ContainerToWatch);
};

// 0x28 (0x58 - 0x30)
// Class NWX.CheckpointVolumeDataAsset
class UCheckpointVolumeDataAsset : public UDataAsset
{
public:
	class URequirement*                          TriggerRequirements;                               // 0x30(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoClear, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRespawnPointIsExclusive;                          // 0x38(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_412A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UVolumeAVFXDataAsset*                  LoopAVFX;                                          // 0x40(0x8)(Edit, ZeroConstructor, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVolumeAVFXDataAsset*                  TriggeredAVFX;                                     // 0x48(0x8)(Edit, ZeroConstructor, NoClear, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVolumeTelemetryDataAsset*             TriggeredTelemetry;                                // 0x50(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCheckpointVolumeDataAsset* GetDefaultObj();

};

// 0x60 (0x300 - 0x2A0)
// Class NWX.CheckpointVolume
class ACheckpointVolume : public AActor
{
public:
	uint8                                        Pad_41D2[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UCheckpointVolumeDataAsset*            DataAsset;                                         // 0x2B8(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x2C0(0x8)(ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBoxComponent*                         CollisionVolume;                                   // 0x2C8(0x8)(Edit, ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVolumeAVFXComponent*                  VolumeAVFX;                                        // 0x2D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ANWXPlayerStart*                       UnlockablePlayerStart;                             // 0x2D8(0x8)(Net, ZeroConstructor, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsUnlocked;                                       // 0x2E0(0x1)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_41DF[0x1F];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ACheckpointVolume* GetDefaultObj();

	void OnWorldPersistenceLoadCompleteHandler(enum class E_WorldPersistenceLoadState LoadState);
	void OnOverlapBegin(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void OnLockStateChanged();
	void Multicast_PlayTriggeredEffect();
	class UVolumeAVFXComponent* GetVolumeAVFXComponent();
};

// 0x50 (0x80 - 0x30)
// Class NWX.CHRAttributeModifierMapAsset
class UCHRAttributeModifierMapAsset : public UPrimaryDataAsset
{
public:
	TMap<struct FCharacteristicAndQuality, struct FItemAttributeModifierReference> CharacteristicAttributeMap;                        // 0x30(0x50)(Edit, DisableEditOnTemplate, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCHRAttributeModifierMapAsset* GetDefaultObj();

};

// 0x20 (0x50 - 0x30)
// Class NWX.ClientProximityDataAsset
class UClientProximityDataAsset : public UDataAsset
{
public:
	class URequirement*                          ProximityRequirements;                             // 0x30(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoClear, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ProximityRadius;                                   // 0x38(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4212[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCurveTableRowHandle                  LerpCurveTable;                                    // 0x40(0x10)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UClientProximityDataAsset* GetDefaultObj();

};

// 0x38 (0xD8 - 0xA0)
// Class NWX.ClientProximityComponent
class UClientProximityComponent : public UActorComponent
{
public:
	class UClientProximityDataAsset*             DataAsset;                                         // 0xA0(0x8)(Edit, Net, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USphereComponent*                      ProximityVolume;                                   // 0xA8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<TWeakObjectPtr<class AActor>>         OverlappingActors;                                 // 0xB0(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4295[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UClientProximityComponent* GetDefaultObj();

	void RegisterForProximityUpdates(FDelegateProperty_& Delegate);
	void OnOverlapEnd(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnOverlapBegin(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void DeregisterFromProximityUpdates(FDelegateProperty_& Delegate);
};

// 0x0 (0x28 - 0x28)
// Class NWX.CollisionEventVolumeInterface
class ICollisionEventVolumeInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class ICollisionEventVolumeInterface* GetDefaultObj();

};

// 0x38 (0x68 - 0x30)
// Class NWX.CollisionVolumeDataAsset
class UCollisionVolumeDataAsset : public UDataAsset
{
public:
	class URequirement*                          InteractionRequirements;                           // 0x30(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoClear, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGameplayAbility>          InteractionAbility;                                // 0x38(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoClear, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  InteractionFeedback;                               // 0x40(0x18)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UVolumeAVFXDataAsset*                  ClosedAVFX;                                        // 0x58(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UVolumeAVFXDataAsset*                  OpenedAVFX;                                        // 0x60(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCollisionVolumeDataAsset* GetDefaultObj();

};

// 0x60 (0x300 - 0x2A0)
// Class NWX.CollisionVolume
class ACollisionVolume : public AActor
{
public:
	uint8                                        Pad_431D[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UCollisionVolumeDataAsset*             DataAsset;                                         // 0x2C0(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x2C8(0x8)(ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBoxComponent*                         CollisionVolume;                                   // 0x2D0(0x8)(Edit, ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVolumeAVFXComponent*                  VolumeAVFX;                                        // 0x2D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UNWXAbilitySystemComponent*            AbilitySystem;                                     // 0x2E0(0x8)(ExportObject, Net, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsCollisionActive;                                // 0x2E8(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4321[0x17];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ACollisionVolume* GetDefaultObj();

	void TryInteract(class AActor* OtherActor);
	void OnRep_IsCollisionActive();
	bool IsInteractable();
	class UVolumeAVFXComponent* GetVolumeAVFXComponent();
	class FText GetInteractionFeedback();
};

// 0x110 (0x1B0 - 0xA0)
// Class NWX.CombatAnalyserComponent
class UCombatAnalyserComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            ClientOnCombatIntensityUpdated;                    // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TMap<class UActorAudioBucket*, struct FCombatBin> CombatBins;                                        // 0xB0(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        NearbyAllyRadius;                                  // 0x100(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4434[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class AActor*, float>                   EnemiesInCombat;                                   // 0x108(0x50)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	TMap<class UActorAudioBucket*, int32>        ClientCombatScores;                                // 0x158(0x50)(BlueprintVisible, Protected, NativeAccessSpecifierProtected)
	float                                        CombatIntensity;                                   // 0x1A8(0x4)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_443A[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCombatAnalyserComponent* GetDefaultObj();

	bool TryGetCombatAnalysersInRadius(struct FVector& Location, float Radius, TArray<class UCombatAnalyserComponent*>* OutCombatAnalysers);
	bool TryFindBucketsForActor(class AActor* Actor, struct FActorAudioBucketContainer* OutBuckets);
	void TriggerCombatIntensityUpdate();
	void TrackEnemyInCombat(class AActor* Enemy);
	void PruneEnemiesInCombat();
	void OnRep_CombatIntensity();
	int32 GetCombatScoreForBucket(class UActorAudioBucket* Bucket);
	bool DoesBucketHaveLiveEnemies(class UActorAudioBucket* Bucket);
	bool DoesActorTypeMatchBucket(class AActor* Actor, class UActorAudioBucket* CreatureAudioBucket);
	float CalculateCombatIntensity(struct FConstActorContainer& EnemyActors, struct FVector& PlayerLocation, float NearbyPlayerRadius);
};

// 0x0 (0x28 - 0x28)
// Class NWX.CombatBlueprintFunctionLibrary
class UCombatBlueprintFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UCombatBlueprintFunctionLibrary* GetDefaultObj();

	void PredictMeleeHits(class ANWXPlayerCharacter* PlayerCharacter, class AEquippableItem* EquippableItem, class UAnimMontage* Montage, enum class ETraceTypeQuery TraceType, struct FPredictedHitResultsData* OutHitResults, class FName& SectionName, float TraceRadius, float ForwardTraceRadiusScale, bool bThirdPerson);
	bool CheckPredictions(bool bHasHit, TArray<struct FHitResult>& RealtimeHits, TArray<struct FHitResult>& PredictedHits, struct FVector& LastLocation, struct FVector& NewLocation, float TraceRadius, TArray<struct FHitResult>* OutTemporaryHits);
	void CalculateCreatureSphere(struct FVector& Principal, struct FVector& Extent, struct FVector& Creature, float TraceRadius, struct FVector* OutTraceLocation, float* OutRadius);
	void CalculateAdjustedTraceEnd(struct FVector& MeleeAttackSocketLocation, struct FVector& AttackerPointOfViewSocketLocation, float TraceRadius, float ForwardTraceRadiusScale, struct FVector* OutVector);
	bool AreHitPredictionsUsed(struct FVector& LastLocation, struct FVector& NewLocation, TArray<struct FHitResult>& PredictedHitResults, float TraceRadius, TArray<struct FHitResult>* ChosenResults);
};

// 0x128 (0x220 - 0xF8)
// Class NWX.CompanionManagementComponent
class UCompanionManagementComponent : public UPersistentDataComponent
{
public:
	FMulticastInlineDelegateProperty_            LeaderRecruitedCompanionDelegate;                  // 0xF8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            LeaderDismissedCompanionDelegate;                  // 0x108(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AActor*                                CurrentCompanion;                                  // 0x118(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bHasCompanion;                                     // 0x120(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4601[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCompanionPersistenceData             CurrentCompanionData;                              // 0x128(0x98)(SaveGame, NativeAccessSpecifierPrivate)
	class UEnvQuery*                             CompanionRespawnEQS;                               // 0x1C0(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AController*                           OwnerController;                                   // 0x1C8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4604[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCompanionManagementComponent* GetDefaultObj();

	void UnequipItemOnCompanion(struct FInventoryEntry& Item);
	void Server_UnequipItemOnCompanion(struct FInventoryEntry& Item);
	void Server_EquipItemOnCompanion(struct FInventoryEntry& Item);
	void OnCompanionLoadoutUpdated(struct FGuid& ItemId, bool bWasEquipped);
	void OnCompanionInventoryUpdated();
	void OnCompanionDestroyed(class AActor* DestroyedActor);
	bool HasCompanion();
	class AActor* GetCurrentCompanion();
	void EquipItemOnCompanion(struct FInventoryEntry& Item);
};

// 0xF8 (0x3A0 - 0x2A8)
// Class NWX.MapPinComponent
class UMapPinComponent : public USceneComponent
{
public:
	uint8                                        Pad_464E[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGuid                                 MapPinId;                                          // 0x2B0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsAlwaysVisible;                                  // 0x2C0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4653[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   MapPinPresentationDataHandle;                      // 0x2C8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, SaveGame, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStartEnabled;                                     // 0x2D8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4658[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        UpdateFrequency;                                   // 0x2DC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsLocationEnabled;                                // 0x2E0(0x1)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_465D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FMapPinData                           MapPinData;                                        // 0x2E8(0xA8)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FTimerHandle                          Auth_LocationUpdateTimerHandle;                    // 0x390(0x8)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        UpdateDistanceThreshold;                           // 0x398(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4660[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UMapPinComponent* GetDefaultObj();

	bool IsMapPinPresentationDataHandleValid();
	bool IsMapPinEnabled();
	struct FMapPinData GetMapPinData();
	void Auth_SetPresentationData(struct FDataTableRowHandle& RowHandle);
	void Auth_SetMapPinEnabled(bool bIsEnabledParameter);
};

// 0x10 (0x3B0 - 0x3A0)
// Class NWX.CompanionMapPinComponent
class UCompanionMapPinComponent : public UMapPinComponent
{
public:
	uint8                                        Pad_4666[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCompanionMapPinComponent* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.CompassDynamicDataProviderInterface
class ICompassDynamicDataProviderInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class ICompassDynamicDataProviderInterface* GetDefaultObj();

	void GetCompassHoverLabel(class FString* OutString);
	void GetCompassHoverDescription(class FString* OutString);
};

// 0x0 (0x28 - 0x28)
// Class NWX.ObjectWithWorld
class UObjectWithWorld : public UObject
{
public:

	static class UClass* StaticClass();
	static class UObjectWithWorld* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.NWXObjectComponent
class UNWXObjectComponent : public UObjectWithWorld
{
public:

	static class UClass* StaticClass();
	static class UNWXObjectComponent* GetDefaultObj();

	void K2_GetOwner(TSubclassOf<class UObject> OwnerClass, class UObject** OutOwner);
};

// 0x0 (0x28 - 0x28)
// Class NWX.StructureObjectComponent
class UStructureObjectComponent : public UNWXObjectComponent
{
public:

	static class UClass* StaticClass();
	static class UStructureObjectComponent* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.CompositePieceComponent
class UCompositePieceComponent : public UStructureObjectComponent
{
public:

	static class UClass* StaticClass();
	static class UCompositePieceComponent* GetDefaultObj();

	void GetPieceData(struct FCompositePieceGameplay* OutPieceData);
	class UStructureCompositePiece* GetOwner();
};

// 0x0 (0x28 - 0x28)
// Class NWX.CompositePieceDataProviderInterface
class ICompositePieceDataProviderInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class ICompositePieceDataProviderInterface* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.MeshObject
class UMeshObject : public UObjectWithWorld
{
public:

	static class UClass* StaticClass();
	static class UMeshObject* GetDefaultObj();

	void TEMP_HasTag(class FName& Tag, bool* HasTag);
	struct FVector GetMeshWorldExtents();
	void GetMeshTransform(struct FTransform* WorldTransform);
	void GetMeshOrigin(struct FVector* LocalLocation, struct FVector* WorldLocation);
	void GetMeshMinAndMax(struct FVector* MinLocal, struct FVector* MaxLocal, struct FVector* MinWorld, struct FVector* MaxWorld);
	struct FVector GetMeshBounds();
};

// 0x0 (0x28 - 0x28)
// Class NWX.StaticMeshGroupObjectBase
class UStaticMeshGroupObjectBase : public UMeshObject
{
public:

	static class UClass* StaticClass();
	static class UStaticMeshGroupObjectBase* GetDefaultObj();

};

// 0xA8 (0xD0 - 0x28)
// Class NWX.CompositePieceInstance
class UCompositePieceInstance : public UStaticMeshGroupObjectBase
{
public:
	class UBoxComponent*                         ConstructionDetectionBox;                          // 0x28(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UStructureMeshesContainer*             MeshesContainer;                                   // 0x30(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        InstanceIndex;                                     // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4813[0x64];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UAcousticOpeningComponent*>     AcousticOpeningComponents;                         // 0xA0(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<class UNiagaraComponent*>             NiagaraComponents;                                 // 0xB0(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UPointLightComponent*                  LightComponent;                                    // 0xC0(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4818[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCompositePieceInstance* GetDefaultObj();

	void ResetAllMaterialsToDefault();
	bool K2_SetTransform(struct FTransform& NewTransform, bool bSweep, struct FHitResult* SweepHitResult, bool bTeleport);
	void K2_OnInitialized();
	struct FTransform GetRootTransform();
	void GetMeshes(TArray<class UStaticMeshComponent*>* OutMeshes);
	void GetAudioGeometryComponents(TArray<class UDynamicAkGeometryComponent*>* AudioGeometryComponentsOut);
	void EnsureFallbackMeshes(bool bForceUseFallback);
	void AddAudioReflectionsToMeshComponents();
};

// 0x0 (0x28 - 0x28)
// Class NWX.CompositePieceOwner
class ICompositePieceOwner : public IInterface
{
public:

	static class UClass* StaticClass();
	static class ICompositePieceOwner* GetDefaultObj();

};

// 0x10 (0x38 - 0x28)
// Class NWX.CompositePieceSnapObject
class UCompositePieceSnapObject : public UObjectWithWorld
{
public:
	class UStructureGridComponent*               SnapComponent;                                     // 0x28(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        PieceId;                                           // 0x30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4C1D[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCompositePieceSnapObject* GetDefaultObj();

	bool ValidateSnapPlacementData(struct FSnapPlacementTargetData& SnapData);
	void ResolvePotentiallyOccupiedGridPoints();
	void ResolveOccupiedSnapPoints();
	bool RemoveOccupyingStructureFromStructureAttachments(class UObject* OccupyingStructure);
	bool RemoveGridPointOccupyingStructure(struct FGridPoint& GridPointRef, class UObject* OccupyingStructure);
	bool IsGridPointIndexValid(int32 Index);
	bool GetTargetDataForTargetSnapPoint(class UObject* OtherActor, struct FGridPoint& OtherSnapPoint, struct FGameplayAbilityTargetDataHandle* TargetData);
	TArray<struct FGridPoint> GetStaticGridPoints();
	enum class ESnapType GetSnapType();
	class USnapRulesEnforcer* GetSnapRulesEnforcer();
	bool GetSnapPlacementTransform(class ACharacter* ControllingCharacter, struct FGameplayAbilityTargetDataHandle* SnapTargetData);
	void GetSnapData(struct FPieceSnapPoints* SnapData);
	class UStructureGridComponent* GetSnapComponent();
	struct FTransform GetRelativeTransformBetweenSnapPoints(struct FGameplayAbilityTargetDataHandle& SnapData);
	bool GetPlacementRequiresSnap();
	enum class ESnapType GetOwningStructureType();
	class UObject* GetOwner();
	int32 GetNumGridPoints();
	struct FGridPoint GetMatchingGridPointForPiece(class UObject* OtherPiece, struct FGridPoint& OtherPieceGridPoint);
	TArray<struct FGridPoint> GetGridPoints();
	void GetGridPointOccupyingStructures(struct FGridPoint& GridPointRef, TArray<class UObject*>* OccupyingStructures);
	struct FGridPoint GetGridPointById(struct FSnapPointId& ID);
	struct FGridPoint GetGridPoint(int32 Index);
	void GetAllUnoccupiedSnapPointsOfType(enum class ESnapType SnapType, TArray<struct FGridPoint>* MatchingSnapPoints);
	void GetAllSnapPointsOfType(enum class ESnapType SnapType, TArray<struct FGridPoint>* MatchingSnapPoints);
	void GetAllSnapPointIndexesAllowingType(enum class ESnapType SnapType, TArray<int32>* AllAcceptableSnapIndexes);
	void GetAllConnectedStructures(TArray<class UObject*>* ConnectedStructures);
	TSet<enum class ESnapType> GetAcceptableStructuresSetForPiece();
	int32 FindGridPointIndex(struct FGridPoint& GridPoint);
	void ChooseCandidateSnapPoint(TArray<struct FGridPoint>& SnapPoints, class ACharacter* Character, enum class ESnapType SnapPointType, struct FGridPoint* SnapPoint);
	bool CanAttachSnapPoints(struct FGridPoint& SourcePoint, struct FGridPoint& TargetPoint);
	struct FTransform CalculateSnapTransformForGridPoints(struct FGridPoint& ReferencePoint, struct FGridPoint& PointToSnap);
	void AttachToOtherSnapObject(class UCompositePieceSnapObject* OtherSnapObject, struct FGridPoint& OtherSnapPoint, int32 MyGridPointIndex);
	bool AddGridPointOccupyingStructure(struct FGridPoint& GridPointRef, class UObject* OccupyingStructure);
};

// 0x10 (0x48 - 0x38)
// Class NWX.CompositePieceProxySnapObject
class UCompositePieceProxySnapObject : public UCompositePieceSnapObject
{
public:
	class UGridComponentProxy*                   GridComponent;                                     // 0x38(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USnapRulesEnforcer*                    SnapRulesEnforcer;                                 // 0x40(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UCompositePieceProxySnapObject* GetDefaultObj();

};

// 0x18 (0x48 - 0x30)
// Class NWX.ConditionalItemRewards
class UConditionalItemRewards : public UDataAsset
{
public:
	class UItemReward*                           DefaultItemReward;                                 // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FItemRewardWithRequirements>   RealmSpecificRewards;                              // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UConditionalItemRewards* GetDefaultObj();

};

// 0x10 (0x3B0 - 0x3A0)
// Class NWX.ConditionalMapPinComponent
class UConditionalMapPinComponent : public UMapPinComponent
{
public:
	uint8                                        Pad_4CFA[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UConditionalMapPinComponent* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.ConditionalRewardFunctionLibrary
class UConditionalRewardFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UConditionalRewardFunctionLibrary* GetDefaultObj();

	void AwardConditionalRewards(class APlayerState* PlayerState, TArray<struct FConditionalReward>& PotentialRewards, class UObject* SenderContextObject, TArray<struct FConditionalReward>* OutAwardedRewards, int32 NumberOfAwards);
};

// 0x0 (0x30 - 0x30)
// Class NWX.EncounterRewardDataAsset
class UEncounterRewardDataAsset : public UDataAsset
{
public:

	static class UClass* StaticClass();
	static class UEncounterRewardDataAsset* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class NWX.FactionRewardSet
class UFactionRewardSet : public UEncounterRewardDataAsset
{
public:
	TArray<struct FConditionalReward>            PotentialRewards;                                  // 0x30(0x10)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UFactionRewardSet* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class NWX.ConditionalRewardSet
class UConditionalRewardSet : public UEncounterRewardDataAsset
{
public:
	TArray<struct FRealmRewardSet>               ConditionalSets;                                   // 0x30(0x10)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UConditionalRewardSet* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class NWX.ConditionChallengeCompleted
class UConditionChallengeCompleted : public UConditionBehaviour
{
public:
	TSoftObjectPtr<class UChallengeDataAsset>    ChallengeDataAsset;                                // 0x70(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4E5F[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UConditionChallengeCompleted* GetDefaultObj();

	void OnChallengeCompleted(struct FExperienceStateID& ChallengeID);
};

// 0x20 (0x90 - 0x70)
// Class NWX.ConditionCreatureSuppression
class UConditionCreatureSuppression : public UConditionBehaviour
{
public:
	uint8                                        Pad_4E81[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UConditionCreatureSuppression* GetDefaultObj();

};

// 0x18 (0x88 - 0x70)
// Class NWX.ConditionDayNight
class UConditionDayNight : public UConditionBehaviour
{
public:
	uint8                                        Pad_4ED2[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UConditionDayNight* GetDefaultObj();

	void OnDayNightChangedHandler(bool bIsNight);
};

// 0x0 (0x28 - 0x28)
// Class NWX.ConditionDayNightInterface
class IConditionDayNightInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IConditionDayNightInterface* GetDefaultObj();

	bool GetTargetIsNight(bool* bTargetIsNight);
};

// 0x18 (0x88 - 0x70)
// Class NWX.ConditionMapPinPlaced
class UConditionMapPinPlaced : public UConditionBehaviour
{
public:
	int32                                        CountThreshold;                                    // 0x70(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4F2A[0x14];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UConditionMapPinPlaced* GetDefaultObj();

};

// 0x8 (0x90 - 0x88)
// Class NWX.ConditionMapPinPlacedAboveHeight
class UConditionMapPinPlacedAboveHeight : public UConditionMapPinPlaced
{
public:
	float                                        HeightThreshold;                                   // 0x88(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4F51[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UConditionMapPinPlacedAboveHeight* GetDefaultObj();

};

// 0x10 (0x98 - 0x88)
// Class NWX.ConditionMapPinPlacedNearPoi
class UConditionMapPinPlacedNearPoi : public UConditionMapPinPlaced
{
public:
	TArray<enum class EPOIType>                  AllowedPOITypes;                                   // 0x88(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UConditionMapPinPlacedNearPoi* GetDefaultObj();

};

// 0x98 (0x108 - 0x70)
// Class NWX.ConditionPlayerAttribute
class UConditionPlayerAttribute : public UConditionBehaviour
{
public:
	enum class ENWXMathComparison                ThresholdTarget;                                   // 0x70(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAttributeThresholdType           ThresholdType;                                     // 0x71(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4FC8[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TargetValue;                                       // 0x74(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TargetPercentage;                                  // 0x78(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4FD6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayAttribute                    TargetGameplayAttribute;                           // 0x80(0x38)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayAttribute                    MaxGameplayAttribute;                              // 0xB8(0x38)(Edit, DisableEditOnTemplate, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CurrentAttribute;                                  // 0xF0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4FE8[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ANWXPlayerState*                       ContextPlayerState;                                // 0x100(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UConditionPlayerAttribute* GetDefaultObj();

	void OnPawnSetOnPlayerState(class APlayerState* Player, class APawn* NewPawn, class APawn* OldPawn);
};

// 0x0 (0x28 - 0x28)
// Class NWX.ConditionPOIListenerInterface
class IConditionPOIListenerInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IConditionPOIListenerInterface* GetDefaultObj();

	bool GetRequiredMatches(int32* RequiredMatches);
	bool GetRequiredGameplayTag(struct FGameplayTag* RequiredTag);
	bool GetMaxSearchDistance(float* MaxSearchDistance);
	bool GetEncounterManager(class UObject** Manager);
};

// 0x28 (0x98 - 0x70)
// Class NWX.ConditionProximity
class UConditionProximity : public UConditionBehaviour
{
public:
	uint8                                        Pad_5114[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UConditionProximity* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.ConditionProximityInterface
class IConditionProximityInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IConditionProximityInterface* GetDefaultObj();

	bool GetRadius(float* Radius);
	bool GetNumRequiredPlayers(int32* NumRequiredPlayers);
	bool GetLocation(struct FVector* Location);
};

// 0x20 (0x90 - 0x70)
// Class NWX.ConditionRealmHasAllTags
class UConditionRealmHasAllTags : public UConditionBehaviour
{
public:
	struct FGameplayTagContainer                 RealmCardTags;                                     // 0x70(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UConditionRealmHasAllTags* GetDefaultObj();

};

// 0x50 (0xC0 - 0x70)
// Class NWX.ConditionRealmMeetsRequirement
class UConditionRealmMeetsRequirement : public UConditionBehaviour
{
public:
	struct FRealmPlacementRequirement            Requirement;                                       // 0x70(0x50)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UConditionRealmMeetsRequirement* GetDefaultObj();

};

// 0x10 (0x80 - 0x70)
// Class NWX.ConditionTimeout
class UConditionTimeout : public UConditionBehaviour
{
public:
	int32                                        TimeoutInSeconds;                                  // 0x70(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5220[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UConditionTimeout* GetDefaultObj();

};

// 0xF0 (0x120 - 0x30)
// Class NWX.ConeEffectDataAsset
class UConeEffectDataAsset : public UDataAsset
{
public:
	class UNiagaraSystem*                        NiagaraSystem;                                     // 0x30(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAkAudioEvent>          AudioHeadEvent;                                    // 0x38(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAkAudioEvent>          AudioTailEvent;                                    // 0x60(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAkAudioEvent>          AudioLoopEvent;                                    // 0x88(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAkAudioEvent>          AudioLoopStopEvent;                                // 0xB0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ConeLength;                                        // 0xD8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ConeHalfAngle;                                     // 0xDC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumPointsPerBand;                                  // 0xE0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxDistanceBetweenAudioSources;                    // 0xE4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeBetweenAudioUpdates;                           // 0xE8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SimplifyBeyondDistance;                            // 0xEC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EmitterLaunchVelocity;                             // 0xF0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EmitterTailVelocity;                               // 0xF4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              EmitterOrientation;                                // 0xF8(0x18)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bUpdateOrientationImmediately;                     // 0x110(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bResizeConeDynamically;                            // 0x111(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5290[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinConeLength;                                     // 0x114(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxConeLength;                                     // 0x118(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5293[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UConeEffectDataAsset* GetDefaultObj();

};

// 0x2D8 (0xAF0 - 0x818)
// Class NWX.ConeEffectsContainer
class UConeEffectsContainer : public UNiagaraComponent
{
public:
	TSoftObjectPtr<class UConeEffectDataAsset>   ConeEffectsData;                                   // 0x818(0x28)(Edit, BlueprintVisible, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FConeEffectsAudioInstance>     AudioInstances;                                    // 0x840(0x10)(ZeroConstructor, Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UAkAudioEvent*                         CachedAudioHeadEvent;                              // 0x850(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_54B7[0x28];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAkAudioEvent*                         CachedAudioTailEvent;                              // 0x880(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_54C1[0x28];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAkAudioEvent*                         CachedAudioLoopEvent;                              // 0x8B0(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_54C5[0x28];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAkAudioEvent*                         CachedAudioLoopStopEvent;                          // 0x8E0(0x8)(ZeroConstructor, Transient, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_54CB[0x208];                                   // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UConeEffectsContainer* GetDefaultObj();

	void UpdateDataAsset(TSoftObjectPtr<class UConeEffectDataAsset>& NewData);
	void UpdateConeEffectsAudio();
	void StopSystem();
	void SetEndOfCone(struct FVector& NewConeEnd);
	void OnSystemStoppedEmitting();
	void OnLastParticleDeath();
	void OnAudioLoaded();
	void NiagaraSystemStoppedEmitting(class UActorComponent* NSystem);
	void NiagaraSystemFinished(class UNiagaraComponent* NSystem);
	bool IsInitialised();
	void DataAssetLoaded();
	void BeginSystem();
	void AddIgnoredComponents(TArray<class UPrimitiveComponent*>& IgnoredComponents);
	void AddIgnoredComponent(class UPrimitiveComponent* IgnoredComponent);
};

// 0x0 (0xF8 - 0xF8)
// Class NWX.ConsumptionComponentBase
class UConsumptionComponentBase : public UPersistentDataComponent
{
public:

	static class UClass* StaticClass();
	static class UConsumptionComponentBase* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.ContainerRewardsInterface
class IContainerRewardsInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IContainerRewardsInterface* GetDefaultObj();

	void PopulateChest(TArray<struct FInventoryEntry>& ItemRewards);
};

// 0x0 (0x28 - 0x28)
// Class NWX.ContextObjectInterface
class IContextObjectInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IContextObjectInterface* GetDefaultObj();

	void GetContextObjects(TArray<class UObject*>* OutContextObjects);
	void GetContextActors(TArray<class AActor*>* OutContextActors);
};

// 0x0 (0x28 - 0x28)
// Class NWX.ControllerInteractionInterface
class IControllerInteractionInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IControllerInteractionInterface* GetDefaultObj();

	void UnbindEventFrom_OnNearbyInteractableRemoved(FDelegateProperty_& Event);
	void UnbindEventFrom_OnNearbyInteractableAdded(FDelegateProperty_& Event);
	class UObject* GetLastNearbyInteractableObject();
	int32 GetLastNearbyInteractableHitItem();
	class AActor* GetLastNearbyInteractableActor();
	class UObject* GetLastInteractedObject();
	class AActor* GetLastInteractedActor();
	void BindEventTo_OnNearbyInteractableRemoved(FDelegateProperty_& Event);
	void BindEventTo_OnNearbyInteractableAdded(FDelegateProperty_& Event);
};

// 0x20 (0x58 - 0x38)
// Class NWX.NWXCraftingSettings
class UNWXCraftingSettings : public UDeveloperSettings
{
public:
	class FString                                PrimarySlotTypeDataTablePath;                      // 0x38(0x10)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SlotTraitDataTablePath;                            // 0x48(0x10)(ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UNWXCraftingSettings* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class NWX.CraftingActorConstraintBehaviour
class UCraftingActorConstraintBehaviour : public UObject
{
public:
	enum class ECraftingActorConstraintSelection ActorToCheck;                                      // 0x28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_5847[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCraftingActorConstraintBehaviour* GetDefaultObj();

	bool IsConstraintMet(class AActor* Crafter, class AActor* Station);
};

// 0x48 (0x78 - 0x30)
// Class NWX.CraftingActorConstraint_TagQuery
class UCraftingActorConstraint_TagQuery : public UCraftingActorConstraintBehaviour
{
public:
	struct FGameplayTagQuery                     TagQuery;                                          // 0x30(0x48)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UCraftingActorConstraint_TagQuery* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.CraftingCheats
class UCraftingCheats : public UCheatManagerExtension
{
public:

	static class UClass* StaticClass();
	static class UCraftingCheats* GetDefaultObj();

	void GetResourceDistributionForCrafting(TMap<int32, struct FResourceDistributionList>* OutResourceDistribution);
};

// 0x8 (0xA8 - 0xA0)
// Class NWX.CraftingComponentBase
class UCraftingComponentBase : public UActorComponent
{
public:
	class ANWXPlayerController*                  OwningController;                                  // 0xA0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UCraftingComponentBase* GetDefaultObj();

	void CallCraftedItemReceived(struct FCraftingRecipeReference& RecipeReference, struct FInventoryEntry& ReceivedItem, int32& ReceivedRecipeQuantity);
};

// 0x200 (0x2A0 - 0xA0)
// Class NWX.CraftingCreationComponent
class UCraftingCreationComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnWorkbenchRecipesUpdated;                         // 0xA0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnScreenStateUpdated;                              // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnEntrySelected;                                   // 0xC0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCandidateEntryUpdated;                           // 0xD0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                        SearchStringUpdateTime;                            // 0xE0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SearchStringUpdateTimeIfEmpty;                     // 0xE4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	FMulticastInlineDelegateProperty_            OnCraftingCreationFilteredEntriesCompleted;        // 0xE8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	TArray<struct FGameplayTag>                  CraftingScreenCategories;                          // 0xF8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TMap<struct FCraftingRecipeReference, enum class ECraftingScreenState> RecipeToStateMap;                                  // 0x108(0x50)(Edit, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_5EE7[0x28];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UNWXMenuDataEntry*                     LastSelectedEntry;                                 // 0x180(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UNWXMenuDataEntry*                     CandidateEntry;                                    // 0x188(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_5EF6[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItemDataReference                    ItemReferenceEssence;                              // 0x1A0(0x80)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FItemDataReference                    ItemReferenceSpell;                                // 0x220(0x80)(Edit, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UCraftingCreationComponent* GetDefaultObj();

	void SetWorkbenchCraftingRecipes(TArray<struct FCraftingRecipeReference>& NewWorkbenchRecipes);
	void SetSearchString(const class FString& NewSearchString);
	void SetScreenState(enum class ECraftingScreenState NewState);
	void SetLastSelectedEntry(class UNWXMenuDataEntry* Entry);
	void SetFilterRefreshesPermissions(bool bAllowFilterAutoRefreshes);
	void SetCandidateEntry(bool IsActive, class UNWXMenuDataEntry* Entry);
	void RemoveFilter(TSubclassOf<class UNWXMenuDataEntryFilter>& FilterClass);
	void RemoveAllRemovableFilters();
	void OnSearchStringTimerFinished();
	void OnFilteringEntriesCompleted(struct FGameplayTag& Category, int32 TotalResults);
	bool IsSearchStringEmpty();
	bool IsFilterActive(TSubclassOf<class UNWXMenuDataEntryFilter>& FilterClass);
	TArray<struct FCraftingRecipeReference> GetWorkbenchCraftingRecipes();
	class UNWXMenuDataEntryCrafting* GetStateDependantCraftingEntry(class UNWXMenuDataEntry* Entry);
	class FString GetSearchString();
	TArray<struct FMenuDataRelevantFilter> GetRelevantFilters();
	class UNWXMenuDataEntry* GetLastSelectedEntry();
	struct FInventoryEntry GetItemEntryFromModifier(struct FInstancedItemAttributeModifier& Modifier);
	int32 GetFilteredEntryCount();
	void GetFilteredEntries(TArray<class UNWXMenuDataEntry*>* OutEntries);
	struct FGameplayTag GetCurrentCategoryTag();
	enum class ECraftingScreenState GetCraftingScreenState();
	class UNWXMenuDataEntry* GetCandidateEntry();
	void GetAllEntries(TArray<class UNWXMenuDataEntry*>* OutEntries);
	class UNWXMenuDataEntry* FindEntryWithIDFromCategory(struct FGameplayTag& CategoryTag, struct FGuid& EntryID);
	void AddFilter(TSubclassOf<class UNWXMenuDataEntryFilter>& FilterClass);
};

// 0x88 (0xB0 - 0x28)
// Class NWX.CraftingDerivedExperienceStateIDBuilder
class UCraftingDerivedExperienceStateIDBuilder : public UExperienceStateIDBuilder
{
public:
	uint8                                        Pad_6026[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCraftingRecipeReference              RecipeReference;                                   // 0x30(0x70)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EDerivedStates                    TargetDerivedState;                                // 0xA0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6036[0xF];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCraftingDerivedExperienceStateIDBuilder* GetDefaultObj();

	struct FExperienceStateID Build(enum class EDerivedStates TargetState, struct FCraftingRecipeReference& CraftingRecipeReference);
};

// 0x0 (0x28 - 0x28)
// Class NWX.CraftingExperienceStateIDEnumerator
class UCraftingExperienceStateIDEnumerator : public UExperienceStateDefinitionSource
{
public:

	static class UClass* StaticClass();
	static class UCraftingExperienceStateIDEnumerator* GetDefaultObj();

};

// 0x10 (0x38 - 0x28)
// Class NWX.TestCraftingExperienceStateIDEnumerator
class UTestCraftingExperienceStateIDEnumerator : public UCraftingExperienceStateIDEnumerator
{
public:
	TArray<struct FSoftObjectPath>               TestRecipeReferences;                              // 0x28(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UTestCraftingExperienceStateIDEnumerator* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.CraftingFunctionsLibrary
class UCraftingFunctionsLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UCraftingFunctionsLibrary* GetDefaultObj();

	TArray<struct FInventoryEntry> ValidateCraftingInputEntries(class AController* CraftingController, TArray<struct FInventoryEntry>& InputItems, enum class EGetResult* Branches);
	void TryGetRecipeMetaTags(struct FDataTableRowHandle& RecipeHandle, struct FGameplayTagContainer* MetaTags, enum class EGetResult* Branches);
	void TryGetQuickCraftDisciplineTags(enum class EGetResult* Branches, struct FGameplayTagContainer* OutPlayerCraftingDisciplineTags);
	void TryGetQuickCraftCollections(enum class EGetResult* Branches, TArray<TSoftObjectPtr<class UDisciplineRecipeCollectionAsset>>* OutPlayerRecipeCollections);
	void TryGetPlayMinorCardRecipe(enum class EGetResult* Branches, struct FCraftingRecipeReference* OutPlayMinorCardRecipe);
	TArray<struct FItemDataReference> TryGetCraftingResultItems(struct FCraftingRecipeReference& RecipeReference, enum class EGetResult* Branches);
	TArray<struct FInventoryEntry> TryGenerateCraftingPreview(class AActor* Crafter, class AActor* CraftingStation, struct FCraftingRecipeReference& RecipeReference, int32 Quantity, TArray<struct FInventoryEntry>& InputItems, enum class EGetResult* Branches);
	struct FCraftingRecipeReference TryFindRecipeVariant(class AActor* Crafter, class AActor* CraftingStation, struct FCraftingRecipeReference& RecipeReference, int32 RequestedQuantity, TArray<struct FInventoryEntry>& InputItems, enum class EGetResult* Branches);
	bool IsRecipeSatisfied(class AActor* Crafter, class AActor* CraftingStation, struct FCraftingRecipe& RecipeData, int32 RequestedQuantity, TArray<struct FInventoryEntry>& InputItems);
	bool GetRequiredInputQuantitiesForSlot(TArray<struct FInventoryEntry>& InputSlotMaterials, struct FCraftingConstraintSlot& Slot, int32 RecipeQuantity, TMap<struct FGuid, int32>* OutQuantitiesRequired, TArray<struct FInventoryEntry>* OutSlotItems);
	void GetRequiredInputQuantitiesForRecipe(TArray<struct FInventoryEntry>& InputItems, struct FCraftingRecipeReference& RecipeReference, int32 RecipeQuantity, TMap<struct FGuid, int32>* OutQuantitiesRequired, TArray<struct FInventoryEntry>* OutSlotItems, enum class EGetResult* Branches);
	struct FPowerLevel GetPowerLevelOfRecipe(struct FCraftingRecipe& RecipeData);
	void GetNumberOfRecipeSlotsFilled(struct FCraftingRecipeReference& RecipeReference, TArray<struct FInventoryEntry>& InputItems, int32* SlotsFilled, int32* RecipeSlots, enum class EGetResult* Branches);
	float GetMinimumCraftingTimeAllowed();
	TArray<struct FInventoryEntry> GetMaterialsForSlot(TArray<struct FInventoryEntry>& InputItems, int32 SlotNumber, enum class EGetResult* Branches);
	struct FDataTableRowHandle GetCraftingStepFromTargetData(struct FGameplayAbilityTargetDataHandle& TargetData, class FString* CrafterUniqueID);
	struct FDataTableRowHandle GetCraftingStepEffectDataFromTargetData(struct FGameplayAbilityTargetDataHandle& TargetData, class FString* CrafterUniqueID, bool* bFireActivation, bool* bFireInterface);
	void GetCraftingRecipesFromDisciplines(TArray<TSoftObjectPtr<class UDisciplineRecipeCollectionAsset>>& Disciplines, TSet<struct FCraftingRecipeReference>* OutCraftingRecipeReferences);
	class FText GetCraftingRecipeDescription(struct FCraftingRecipeReference& CraftingRecipeReference, bool bExpandedDescription);
	struct FInventoryEntry GenerateSingleCraftedItem(struct FCraftingRecipeReference& RecipeReference, struct FCraftingResultDataItem& CraftedItem, TArray<struct FInventoryEntry>& InputItems, enum class EGetResult* Branches);
	bool DoesStationHaveRecipe(class AActor* CraftingStation, struct FCraftingRecipe& RecipeData);
	bool DoesPlayerHaveRecipe(class AController* Controller, struct FCraftingRecipeReference& RecipeReference);
	bool CanSlotSpellOnItem(struct FInventoryEntry& ItemToSlotSpell);
	bool CanSlotPerkOnItem(struct FInventoryEntry& ItemToSlotPerk);
	bool CanSlotInfusionOnItem(struct FInventoryEntry& ItemToSlotInfusion);
	bool CanCraftRecipe(class AController* Controller, class AActor* CraftingStation, struct FCraftingRecipeReference& RecipeReference, int32 RequestedQuantity, TArray<struct FInventoryEntry>& InputItems);
	int32 CalculateMaxQuantityForRecipe(class AController* CraftingController, TArray<struct FInventoryEntry>& InputItems, struct FCraftingRecipeReference& RecipeReference);
	bool AreSlotsSatisfied(TArray<struct FInventoryEntry>& InputItems, TArray<struct FCraftingConstraintSlot>& RecipeSlots, int32 RequestedQuantity);
	bool AreItemTraitConstraintsSatisfied(struct FGameplayTagContainer& ItemTraits, struct FCraftingConstraintSet& ConstraintSet);
	bool AreItemStatConstraintsSatisfied(class UInventoryItem* InventoryItem, struct FCraftingConstraintSet& ConstraintSet);
	bool AreItemQuantityConstraintsSatisfied(struct FInventoryEntry& InventoryEntry, int32 Quantity);
	bool AreItemConstraintsSatisfied(struct FInventoryEntry& InventoryEntry, struct FCraftingConstraintSet& ConstraintSet);
	bool AllRecipeSlotsFilled(struct FCraftingRecipeReference& RecipeReference, TArray<struct FInventoryEntry>& InputItems);
	struct FGameplayAbilityTargetDataHandle AbilityTargetDataFromCraftingStepEffectData(struct FDataTableRowHandle& CraftingStep, const class FString& CrafterUniqueID, bool bFireActivation, bool bFireInterface);
	struct FGameplayAbilityTargetDataHandle AbilityTargetDataFromCraftingStep(struct FDataTableRowHandle& CraftingStep, const class FString& CrafterUniqueID);
};

// 0x0 (0x28 - 0x28)
// Class NWX.CraftingRecipeReferenceFunctionLibrary
class UCraftingRecipeReferenceFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UCraftingRecipeReferenceFunctionLibrary* GetDefaultObj();

	void TryGetRelatedCraftingRecipes(struct FCraftingRecipeReference& RecipeReference, TArray<struct FCraftingRecipeReference>* OutReferences, enum class EGetResult* OutBranches);
	void TryGetCraftingRecipe(struct FCraftingRecipeReference& RecipeReference, struct FCraftingRecipe* CraftingRecipe, enum class EGetResult* Branches);
	bool RegisterRecipeForAssetLookup(class UAssetLookupFake* AssetLookup, struct FCraftingRecipeReference& RecipeReference);
	bool NotEqual_FCraftingRecipeReference(struct FCraftingRecipeReference& A, struct FCraftingRecipeReference& B);
	struct FCraftingRecipeReference MakeCraftingRecipeReferenceFromSoftObjectPath(struct FSoftObjectPath& SoftObjectPath);
	bool IsValid(struct FCraftingRecipeReference& RecipeReference);
	struct FGuid GetID(struct FCraftingRecipeReference& RecipeReference);
	struct FGameplayTagContainer GetDisciplineTagsForCraftingRecipes(TArray<struct FCraftingRecipeReference>& Recipes);
	class FString GetAssetName(struct FCraftingRecipeReference& RecipeReference);
	bool GetAllUnlockableCraftingRecipeReferences(TArray<struct FCraftingRecipeReference>* OutCraftingRecipes);
	TArray<struct FCraftingRecipeReference> FindAllCraftingRecipesWithDisciplines(struct FGameplayTagContainer& Disciplines);
	TArray<struct FCraftingRecipeReference> FindAllCraftingRecipes();
	bool EqualEqual_FCraftingRecipeReference(struct FCraftingRecipeReference& A, struct FCraftingRecipeReference& B);
	bool DoesRecipeSatisfyConstraint(struct FCraftingRecipeReference& RecipeReference, struct FItemConstraint& ItemConstraint);
	bool DoesRecipeListContainRecipe(TArray<struct FCraftingRecipeReference>& Recipes, struct FCraftingRecipe& Recipe);
};

// 0x8 (0x38 - 0x30)
// Class NWX.CraftingRefinementModifierAsset
class UCraftingRefinementModifierAsset : public UDataAsset
{
public:
	enum class ERefinementTimeModifer            ModifierType;                                      // 0x30(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_78B3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RefinementModifier;                                // 0x34(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UCraftingRefinementModifierAsset* GetDefaultObj();

	enum class ERefinementTimeModifer GetRefinementModifierType();
	float GetRefinementModifier();
};

// 0x0 (0x28 - 0x28)
// Class NWX.ItemProcessingObject
class UItemProcessingObject : public UObject
{
public:

	static class UClass* StaticClass();
	static class UItemProcessingObject* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class NWX.CraftingResultObject
class UCraftingResultObject : public UItemProcessingObject
{
public:
	uint8                                        Pad_7970[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCraftingResultObject* GetDefaultObj();

	bool GetOutputItem(struct FItemDataReference* OutputReference);
};

// 0x40 (0x70 - 0x30)
// Class NWX.CraftingResultMod_AddRemoveTags
class UCraftingResultMod_AddRemoveTags : public UCraftingResultObject
{
public:
	TArray<struct FGameplayTag>                  TagsToAdd;                                         // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                  TagsToRemove;                                      // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FGameplayTag>                  PassthroughTags;                                   // 0x50(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FInventoryEntry>               RecipeInputs;                                      // 0x60(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, EditConst, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCraftingResultMod_AddRemoveTags* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class NWX.CraftingResultMod_DeploymentData
class UCraftingResultMod_DeploymentData : public UCraftingResultObject
{
public:

	static class UClass* StaticClass();
	static class UCraftingResultMod_DeploymentData* GetDefaultObj();

};

// 0x8 (0x38 - 0x30)
// Class NWX.CraftingResultMod_SetQuality
class UCraftingResultMod_SetQuality : public UCraftingResultObject
{
public:
	enum class EItemQuality                      Quality;                                           // 0x30(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bQualityPassthrough;                               // 0x31(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7DCB[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        PassthroughSlotNumber;                             // 0x34(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCraftingResultMod_SetQuality* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class NWX.CraftingResult_GrantItem
class UCraftingResult_GrantItem : public UCraftingResultObject
{
public:

	static class UClass* StaticClass();
	static class UCraftingResult_GrantItem* GetDefaultObj();

};

// 0xA0 (0xD0 - 0x30)
// Class NWX.CraftingResult_CraftItem
class UCraftingResult_CraftItem : public UCraftingResult_GrantItem
{
public:
	struct FCraftingResultDataItem               Data;                                              // 0x30(0xA0)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCraftingResult_CraftItem* GetDefaultObj();

};

// 0x28 (0x58 - 0x30)
// Class NWX.CraftingResult_CraftPerk
class UCraftingResult_CraftPerk : public UCraftingResult_GrantItem
{
public:
	TSoftObjectPtr<class UItemPerkDataAsset>     PerkToApply;                                       // 0x30(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UCraftingResult_CraftPerk* GetDefaultObj();

	void SetPerkDataAsset(TSoftObjectPtr<class UItemPerkDataAsset>& Asset);
};

// 0x0 (0x30 - 0x30)
// Class NWX.CraftingResult_PlayRealmCard
class UCraftingResult_PlayRealmCard : public UCraftingResultObject
{
public:

	static class UClass* StaticClass();
	static class UCraftingResult_PlayRealmCard* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class NWX.CraftingResult_PlayMinorCard
class UCraftingResult_PlayMinorCard : public UCraftingResult_PlayRealmCard
{
public:

	static class UClass* StaticClass();
	static class UCraftingResult_PlayMinorCard* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class NWX.CraftingResult_SlotInfusion
class UCraftingResult_SlotInfusion : public UCraftingResult_GrantItem
{
public:

	static class UClass* StaticClass();
	static class UCraftingResult_SlotInfusion* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class NWX.CraftingResult_UpgradeItem
class UCraftingResult_UpgradeItem : public UCraftingResult_GrantItem
{
public:

	static class UClass* StaticClass();
	static class UCraftingResult_UpgradeItem* GetDefaultObj();

};

// 0x18 (0x48 - 0x30)
// Class NWX.CraftingResult_Variant_Inputs
class UCraftingResult_Variant_Inputs : public UCraftingResultObject
{
public:
	class UCraftingResultObject*                 ResultDefault;                                     // 0x30(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, PersistentInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSlotConstraintsRecipeResult>  ResultVariants;                                    // 0x38(0x10)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCraftingResult_Variant_Inputs* GetDefaultObj();

};

// 0x150 (0x180 - 0x30)
// Class NWX.CraftingRewardRegistry
class UCraftingRewardRegistry : public UDataAsset
{
public:
	TSubclassOf<class ANWXGameStateBase>         GameState;                                         // 0x30(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UActorComponent>           CraftingComponent;                                 // 0x38(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UActorComponent>           CraftingStationComponent;                          // 0x40(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UItemClaimObject>          ItemClaimObject;                                   // 0x48(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                     NoRefinementDisciplines;                           // 0x50(0x48)(Edit, NativeAccessSpecifierPublic)
	float                                        MinimumCraftingTimeAllowed;                        // 0x98(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7EDB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSoftObjectPtr<class UDisciplineRecipeCollectionAsset>> PlayerRecipeCollections;                           // 0xA0(0x10)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 PlayerCraftingRecipeTags;                          // 0xB0(0x20)(Edit, EditConst, AdvancedDisplay, NativeAccessSpecifierPublic)
	class UItemConstraintDataAsset*              InfuseableConstraint;                              // 0xD0(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UItemConstraintDataAsset*              PerkableConstraint;                                // 0xD8(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UItemDataAsset>         PerkDataAsset;                                     // 0xE0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UItemConstraintDataAsset*              SpellableConstraint;                               // 0x108(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCraftingRecipeReference              PlayMinorCardRecipe;                               // 0x110(0x70)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCraftingRewardRegistry* GetDefaultObj();

};

// 0x0 (0xA0 - 0xA0)
// Class NWX.CraftingStationComponentBase
class UCraftingStationComponentBase : public UActorComponent
{
public:

	static class UClass* StaticClass();
	static class UCraftingStationComponentBase* GetDefaultObj();

	void ServerIncrementCraftClaimedQuantity(const class FString& CrafterID, int32& ClaimedQuantity);
	struct FGuid GetCraftInProgressID(int32& CraftInProgressIndex);
	bool FindCraftForID(const class FString& CrafterID, int32* CraftInProgressIndex);
};

// 0x0 (0x28 - 0x28)
// Class NWX.CraftingStationDataProvider
class ICraftingStationDataProvider : public IInterface
{
public:

	static class UClass* StaticClass();
	static class ICraftingStationDataProvider* GetDefaultObj();

	TArray<struct FCraftingRecipeReference> GetCurrentCraftingRecipes();
};

// 0x0 (0x28 - 0x28)
// Class NWX.CraftingTelemetryLibrary
class UCraftingTelemetryLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UCraftingTelemetryLibrary* GetDefaultObj();

	void SendReceiveCraftedItemEvent(class APlayerState* PlayerState, struct FGuid& CraftId, struct FCraftingRecipeReference& RecipeReference, class AActor* CraftingStationActor, struct FInventoryEntry& OutputItem, int32 QuantityGranted);
};

// 0x0 (0x30 - 0x30)
// Class NWX.ItemProcessingDataAsset
class UItemProcessingDataAsset : public UDataAsset
{
public:

	static class UClass* StaticClass();
	static class UItemProcessingDataAsset* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class NWX.Crafting_Result_Items_DataAsset
class UCrafting_Result_Items_DataAsset : public UItemProcessingDataAsset
{
public:
	TArray<struct FInventoryEntry>               ItemsToGrant;                                      // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCrafting_Result_Items_DataAsset* GetDefaultObj();

};

// 0x20 (0x50 - 0x30)
// Class NWX.Crafting_Result_Mechanic_RealmCard_DataAsset
class UCrafting_Result_Mechanic_RealmCard_DataAsset : public UItemProcessingDataAsset
{
public:
	TArray<TScriptInterface<class IRealmCard>>   AppliedRealmCards;                                 // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TScriptInterface<class IRealmCard>>   RemovedRealmCards;                                 // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, UObjectWrapper, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCrafting_Result_Mechanic_RealmCard_DataAsset* GetDefaultObj();

};

// 0x8 (0x38 - 0x30)
// Class NWX.Craft_ResultData_VariantIndex
class UCraft_ResultData_VariantIndex : public UItemProcessingDataAsset
{
public:
	uint8                                        Pad_8039[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCraft_ResultData_VariantIndex* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class NWX.Craft_Result_Instances_DataAsset
class UCraft_Result_Instances_DataAsset : public UItemProcessingDataAsset
{
public:
	TArray<struct FGuid>                         Instances;                                         // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCraft_Result_Instances_DataAsset* GetDefaultObj();

};

// 0x20 (0x50 - 0x30)
// Class NWX.CreatureAdditiveReactsDataAsset
class UCreatureAdditiveReactsDataAsset : public UDataAsset
{
public:
	enum class EBonesToEnablePhysicsOn           BonesSimulatingPhysicsOnHit;                       // 0x30(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_805F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           BlendCurve;                                        // 0x38(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bImpulseOnHitBone;                                 // 0x40(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_806A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ImpulseMultiplier;                                 // 0x44(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinimumAllowedImpulse;                             // 0x48(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaximumAllowedImpulse;                             // 0x4C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCreatureAdditiveReactsDataAsset* GetDefaultObj();

};

// 0x2C8 (0x2F8 - 0x30)
// Class NWX.CreatureAnimationDataAsset
class UCreatureAnimationDataAsset : public UPrimaryDataAsset
{
public:
	class UAnimMontage*                          InitializationTransitionSequence;                  // 0x30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<enum class ENWXStartMovingType, class UAnimMontage*> TurnOnSpots;                                       // 0x38(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<enum class ENWXStartMovingType, class UAnimMontage*> WalkingStarts;                                     // 0x88(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<enum class ENWXStartMovingType, class UAnimMontage*> TrotStarts;                                        // 0xD8(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<enum class ENWXStartMovingType, class UAnimMontage*> RunStarts;                                         // 0x128(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class UDataTable*                            HitReactDataTable;                                 // 0x178(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCreatureAdditiveReactsDataAsset*      AdditiveHitReactData;                              // 0x180(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAnimSequenceBase*>             IdleLocomotionSequences;                           // 0x188(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                     WalkLocomotionSequence;                            // 0x198(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                     TrotLocomotionSequence;                            // 0x1A0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                     RunLocomotionSequence;                             // 0x1A8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                     SleepStateSequence;                                // 0x1B0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                     DeathStateSequence;                                // 0x1B8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                     CombatStateSequence;                               // 0x1C0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                     DownedStateSequence;                               // 0x1C8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimSequenceBase*                     SwimLocomotionSequence;                            // 0x1D0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              DeltaRotationWhileSwimming;                        // 0x1D8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                               DeltaOffsetWhileSwimming;                          // 0x1F0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FName, class UAnimSequenceBase*>  SpecialtyStateSequences;                           // 0x208(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	TMap<enum class ELinkedLoiterType, struct FLinkedLoiterState> LinkedLoiterAnimations;                            // 0x258(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                         bHasLookAt;                                        // 0x2A8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_80D8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TargetRange;                                       // 0x2AC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ForwardThreshold;                                  // 0x2B0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InterpSpeed;                                       // 0x2B4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InterpSpeedTurnOff;                                // 0x2B8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bClockwise;                                        // 0x2BC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_80EF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               MinimumClamp;                                      // 0x2C0(0x18)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               MaximumClamp;                                      // 0x2D8(0x18)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LookAtBoneCount;                                   // 0x2F0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_80F6[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCreatureAnimationDataAsset* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.CreatureBlueprintFunctionLibrary
class UCreatureBlueprintFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UCreatureBlueprintFunctionLibrary* GetDefaultObj();

	struct FSuppressionTraitChangedProperties MakeSuppressionTraitChangedProperties(class AActor* TraitOwner, bool bActivated, float EffectRadius);
	bool IsAnyPlayerWithinRangeOfSquad(class ANWXAISpawner* Spawner, float Range);
	float GetStealthModifier(class AActor* PlayerActor);
	class ANWXCreatureManagerBase* GetCreatureManager(class UObject* WorldContextObject);
	void GetCompanionSearchParameters(class ANWXAICharacter* AICharacter, float DesiredSearchRadius, struct FVector* SearchLocation, float* SearchRadius);
	void GetCapsuleBottomDistance(class ACharacter* Target, class ACharacter* OtherCharacter, float* OutDistance, enum class EGetResult* Branches);
};

// 0xD8 (0x178 - 0xA0)
// Class NWX.CreatureBudgetComponent
class UCreatureBudgetComponent : public UActorComponent
{
public:
	int32                                        MaxCreaturesPerWorker;                             // 0xA0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_82F0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UDataTable*                            DefaultMaxCreaturesDataTable;                      // 0xA8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FMaxPerType>                   MaxCreaturesPerType;                               // 0xB0(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UDataTable*                            MaxCreatureOverrideDataTable;                      // 0xC0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ANWXCreatureManagerBase*               CreatureManager;                                   // 0xC8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSet<class AActor*>                          Actors;                                            // 0xD0(0x50)(NativeAccessSpecifierPrivate)
	uint8                                        Pad_82FD[0x58];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCreatureBudgetComponent* GetDefaultObj();

	void UpdateFromConfigOverrides();
	void RemoveCreatureFromTotal(class ANWXAICharacter* AICreature);
	void RegisterCreatureManager(class ANWXCreatureManagerBase* CreatureManager);
	void HandleOnActorSpawned(class AActor* SpawnedActor);
	void HandleOnActorBeginPlay(class AActor* BeginPlayActor);
	int32 GetTotalCreaturesForType(enum class ECreatureType Type);
	int32 GetTotalCreatures();
	int32 GetMaxCreaturesForType(enum class ECreatureType Type);
	void AddCreatureToTotal(class ANWXAICharacter* AICreature);
};

// 0x0 (0x28 - 0x28)
// Class NWX.CreatureCheats
class UCreatureCheats : public UCheatManagerExtension
{
public:

	static class UClass* StaticClass();
	static class UCreatureCheats* GetDefaultObj();

	void UntagAllCreatures(struct FGameplayTag& Tag);
	void TagAllCreatures(struct FGameplayTag& Tag);
};

// 0x158 (0x188 - 0x30)
// Class NWX.CreatureCustomizationRegistry
class UCreatureCustomizationRegistry : public UDataAsset
{
public:
	class FName                                  BackgroundGradientParameter;                       // 0x30(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  PatternGradientParameter;                          // 0x38(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  AnimalMarkingsParameter;                           // 0x40(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<enum class ECreatureTier, class UTexture*> BackgroundGradientMap;                             // 0x48(0x50)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<enum class ECreatureTier, class UTexture*> HeroBackgroundGradientMap;                         // 0x98(0x50)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<enum class ECreatureTier, class UTexture*> PatternGradientMap;                                // 0xE8(0x50)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)
	TMap<enum class ECreatureTier, class UTexture*> HeroPatternGradientMap;                            // 0x138(0x50)(Edit, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UCreatureCustomizationRegistry* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.CreatureDataInterface
class ICreatureDataInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class ICreatureDataInterface* GetDefaultObj();

	bool IsShowingWeakpoint();
	class FName GetCreatureDataRowName();
};

// 0x0 (0xA0 - 0xA0)
// Class NWX.CreatureSocketTraceComponent
class UCreatureSocketTraceComponent : public UActorComponent
{
public:

	static class UClass* StaticClass();
	static class UCreatureSocketTraceComponent* GetDefaultObj();

	bool HasAnyDebugCommands();
	bool GetSphereForwards();
	int32 GetSphereDetail();
	bool GetSphereArc();
	int32 GetPredictionPathsLevel();
	bool GetPEATriangle();
	bool GetPEAArc();
	int32 GetNumAdditionalSpheres();
	bool GetDetailedDebug();
};

// 0x0 (0x28 - 0x28)
// Class NWX.CreatureSpawningBlueprintFunctionLibrary
class UCreatureSpawningBlueprintFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UCreatureSpawningBlueprintFunctionLibrary* GetDefaultObj();

	bool IsSpawnerValidForCluster(class UObject* WorldContextObject, struct FWildlifeSpawnerBase& SpawnerData, class FName& ClusterName, TMap<class FName, struct FClusterTheme>& RealmClusters);
	bool IsNaturalSpawnerValidForRealm(class UObject* WorldContextObject, struct FWildlifeSpawner& SpawnerData, TMap<class FName, struct FClusterTheme>& RealmClusters);
	bool IsDynamicSpawnerValidForRealm(class UObject* WorldContextObject, struct FDynamicWildlifeSpawner& SpawnerData, TMap<class FName, struct FClusterTheme>& RealmClusters);
};

// 0x0 (0x28 - 0x28)
// Class NWX.CullDistanceVolumeEditorUtils
class UCullDistanceVolumeEditorUtils : public UObject
{
public:

	static class UClass* StaticClass();
	static class UCullDistanceVolumeEditorUtils* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.CustomBoundsInterface
class ICustomBoundsInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class ICustomBoundsInterface* GetDefaultObj();

	void GetWorldTransform(struct FTransform* WorldTransform);
	void GetOrigin(struct FVector* RelativeLocation, struct FVector* WorldLocation);
	void GetMinAndMaxExtents(struct FVector* RelativeMinExtent, struct FVector* RelativeMaxExtent, struct FVector* WorldMinExtent, struct FVector* WorldMaxExtent);
	void GetBounds(struct FVector* Bounds);
};

// 0x0 (0x28 - 0x28)
// Class NWX.CustomDamageInterface
class ICustomDamageInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class ICustomDamageInterface* GetDefaultObj();

	void CustomDamage_OnDamageReceived(float Damage, class AActor* Target, class AActor* Source, struct FGameplayTagContainer& EffectTags, struct FHitResult& HitResult, struct FTagValueContainer& TagValueContainer);
};

// 0x0 (0x28 - 0x28)
// Class NWX.CustomizationFunctionLibrary
class UCustomizationFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UCustomizationFunctionLibrary* GetDefaultObj();

	void UpdateAllProximityHiding(class AActor* HidingActor, bool bEnableProxyHiding, TArray<class UMaterialInstanceDynamic*>& MaterialInstances);
	class FName GetProximityHidingParameter();
	struct FLinearColor GetInvalidProximityValue();
};

// 0x0 (0x28 - 0x28)
// Class NWX.DamageEventInterface
class IDamageEventInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IDamageEventInterface* GetDefaultObj();

	void OnDamageReceived(float Damage, class AActor* Target, class AActor* Source, struct FGameplayTagContainer& EffectTags, struct FHitResult& HitResult, struct FTagValueContainer& TagValueContainer);
	void OnDamageActor(class AActor* Source, struct FGameplayTagContainer& EffectTags, float BaseDamage, struct FHitResult& HitResult, struct FTagValueContainer& TagValueContainer, TArray<struct FGameplayEffectCue>& GameplayCues, struct FTagValueContainer* AggregatedDamageTags);
	void DamageActor(class AActor* Source, struct FGameplayTagContainer& EffectTags, float BaseDamage, struct FHitResult& HitResult, struct FTagValueContainer& TagValueContainer, TArray<struct FGameplayEffectCue>& GameplayCues, struct FTagValueContainer* AggregatedDamageTags);
};

// 0xB8 (0x358 - 0x2A0)
// Class NWX.NWXActor
class ANWXActor : public AActor
{
public:
	uint8                                        Pad_85A1[0x40];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 GameplayTags;                                      // 0x2E0(0x20)(Edit, BlueprintVisible, Net, NativeAccessSpecifierPublic)
	class UNWXAbilitySystemComponent*            AbilitySystem;                                     // 0x300(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UGameplayAbility>>  InitialGrantedAbilities;                           // 0x308(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UGameplayEffect>>   InitialGrantedEffects;                             // 0x318(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	class UDataTable*                            AttributeInitData;                                 // 0x328(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UNWXAttributeSet*                      AttributeSet;                                      // 0x330(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         CanBeBaseForAI;                                    // 0x338(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_85A3[0x1F];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ANWXActor* GetDefaultObj();

	TArray<class UPrimitiveComponent*> GetPrimitiveComponentsByTag(struct FGameplayTagContainer& Tag);
};

// 0x0 (0x358 - 0x358)
// Class NWX.DamageSource_ZKill
class ADamageSource_ZKill : public ANWXActor
{
public:

	static class UClass* StaticClass();
	static class ADamageSource_ZKill* GetDefaultObj();

};

// 0x0 (0x358 - 0x358)
// Class NWX.DamageSource_Debug
class ADamageSource_Debug : public ANWXActor
{
public:

	static class UClass* StaticClass();
	static class ADamageSource_Debug* GetDefaultObj();

};

// 0x0 (0x358 - 0x358)
// Class NWX.DamageSource_Falling
class ADamageSource_Falling : public ANWXActor
{
public:

	static class UClass* StaticClass();
	static class ADamageSource_Falling* GetDefaultObj();

};

// 0x0 (0x358 - 0x358)
// Class NWX.DamageSource_Hail
class ADamageSource_Hail : public ANWXActor
{
public:

	static class UClass* StaticClass();
	static class ADamageSource_Hail* GetDefaultObj();

};

// 0x0 (0x358 - 0x358)
// Class NWX.DamageSource_FunctionalTest
class ADamageSource_FunctionalTest : public ANWXActor
{
public:

	static class UClass* StaticClass();
	static class ADamageSource_FunctionalTest* GetDefaultObj();

};

// 0x0 (0x358 - 0x358)
// Class NWX.DamageSource_Invalid
class ADamageSource_Invalid : public ANWXActor
{
public:

	static class UClass* StaticClass();
	static class ADamageSource_Invalid* GetDefaultObj();

};

// 0x30 (0x2F0 - 0x2C0)
// Class NWX.DamageManager
class ADamageManager : public AManagerBase
{
public:
	class ANWXActor*                             DamageSource_ZKill;                                // 0x2C0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ANWXActor*                             DamageSource_Debug;                                // 0x2C8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ANWXActor*                             DamageSource_Falling;                              // 0x2D0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ANWXActor*                             DamageSource_Hail;                                 // 0x2D8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ANWXActor*                             DamageSource_FunctionalTest;                       // 0x2E0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ANWXActor*                             DamageSource_Invalid;                              // 0x2E8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class ADamageManager* GetDefaultObj();

	class ANWXActor* GetDamageSource_ZKill(class UObject* WorldContextObject);
	class ANWXActor* GetDamageSource_Invalid(class UObject* WorldContextObject);
	class ANWXActor* GetDamageSource_Hail(class UObject* WorldContextObject);
	class ANWXActor* GetDamageSource_FunctionalTest(class UObject* WorldContextObject);
	class ANWXActor* GetDamageSource_Falling(class UObject* WorldContextObject);
	class ANWXActor* GetDamageSource_Debug(class UObject* WorldContextObject);
};

// 0x0 (0x28 - 0x28)
// Class NWX.DamageTargetValidationInterface
class IDamageTargetValidationInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IDamageTargetValidationInterface* GetDefaultObj();

	float GetMeleeValidationDistance();
};

// 0x0 (0x28 - 0x28)
// Class NWX.DamageUtilitiesFunctionLibrary
class UDamageUtilitiesFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UDamageUtilitiesFunctionLibrary* GetDefaultObj();

	struct FTagValueContainer GetTagContainerFromEffectSpec(struct FGameplayEffectSpecHandle& Spec);
	struct FGameplayTag GetIncomingQuadrantTag(class AActor* Target, class AActor* Source, float QuadrantThreshold);
	struct FGameplayTag GetIncomingHemisphereTag(class AActor* Target, class AActor* Source);
	struct FGameplayTag GetDOTDamageTag();
	bool ContainsBlockingTag(struct FGameplayTagContainer& InTags);
	bool AttackCanBeBlocked(struct FGameplayTagContainer& SourceTags, struct FGameplayTagContainer& TargetTags, bool bDebugState);
};

// 0x0 (0x28 - 0x28)
// Class NWX.DamageVulnerabilityInterface
class IDamageVulnerabilityInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IDamageVulnerabilityInterface* GetDefaultObj();

	bool IsVulnerableToPowerLevel(class AActor* Source, int32 IdentifierIndex, struct FPowerLevel* OutPowerLevelDifference);
	bool IsVulnerableToDamageTags(struct FGameplayTagContainer& DamageTags, int32 IdentifierIndex);
};

// 0x0 (0x28 - 0x28)
// Class NWX.DataAssetFunctionLibrary
class UDataAssetFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UDataAssetFunctionLibrary* GetDefaultObj();

	void GenerateDataAssetCSV(TArray<class UObject*>& ObjectArray, const class FString& Filename, bool* bSuccess, class FString* Message);
};

// 0x0 (0x28 - 0x28)
// Class NWX.POIDistributionStage
class UPOIDistributionStage : public UObject
{
public:

	static class UClass* StaticClass();
	static class UPOIDistributionStage* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.DataOnlyPOIDistributionStage
class UDataOnlyPOIDistributionStage : public UPOIDistributionStage
{
public:

	static class UClass* StaticClass();
	static class UDataOnlyPOIDistributionStage* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.DatapointStage
class UDatapointStage : public UObject
{
public:

	static class UClass* StaticClass();
	static class UDatapointStage* GetDefaultObj();

	struct FPOIData MakeDatapoint(struct FVector& Location, int32 Radius, enum class EPOIType Type, bool IsHub, int32 RegionMask);
};

// 0x0 (0x28 - 0x28)
// Class NWX.DataTableBPFunctionLibrary
class UDataTableBPFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UDataTableBPFunctionLibrary* GetDefaultObj();

	bool DataTable_AddDataRow(class UDataTable* Table, class FName& RowName, struct FTableRowBase& RowData);
};

// 0x0 (0x28 - 0x28)
// Class NWX.DataValidationInterface
class IDataValidationInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IDataValidationInterface* GetDefaultObj();

};

// 0xB8 (0x358 - 0x2A0)
// Class NWX.GridManager
class AGridManager : public AActor
{
public:
	class UBoxComponent*                         WorldBox;                                          // 0x2A0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               WorldOrigin;                                       // 0x2A8(0x18)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               WorldSize;                                         // 0x2C0(0x18)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               WorldExtents;                                      // 0x2D8(0x18)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefaultGridValue;                                  // 0x2F0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_86AF[0x14];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NumberOfColumns;                                   // 0x308(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        NumberOfRows;                                      // 0x30C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               Resolution;                                        // 0x310(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_86B1[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               DistanceFromZeroOffset;                            // 0x340(0x18)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class AGridManager* GetDefaultObj();

	void SetGridValues(float Value);
	void PrintDimensions();
	void PrintData(int32 DesiredNumberOfRows, int32 DesiredNumberOfColumns, bool bIncludeBaseValue, bool bIncludeDeviation);
	void InitializeGrid();
	void GetGridCellsInRadius(struct FVector& Location, float Radius, TArray<struct FGridCell>* OutCellsInRange);
	float GetData(struct FVector& Location);
};

// 0x40 (0x398 - 0x358)
// Class NWX.DaylightManager
class ADaylightManager : public AGridManager
{
public:
	float                                        ElevationAngle;                                    // 0x358(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_86B6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           SunPitchCurve;                                     // 0x360(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ElevationAngleAffectsDaylight;                     // 0x368(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_86B7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          DaylightBlockerTag;                                // 0x36C(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Daylight;                                          // 0x374(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                              SunRotator;                                        // 0x378(0x18)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_86B8[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ADaylightManager* GetDefaultObj();

	float GetDaylightAtLocation(struct FVector& Location);
};

// 0x30 (0x58 - 0x28)
// Class NWX.DeathBehaviour
class UDeathBehaviour : public UObjectWithWorld
{
public:
	class UDeathComponent*                       DeathComponent;                                    // 0x28(0x8)(ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APawn*                                 Pawn;                                              // 0x30(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AController*                           Controller;                                        // 0x38(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class APlayerState*                          State;                                             // 0x40(0x8)(ZeroConstructor, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAbilitySystemComponent*               AbilitySystemComponent;                            // 0x48(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_86D3[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDeathBehaviour* GetDefaultObj();

	void StartRespawn();
	void StartDowned();
	void StartDeath();
	void SafeDestroyObject(class UObject* Object);
	void OnPlayerDisconnected_Started();
	void OnPlayerDisconnected_Respawning();
	void OnPlayerDisconnected_Downed();
	void OnPlayerDisconnected_Dead();
	void InitializeForAutomatedTests();
	class APlayerState* GetState();
	class APawn* GetPawn();
	class AController* GetController();
	void EndRespawn();
	void EndDowned(bool bContinue);
	void EndDeath(bool bContinue);
};

// 0x0 (0x28 - 0x28)
// Class NWX.DeathBehaviourInterface
class IDeathBehaviourInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IDeathBehaviourInterface* GetDefaultObj();

	TSubclassOf<class UDeathBehaviour> GetDeathBehaviour();
};

// 0x20 (0x3C0 - 0x3A0)
// Class NWX.DeathChestMapPinComponent
class UDeathChestMapPinComponent : public UMapPinComponent
{
public:
	class FString                                Note;                                              // 0x3A0(0x10)(ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                OwningPlayerName;                                  // 0x3B0(0x10)(ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UDeathChestMapPinComponent* GetDefaultObj();

	void Auth_SetPlayerName(const class FString& NewName);
	void Auth_SetCauseOfDeath(const class FString& CauseOfDeath);
};

// 0x50 (0xF0 - 0xA0)
// Class NWX.DeathComponent
class UDeathComponent : public UActorComponent
{
public:
	TMap<class APawn*, class UDeathBehaviour*>   Behaviours;                                        // 0xA0(0x50)(NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UDeathComponent* GetDefaultObj();

	bool IsInAnyDeathState(class APawn* Pawn);
	bool IsDeathBehaviourActive(class APawn* Pawn, TSubclassOf<class UDeathBehaviour>& DeathBehaviourClass);
};

// 0x0 (0x28 - 0x28)
// Class NWX.DebugBlueprintFunctionLibrary
class UDebugBlueprintFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UDebugBlueprintFunctionLibrary* GetDefaultObj();

	void SetPrintImpactInfo(bool bNewPrintImpactInfo);
	void SetHideHUDAndChatInFlycam(bool ValueToSetHideHUDAndChat);
	void SetHideFrameStats(bool ValueToSetHideFrameStats);
	void PrintProfilingStats(float* RawGPUTime, float* AvgGPUTime, float* RawGame, float* AvgGame, float* RawDraw, float* AvgDraw, float* RawRHIT, float* AvgRHIT);
	void OpenBugScreenShot();
	void GetUserSpecInfo(class FString* CPUBrand, class FString* GPUBrand, class FString* OS);
	bool GetPrintImpactInfo();
	void GetMemoryStats(class FString* MemoryStats);
	bool GetHideHUDAndChatInFlycam();
	bool GetHideFrameStats();
	void GetDriverInfo(class FString* ActiveDriver);
	class FString GetCurrentViewModeName(class UObject* WorldContext);
	class FText GetCurrentViewModeDisplayName(class UObject* WorldContext);
	void GetBuildAndEngineInfo(class FString* BuildVersion, class FString* BuildConfig, class FString* EngineVersion);
	void GetAvgFPS(float* AvgFPS, float* AvgMS);
	void DrawWireframe(class UObject* WorldContext, TArray<struct FVector>& Verts, struct FLinearColor& Color, float Duration);
	void DrawDebugMeshInWorldSpace(struct FTransform& Transform, class UMeshComponent* MeshComp, struct FLinearColor& Color, float Duration);
};

// 0x80 (0x340 - 0x2C0)
// Class NWX.NWXUserWidget
class UNWXUserWidget : public UUserWidget
{
public:
	struct FGameplayTagContainer                 WidgetTags;                                        // 0x2C0(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FGameplayTag                          WidgetTag;                                         // 0x2E0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAutoRegisterToInputEvents;                        // 0x2E8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAutoRegisterToViewportResizedEvent;               // 0x2E9(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_8744[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FKey                                  AlternateCancelKey;                                // 0x2F0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EUINavigationRule                 DefaultNavigationRule;                             // 0x308(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_8748[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class ENWXWidgetTelemetryType>   EnabledTelemetryTypes;                             // 0x310(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_8749[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UNWXUserWidget* GetDefaultObj();

	void SetWrappingNavigationRules(class UWidget* Widget, bool bWrapUpDown, bool bWrapLeftRight);
	void SetFocusOnDefaultWidget();
	void SetDefaultNavigationRules(class UWidget* Widget);
	void OnViewportResized();
	void OnUsingGamepadChanged(bool bUsingGamepad);
	void OnPossessedPawnChanged(class APawn* OldPawn, class APawn* NewPawn);
	void OnPawnUnpossessed(class APawn* OldPawn);
	void OnPawnPossessedAndReady(class APawn* NewPawn);
	struct FEventReply OnInputStart();
	struct FEventReply OnInputSelect();
	struct FEventReply OnInputPrevious();
	struct FEventReply OnInputNext();
	struct FEventReply OnInputContext(int32 ContextIndex);
	struct FEventReply OnInputConfirm();
	struct FEventReply OnInputCancel();
	bool IsUsingGamepad();
	class ANWXPlayerState* GetOwningPlayerState();
	class ANWXPlayerController* GetOwningPlayerController();
	class UWidget* GetDefaultFocusWidget();
	void BroadcastUIEventWithWidget(struct FGameplayTag& InEventTag, struct FGameplayTag& InWidgetTag);
};

// 0x10 (0x350 - 0x340)
// Class NWX.DebugCommandScreenWidget
class UDebugCommandScreenWidget : public UNWXUserWidget
{
public:
	TArray<class FString>                        UserCommands;                                      // 0x340(0x10)(ZeroConstructor, Config, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UDebugCommandScreenWidget* GetDefaultObj();

	void SaveUserCommandsToConfig(TArray<class FString>& Commands);
	TArray<class FString> LoadUserCommandsFromConfig();
};

// 0x78 (0x118 - 0xA0)
// Class NWX.DebugFlyCam
class UDebugFlyCam : public UActorComponent
{
public:
	TWeakObjectPtr<class APawn>                  Server_PlayerPawnToRepossess;                      // 0xA0(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FOptionalCachedPawnLocationAndRotation CachedPlayerPawnLocationAndRotation;               // 0xA8(0x38)(Net, NoDestructor, NativeAccessSpecifierPrivate)
	struct FOptionalCachedPawnLocationAndRotation Client_SpectatorLocationAndRotation;               // 0xE0(0x38)(NoDestructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UDebugFlyCam* GetDefaultObj();

	void Server_TeleportPlayerPawnToLocationAndRotation(struct FVector& Location, struct FRotator& Rotation);
	void Server_RepossessPlayerPawn();
	void Server_EnterFlyCam();
	void Client_ExitFlyCam(bool bTeleportToSpectatorLocation);
	void Client_EnterFlyCam();
};

// 0x0 (0x58 - 0x58)
// Class NWX.DefaultDeathBehaviour
class UDefaultDeathBehaviour : public UDeathBehaviour
{
public:

	static class UClass* StaticClass();
	static class UDefaultDeathBehaviour* GetDefaultObj();

};

// 0x0 (0x2A8 - 0x2A8)
// Class NWX.NWXTriggerBox
class ANWXTriggerBox : public ATriggerBox
{
public:

	static class UClass* StaticClass();
	static class ANWXTriggerBox* GetDefaultObj();

};

// 0x138 (0x3D8 - 0x2A0)
// Class NWX.DeploymentPortal
class ADeploymentPortal : public AActor
{
public:
	uint8                                        Pad_8797[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                DisplayName;                                       // 0x2A8(0x10)(Edit, Net, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FString>                        DestinationMapNames;                               // 0x2B8(0x10)(Edit, BlueprintVisible, Net, ZeroConstructor, NativeAccessSpecifierPublic)
	class FString                                SelectedMapName;                                   // 0x2C8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PortalSessionId;                                   // 0x2D8(0x10)(BlueprintVisible, ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bReturnPortal;                                     // 0x2E8(0x1)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETemporalPortalState              TemporalState;                                     // 0x2E9(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, SaveGame, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8798[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTemporalConfig                       PortalConfig;                                      // 0x2F0(0x78)(Edit, BlueprintVisible, SaveGame, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnTemporalPortalStateChanged;                      // 0x368(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_879A[0x28];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                TargetPlayerStartTag;                              // 0x3A0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                DeploymentId;                                      // 0x3B0(0x10)(ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                DeploymentSetName;                                 // 0x3C0(0x10)(ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bServerTravelPortal;                               // 0x3D0(0x1)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_879D[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ADeploymentPortal* GetDefaultObj();

	void StartDeployment();
	void SetTargetPlayerStartTag(const class FString& Target);
	bool SetDestinationDeploymentSetDynamic();
	bool SetDestinationDeploymentSet(const class FString& InDeploymentSet);
	bool SetDestinationAndRestart(const class FString& DeploymentId);
	bool SetDestination(const class FString& InDeploymentID);
	void SelectServerTravelDestinationAndStart();
	void RestartDeployment();
	void ResetPortal();
	void OnWorkerFlagUpdated(const class FString& FlagName, const class FString& FlagValue);
	void OnTemporalPortalStateChanged__DelegateSignature(enum class ETemporalPortalState State, class ADeploymentPortal* DeploymentPortal);
	void OnRep_TemporalPortalStateChanged();
	class FString GetID();
	class FString GetDisplayString();
	struct FTemporalConfig ConvertJsonToTemporalConfig(const class FString& Json);
};

// 0x0 (0x28 - 0x28)
// Class NWX.DiagnosticCheats
class UDiagnosticCheats : public UCheatManagerExtension
{
public:

	static class UClass* StaticClass();
	static class UDiagnosticCheats* GetDefaultObj();

	void TraceBookmark_Server(const class FString& BookmarkName);
	void TraceBookmark_Client(const class FString& BookmarkName);
	void StartProfileCapture();
	void SetVislogWhiteListOnlyOnServer(bool bIsEnabled);
	void SetVislogEnabledOnServer(bool bIsEnabled);
	void SetRecordingWhiteListedVislogOnServer(bool bIsEnabled);
	void QuickTrace(float TraceLengthSeconds);
	void EnableUnrealInsights_Server(const class FString& ChannelList);
	void EnableUnrealInsights_Client(const class FString& ChannelList);
	void DisableUnrealInsights_Server();
	void DisableUnrealInsights_Client();
	void CreateMemReport();
};

// 0x0 (0x28 - 0x28)
// Class NWX.DialogueDataProvider
class IDialogueDataProvider : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IDialogueDataProvider* GetDefaultObj();

	class UDialogue* GetDialogue();
};

// 0x10 (0x50 - 0x40)
// Class NWX.DialogueExperienceStateEvent
class UDialogueExperienceStateEvent : public UDialogueEvents
{
public:
	class UExperienceStateIDBuilder*             ExperienceState;                                   // 0x40(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Change;                                            // 0x48(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_87CA[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDialogueExperienceStateEvent* GetDefaultObj();

};

// 0x10 (0x38 - 0x28)
// Class NWX.DialogueExperienceStateRequirement
class UDialogueExperienceStateRequirement : public UDialogueConditions
{
public:
	class UExperienceStateIDBuilder*             ExperienceState;                                   // 0x28(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowAdvanced;                                     // 0x30(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ENWXMathComparison                Comparator;                                        // 0x31(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_87CF[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        TargetValue;                                       // 0x34(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UDialogueExperienceStateRequirement* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class NWX.DialogueRequirement
class UDialogueRequirement : public UDialogueConditions
{
public:
	class URequirement*                          Requirement;                                       // 0x28(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UDialogueRequirement* GetDefaultObj();

};

// 0x8 (0x48 - 0x40)
// Class NWX.DialogueReward
class UDialogueReward : public UDialogueEvents
{
public:
	class URewardBehaviour*                      Reward;                                            // 0x40(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnTemplate, InstancedReference, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UDialogueReward* GetDefaultObj();

};

// 0xA0 (0x3D0 - 0x330)
// Class NWX.StructureVolumeAkLateReverbComponent
class UStructureVolumeAkLateReverbComponent : public UAkLateReverbComponent
{
public:
	uint8                                        Pad_87DC[0x50];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ReverbTime;                                        // 0x380(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_87DE[0x4C];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UStructureVolumeAkLateReverbComponent* GetDefaultObj();

	class FString GetAuxBusName();
};

// 0x60 (0x430 - 0x3D0)
// Class NWX.DirectionalSectorStructureVolumeAkLateReverbComponent
class UDirectionalSectorStructureVolumeAkLateReverbComponent : public UStructureVolumeAkLateReverbComponent
{
public:
	uint8                                        Pad_87E0[0x60];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDirectionalSectorStructureVolumeAkLateReverbComponent* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.DisciplineUIDataFunctionLibrary
class UDisciplineUIDataFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UDisciplineUIDataFunctionLibrary* GetDefaultObj();

	void TryGetDisciplineUIData(struct FGameplayTag& DisciplineTag, struct FDisciplineUIData* OutData, enum class EGetResult* OutBranch);
};

// 0x50 (0x80 - 0x30)
// Class NWX.DisciplineUIDataRegistry
class UDisciplineUIDataRegistry : public UDataAsset
{
public:
	TMap<struct FGameplayTag, struct FDisciplineUIData> Data;                                              // 0x30(0x50)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UDisciplineUIDataRegistry* GetDefaultObj();

};

// 0x20 (0x2C8 - 0x2A8)
// Class NWX.DiscoverableDataComponent
class UDiscoverableDataComponent : public USceneComponent
{
public:
	struct FGuid                                 DiscoverableId;                                    // 0x2A8(0x10)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDataTableRowHandle                   DiscoverablePresentationDataHandle;                // 0x2B8(0x10)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UDiscoverableDataComponent* GetDefaultObj();

	struct FDiscoverableData GetDiscoverableData();
};

// 0x28 (0x2F0 - 0x2C8)
// Class NWX.DiscoverableRadiusComponent
class UDiscoverableRadiusComponent : public UDiscoverableDataComponent
{
public:
	bool                                         bStartEnabled;                                     // 0x2C8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_87F5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        DiscoveryRadius;                                   // 0x2CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnDiscoveredByPlayer;                              // 0x2D0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         bIsEnabled;                                        // 0x2E0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_87F7[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          OverlapCheckTimerHandle;                           // 0x2E8(0x8)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UDiscoverableRadiusComponent* GetDefaultObj();

	void CrossServer_SetEnabled(bool bIsEnabledParameter);
};

// 0x0 (0x28 - 0x28)
// Class NWX.NWXDiscoveryBlueprintLibrary
class UNWXDiscoveryBlueprintLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UNWXDiscoveryBlueprintLibrary* GetDefaultObj();

	void GetRealmRewardsFromSettings(struct FRealmSettings& RealmSettings, TArray<class UConditionalRewardSet*>* OutRewards);
	void GetNarrativeNPCsFromRealm(class UObject* WorldContextObject, struct FRealmSettings& RealmSettings, TArray<struct FNWXNPCNarrativeData>* OutNPCs);
	void GetFactionsFromRealm(struct FRealmSettings& RealmSettings, TArray<enum class EFaction>* Factions);
	void GetCurrentRealmRewards(class ANWXGameStateBase* GameState, TArray<class UConditionalRewardSet*>* OutRewards);
	void GetCreaturesFromRealm(struct FRealmSettings& RealmSettings, TArray<struct FDataTableRowHandle>* SpawnerData);
};

// 0x28 (0x50 - 0x28)
// Class NWX.DiscoveryExperienceStateIDBuilder
class UDiscoveryExperienceStateIDBuilder : public UExperienceStateIDBuilder
{
public:
	TSoftObjectPtr<class UDiscoveryDataAsset>    Discovery;                                         // 0x28(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UDiscoveryExperienceStateIDBuilder* GetDefaultObj();

	struct FExperienceStateID Build(TSoftObjectPtr<class UDiscoveryDataAsset>& DiscoveryDataAsset);
};

// 0x0 (0x28 - 0x28)
// Class NWX.DiscoveryExperienceStateIDEnumerator
class UDiscoveryExperienceStateIDEnumerator : public UExperienceStateDefinitionSource
{
public:

	static class UClass* StaticClass();
	static class UDiscoveryExperienceStateIDEnumerator* GetDefaultObj();

};

// 0x10 (0x38 - 0x28)
// Class NWX.TestDiscoveryExperienceStateIDEnumerator
class UTestDiscoveryExperienceStateIDEnumerator : public UExperienceStateDefinitionSource
{
public:
	TArray<struct FSoftObjectPath>               TestDiscoveryAssets;                               // 0x28(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UTestDiscoveryExperienceStateIDEnumerator* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.DiscoveryRewardTagReciever
class IDiscoveryRewardTagReciever : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IDiscoveryRewardTagReciever* GetDefaultObj();

	bool IsDiscoveryRewardTagHandled(const struct FGameplayTag& GameplayTag);
	void HandleDiscoveryRewardFromTag(const struct FGameplayTag& GameplayTag);
};

// 0x20 (0x50 - 0x30)
// Class NWX.DiscoverySet
class UDiscoverySet : public UDataAsset
{
public:
	struct FDirectoryPath                        Directory;                                         // 0x30(0x10)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftObjectPtr<class UDiscoveryDataAsset>> Discoveries;                                       // 0x40(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UDiscoverySet* GetDefaultObj();

};

// 0x170 (0x210 - 0xA0)
// Class NWX.DiscoverySystem
class UDiscoverySystem : public UActorComponent
{
public:
	uint8                                        Pad_8842[0x30];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class ANWXPlayerState*                       OwningState;                                       // 0xD0(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8843[0x118];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UDiscoveryDataAsset*>           PendingAdds;                                       // 0x1F0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8844[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDiscoverySystem* GetDefaultObj();

	void OnExperienceStatesReady();
};

// 0x0 (0x40 - 0x40)
// Class NWX.NWXGameplayEffectExecutionCalculation
class UNWXGameplayEffectExecutionCalculation : public UGameplayEffectExecutionCalculation
{
public:

	static class UClass* StaticClass();
	static class UNWXGameplayEffectExecutionCalculation* GetDefaultObj();

	void GetTransientAggregatorMagnitude(struct FGameplayEffectCustomExecutionParameters& ExecutionParams, struct FGameplayTag& AggregateIdentifier, float* Magnitude);
	void GetTargetAttributeMagnitude(struct FGameplayEffectCustomExecutionParameters& ExecutionParams, struct FGameplayAttribute& Attribute, float* Magnitude);
	class UAbilitySystemComponent* GetTargetAbilitySystemComponent(struct FGameplayEffectCustomExecutionParameters& ExecutionParams);
	void GetSourceAttributeMagnitude(struct FGameplayEffectCustomExecutionParameters& ExecutionParams, struct FGameplayAttribute& Attribute, float* Magnitude);
	class UAbilitySystemComponent* GetSourceAbilitySystemComponent(struct FGameplayEffectCustomExecutionParameters& ExecutionParams);
	float GetEffectPeriod(struct FGameplayEffectCustomExecutionParameters& ExecutionParams);
};

// 0x0 (0x40 - 0x40)
// Class NWX.DoTCalculation
class UDoTCalculation : public UNWXGameplayEffectExecutionCalculation
{
public:

	static class UClass* StaticClass();
	static class UDoTCalculation* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.DynamicCollisionVolumeInterface
class IDynamicCollisionVolumeInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IDynamicCollisionVolumeInterface* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.DynamicDataVolumeInterface
class IDynamicDataVolumeInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IDynamicDataVolumeInterface* GetDefaultObj();

};

// 0x228 (0x4E8 - 0x2C0)
// Class NWX.DynamicResourceSpawningManager
class ADynamicResourceSpawningManager : public AManagerBase
{
public:
	uint8                                        Pad_8891[0x1B0];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UDataTable>             ResourceRarityDistributionDTPtr;                   // 0x470(0x28)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UDataTable>             ResourceCategoryToItemTraitsMappingDTPtr;          // 0x498(0x28)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UCurveTable>            POIResourceProgresionCurvePtr;                     // 0x4C0(0x28)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class ADynamicResourceSpawningManager* GetDefaultObj();

	void BuildResourceRarityBucketsCache(struct FRealmSettings& RealmSettings);
};

// 0x170 (0x210 - 0xA0)
// Class NWX.DynamicSpawningManagerComponent
class UDynamicSpawningManagerComponent : public UActorComponent
{
public:
	TMap<enum class EDynamicSpawnCategory, int32> NumberOfDynamicEncountersPerCategory;              // 0xA0(0x50)(Edit, EditFixedSize, NativeAccessSpecifierPublic)
	float                                        RespawnEncounterNoPlayerRadius;                    // 0xF0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RespawnEncounterRetryTimePlayerInRange;            // 0xF4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SpawnNewEncounterCooldown;                         // 0xF8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_889F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AEncounterConfig>          EncounterClassType;                                // 0x100(0x8)(Edit, ZeroConstructor, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_88A1[0xF0];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UDynamicSpawningDataAsset*             DynamicSpawningDataAsset;                          // 0x1F8(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDataTable*                            DynamicWildlifeSpawnersDataTable;                  // 0x200(0x8)(ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_88A2[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDynamicSpawningManagerComponent* GetDefaultObj();

	void DynamicEncounterFinished(class AEncounterConfig* Encounter);
};

// 0x98 (0xC0 - 0x28)
// Class NWX.NWXEditorTemporalRealmConfigSettings
class UNWXEditorTemporalRealmConfigSettings : public UObject
{
public:
	bool                                         bUseTemporalConfigOverride;                        // 0x28(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_88A7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Seed;                                              // 0x2C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsCurated;                                        // 0x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_88AA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                PortalTargetDeploymentID;                          // 0x38(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDebugRealm;                                     // 0x48(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_88AC[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                POIDistributionKey;                                // 0x50(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UItemDataAsset>         BiomeCard;                                         // 0x60(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSoftObjectPtr<class UItemDataAsset>> MajorCards;                                        // 0x88(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 AdditionalTags;                                    // 0x98(0x20)(Edit, BlueprintVisible, BlueprintReadOnly, Config, NativeAccessSpecifierPublic)
	bool                                         bOverrideBaseRealmPower;                           // 0xB8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_88B0[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        RealmPowerOverride;                                // 0xBC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UNWXEditorTemporalRealmConfigSettings* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.EffectsBlueprintFunctionLibrary
class UEffectsBlueprintFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UEffectsBlueprintFunctionLibrary* GetDefaultObj();

	void TriggerRealmicTransmuterPlayerEffects(class UObject* WorldContextObject, struct FVector& TransmuterLocation);
	bool SimpleUnderwaterTest(class AActor* Actor, enum class ETraceTypeQuery WaterTraceType, float TestDistance);
	bool ShouldSpawnVFXBasedOnFocusRank(class AActor* VFXInstigator, int32 RankThreshold, bool UseGlobalRank);
	bool ShouldPlayFirstPersonAudio(class ANWXCharacter* AudioInstigator);
	void SetTexture2DObject(class UNiagaraComponent* NiagaraSystem, const class FString& OverrideName, class UTexture* Texture);
	void SetHiddenInGameFromVFXContext(class USceneComponent* Target, bool bNewHidden, bool bPropagateToChildren);
	TSoftObjectPtr<class UAkAudioEvent> ResolveTaggableSound(struct FTaggableSound& TaggableSound, struct FGameplayTagContainer& TagsToSearch);
	class UAkAudioEvent* ResolveAudio(TSoftObjectPtr<class UAkAudioEvent>& AudioSoftPath);
	bool LineTraceForWaterHit(class AActor* WorldContextActor, struct FVector& StartTraceLocation, struct FVector& EndTraceLocation, enum class ETraceTypeQuery WaterTraceType, TArray<class AActor*>& IgnoredActorArray, float* OutWaterDepth, struct FHitResult* OutHitResult);
	bool LineTraceForWaterFootstep(class AActor* Actor, class UCapsuleComponent* Capsule, enum class ETraceTypeQuery WaterTraceType, float* WaterDepth, struct FVector* WaterHitNormal, struct FVector* WaterHitLocation);
	bool IsShippingBuild();
	bool IsPointUnderwaterNoBlockers(class UObject* WorldContext, struct FVector& Point, float TestDistance, enum class ECollisionChannel WaterTraceChannel, enum class ECollisionChannel BlockingTraceChanel, TArray<class AActor*>& BlockersToIgnore, float* OutWaterDepth);
	bool IsPointUnderwater(class UObject* WorldContext, struct FVector& Point, float TestDistance, enum class ECollisionChannel TraceChannel, float* OutWaterDepth);
	bool IsFirstPersonCharacter(class AActor* Actor);
	void GetParticleOrientation(struct FVector& ImpactSourceDirection, struct FVector& Location, struct FVector& SurfaceNormal, struct FRotator* OutAligningReflectionRotator, struct FRotator* OutAligningNormalRotator, struct FRotator* OutAligningNormalDoubleXRotator, struct FRotator* OutAligningTotalReflectionRotator, struct FRotator* OutAligningNoDeviationRotator);
	bool GetNiagaraComponentLocalBounds(class UNiagaraComponent* NiagaraComponent, struct FBox* OutBounds);
	class UMusicManager* GetMusicManager(class UObject* WorldContextObject);
	class UAmbienceManager* GetAmbienceManager(class UObject* WorldContextObject);
	class UAkSwitchValue* GetAkSwitchFromMeshArray(TArray<class UMeshComponent*>& MeshComponents, bool bIgnoreHiddenMeshes, bool bIgnoreMeshesWithoutCollision);
	class UAkSwitchValue* GetAkSwitchFromMesh(class UMeshComponent* MeshComponent);
	void GatherTreeInstances(TArray<struct FActorAndInstanceIds>& ActorAndInstanceIds, TMap<class AActor*, struct FIIMInstanceFilterCache>& PreFilteredInstances, TMap<class FName, struct FIIMExtents>& InOutExtents, TMap<class FName, struct FAmbienceDataReference>& InOutAmbienceData, TArray<struct FIIMInstance>* OutInstances);
	void GatherInstanceOfState(TArray<struct FActorAndInstanceIds>& ActorAndInstanceIds, enum class EIIMGameplayState State, TMap<class FName, struct FIIMExtents>& InOutExtents, TMap<class FName, struct FAmbienceDataReference>& InOutAmbienceData, TArray<struct FIIMInstance>* OutInstances);
	void FindClosestWaterBodyRiverSplinePointFlow(class AActor* PlayerActor, struct FVector* OutFlowDirection, float* OutFlowSpeed);
	bool FindClosestCollisionPointOnOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, struct FVector* ClosestPoint);
	void EndRealmicTransmuterPlayerEffects(class UObject* WorldContextObject);
	bool DoesActorMeetFocusRankThreshold(class AActor* Actor, int32 RankThreshold, bool bApplyScalability, bool bUseGlobalRank);
	struct FAmbienceData CopyAmbienceData(struct FAmbienceDataReference& AmbienceDataReference);
	void CheckAndSelectRagDollSocketData(bool& bIsRagDolling, float& DeltaTime, class UNiagaraComponent*& SpawnedNiagaraComponent, class USkeletalMeshComponent* SkeletalMeshComponent, struct FGameplayTag& CurrentSurfaceGameplayTag, enum class ETraceTypeQuery GroundTraceTypeQuery, enum class ETraceTypeQuery LiquidTraceTypeQuery, struct FRagDollSocketsData& SocketsData, bool* bOutIsVfxNeeded, bool* bOutIsSurfaceTagChangeNeeded, struct FHitResult* OutHitResult, TArray<struct FLiquidHitData>* OutLiquidHits, float* OutScaledVelocity, float* OutScaleOverride);
	float CalculateScaleOverride(float CreatureRadius, float BoundsMultiplier, float MinimumValue, float MaximumValue);
	struct FVector CalculateImpactSourceDirection(bool ShouldOverrideImpactDirection, struct FVector& OverriddenImpactDirection, struct FVector& TraceStart, struct FVector& TraceEnd, struct FRotator& CameraRotation);
	void BatchAsyncLoadAudio(class UObject* WorldContext, TArray<TSoftObjectPtr<class UAkAudioEvent>>& AssetsSoftPaths, FDelegateProperty_& AsyncLoadComplete);
	void BatchAsyncLoad(class UObject* WorldContext, TArray<struct FSoftObjectPath>* AssetsSoftPaths, FDelegateProperty_& AsyncLoadComplete);
	void AttachWaterVFXAboveFoot(class UNiagaraComponent* NiagaraComponent, class AActor* SteppingActor, class USceneComponent* AttachToComponent, class FName& SocketName, struct FVector& SpawnLocation, struct FVector& WaterHitNormal, float WaterDepth);
	void AsyncLoadNiagaraAsset(class UObject* WorldContext, TSoftObjectPtr<class UNiagaraSystem>& AssetSoftPtr, FDelegateProperty_& AsyncLoadNiagaraAssetComplete);
	void AsyncLoadLoopingAudio(class UObject* WorldContext, TSoftObjectPtr<class UAkAudioEvent>& StartEventSoftPtr, TSoftObjectPtr<class UAkAudioEvent>& StopEventSoftPtr, FDelegateProperty_& AsyncLoadComplete);
	void AsyncLoadAudioState(class UObject* WorldContext, TSoftObjectPtr<class UAkStateValue>& StateSoftPtr, FDelegateProperty_& AsyncLoadComplete);
	void AsyncLoadAudioAndSwitches(class UObject* WorldContext, TSoftObjectPtr<class UAkAudioEvent>& EventSoftPath, TArray<TSoftObjectPtr<class UAkSwitchValue>>& SwitchesSoftPaths, FDelegateProperty_& AsyncLoadComplete);
	void AsyncLoadAudio(class UObject* WorldContext, TSoftObjectPtr<class UAkAudioEvent>& AssetsSoftPath, FDelegateProperty_& AsyncLoadComplete);
	void AsyncLoad(class UObject* WorldContext, struct FSoftObjectPath& AssetsSoftPath, FDelegateProperty_& AsyncLoadComplete);
	struct FGameplayTag AppendDamageModToImpactTag(struct FGameplayTag& ImpactTag, struct FGameplayTag& DamageModTag, struct FGameplayTagContainer& ResistDamageModTags, struct FGameplayTagContainer& WeakDamageModTags);
	bool AmbienceDataContainsTags(struct FAmbienceDataReference& AmbienceDataReference, struct FGameplayTagContainer& TagContainer);
};

// 0x38 (0xC8 - 0x90)
// Class NWX.EmoteRadialMenuEntry
class UEmoteRadialMenuEntry : public URadialMenuEntry
{
public:
	FMulticastInlineDelegateProperty_            OnEmoteSelected;                                   // 0x90(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A05[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UEmoteRadialMenuEntry* GetDefaultObj();

};

// 0x1A8 (0x448 - 0x2A0)
// Class NWX.EncounterBase
class AEncounterBase : public AActor
{
public:
	uint8                                        Pad_8A42[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnEncounterStart;                                  // 0x2B8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnEncounterFinish;                                 // 0x2C8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnEncounterCompleted;                              // 0x2D8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCombatStarted;                                   // 0x2E8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCombatEnded;                                     // 0x2F8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnEncounterActivated;                              // 0x308(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnEncounterStatusChanged;                          // 0x318(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	class UEncounterBridgeComponent*             EncounterBridgeComponent;                          // 0x328(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UNWXAIPOI_Component*                   NWXAIPOI_Component;                                // 0x330(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  EncounterName;                                     // 0x338(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEncounterDataAsset*                   EncounterData;                                     // 0x340(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AEncounterConfig*                      TargetActor;                                       // 0x348(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AActor*>                        ContextActors;                                     // 0x350(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, ExposeOnSpawn, NativeAccessSpecifierProtected)
	struct FGuid                                 EncounterID;                                       // 0x360(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                 EncounterInstanceID;                               // 0x370(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        EncounterRange;                                    // 0x380(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bNotifyPlayers;                                    // 0x384(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bEncounterIsActive;                                // 0x385(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_8A47[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        EncounterRefreshCounter;                           // 0x388(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        PlayerCount;                                       // 0x38C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EEncounterState                   EncounterRunState;                                 // 0x390(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_8A4A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FInventoryEntry>               ItemRewards;                                       // 0x398(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FEncounterFavourData>          FavourRewards;                                     // 0x3A8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FConditionalReward>            ConditionalRewards;                                // 0x3B8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	enum class EFaction                          EncounterFaction;                                  // 0x3C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EEncounterRewardType              EncounterRewardType;                               // 0x3C9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_8A4B[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TScriptInterface<class IEncounterManagerInterface> EncounterManagerInterface;                         // 0x3D0(0x10)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftClassPtr<class AEncounterMusic>         EncounterMusicPath;                                // 0x3E0(0x28)(Config, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EEncounterStatus                  EncounterStatus;                                   // 0x408(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8A4D[0x37];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UEncounterMarkupDataAsset> ExpectedMarkup;                                    // 0x440(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class AEncounterBase* GetDefaultObj();

	void Start();
	void SpawnRewardStructure();
	void SetPOILevel(class AActor* POIActor, int32 POIProgressionLevel);
	void SetEncounterStatus(enum class EEncounterStatus NewEncounterStatus);
	void SetEncounterState(enum class EEncounterState State);
	void SetEncounterResettable(bool bReset);
	void RefreshEncounter();
	void OnMusicAssetLoaded();
	void Initialize();
	class AEncounterConfig* GetTargetActor();
	void GetFirstContextActorOfClass(TSubclassOf<class AActor>& Class, bool* bSuccess, class AActor** ContextActor);
	enum class EEncounterStatus GetEncounterStatus();
	class FName GetEncounterName();
	struct FGuid GetEncounterInstanceID();
	struct FGuid GetEncounterID();
	class UEncounterDataAsset* GetEncounterData();
	void Finish(class AEncounterConfig* OverridePOITarget);
	void FailEncounterFromError(const class FString& ErrorMessage);
	void Fail(class AEncounterConfig* OverridePOITarget);
	void EncounterNPCInteraction();
	void CollectDebuggerShapes(TArray<struct FEncounterDebugLine>* OutDebugLines, TArray<struct FEncounterDebugPoint>* OutDebugPoints);
	class FString CollectDebuggerInformation();
	void CleanupEncounter();
	void BeginEncounter();
	void Award();
};

// 0x8 (0xA8 - 0xA0)
// Class NWX.EncounterBridgeComponent
class UEncounterBridgeComponent : public UActorComponent
{
public:
	uint8                                        Pad_8A5A[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UEncounterBridgeComponent* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.EncounterBridgeInterface
class IEncounterBridgeInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IEncounterBridgeInterface* GetDefaultObj();

};

// 0x0 (0xA0 - 0xA0)
// Class NWX.EncounterComponentBase
class UEncounterComponentBase : public UActorComponent
{
public:

	static class UClass* StaticClass();
	static class UEncounterComponentBase* GetDefaultObj();

	void InitializeEncounterComponent();
};

// 0x0 (0x30 - 0x30)
// Class NWX.EncounterComponentDataAsset
class UEncounterComponentDataAsset : public UPrimaryDataAsset
{
public:

	static class UClass* StaticClass();
	static class UEncounterComponentDataAsset* GetDefaultObj();

};

// 0x18 (0x48 - 0x30)
// Class NWX.EncounterComponentSpawnerAutomaticDataAsset
class UEncounterComponentSpawnerAutomaticDataAsset : public UEncounterComponentDataAsset
{
public:
	bool                                         bOverrideCreatureRealmPowerScalingValue;           // 0x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A67[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CreatureRealmPowerScalingValueOverride;            // 0x34(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FEncounterSpawnerWaveData>     EncounterSpawnerWaveData;                          // 0x38(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UEncounterComponentSpawnerAutomaticDataAsset* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class NWX.PlatformInterface
class IPlatformInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IPlatformInterface* GetDefaultObj();

	class FName GetPlatformLabel();
};

// 0x58 (0x2F8 - 0x2A0)
// Class NWX.PlatformActor
class APlatformActor : public AActor
{
public:
	uint8                                        Pad_8A74[0x58];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class APlatformActor* GetDefaultObj();

};

// 0x150 (0x1F0 - 0xA0)
// Class NWX.EncounterComponent_Markup
class UEncounterComponent_Markup : public UEncounterComponentBase
{
public:
	class AActor*                                Spawner;                                           // 0xA0(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                        MovingPlatforms;                                   // 0xA8(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                        ActivationVolumes;                                 // 0xB8(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class AActor*                                ExtractionActor;                                   // 0xC8(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                Gate;                                              // 0xD0(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                PortalCardMachine;                                 // 0xD8(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ANWXPlayerStart*                       UnlockableRespawnPoint;                            // 0xE0(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bRespawnPointIsExclusive;                          // 0xE8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8A7A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ANWXStructurePartProxyActor*>   StructuresToRemove;                                // 0xF0(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class ANWXStructurePartProxyActor*>   StructuresToBuild;                                 // 0x100(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class ANWXStructurePartProxyActor*>   CriticalStructures;                                // 0x110(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class ATargetPoint*                          TargetPoint_Reward;                                // 0x120(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class ATargetPoint*>                  TargetPoint_Spawners;                              // 0x128(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class ATargetPoint*>                  TargetPoint_ReachPoints;                           // 0x138(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class ATargetPoint*                          TargetPoint_Memory;                                // 0x148(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class ATargetPoint*>                  TargetPoint_MemoryTargets;                         // 0x150(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class ATargetPoint*>                  TargetPoint_GlyphTargets;                          // 0x160(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<int32, class ATargetPoint*>             TargetPoint_Interactables;                         // 0x170(0x50)(Edit, NativeAccessSpecifierPrivate)
	class ATargetPoint*                          TargetPoint_Rally;                                 // 0x1C0(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                EndFloorTrigger;                                   // 0x1C8(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                FloorSpawnPoint;                                   // 0x1D0(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                TowerShellActor;                                   // 0x1D8(0x8)(Edit, ZeroConstructor, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_            OnPOIPopulationChanged;                            // 0x1E0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UEncounterComponent_Markup* GetDefaultObj();

};

// 0x28 (0xC8 - 0xA0)
// Class NWX.EncounterComponent_Relevant
class UEncounterComponent_Relevant : public UEncounterComponentBase
{
public:
	uint8                                        Pad_8A86[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        POIProgressionLevel;                               // 0xA8(0x4)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8A87[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FGuid>                         EncounterIDs;                                      // 0xB0(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8A88[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UEncounterComponent_Relevant* GetDefaultObj();

};

// 0x28 (0xC8 - 0xA0)
// Class NWX.EncounterComponent_Spawners
class UEncounterComponent_Spawners : public UEncounterComponentBase
{
public:
