#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x74 (0x74 - 0x0)
// UserDefinedStruct S_Profile_Component_Randomize.S_Profile_Component_Randomize
struct FS_Profile_Component_Randomize
{
public:
	int32                                        Color_Row_5_F33B6C3641645C4FB1CF2881A78AC1C4;      // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Season_7_E11E0BA04AA87C40B250959038C91D61;         // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Moon_Visibilty_9_F4CDAEBF4025C122543475AC5E2CC807; // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Moon_A_Type_15_BE4C567C4978FCE11CAD22AA104DD558;   // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Moon_B_Type_16_8A4BD79743504AC4AD465A9F992B1A70;   // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Moon_C_Type_17_7879051D48A56607BA20659155B0B5A3;   // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Moon_D_Type_18_3EDD81A94E4A910C28BFDDAB57A66233;   // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Moon_E_Type_19_A661E7CB41E3990FBC223899967D7D0B;   // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Moon_A_Color_Row_25_7E6CA67B489ACDB49DF69CA6548FC279; // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Moon_B_Color_Row_26_6C27D34E44C831960D72258FC9FF6431; // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Moon_C_Color_Row_27_0199F24C479933D5F2E253A9AC629523; // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Moon_D_Color_Row_28_8E2719CE415ECE59B51581A85E3F27DB; // 0x2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Moon_E_Color_Row_29_E637FAA145F3F18629B87EACFB48D0E3; // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Moon_A_Saturation_35_5E4EE83943B407B226EB1FBCB021BCB6; // 0x34(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Moon_B_Saturation_36_CC7DE9DE4ED955E2960C08AA4B53628F; // 0x38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Moon_C_Saturation_37_9E981F4D469375448D3A25B749325417; // 0x3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Moon_D_Saturation_38_CAC2D15C488EA7A61B26239972B1A030; // 0x40(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Moon_E_Saturation_39_700A7C81481140513FA2C0B8C9BFEC1E; // 0x44(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Cloud_Index_A_45_D011A2E649A53D23CE29A8BFDCA58332; // 0x48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Cloud_Index_B_46_E4653D2A41282B916AE66B9378CCFF7B; // 0x4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Cloud_Index_C_47_FA87F5AD44D9FF85E9776896DD12944F; // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Cloud_Index_D_48_9B0ABB954A1370059B3491847EA0F69C; // 0x54(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Cloud_Index_E_49_6950CD9044366FD198B3DCA6A5D7504D; // 0x58(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Ring_Tile_53_612509C743ADC7E98171719B85956678;     // 0x5C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Ring_Color_54_801EDEE84A9EBC5E59A8F6910995FC0D;    // 0x60(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Nebula_Color_B_55_A2C7E21442E1795A6444FA9BEC841C44; // 0x64(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Nebula_Atm_Override_58_8757116647CA1C76FAB3148CAFE9678C; // 0x68(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Ring_Override_59_E5AA33D643FD4CF3E26AAEA9C7349ED2; // 0x69(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2E74[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Nebula_Brightness_Array_62_DC26254A4896C8E5C42415B59846D9FF; // 0x6C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Celestial_Type_64_299707064D62EBA3EB3D6A8836BF44C3; // 0x70(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


