#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xA0 (0xA0 - 0x0)
// UserDefinedStruct S_QuestNotificatorInfo.S_QuestNotificatorInfo
struct FS_QuestNotificatorInfo
{
public:
	class UObject*                               Icon_3_B708E5D440250E722536638194D23315;           // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	float                                        IconScale_43_9122F7FE4F984C995E7E3E9A040053D3;     // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4A90[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  QuestType_32_80ED37F84D88E8E9A0601B98A751387D;     // 0x10(0x18)(Edit, BlueprintVisible)
	class FText                                  QuestHeadline_27_0F29D2E443629A61AF7FECB6F4C7EAB9; // 0x28(0x18)(Edit, BlueprintVisible)
	class FText                                  QuestText_28_E299A4784C506DAE626EB5ABFC1AEF96;     // 0x40(0x18)(Edit, BlueprintVisible)
	struct FLinearColor                          IconFrameColor_6_563CD1824E5762594B3AE4B3E7485999; // 0x58(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          TextFrameColor_29_83C6021749BA483DC040E990E6844916; // 0x68(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         TextFrameParticles__33_96E976054159DB255D777383B66DE038; // 0x78(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4A9D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          TextFrameParticlesColor_34_A38BAFEE45B9A2E29F1E7D99A2B68D3D; // 0x7C(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IconFrameParticles__37_441D2A004127047AAC0EA5BA29AB1BD6; // 0x8C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4AA6[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          IconFrameParticlesColor_40_DD1F173646132C2250A54CBB7543AC2E; // 0x90(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


