#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xA0 (0xA0 - 0x0)
// UserDefinedStruct S_RapidColorAdjust.S_RapidColorAdjust
struct FS_RapidColorAdjust
{
public:
	struct FLinearColor                          Sand_Color_22_9515F3B146A19B70E2CD2AABE4D0F25F;    // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Sand_Blend_35_5E632A8D4BD777DDEE5C06B5FE490C7B;    // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          Foliage_Color_23_3D67E9FA4727C6E071403DB39C3CCD18; // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Foliage_Blend_36_A10C84DE403E69306F0CBBAC5A8EE345; // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          Bark_Color_24_766D19634594D98837C0269BF0E120CA;    // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Bark_Blend_37_42455ACD4080AC34EB47E8993FA2E1C8;    // 0x40(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          Grass_Color_25_25DEA5D84048802050D420B95B1C30A6;   // 0x48(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Grass_Blend_38_759436E142F7381044E39881E2B84F3E;   // 0x58(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          Rock_Color_26_DA4984344D5C9659D58FBD8613DF8627;    // 0x60(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Rock_Blend_39_76CE2546414618965544AEBE6EC5C6FD;    // 0x70(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          Water_Color_27_DC1BDB2B4FE820E194315B837C16AB9A;   // 0x78(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Water_Blend_40_5AFA1A214AB9D3D3EF234F99A9AF0D55;   // 0x88(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FRealmPlacementRequirement>    Realm_Placement_Requirement_21_1735A4B74E0AF5CF2653DF9326AB408F; // 0x90(0x10)(Edit, BlueprintVisible)
};

}


