#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x90 (0x90 - 0x0)
// UserDefinedStruct S_UI_Preferences_Guidebook.S_UI_Preferences_Guidebook
struct FS_UI_Preferences_Guidebook
{
public:
	struct FGameplayTag                          LastCategory_34_221F826E40B8AB9ED550DD888F0947CA;  // 0x0(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash)
	class FText                                  SearchText_5_DF216CFC420BE99CCE3582A3023BE5E9;     // 0x8(0x18)(Edit, BlueprintVisible)
	struct FGuid                                 LastSelectedEntryBuilding_49_F9A0B76F40C02300A647E3B7EF32C780; // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                 LastSelectedEntryRecipe_50_0CDC1CAE465EBE3EC0F5E4AE1C45E5E9; // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                 LastSelectedEntryCodex_51_51EA1A4F4831FD32257BA5B5508C8A7B; // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                 LastSelectedEntryTutorial_54_61F4E7E8484A3ACC4F7193828D0155AD; // 0x50(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGuid                                 LastSelectedEntryGlossary_57_184CFDD8413B56DAD24B8487D5112024; // 0x60(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagContainer                 LastOpenedGroups_60_D04FE712429C7810C972BF819A7A2594; // 0x70(0x20)(Edit, BlueprintVisible)
};

}


