#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x7 (0x7 - 0x0)
// Function WBP_PlayerMap_GridEntry.WBP_PlayerMap_GridEntry_C.ShowMeasureLabel
struct UWBP_PlayerMap_GridEntry_C_ShowMeasureLabel_Params
{
public:
	bool                                         Temp_bool_Variable;                                // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ESlateVisibility                  Temp_byte_Variable;                                // 0x1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ESlateVisibility                  Temp_byte_Variable_1;                              // 0x2(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_EqualEqual_IntInt_ReturnValue;            // 0x3(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_EqualEqual_IntInt_ReturnValue_1;          // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_BooleanAND_ReturnValue;                   // 0x5(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ESlateVisibility                  K2Node_Select_Default;                             // 0x6(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function WBP_PlayerMap_GridEntry.WBP_PlayerMap_GridEntry_C.PreConstruct
struct UWBP_PlayerMap_GridEntry_C_PreConstruct_Params
{
public:
	bool                                         IsDesignTime;                                      // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x2B8 (0x2B8 - 0x0)
// Function WBP_PlayerMap_GridEntry.WBP_PlayerMap_GridEntry_C.ExecuteUbergraph_WBP_PlayerMap_GridEntry
struct UWBP_PlayerMap_GridEntry_C_ExecuteUbergraph_WBP_PlayerMap_GridEntry_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Variable;                                 // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  Temp_text_Variable;                                // 0x8(0x18)(None)
	class FText                                  Temp_text_Variable_1;                              // 0x20(0x18)(None)
	class FText                                  Temp_text_Variable_2;                              // 0x38(0x18)(None)
	class FText                                  Temp_text_Variable_3;                              // 0x50(0x18)(None)
	class FText                                  Temp_text_Variable_4;                              // 0x68(0x18)(None)
	class FText                                  Temp_text_Variable_5;                              // 0x80(0x18)(None)
	class FText                                  Temp_text_Variable_6;                              // 0x98(0x18)(None)
	class FText                                  Temp_text_Variable_7;                              // 0xB0(0x18)(None)
	class FText                                  Temp_text_Variable_8;                              // 0xC8(0x18)(None)
	class FText                                  Temp_text_Variable_9;                              // 0xE0(0x18)(None)
	class FText                                  Temp_text_Variable_10;                             // 0xF8(0x18)(None)
	class FText                                  Temp_text_Variable_11;                             // 0x110(0x18)(None)
	class FText                                  Temp_text_Variable_12;                             // 0x128(0x18)(None)
	class FText                                  Temp_text_Variable_13;                             // 0x140(0x18)(None)
	class FText                                  Temp_text_Variable_14;                             // 0x158(0x18)(None)
	class FText                                  Temp_text_Variable_15;                             // 0x170(0x18)(None)
	class FText                                  Temp_text_Variable_16;                             // 0x188(0x18)(None)
	class FText                                  Temp_text_Variable_17;                             // 0x1A0(0x18)(None)
	class FText                                  Temp_text_Variable_18;                             // 0x1B8(0x18)(None)
	class FText                                  Temp_text_Variable_19;                             // 0x1D0(0x18)(None)
	class FText                                  Temp_text_Variable_20;                             // 0x1E8(0x18)(None)
	class FText                                  Temp_text_Variable_21;                             // 0x200(0x18)(None)
	class FText                                  Temp_text_Variable_22;                             // 0x218(0x18)(None)
	class FText                                  Temp_text_Variable_23;                             // 0x230(0x18)(None)
	class FText                                  Temp_text_Variable_24;                             // 0x248(0x18)(None)
	class FText                                  Temp_text_Variable_25;                             // 0x260(0x18)(None)
	bool                                         K2Node_Event_IsDesignTime;                         // 0x278(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4805[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Add_IntInt_ReturnValue;                   // 0x27C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  CallFunc_Conv_IntToText_ReturnValue;               // 0x280(0x18)(None)
	class FText                                  K2Node_Select_Default;                             // 0x298(0x18)(None)
	float                                        CallFunc_SetWidthOverride_InWidthOverride_ImplicitCast; // 0x2B0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_SetHeightOverride_InHeightOverride_ImplicitCast; // 0x2B4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


