#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x160 (0x3F8 - 0x298)
// BlueprintGeneratedClass BP_AISpawner_Master.BP_AISpawner_Master_C
class ABP_AISpawner_Master_C : public AActor
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x298(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class USphereComponent*                      SpawnRadius_DebugSphere;                           // 0x2A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBoxComponent*                         SpawningBox;                                       // 0x2A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                   Billboard;                                         // 0x2B0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       Scene;                                             // 0x2B8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<struct FAIOPendingSpawnGroup>         SpawnGroupsQueue;                                  // 0x2C0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FAIOPendingRespawnGroup>       RespawnGroupsQueue;                                // 0x2D0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<struct FAIOSubjectHandle>             SpawnedActorsHandles;                              // 0x2E0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class AActor*>                        SpawnedActors;                                     // 0x2F0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FTimerHandle                          TimerHandle_CheckSpawnRadius;                      // 0x300(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          TimeHandle_UpdateRespawningGroups;                 // 0x308(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       SpawnRadius;                                       // 0x310(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Box_Extent_X;                                      // 0x318(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                       Box_Extent_Y;                                      // 0x320(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	double                                       Box_Extent_Z;                                      // 0x328(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                        SpawnAmount;                                       // 0x330(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	enum class Enum_SpawnType                    SpawnType;                                         // 0x334(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_46A7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AActor>                    SpawnedActorClass;                                 // 0x338(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash)
	double                                       InitialSpawnDelay;                                 // 0x340(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       SpawningInterval;                                  // 0x348(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         bIsSpawning;                                       // 0x350(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_46A9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        TotalAliveActors;                                  // 0x354(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        TotalSpawnedActors;                                // 0x358(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         SkipNoSpawnAreaCheck_;                             // 0x35C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         SkipMeshes_;                                       // 0x35D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_46AA[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AActor*>                        MeshesToSpawnOn;                                   // 0x360(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, ExposeOnSpawn)
	int32                                        SpawnRetries;                                      // 0x370(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EAIORespawnMethod                 RespawnMethod;                                     // 0x374(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DisplayDebugInfo;                                  // 0x375(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_46AC[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       ProjectionRadius;                                  // 0x378(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ProjectionZOffset;                                 // 0x380(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsSpawningStopped;                                 // 0x388(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         WasSpawningInitialized;                            // 0x389(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_46AE[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        InvokersInsideRegion;                              // 0x38C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        SpawningCapacity;                                  // 0x390(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        ActorsSpawnedThisFrame;                            // 0x394(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            OnActorSpawned;                                    // 0x398(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	enum class Enum_AIBehviour                   Starting_Behaviour;                                // 0x3A8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_46B1[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               LocationToGoTo;                                    // 0x3B0(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class ABP_AIWaypoint_C*                      Waypoint;                                          // 0x3C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	class FString                                ArgumentForQuest;                                  // 0x3D0(0x10)(Edit, BlueprintVisible, ZeroConstructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         IsAtSettlementSpawn_;                              // 0x3E0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_46B4[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            SettlementSpawn;                                   // 0x3E8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

	static class UClass* StaticClass();
	static class ABP_AISpawner_Master_C* GetDefaultObj();

	void OverrideBehaviour(class AActor* Actor, class USD_AIComponent_C* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void GetCVarType(class FName* CVar, bool K2Node_SwitchEnum_CmpSuccess);
	void IsSpawnedClassReplicated(bool* Replicates);
	void SetWasSpawningInitialized(bool IsInitialized, const class FString& CallFunc_Concat_StrStr_ReturnValue, bool CallFunc_NotEqual_BoolBool_ReturnValue);
	void SetIsSpawningStopped(bool Stop, const class FString& CallFunc_Conv_BoolToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, bool CallFunc_NotEqual_BoolBool_ReturnValue);
	void ConvertWorldToLocalSpawnPoint(struct FAIOSpawnPoint& SpawnPoint_WorldSpace, struct FAIOSpawnPoint* SpawnPoint_LocalSpace, const struct FTransform& L_BoxTransform, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, const struct FTransform& CallFunc_MakeTransform_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location_1, const struct FRotator& CallFunc_BreakTransform_Rotation_1, const struct FVector& CallFunc_BreakTransform_Scale_1, const struct FRotator& CallFunc_InverseTransformRotation_ReturnValue, const struct FVector& CallFunc_InverseTransformLocation_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue_1, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue, const struct FAIOSpawnPoint& K2Node_MakeStruct_AIOSpawnPoint);
	void ConvertLocalToWorldSpawnPoint(struct FAIOSpawnPoint& SpawnPoint_LocalSpace, struct FAIOSpawnPoint* SpawnPoint_WorldSpace, const struct FTransform& L_BoxTransform, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, const struct FTransform& CallFunc_MakeTransform_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location_1, const struct FRotator& CallFunc_BreakTransform_Rotation_1, const struct FVector& CallFunc_BreakTransform_Scale_1, const struct FRotator& CallFunc_TransformRotation_ReturnValue, const struct FVector& CallFunc_TransformLocation_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue_1, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue, const struct FAIOSpawnPoint& K2Node_MakeStruct_AIOSpawnPoint);
	void ConvertWorldToLocalLocation(struct FVector& Point_Local, struct FVector* Point_World, const struct FTransform& L_BoxTransform, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, const struct FVector& CallFunc_InverseTransformLocation_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue);
	void ConvertLocalToWorldLocation(struct FVector& Point_Local, struct FVector* Point_World, const struct FTransform& L_BoxTransform, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, const struct FVector& CallFunc_TransformLocation_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue);
	void ProjectLocation(struct FVector& LocationToProject, bool* Success, struct FVector* ProjectedLocation, const struct FVector& L_ProjectedPoint, double L_TraceHeight, bool Temp_bool_Variable, enum class EDrawDebugTrace Temp_byte_Variable, enum class EDrawDebugTrace Temp_byte_Variable_1, int32 Temp_int_Variable, int32 CallFunc_Add_IntInt_ReturnValue, bool Temp_bool_Variable_1, bool CallFunc_Not_PreBool_ReturnValue, TArray<class AActor*>& Temp_object_Variable, TArray<class AActor*>& Temp_object_Variable_1, bool CallFunc_LessEqual_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, TArray<enum class EObjectTypeQuery>& K2Node_MakeArray_Array, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FHitResult& CallFunc_SphereTraceSingle_OutHit, bool CallFunc_SphereTraceSingle_ReturnValue, const struct FVector& CallFunc_MakeVector_ReturnValue_1, enum class EDrawDebugTrace K2Node_Select_Default, const struct FVector& CallFunc_MakeVector_ReturnValue_2, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue_1, const struct FVector& CallFunc_GetScaledBoxExtent_ReturnValue, const struct FHitResult& CallFunc_SphereTraceSingleForObjects_OutHit, bool CallFunc_SphereTraceSingleForObjects_ReturnValue, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, double CallFunc_Multiply_DoubleDouble_ReturnValue, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, class FName CallFunc_BreakHitResult_BoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, class UClass* CallFunc_GetObjectClass_ReturnValue, bool CallFunc_Array_Contains_ReturnValue, bool CallFunc_EqualEqual_ClassClass_ReturnValue, bool CallFunc_EqualEqual_ClassClass_ReturnValue_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, float CallFunc_SphereTraceSingleForObjects_Radius_ImplicitCast);
	void GetRandomSpawnPoint(struct FAIOSpawnPoint* SpawnPoint, bool* Success, const struct FAIOSpawnPoint& L_SpawnPoint, const struct FVector& L_RandomPoint_LocalSpace, const struct FVector& CallFunc_ConvertLocalToWorldLocation_Point_World, double CallFunc_BreakVector_X, double CallFunc_BreakVector_Y, double CallFunc_BreakVector_Z, bool CallFunc_ProjectLocation_Success, const struct FVector& CallFunc_ProjectLocation_ProjectedLocation, double CallFunc_RandomFloatInRange_ReturnValue, const struct FRotator& CallFunc_MakeRotator_ReturnValue, const struct FVector& CallFunc_GetScaledBoxExtent_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, double CallFunc_BreakVector_X_1, double CallFunc_BreakVector_Y_1, double CallFunc_BreakVector_Z_1, const struct FAIOSpawnPoint& K2Node_MakeStruct_AIOSpawnPoint, const struct FVector& CallFunc_MakeVector_ReturnValue, const struct FVector& CallFunc_RandomPointInBoundingBox_ReturnValue, float CallFunc_MakeRotator_Yaw_ImplicitCast);
	void UpdateSpawnerAfterActorWasKilled(int32 KilledAIAmount, bool CallFunc_Greater_IntInt_ReturnValue, float CallFunc_GetFloatCVar_ReturnValue, float CallFunc_GetFloatCVar_ReturnValue_1, const class FString& CallFunc_Conv_IntToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 CallFunc_Max_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, double CallFunc_AddGroupToRepsawn_Delay_ImplicitCast, double CallFunc_AddGroupToRepsawn_Delay_ImplicitCast_1);
	void OnSpawnedActorKilled(class AActor* KilledAI, class UAIOSubjectComponent* L_SubjectComponent, bool CallFunc_NotEqual_ObjectObject_ReturnValue, class UAIOSubjectComponent* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsDespawning_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Array_RemoveItem_ReturnValue, bool CallFunc_RemoveHandle_ReturnValue);
	void CanSpawnerRespawnActors(bool* Result, bool CallFunc_NotEqual_ByteByte_ReturnValue);
	void CanSpawnActors(bool* Result, bool CallFunc_IsAnyInvokerInRadius_Result, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	bool IsAnyInvokerInSpawnRegion(bool CallFunc_Greater_IntInt_ReturnValue);
	void IsAnyInvokerInRadius(double Radius, bool* Result, class AGameStateBase* L_GameState, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, double CallFunc_Square_ReturnValue, class UAIOptimizerSubsystem* CallFunc_GetWorldSubsystem_ReturnValue, float CallFunc_GetDistanceToClosestInvokerSquared_ReturnValue, bool CallFunc_LessEqual_DoubleDouble_ReturnValue, double CallFunc_LessEqual_DoubleDouble_A_ImplicitCast);
	void UpdateSpawnerAfterSpawnActor(bool* FinishedSpawningGroup, int32 Temp_int_Variable, int32 Temp_int_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, const class FString& CallFunc_Conv_IntToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_Conv_IntToString_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_3);
	void SpawnActor(class AActor* L_SpawnedActor, class UAIOSubjectComponent* L_SubjectComp, const struct FAIOSpawnPoint& L_SpawnPoint, bool CallFunc_NotEqual_ObjectObject_ReturnValue, class UAIOSubjectComponent* CallFunc_GetComponentByClass_ReturnValue, const struct FAIOSpawnPoint& CallFunc_GetRandomSpawnPoint_SpawnPoint, bool CallFunc_GetRandomSpawnPoint_Success, TScriptInterface<class ISpawnerInterface> CallFunc_SetSpawner_NewSpawner_CastInput, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, TScriptInterface<class IBPI_Quest_C> K2Node_DynamicCast_AsBPI_Quest, bool K2Node_DynamicCast_bSuccess, class AActor* CallFunc_FinishSpawningActor_ReturnValue);
	void UserConstructionScript(const struct FVector& CallFunc_MakeVector_ReturnValue, float CallFunc_SetSphereRadius_InSphereRadius_ImplicitCast);
	void AddGroupToSpawn(int32 AmountToSpawn);
	void TryToSpawnGroup();
	void SpawningLoop();
	void FinishedSpawningGroup();
	void ReceiveBeginPlay();
	void KillSpawnedActors(bool AllowRespawn);
	void UpdateRespawningGroups();
	void AddGroupToRepsawn(double Delay, int32 Amount);
	void CheckStartSpawningWithRadius();
	void ResetSpawner(bool ResetIsSpawningStopped);
	void InitSpawner();
	void InitSpawnByRadius();
	void OnSubjectSpawnedByOptimizerSubsystem(class UAIOSubjectComponent* SpawnedSubjectComponent);
	void OnSubjectDespawnedByOptimizerSubsystem(class UAIOSubjectComponent* DespawnedSubjectComponent);
	void PostSpawn(class AActor* SpawnedActor);
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason);
	void EventSettlement();
	void ExecuteUbergraph_BP_AISpawner_Master(int32 EntryPoint, double CallFunc_Conv_IntToDouble_ReturnValue, bool CallFunc_IsSpawnedClassReplicated_Replicates, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_GreaterEqual_IntInt_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Subtract_IntInt_ReturnValue_1, bool CallFunc_GreaterEqual_IntInt_ReturnValue_1, bool Temp_bool_IsClosed_Variable, bool Temp_bool_Has_Been_Initd_Variable, int32 K2Node_CustomEvent_AmountToSpawn, const class FString& CallFunc_Conv_IntToString_ReturnValue, const struct FAIOPendingSpawnGroup& K2Node_MakeStruct_AIOPendingSpawnGroup, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, bool CallFunc_Greater_IntInt_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_UpdateSpawnerAfterSpawnActor_FinishedSpawningGroup, int32 CallFunc_Array_Add_ReturnValue, bool CallFunc_CanSpawnActors_Result, bool K2Node_CustomEvent_AllowRespawn, const struct FAIOSubjectHandle& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue_2, int32 CallFunc_Max_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Subtract_IntInt_ReturnValue_3, int32 CallFunc_Max_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, double CallFunc_GetTimeSeconds_ReturnValue, double K2Node_CustomEvent_Delay, int32 K2Node_CustomEvent_Amount, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, const struct FAIOPendingSpawnGroup& K2Node_MakeStruct_AIOPendingSpawnGroup_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue_1, const class FString& CallFunc_Conv_IntToString_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_5, const class FString& CallFunc_Concat_StrStr_ReturnValue_6, bool CallFunc_Greater_IntInt_ReturnValue_1, bool CallFunc_Greater_DoubleDouble_ReturnValue, bool CallFunc_K2_IsTimerActiveHandle_ReturnValue, double CallFunc_GetTimeSeconds_ReturnValue_1, double CallFunc_Add_DoubleDouble_ReturnValue, const struct FAIOPendingRespawnGroup& K2Node_MakeStruct_AIOPendingRespawnGroup, const struct FAIOPendingRespawnGroup& CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Add_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_2, int32 CallFunc_Subtract_IntInt_ReturnValue_4, int32 CallFunc_Max_ReturnValue_2, bool CallFunc_GreaterEqual_DoubleDouble_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, int32 Temp_int_Array_Index_Variable_2, class AActor* CallFunc_Array_Get_Item_2, bool CallFunc_IsValid_ReturnValue, int32 Temp_int_Loop_Counter_Variable_2, int32 CallFunc_Subtract_IntInt_ReturnValue_5, bool CallFunc_IsAnyInvokerInRadius_Result, bool CallFunc_GreaterEqual_IntInt_ReturnValue_2, bool CallFunc_CanSpawnActors_Result_1, bool CallFunc_Greater_DoubleDouble_ReturnValue_1, bool K2Node_CustomEvent_ResetIsSpawningStopped, bool CallFunc_CanSpawnerRespawnActors_Result, bool CallFunc_Greater_IntInt_ReturnValue_2, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_IsValidClass_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue_2, bool CallFunc_BooleanAND_ReturnValue_1, int32 Temp_int_Variable, class UAIOptimizerSubsystem* CallFunc_GetWorldSubsystem_ReturnValue, class UAIOSubjectComponent* K2Node_Event_SpawnedSubjectComponent, bool CallFunc_RemoveDespawnedSubjectByHandle_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, class UAIOSubjectComponent* K2Node_Event_DespawnedSubjectComponent, int32 CallFunc_Array_Add_ReturnValue_2, bool CallFunc_HasAuthority_ReturnValue, bool CallFunc_Greater_DoubleDouble_ReturnValue_3, bool CallFunc_IsSpawnedClassReplicated_Replicates_1, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class AActor* K2Node_CustomEvent_SpawnedActor, enum class EEndPlayReason K2Node_Event_EndPlayReason, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_HasAuthority_ReturnValue_1, float CallFunc_GetFloatCVar_ReturnValue, class FName CallFunc_GetCVarType_CVar, double CallFunc_Conv_IntToDouble_ReturnValue_1, float CallFunc_GetFloatCVar_ReturnValue_1, double CallFunc_Multiply_DoubleDouble_ReturnValue, int32 CallFunc_FTrunc_ReturnValue, class FName CallFunc_GetCVarType_CVar_1, float CallFunc_GetFloatCVar_ReturnValue_2, double CallFunc_Multiply_DoubleDouble_ReturnValue_1, int32 CallFunc_FTrunc_ReturnValue_1, float K2Node_MakeStruct_SpawnGameTime_ImplicitCast, double CallFunc_GreaterEqual_DoubleDouble_B_ImplicitCast, float CallFunc_Delay_Duration_ImplicitCast, float CallFunc_Delay_Duration_ImplicitCast_1, float CallFunc_Delay_Duration_ImplicitCast_2, double CallFunc_AddGroupToRepsawn_Delay_ImplicitCast, double CallFunc_Multiply_DoubleDouble_B_ImplicitCast, double CallFunc_Multiply_DoubleDouble_B_ImplicitCast_1);
	void SettlementSpawn__DelegateSignature();
	void OnActorSpawned__DelegateSignature(class AActor* SpawnedActor);
};

}


