#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1B60 (0x1C00 - 0xA0)
// BlueprintGeneratedClass BP_SmartAIComponent.BP_SmartAIComponent_C
class UBP_SmartAIComponent_C : public UActorComponent
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xA0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                         Debug_Mode;                                        // 0xA8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4DCC[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Debug_Text_Duration;                               // 0xB0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                        Attackers;                                         // 0xB8(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class ABP_MasterInteractionPoint_C*          Interaction_Point;                                 // 0xC8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	enum class E_AIBehaviour                     AI_Current_Behaviour;                              // 0xD0(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4DD0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Still_Location;                                    // 0xD8(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               Still_Direction;                                   // 0xF0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MasterAIController_C*              AI_Controller;                                     // 0x108(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<double>                               Attackers_Forget_Time;                             // 0x110(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ACharacter*                            AI_Character;                                      // 0x120(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class ABP_MasterWayPoint_C*                  Way_Point;                                         // 0x128(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         Dead;                                              // 0x130(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4DD6[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Health;                                            // 0x134(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Accuracy;                                          // 0x138(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Combat_Equip_Weapon;                               // 0x140(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Only_Melee_When_No_Ammo;                           // 0x141(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4DD8[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UAnimSequenceBase*>             Death_Animations;                                  // 0x148(0x10)(Edit, BlueprintVisible)
	TArray<class ABP_MasterInteractionPoint_C*>  Specified_Interaction_Point;                       // 0x158(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                         Use_Interaction_Point_Tags;                        // 0x168(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_4DDA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          Interaction_Point_Tags;                            // 0x170(0x10)(Edit, BlueprintVisible)
	double                                       Interaction_Point_Range;                           // 0x180(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Use_Between_IP_Behavior;                           // 0x188(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_AIBehaviour                     Between_IP_Behaviour;                              // 0x189(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4DDD[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Between_IP_Behaviour_Time;                         // 0x190(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                AI_Base;                                           // 0x198(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                       AI_Base_Distance;                                  // 0x1A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Flee_Low_Health;                                   // 0x1A8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Flee_When_Found;                                   // 0x1AC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Face_Attacker_When_Hidden;                         // 0x1AD(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Should_Hide;                                       // 0x1AE(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4DE1[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Hide_Time_Length;                                  // 0x1B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                  Hidden_Montages;                                   // 0x1B8(0x10)(Edit, BlueprintVisible)
	double                                       Forget_Attackers_Time;                             // 0x1C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Forget_Attackers;                                  // 0x1D0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Return_To_Start_Location;                          // 0x1D1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_FleeSetting                     Flee_Type;                                         // 0x1D2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4DE6[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          Temp_Behavior_Timer;                               // 0x1D8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         Can_Melee_Attack;                                  // 0x1E0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4DE8[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Basic_Melee_Radius;                                // 0x1E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Basic_Melee_Collision;                             // 0x1F0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_OrderOptions                    Melee_Animation_Order;                             // 0x1F1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4DEC[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FS_MeleeAnimations>            Melee_Animations;                                  // 0x1F8(0x10)(Edit, BlueprintVisible)
	double                                       Melee_Distance;                                    // 0x208(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Melee_Switch_Distance;                             // 0x210(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_MeleeAnimations>            Lower_Melee_Animations;                            // 0x218(0x10)(Edit, BlueprintVisible)
	TMap<enum class E_HitboxTypeAI, double>      Melee_Damage;                                      // 0x228(0x50)(Edit, BlueprintVisible)
	double                                       Melee_Attack_Frequancy;                            // 0x278(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Use_Melee_Anim_Time_Frequency;                     // 0x280(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Can_Melee_Attack_While_Moving;                     // 0x281(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4DF2[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                Attack_Target;                                     // 0x288(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FVector                               Attack_Target_Last_Location;                       // 0x290(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               Search_Direction;                                  // 0x2A8(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Combat;                                            // 0x2C0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4DF7[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Wait_Time_Between_Searching;                       // 0x2C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Search_Area_Size;                                  // 0x2D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       RangeStartPoint;                                   // 0x2D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	int32                                        Current_Behavior_Index;                            // 0x2E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4DFD[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                Move_To_Actor;                                     // 0x2E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         Being_Interacted_With;                             // 0x2F0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Available_To_AI_Interact;                          // 0x2F1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Can_AI_Interact;                                   // 0x2F2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Only_Interact_With_AI_Teams;                       // 0x2F3(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E03[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          AI_Teams;                                          // 0x2F8(0x10)(Edit, BlueprintVisible)
	double                                       AI_Interact_Ranage;                                // 0x308(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AI_Interact_Time_Deviation;                        // 0x310(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_AIInteractAnim>             AI_Interaction_Animations;                         // 0x318(0x10)(Edit, BlueprintVisible)
	enum class E_OrderOptions                    AI_Interaction_Animation_Order;                    // 0x328(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E08[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       AI_Interact_Time;                                  // 0x330(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                        Melee_Hit_Actors;                                  // 0x338(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                         Temporary_Stop;                                    // 0x348(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_AIBehaviour                     End_Behaviour;                                     // 0x349(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E0A[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FName, enum class E_StimuliReaction> Current_Audio_Response;                            // 0x350(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                               Search_Location;                                   // 0x3A0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                        Flee_From_Actors;                                  // 0x3B8(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	struct FTimerHandle                          Forget_Attackers_Timer_Reference;                  // 0x3C8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	enum class E_AIBehaviour                     Temp_Behaviour;                                    // 0x3D0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Use_Trigger_Cooldown;                              // 0x3D1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E0C[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FS_TriggerResponse>            Trigger_Activated_Response;                        // 0x3D8(0x10)(Edit, BlueprintVisible)
	TArray<struct FS_TriggerResponse>            Trigger_Deactivated_Response;                      // 0x3E8(0x10)(Edit, BlueprintVisible)
	double                                       Trigger_Cooldown_Time;                             // 0x3F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Use_Proximity_Response;                            // 0x400(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E10[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FS_ReactSettings>              Proximity_Activated_Response;                      // 0x408(0x10)(Edit, BlueprintVisible)
	TArray<struct FS_ReactSettings>              Proximity_Deactivated_Response;                    // 0x418(0x10)(Edit, BlueprintVisible)
	bool                                         Proximity_Responce_Requires_Sight;                 // 0x428(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Use_Reaction_Cooldown;                             // 0x429(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E12[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Proximity_Cool_Down_Time;                          // 0x430(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Proximity_Sphere_Radius;                           // 0x438(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Current_Trigger_Cooldown_Time;                     // 0x440(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                Focus_Actor;                                       // 0x448(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       Current_Proximity_Cool_Down_Time;                  // 0x450(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_AttachedHoldables>          Attached_Holdables;                                // 0x458(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ABP_AIWeapon_Master_C*                 Holdable_Actor;                                    // 0x468(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         Block_Attack;                                      // 0x470(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E1E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Current_Emote_Index;                               // 0x474(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_EmoteAnimations                    Current_Emote;                                     // 0x478(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E21[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_EmoteProp_C*                       Emote_Actor;                                       // 0x488(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         Reloading;                                         // 0x490(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E24[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Current_Ammo;                                      // 0x494(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Searching_For_Target;                              // 0x498(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E28[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Attack_Target_Velocity;                            // 0x4A0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          Emote_Timer;                                       // 0x4B8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UClass*                                Temp_Holdable_Class;                               // 0x4C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         In_Transition;                                     // 0x4C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E2B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Current_Anim_Transition_Cooldown;                  // 0x4D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Current_Audio_Transition_Cooldown;                 // 0x4D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                             Second_Audio_Transition;                           // 0x4E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	enum class E_AIBehaviour                     Last_Non_Combat_Behaviour;                         // 0x4E8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         In_Override_Behaviour;                             // 0x4E9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_AIBehaviour                     Base_Behaviour;                                    // 0x4EA(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E34[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Base_Behaviour_Timer;                              // 0x4F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Use_Base_Behaviour;                                // 0x4F8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E36[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          Emote_Done_Timer;                                  // 0x500(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          Second_Anim_Transition;                            // 0x508(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         Ragdoll_On_Death;                                  // 0x510(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AI_Interact_Loop_Order_Anims;                      // 0x511(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_StartingAIBehaviours            AI_Interact_Between_Behaviour;                     // 0x512(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E3B[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Between_AI_Interact_Time;                          // 0x518(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*              Muzzle_Effect;                                     // 0x520(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, NoDestructor, HasGetValueTypeHash)
	double                                       From_Audio_Length;                                 // 0x528(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       LOS_Break_Search_Time;                             // 0x530(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            AI_Killed;                                         // 0x538(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	double                                       Dead_Despawned_Time;                               // 0x548(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_ReactedActors>              Reacted_Actors;                                    // 0x550(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                          Melee_Trace_Timer;                                 // 0x560(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FS_AIOptimization                     AI_Manager_Settings;                               // 0x568(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Allow_Friendly_Fire;                               // 0x574(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E41[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Combat_Search_Time;                                // 0x578(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                          Friendly_Tags;                                     // 0x580(0x10)(Edit, BlueprintVisible)
	double                                       Flee_Time;                                         // 0x590(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          Still_Override_Animation;                          // 0x598(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	enum class E_OrderOptions                    Still_Override_Order;                              // 0x5A0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E43[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UAnimMontage*>                  Still_Override_Anims;                              // 0x5A8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         Still_Behaviour_Override;                          // 0x5B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E47[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FS_GeneralSettings                    Still_Reaction_Settings;                           // 0x5C0(0xA8)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	TSet<enum class E_AIBehaviour>               Override_Behaviours;                               // 0x668(0x50)(Edit, BlueprintVisible)
	TArray<class UAnimMontage*>                  Priority_Montages;                                 // 0x6B8(0x10)(Edit, BlueprintVisible)
	double                                       Audio_Transition_Cooldown;                         // 0x6C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Animation_Transition_Cooldown;                     // 0x6D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_AllAIAnims                         AI_Animations;                                     // 0x6D8(0x4C8)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                         Use_Sight_Reaction_Time;                           // 0xBA0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E4D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Reaction_Time;                                     // 0xBA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Reacted_Actor_Time;                                // 0xBB0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	bool                                         Can_Crouch;                                        // 0xBB8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E51[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class E_AIBehaviour, double>       Movement_Speeds;                                   // 0xBC0(0x50)(Edit, BlueprintVisible)
	struct FS_GeneralSettings                    Default_Reaction_Settings;                         // 0xC10(0xA8)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	double                                       Flee_Distance;                                     // 0xCB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Flee_Distance_Cut_Off;                             // 0xCC0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_GeneralSettings                    Flee_Reaction_Settings;                            // 0xCC8(0xA8)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	double                                       Roam_Wait_Time;                                    // 0xD70(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Roam_Wait_Time_Deviation;                          // 0xD78(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Min_Roam_Distance;                                 // 0xD80(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Max_Roam_Distance;                                 // 0xD88(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Use_Prop_Anims;                                    // 0xD90(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E55[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Prop_Anim_Freequency;                              // 0xD98(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Prop_Anim_Frequency_Deviation;                     // 0xDA0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_OrderOptions                    Prop_Anim_Order;                                   // 0xDA8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E56[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FS_EmoteAnimations>            Prop_Anims_Animations;                             // 0xDB0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly)
	enum class E_OrderOptions                    Roam_Wait_Anim_Order;                              // 0xDC0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E58[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UAnimMontage*>                  Roam_Wait_Anims;                                   // 0xDC8(0x10)(Edit, BlueprintVisible)
	bool                                         Loop_Roam_Wait_Order_Anims;                        // 0xDD8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E5A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FS_GeneralSettings                    Roam_Reaction_Settings;                            // 0xDE0(0xA8)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_GeneralSettings                    Search_Reaction_Settings;                          // 0xE88(0xA8)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_GeneralSettings                    AI_Interact_Reaction_Settings;                     // 0xF30(0xA8)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	enum class E_OrderOptions                    Way_Point_Options;                                 // 0xFD8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Loop_Way_Points;                                   // 0xFD9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Reverse_Loop_Way_Point;                            // 0xFDA(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E5C[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ABP_MasterWayPoint_C*>          Way_Points;                                        // 0xFE0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate)
	struct FS_GeneralSettings                    Way_Point_Reaction_Settings;                       // 0xFF0(0xA8)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_GeneralSettings                    Face_Direction_Reaction_Settings;                  // 0x1098(0xA8)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	struct FS_GeneralSettings                    Melee_Reaction_Settings;                           // 0x1140(0xA8)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	double                                       Melee_Trace_Lenth;                                 // 0x11E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Max_Magazine_Ammo;                                 // 0x11F0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Per_Shot_Ammo_Reduction;                           // 0x11F4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          Reload_Montage;                                    // 0x11F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	int32                                        Max_Total_Ammo;                                    // 0x1200(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Use_Ammo;                                          // 0x1204(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Can_Reload;                                        // 0x1205(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Start_With_Full_Magazine;                          // 0x1206(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E67[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Max_Hit_Deviation__Projectile_;                    // 0x1208(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	double                                       Accuracy__Projectile_;                             // 0x1210(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Max_Miss_Deviation__Projectile_;                   // 0x1218(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	class UClass*                                Range_Projectile;                                  // 0x1220(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                       Trace_Range;                                       // 0x1228(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Trace_Radius;                                      // 0x1230(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Spread__Trace_;                                    // 0x1238(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Decal_LifeSpan__Trace_;                            // 0x1240(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<enum class EPhysicalSurface, class UMaterialInterface*> Surface_Decal__Trace_;                             // 0x1248(0x50)(Edit, BlueprintVisible)
	double                                       Decal_Fade_Distance__Trace_;                       // 0x1298(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<enum class EPhysicalSurface, class UParticleSystem*> Surface_Emitters__Trace_;                          // 0x12A0(0x50)(Edit, BlueprintVisible)
	struct FVector                               Surface_Decal_Size__Trace_;                        // 0x12F0(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class USoundCue*                             RangeShootSound;                                   // 0x1308(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         Can_Range_Attack_While_Moving;                     // 0x1310(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Use_Range_Anim_Time_Frequency;                     // 0x1311(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E6E[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Range_Attack_Frequency;                            // 0x1318(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Can_Range_Attack;                                  // 0x1320(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_OrderOptions                    Range_Attack_Anim_Order;                           // 0x1321(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E72[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UAnimMontage*>                  Range_Attack_Montages;                             // 0x1328(0x10)(Edit, BlueprintVisible)
	TMap<enum class E_HitboxTypeAI, double>      Range_Damage;                                      // 0x1338(0x50)(Edit, BlueprintVisible)
	double                                       Range_Attack_Distance;                             // 0x1388(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Projectile_Homing_Acceleration_Magnitude;          // 0x1390(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Homing_Projectile;                                 // 0x1398(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Use_Projectile_Actor_Settings;                     // 0x1399(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E7B[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FS_GeneralSettings                    Range_Reaction_Settings;                           // 0x13A0(0xA8)(Edit, BlueprintVisible, ContainsInstancedReference, HasGetValueTypeHash)
	class UParticleSystem*                       Range_Attack_Particle_Effect;                      // 0x1448(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class FName                                  Range_Attack_Particle_Socket;                      // 0x1450(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Use_Cover;                                         // 0x1458(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E7F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FS_GeneralSettings                    Follow_Reaction_Settings;                          // 0x1460(0xA8)(Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, HasGetValueTypeHash)
	class AActor*                                Follow_Actor;                                      // 0x1508(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	double                                       Max_Follow_Distance;                               // 0x1510(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Copy_Follow_Actor_Direction;                       // 0x1518(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Attack_Follow_Attack_Target;                       // 0x1519(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Attack_Follow_Attackers;                           // 0x151A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E92[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Follow_Attack_Distance;                            // 0x1520(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_StartingAIBehaviours            Follow_End_Behaviour;                              // 0x1528(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E94[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FS_GeneralSettings                    Interaction_Point_Reaction_Settings;               // 0x1530(0xA8)(Edit, BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, HasGetValueTypeHash)
	double                                       Flee_Base_Distance;                                // 0x15D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Require_Sight_Of_Attacker;                         // 0x15E0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E98[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Alert_Defenders_Distances;                         // 0x15E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                          Defend_Tags;                                       // 0x15F0(0x10)(Edit, BlueprintVisible)
	TArray<class AActor*>                        Defend_Actors;                                     // 0x1600(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate)
	double                                       Defend_Cooldown_Time;                              // 0x1610(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Standing_Half_Hight;                               // 0x1618(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_MasterWayPoint_C*                  Current_Way_Point;                                 // 0x1620(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	enum class E_AIBehaviour                     Last_Behaviour;                                    // 0x1628(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4E9D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Climb_End_Location;                                // 0x1630(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Time;                                              // 0x1648(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              Jump_Look_At_Rotation;                             // 0x1650(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FVector                               Jump_End_Location;                                 // 0x1668(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               End_Climb_Location;                                // 0x1680(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Climbing;                                          // 0x1698(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Forward_Blocked;                                   // 0x1699(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EA0[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Current_Climb_Hight;                               // 0x16A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Valt;                                              // 0x16A8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EA2[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Valt_End_Location;                                 // 0x16B0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               Object_Normal;                                     // 0x16C8(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAnimMontage*                          Climb_Anim;                                        // 0x16E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       Current_Alert_Cooldown_Time;                       // 0x16E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FS_ClimbAnims>                 Climb_Animations;                                  // 0x16F0(0x10)(Edit, BlueprintVisible)
	TArray<struct FS_ClimbAnims>                 Valt_Animations;                                   // 0x1700(0x10)(Edit, BlueprintVisible)
	double                                       Max_Drop_Down_Height;                              // 0x1710(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AActor*>                        Attack_Targets;                                    // 0x1718(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                         In_Cover;                                          // 0x1728(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Can_Climb;                                         // 0x1729(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Use_AI_Routine;                                    // 0x172A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EAB[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FS_RoutineSettings>            AI_Routines;                                       // 0x1730(0x10)(Edit, BlueprintVisible)
	class AActor*                                Time_of_Day;                                       // 0x1740(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          Routine_Timer;                                     // 0x1748(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	enum class E_OrderOptions                    Face_Direction_Anim_Order;                         // 0x1750(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Loop_Face_Direction_Anims;                         // 0x1751(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EB0[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UAnimMontage*>                  Face_Direction_Anims;                              // 0x1758(0x10)(Edit, BlueprintVisible, BlueprintReadOnly)
	bool                                         Delay_Range_Attack;                                // 0x1768(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EB4[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Range_Delay_Time;                                  // 0x1770(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Delay_Done;                                        // 0x1778(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Hit_React_Timer;                                   // 0x1779(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Use_Combat_Stance;                                 // 0x177A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EB6[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Hit_Reaction_Cooldown;                             // 0x1780(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Combat_Stance_Time;                                // 0x1788(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Use_Dead_Body_Reaction;                            // 0x1790(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_DeadBodyReaction                Dead_Body_Responce;                                // 0x1791(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Dead_Body_Reaction_Temporary;                      // 0x1792(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EBA[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Dead_Body_Temporary_Time;                          // 0x1798(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                          Dead_Body_Alert_Tags;                              // 0x17A0(0x10)(Edit, BlueprintVisible)
	double                                       Dead_Body_Alert_Range;                             // 0x17B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class FName>                          Dead_Body_React_Tags;                              // 0x17B8(0x10)(Edit, BlueprintVisible)
	bool                                         Dead_Body_Alert;                                   // 0x17C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EBE[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AActor*>                        Dead_Body_Alert_Actors;                            // 0x17D0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AActor*>                        Seen_Dead_Bodys;                                   // 0x17E0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                         Temperary_Response;                                // 0x17F0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EC2[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Temparary_Time;                                    // 0x17F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class E_DeadBodyReaction                Alerted_Response;                                  // 0x1800(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Can_Be_Alerted_AI;                                 // 0x1801(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EC4[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Yaw_Aim_Offset;                                    // 0x1808(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Aim_Offset_Enabled;                                // 0x1810(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EC6[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FS_MeleeAnimations                    Current_Melee_Anim;                                // 0x1818(0x58)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	double                                       Alert_Cooldown_Time;                               // 0x1870(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Use_Strafe;                                        // 0x1878(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4ECA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Min_Strafe_Distance;                               // 0x1880(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Max_Strafe_Distance;                               // 0x1888(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Allow_Strafe;                                      // 0x1890(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4ECD[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AActor*>                        Last_Proximity_Check;                              // 0x1898(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	enum class E_StartingAIBehaviours            Start_Behaviour;                                   // 0x18A8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4ECE[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                Start_Holdable;                                    // 0x18B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                Start_Range_Weapon;                                // 0x18B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UClass*                                Start_Melee_Weapon;                                // 0x18C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	bool                                         Activated;                                         // 0x18C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4ED0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          Combat_Stance_Timer;                               // 0x18D0(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         Combat_Stance;                                     // 0x18D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Call_Defenders;                                    // 0x18D9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         AI_Ready;                                          // 0x18DA(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4ED5[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Climb_Speed;                                       // 0x18E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Can_Block;                                         // 0x18E8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4ED8[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class E_BlockType, int32>          Block_Chances;                                     // 0x18F0(0x50)(Edit, BlueprintVisible)
	TArray<class UAnimMontage*>                  Melee_Block_Anims;                                 // 0x1940(0x10)(Edit, BlueprintVisible)
	struct FTimerHandle                          Block_Timer;                                       // 0x1950(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       Block_Cooldown;                                    // 0x1958(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UAnimMontage*>                  Blocked_Attack_Montages;                           // 0x1960(0x10)(Edit, BlueprintVisible)
	bool                                         Flee_Alert;                                        // 0x1970(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Can_Be_Flee_Alerted;                               // 0x1971(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EDD[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AActor*>                        Flee_Alert_Actors;                                 // 0x1978(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class FName>                          Flee_Alert_Tags;                                   // 0x1988(0x10)(Edit, BlueprintVisible)
	double                                       Flee_Alert_Distance;                               // 0x1998(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Aimed_Still_Override;                              // 0x19A0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EDF[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Flee_Start_Location;                               // 0x19A8(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Use_LOS_Search_Time;                               // 0x19C0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EE0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Projectile_Speed;                                  // 0x19C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Melee_Allow_Rotation;                              // 0x19D0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETraceTypeQuery                   CoverTraceChannel;                                 // 0x19D1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETraceTypeQuery                   AttackTraceChannel;                                // 0x19D2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EE3[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          Despawn_Timer;                                     // 0x19D8(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       DamageMulti;                                       // 0x19E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         InAttack;                                          // 0x19E8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Despawn_AI;                                        // 0x19E9(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EEE[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class E_Radius, int32>             Acceptable_Radius;                                 // 0x19F0(0x50)(Edit, BlueprintVisible)
	class FName                                  DeadAICapsuleCollision;                            // 0x1A40(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  DeadAIMeshCollision;                               // 0x1A48(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<enum class EPhysicalSurface, class USoundBase*> Surface_Sound__Trace_;                             // 0x1A50(0x50)(Edit, BlueprintVisible)
	class USoundCue*                             DeathSound;                                        // 0x1AA0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<enum class EPhysicalSurface, class UMaterialInterface*> Melee_Surface_Decal;                               // 0x1AA8(0x50)(Edit, BlueprintVisible)
	TMap<enum class EPhysicalSurface, class USoundBase*> Melee_Surface_Sounds;                              // 0x1AF8(0x50)(Edit, BlueprintVisible)
	TMap<enum class EPhysicalSurface, class UParticleSystem*> Melee_Emitters;                                    // 0x1B48(0x50)(Edit, BlueprintVisible)
	double                                       MeleeDetectHighOffset;                             // 0x1B98(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               MeleeDetectSize;                                   // 0x1BA0(0x18)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Respawn;                                           // 0x1BB8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EF5[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UAudioComponent*>               Sounds;                                            // 0x1BC0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                         AllowDynamicRespawnCheck;                          // 0x1BD0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EF7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  StreamLevelPackageName;                            // 0x1BD4(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EF8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                SpawnedBy;                                         // 0x1BE0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UBTS_FaceDirectionAnimations_C*        FaceDirectionTask;                                 // 0x1BE8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                        MaxHealth;                                         // 0x1BF0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4EF9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                Sight_Actor;                                       // 0x1BF8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UBP_SmartAIComponent_C* GetDefaultObj();

	void Actor_Attack_Target(class AActor** Attack_Target);
	void AI_Can_Interact_(bool* Can_Interact, bool CallFunc_Set_Contains_ReturnValue);
	void AI_Is_Dead_(bool* Dead);
	void DespawnCheck(class ABP_CampSpawner_Scavengers_C* K2Node_DynamicCast_AsBP_Camp_Spawner_Scavengers, bool K2Node_DynamicCast_bSuccess, class ABP_CampSpawner_Bandits_C* K2Node_DynamicCast_AsBP_Camp_Spawner_Bandits, bool K2Node_DynamicCast_bSuccess_1, class ABP_AISpawnPoint_C* K2Node_DynamicCast_AsBP_AISpawn_Point, bool K2Node_DynamicCast_bSuccess_2, class ABP_AISpawningVolume_C* K2Node_DynamicCast_AsBP_AISpawning_Volume, bool K2Node_DynamicCast_bSuccess_3, bool CallFunc_IsValid_ReturnValue);
