#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x60 (0x60 - 0x0)
// UserDefinedStruct PhotoModeComponentMenuIcons.PhotoModeComponentMenuIcons
struct FPhotoModeComponentMenuIcons
{
public:
	class UTexture2D*                            ChangeTab_46_8FD2727B43472B5E6153E29722A7F2BC;     // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            ClosePhotoMode_22_59B3A2F7430BB721A4FBC3B2F5273529; // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            HideMenu_16_54AE368F40B108679A2E8082526C4CC7;      // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            ResetValue_23_A060207D44781B6BCAE6AE9BBA5D4FD9;    // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            FreeCamera_25_F9C327D14FD848C5B9447F8ECD7930A4;    // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            ShowMouseCursor_18_2C71D581425935A02EBB7B9432A84A69; // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            Up_27_EB1779894921245F0BF9DA987040C50D;            // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            Down_29_22DF6E244B88E81CA453448C9F12E460;          // 0x38(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            Left_43_5B7E817C4553FA28AD4EA28FB1FDAE23;          // 0x40(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            Right_45_ACC4784C474DB07D4FF16084C565D92D;         // 0x48(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            TakePicture_31_CB06B53D4929BBE21AEA979C7ED33F80;   // 0x50(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            OpenGallery_39_6B55260A49DA2212EC3709A31AA125AB;   // 0x58(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
};

}


