#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x690 (0x690 - 0x0)
// UserDefinedStruct S_ServerEquippedItems.S_ServerEquippedItems
struct FS_ServerEquippedItems
{
public:
	struct FRepItemInfo                          EquippedPrimary_6_27F872F64826604D9E144B835F76AAA1; // 0x0(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRepItemInfo                          EquippedSecondary_9_D9C5EBD3498FCB04AFC073AF597D0E61; // 0x50(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRepItemInfo                          EquippedPistol_18_68214F6745B9623EC27562AA1DFFE07F; // 0xA0(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRepItemInfo                          EquippedMelee_20_2283163D415F1E31B016B19F2F5C5262; // 0xF0(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRepItemInfo                          EquippedArmor_4_8AE6F97846E0F3067404628BBA8FD496;  // 0x140(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRepItemInfo                          EquippedBackpack_30_A980E63A441FE0EF1756E2BB5EF88F82; // 0x190(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRepItemInfo                          EquippedContainer_55_8AC8653C42B55B98B18B409ADF11C9D0; // 0x1E0(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRepItemInfo                          EquippedFacewear_56_023355084FFB67B156D00A8D1F88F489; // 0x230(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRepItemInfo                          EquippedHeadwear_57_1820AF744A68808040CE7AB76A7CDB39; // 0x280(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRepItemInfo                          EquippedEyewear_58_71FDAE8F453FE0DADB6317949C57DDCF; // 0x2D0(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRepItemInfo                          EquippedAccessories_59_307137BA447CB8C0EDCE3E95850C75BA; // 0x320(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRepItemInfo                          EquippedTorso_60_28D80C89469B81E7286ADB81BE5B9F0F; // 0x370(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRepItemInfo                          EquippedGloves_61_06F9E8664A16E6584B9772A436A872B0; // 0x3C0(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRepItemInfo                          EquippedLegs_62_DBAF50604B799AD8D36966B58FC8D116;  // 0x410(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRepItemInfo                          EquippedFeet_63_B2B117504F41691DC5BA379E94CB9449;  // 0x460(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRepItemInfo                          EquippedThrowable_54_63C4E2C548872D055C51F6B871FB94F2; // 0x4B0(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRepItemInfo                          EquippedBinoculars_40_90F738CB47272BFA8B782895190FC4F1; // 0x500(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRepItemInfo                          EquippedFlashlight_66_393B002D48803EA8636BEDA636BE750F; // 0x550(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRepItemInfo                          EquippedCompass_42_610F810F4A141F08E31BF2BB00FCBC91; // 0x5A0(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRepItemInfo                          EquippedFishingRod_50_0A021E0743C884DECD549BB340CDF21D; // 0x5F0(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FRepItemInfo                          EquippedMap_44_A34D90BB4A0265A14C22F881C5F5F07D;   // 0x640(0x50)(Edit, BlueprintVisible, HasGetValueTypeHash)
};

}


