#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x1A8 (0x1A8 - 0x0)
// Function Save_Difficulties.Save_Difficulties_C.SaveDifficulties
struct USave_Difficulties_C_SaveDifficulties_Params
{
public:
	float                                        CallFunc_GetFloatCVar_ReturnValue;                 // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_1;               // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_2;               // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_3;               // 0xC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_4;               // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_5;               // 0x14(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_6;               // 0x18(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_7;               // 0x1C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_8;               // 0x20(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_9;               // 0x24(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_10;              // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_11;              // 0x2C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_12;              // 0x30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_13;              // 0x34(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_14;              // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_15;              // 0x3C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_16;              // 0x40(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_17;              // 0x44(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_18;              // 0x48(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_19;              // 0x4C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_20;              // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_GetBoolCVar_ReturnValue;                  // 0x54(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_GetBoolCVar_ReturnValue_1;                // 0x55(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_E1[0x2];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_GetFloatCVar_ReturnValue_21;              // 0x58(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_22;              // 0x5C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_23;              // 0x60(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_24;              // 0x64(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_25;              // 0x68(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_GetBoolCVar_ReturnValue_2;                // 0x6C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_E5[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_GetFloatCVar_ReturnValue_26;              // 0x70(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_27;              // 0x74(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_28;              // 0x78(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_29;              // 0x7C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_30;              // 0x80(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_31;              // 0x84(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_32;              // 0x88(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_33;              // 0x8C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_34;              // 0x90(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_35;              // 0x94(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_36;              // 0x98(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_37;              // 0x9C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_38;              // 0xA0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFloatCVar_ReturnValue_39;              // 0xA4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_GetBoolCVar_ReturnValue_3;                // 0xA8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_EF[0x3];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_GetFloatCVar_ReturnValue_40;              // 0xAC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_GetBoolCVar_ReturnValue_4;                // 0xB0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_GetBoolCVar_ReturnValue_5;                // 0xB1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_F1[0x6];                                       // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       K2Node_VariableSet_BanditCampMultiplier_ImplicitCast; // 0xB8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_ScavengerHealth_ImplicitCast;   // 0xC0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_ScavengerCampMultiplier_ImplicitCast; // 0xC8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_BanditHealth_ImplicitCast;      // 0xD0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_ZombieDamage_ImplicitCast;      // 0xD8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_ZombieSpeed_ImplicitCast;       // 0xE0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_ZombieHealth_ImplicitCast;      // 0xE8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_ZombieAmount_ImplicitCast;      // 0xF0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_ZombieBossAmount_ImplicitCast;  // 0xF8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_ScalingDamage_ImplicitCast;     // 0x100(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_ScalingHealth_ImplicitCast;     // 0x108(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_NightBrightness_ImplicitCast;   // 0x110(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_InfestationsHealth_ImplicitCast; // 0x118(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_InfestationsMultiplier_ImplicitCast; // 0x120(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_AnimalAmount_ImplicitCast;      // 0x128(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_MilitaryHealth_ImplicitCast;    // 0x130(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_MilitaryCampMultiplier_ImplicitCast; // 0x138(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_StaminaRecoveryMultiplier_ImplicitCast; // 0x140(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_StaminaMultiplier_ImplicitCast; // 0x148(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_AiRespawnTimer_ImplicitCast;    // 0x150(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_RandomEventMultiplier_ImplicitCast; // 0x158(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_MaximumAirdrop_ImplicitCast;    // 0x160(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_MinimumAirdrop_ImplicitCast;    // 0x168(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_NightLength_ImplicitCast;       // 0x170(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_DayLength_ImplicitCast;         // 0x178(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_DamageMultiplier_ImplicitCast;  // 0x180(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_FuelMultiplier_ImplicitCast;    // 0x188(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_ThirstMultiplier_ImplicitCast;  // 0x190(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_HungerMultiplier_ImplicitCast;  // 0x198(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       K2Node_VariableSet_XpMultiplier_ImplicitCast;      // 0x1A0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xD90 (0xD90 - 0x0)
// Function Save_Difficulties.Save_Difficulties_C.LoadDifficulties
struct USave_Difficulties_C_LoadDifficulties_Params
{
public:
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue;          // 0x0(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_1;        // 0x10(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData;                 // 0x20(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_1;               // 0x58(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_2;        // 0x90(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_3;        // 0xA0(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_2;               // 0xB0(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_3;               // 0xE8(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_4;        // 0x120(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_5;        // 0x130(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_4;               // 0x140(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_5;               // 0x178(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_6;        // 0x1B0(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_7;        // 0x1C0(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_6;               // 0x1D0(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_7;               // 0x208(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_8;        // 0x240(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_9;        // 0x250(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_8;               // 0x260(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_9;               // 0x298(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_10;       // 0x2D0(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_11;       // 0x2E0(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_10;              // 0x2F0(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_11;              // 0x328(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_12;       // 0x360(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_13;       // 0x370(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_12;              // 0x380(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_13;              // 0x3B8(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_14;       // 0x3F0(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_15;       // 0x400(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_14;              // 0x410(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_15;              // 0x448(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_16;       // 0x480(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_17;       // 0x490(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_16;              // 0x4A0(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_17;              // 0x4D8(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_18;       // 0x510(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_19;       // 0x520(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_18;              // 0x530(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_19;              // 0x568(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_20;       // 0x5A0(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_21;       // 0x5B0(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_20;              // 0x5C0(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_21;              // 0x5F8(0x38)(None)
	class FString                                CallFunc_Conv_BoolToString_ReturnValue;            // 0x630(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_BoolToString_ReturnValue_1;          // 0x640(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_22;              // 0x650(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_23;              // 0x688(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_22;       // 0x6C0(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_23;       // 0x6D0(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_24;              // 0x6E0(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_25;              // 0x718(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_24;       // 0x750(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_25;       // 0x760(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_26;              // 0x770(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_27;              // 0x7A8(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_26;       // 0x7E0(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_BoolToString_ReturnValue_2;          // 0x7F0(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_28;              // 0x800(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_29;              // 0x838(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_27;       // 0x870(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_28;       // 0x880(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_30;              // 0x890(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_31;              // 0x8C8(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_29;       // 0x900(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_30;       // 0x910(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_32;              // 0x920(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_33;              // 0x958(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_31;       // 0x990(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_32;       // 0x9A0(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_34;              // 0x9B0(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_35;              // 0x9E8(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_33;       // 0xA20(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_34;       // 0xA30(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_36;              // 0xA40(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_37;              // 0xA78(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_35;       // 0xAB0(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_36;       // 0xAC0(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_38;              // 0xAD0(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_39;              // 0xB08(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_37;       // 0xB40(0x10)(ZeroConstructor, HasGetValueTypeHash)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_38;       // 0xB50(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_40;              // 0xB60(0x38)(None)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_41;              // 0xB98(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_39;       // 0xBD0(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_42;              // 0xBE0(0x38)(None)
	class FString                                CallFunc_Conv_BoolToString_ReturnValue_3;          // 0xC18(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_43;              // 0xC28(0x38)(None)
	class FString                                CallFunc_Conv_BoolToString_ReturnValue_4;          // 0xC60(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_44;              // 0xC70(0x38)(None)
	class FString                                CallFunc_Conv_BoolToString_ReturnValue_5;          // 0xCA8(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_45;              // 0xCB8(0x38)(None)
	class FString                                CallFunc_Conv_DoubleToString_ReturnValue_40;       // 0xCF0(0x10)(ZeroConstructor, HasGetValueTypeHash)
	struct FAutoSettingData                      K2Node_MakeStruct_AutoSettingData_46;              // 0xD00(0x38)(None)
	double                                       CallFunc_Conv_DoubleToString_InDouble_ImplicitCast; // 0xD38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_1; // 0xD40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_2; // 0xD48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_3; // 0xD50(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_4; // 0xD58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_5; // 0xD60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_6; // 0xD68(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_7; // 0xD70(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_8; // 0xD78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_9; // 0xD80(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       CallFunc_Conv_DoubleToString_InDouble_ImplicitCast_10; // 0xD88(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


