#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xB0 (0xB0 - 0x0)
// UserDefinedStruct Struct_Difficulty.Struct_Difficulty
struct FStruct_Difficulty
{
public:
	double                                       XPMultiplier_71_A0E0CAF842FFD2954832EAA26CCEE134;  // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ZombieSpawnAmountMultiplier_7_F8703844491691CC45AAA7941FFAB741; // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ZombieBossSpawnAmountMultiplier_75_F2B0F20A4A48972FDC6D0290ED1CCC7A; // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ZombieHoundSpawnAmountMultiplier_8_49AE1C56496FFF7EC3663F98B7A05881; // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ZombieHealthMultiplier_9_C2B4BF884AFA926137E0B6900A8761BF; // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ZombieSpeedMultiplier_11_2D42A17E4783998E5BACAF8E0E6DC69A; // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ZombieDamageMultiplier_13_135C2604492CBA9F6BCDBE8DD0FD1E39; // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       BanditHealthMultiplier_15_6896BD1349632309A3B63EA9129BF866; // 0x38(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MilitaryHealthMultiplier_18_1B5D81E04A7A7FCA924FDFB5719698B5; // 0x40(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ScavengerWanderingTraderHealthMultiplier_19_7F85BA9C42824B40D42482A13CB95B48; // 0x48(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       AnimalSpawnAmountMultiplier_21_7C606B31435FD8CA1903CC87F95A26DD; // 0x50(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       RandomEventSpawnMultiplier_23_4BD59C7C48E5986987029A96A950C379; // 0x58(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       BanditCampSpawnMultiplier_25_2C69AD8A4C32F1689FF2DDBC73E7F8DB; // 0x60(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       MilitaryCampSpawnMultiplier_28_FA982FD84F8DC1E0679A22B9DAC4AA48; // 0x68(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       InfestationSpawnMultiplier_29_639BCC9942E2DFE9D717D8805EAA36E7; // 0x70(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       InfestationHealthMultiplier_73_C11D71644DA20F3B1D2415A7C4A89E53; // 0x78(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class Enum_LootDifficulties             GeneralItemsRarity_32_9B0B9DD441EEE866536C6198D7F462D5; // 0x80(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class Enum_LootDifficulties             MeleeWeaponsRarity_34_714F368F415419FF5075F8A93745AE4C; // 0x81(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class Enum_LootDifficulties             RangedWeaponsRarity_36_4A384B8D44DD675BEBF092B323D13232; // 0x82(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class Enum_LootDifficulties             FoodDrinkRarity_38_592F04F749928F35361C50A7D17FFB20; // 0x83(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class Enum_LootDifficulties             MedicalItemsRarity_43_655EBA4F4F2FDF5E6D36E1BAA9E88F54; // 0x84(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class Enum_LootDifficulties             CraftingItemsRarity_44_28F3D86A40216456CE09F595E879F106; // 0x85(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class Enum_LootDifficulties             EquipmentRarity_45_4B6BDC1143FB67E68B23A5AC420B70C6; // 0x86(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class Enum_LootDifficulties             AttachmentsRarity_46_C679671644CDCF1879153C987CAFC649; // 0x87(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class Enum_LootDifficulties             AmmoRarity_49_216030604476DF03FF03AA8AD6637930;    // 0x88(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class Enum_LootDifficulties             KeycardsRarity_50_5622F481495836C788DD928B7E6E49CB; // 0x89(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ResetPassiveSkillsOnDeath__53_373A025B4F4AB2B1C45BD2A7487CE27D; // 0x8A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1A83[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       HungerDepletionMultiplier_62_F254AEDC400C703E2DF28DB8D4821F64; // 0x90(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       ThirstDepletionMultiplier_63_2944FCE0417C4C048EE30B851D93D8BA; // 0x98(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       FuelDepletionMultiplier_68_5181F3B1423D4BD53E80E3A487AEE4C4; // 0xA0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       DamageDepletionMultiplier_69_3B4BD18B46875ED08D1785A97B636BEC; // 0xA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


