#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x311 (0x5A9 - 0x298)
// BlueprintGeneratedClass Weather_Override_Volume.Weather_Override_Volume_C
class AWeather_Override_Volume_C : public AActor
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x298(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class URandom_Weather_Variation_C*           Random_Weather_Variation;                          // 0x2A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                   Billboard;                                         // 0x2A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USplineComponent*                      Spline;                                            // 0x2B0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, NonTransactional, NoDestructor, HasGetValueTypeHash)
	enum class EUDS_Weather_Override_Mode        Mode;                                              // 0x2B8(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_7D9[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Transition_Width;                                  // 0x2C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                        Priority;                                          // 0x2C8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_7E1[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UUDS_Weather_Settings_C*               Weather_Type;                                      // 0x2D0(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         Override_Material_Effects;                         // 0x2D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_7E4[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Volume_Alpha;                                      // 0x2E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	double                                       Scaled_Transition_Width;                           // 0x2E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AUltra_Dynamic_Weather_C*              UDW;                                               // 0x2F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUDS_Climate_Preset_C*                 Apply_Climate_Preset;                              // 0x2F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	TMap<class UUDS_Weather_Settings_C*, double> Weather_Type_Probabilities__Spring_;               // 0x300(0x50)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMap<class UUDS_Weather_Settings_C*, double> Weather_Type_Probabilities__Summer_;               // 0x350(0x50)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMap<class UUDS_Weather_Settings_C*, double> Weather_Type_Probabilities__Autumn_;               // 0x3A0(0x50)(Edit, BlueprintVisible, ExposeOnSpawn)
	TMap<class UUDS_Weather_Settings_C*, double> Weather_Type_Probabilities__Winter_;               // 0x3F0(0x50)(Edit, BlueprintVisible, ExposeOnSpawn)
	class UUDS_Weather_Settings_C*               Editor_Preview_State;                              // 0x440(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor, HasGetValueTypeHash)
	double                                       Total_Sphere_Bounds;                               // 0x448(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               Spline_Bounds_Center;                              // 0x450(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Show_Weather_Label_in_Editor;                      // 0x468(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash)
	uint8                                        Pad_7F1[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UUDS_Weather_Settings_C*               Weather_State;                                     // 0x470(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FVector>                       World_Space_Triangles;                             // 0x478(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FVector                               Canvas_Scale_Factor;                               // 0x488(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               Canvas_Offset;                                     // 0x4A0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          Volume_Color;                                      // 0x4B8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FCanvasUVTri>                  Canvas_Space_Triangles;                            // 0x4C8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         Started;                                           // 0x4D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_7FB[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Material_State_Buffer;                             // 0x4E0(0x18)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Transitioning_Weather;                             // 0x4F8(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_7FF[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UUDS_Weather_Settings_C*               Transition_Weather_A;                              // 0x500(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UUDS_Weather_Settings_C*               Transition_Weather_B;                              // 0x508(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	double                                       Transition_Time_Remaining;                         // 0x510(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Changing_to_Random_Weather;                        // 0x518(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Changing_from_Random_Weather;                      // 0x519(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_804[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Transition_Timer_Length;                           // 0x520(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                Random_Weather_Label_Text;                         // 0x528(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<struct FVector>                       Runtime_Spline_Points;                             // 0x538(0x10)(Edit, BlueprintVisible, Net, ExposeOnSpawn)
	class UUDS_Weather_Settings_C*               Preview_Weather_State;                             // 0x548(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         Apply_Wind_Direction;                              // 0x550(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_80C[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	double                                       Wind_Direction;                                    // 0x558(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         Applied_Last_Update;                               // 0x560(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Apply_Temperature_Ranges;                          // 0x561(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_812[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             Summer_Temperature_Min_And_Max;                    // 0x568(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                             Autumn_Temperature_Min_and_Max;                    // 0x578(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                             Winter_Temperature_Min_and_Max;                    // 0x588(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                             Spring_Temperature_Min_and_Max;                    // 0x598(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	enum class EUDS_TemperatureType              Temperature_Scale;                                 // 0x5A8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class AWeather_Override_Volume_C* GetDefaultObj();

