#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xE9 (0x349 - 0x260)
// WidgetBlueprintGeneratedClass Map_Multi_Widget.Map_Multi_Widget_C
class UMap_Multi_Widget_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x260(0x8)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UCanvasPanel*                          MainPanel;                                         // 0x268(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                          Parts_Canvas_Panel;                                // 0x270(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                          ScaleAndRotationPanel;                             // 0x278(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FVector                               Player_Location;                                   // 0x280(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector                               Map_Center;                                        // 0x28C(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                        Player_Z_Rotation;                                 // 0x298(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                        Zoom;                                              // 0x29C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                             Grid;                                              // 0x2A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                             Map_Dimension__Meters_;                            // 0x2A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<struct FMap_Part_Struct>              Map_Widget_Parts_Locations;                        // 0x2B0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UUserWidget*>                   Map_Parts;                                         // 0x2C0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                         Grab_Map_Info_From_Level_Map_BP;                   // 0x2D0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                        Pad_28A9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Map_Parts_In_Range_Multiplier;                     // 0x2D4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         Location_Set;                                      // 0x2D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_28AD[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UMap_Source_Component_C*               Map_Source_Component;                              // 0x2E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<struct FMap_Parts_Arrays_Struct>      Map_Parts_By_Zoom;                                 // 0x2E8(0x10)(Edit, BlueprintVisible, ContainsInstancedReference, ExposeOnSpawn)
	TArray<float>                                Resolution_Cut_Offs;                               // 0x2F8(0x10)(Edit, BlueprintVisible, ExposeOnSpawn)
	struct FVector2D                             Default_Resolution;                                // 0x308(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         Scale_Relative_To_Widget_Size;                     // 0x310(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                         Rotate_Map_With_Source;                            // 0x311(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                        Pad_28BA[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Map_Angle_If_Not_Rotating;                         // 0x314(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         Manually_Set_Player_Location;                      // 0x318(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                         Manually_Set_Player_Rotation;                      // 0x319(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                        Pad_28BE[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Resolution_Size;                                   // 0x31C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                             Widget_Size;                                       // 0x320(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	struct FVector2D                             Cached_Widget_Size;                                // 0x328(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Map_Is_Box;                                        // 0x330(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                        Pad_28C7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Used_Rotation_Angle;                               // 0x334(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FMap_Parts_Arrays_Struct>      Cached_Map_Parts_By_Zoom;                          // 0x338(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                         Is_Same;                                           // 0x348(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class UMap_Multi_Widget_C* GetDefaultObj();

	void Get_Current_Map_Returns(TArray<class UMap_Return_BP_C*>* Actors, TArray<int32>* Return_IDs, TArray<class UClass*>* Return_Widgets);
	void Get_Map_Info(float* Zoom, float* View_Range__meters_, float* Max_View_Range, float* Min_View_Range, struct FVector* Player_Location, struct FRotator* Player_Z_Rotation, class UMap_Source_Component_C** Source_Component, bool* Shows_Responses, TArray<class FName>* Friendly_Units_Tags, TArray<class FName>* Hostile_Unit_Tags);
