#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x34 (0x34 - 0x0)
// UserDefinedStruct s_MorphTargets.s_MorphTargets
struct FS_MorphTargets
{
public:
	class FName                                  MorphName_21_C1BA34A84D3B72391ABB34A4D7B09784;     // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                MorphDescription_4_3DCDED574B41042C88D31BA0F238FDFD; // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	enum class E_Meshcheck                       MeshCheck_8_31ED0FF34ECB377F90B748BBA0C13F85;      // 0x18(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2723[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Value_17_551A4B094BABFA81F3D68DB7BD513840;         // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        MinValue_15_98FBAD9D46F322EAF5E50EA5AB7E6DE4;      // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        MaxValue_16_8E4DB1B14213A29EEBA512AC374810D7;      // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         NegativeOnlyMoprh_20_F318EA2F449188C816D3919A18A019DF; // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_272F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  RowIDLeaveEmpty_29_F823D18A48B20DB970B5689B3963B71B; // 0x2C(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


