#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x20 (0x20 - 0x0)
// UserDefinedStruct Struct_NPC_RunAwayOptions.Struct_NPC_RunAwayOptions
struct FStruct_NPC_RunAwayOptions
{
public:
	bool                                         Canrunaway_1_F23AF8DC45775768D8A640B94D16E952;     // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1603[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PercentHPtorunaway_17_03C3EBA14C14963401C809859319F769; // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Runduration_4_A5268A2F40B89A0AEDFBB18274E5FE0B;    // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        RunDistance_6_3EB2382E4FFD17D0CDD1D6A5DC7E9705;    // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Runawayspeed_20_DF4A8DEF45B68150CB1110A5DAD6E57E;  // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        SearchRadius_9_24C0996D4F5425517BFD68B8F89302E5;   // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        IdleTime_12_09B097F547C73CF2834E3E874915B48C;      // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        PercentHPregenerationevery2seconds_14_517B1BAA499CFA2480872A9FA870E387; // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


