#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x4 (0x4 - 0x0)
// Function w_morph_slider.w_morph_slider_C.BndEvt__w_morph_slider_Slider_0_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature
struct UW_morph_slider_C_BndEvt__w_morph_slider_Slider_0_K2Node_ComponentBoundEvent_0_OnFloatValueChangedEvent__DelegateSignature_Params
{
public:
	float                                        Value;                                             // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xA8 (0xA8 - 0x0)
// Function w_morph_slider.w_morph_slider_C.ExecuteUbergraph_w_morph_slider
struct UW_morph_slider_C_ExecuteUbergraph_w_morph_slider_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2231[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Conv_StringToText_ReturnValue;            // 0x8(0x18)(None)
	float                                        K2Node_ComponentBoundEvent_Value;                  // 0x20(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  CallFunc_Conv_StringToName_ReturnValue;            // 0x24(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_223C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FS_MorphTargets                       K2Node_MakeStruct_s_MorphTargets;                  // 0x30(0x34)(HasGetValueTypeHash)
	uint8                                        Pad_223D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  CallFunc_Conv_StringToName_ReturnValue_1;          // 0x68(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_MorphTargets                       K2Node_MakeStruct_s_MorphTargets_1;                // 0x70(0x34)(HasGetValueTypeHash)
	uint8                                        Pad_2242[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

}
}


