#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x151 (0x3B1 - 0x260)
// WidgetBlueprintGeneratedClass W_TemplateInputAxis.W_TemplateInputAxis_C
class UW_TemplateInputAxis_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x260(0x8)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UImage*                                Image_Over;                                        // 0x268(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_PrimaryFocus;                                // 0x270(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_SecondaryFocus;                              // 0x278(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputKeySelector*                     InputKey_P;                                        // 0x280(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UInputKeySelector*                     InputKey_S;                                        // 0x288(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              MySizeBox;                                         // 0x290(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              SizeBox_Primary;                                   // 0x298(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              SizeBox_Secondary;                                 // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            TextBlock_InputName;                               // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                         OnPrimary_;                                        // 0x2B0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_264F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          MouseEnterColor;                                   // 0x2B4(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          MouseLeaveColor;                                   // 0x2C4(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsInEdit_;                                         // 0x2D4(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         InSecure_;                                         // 0x2D5(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_265E[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  AxisName;                                          // 0x2D8(0x18)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                  Description;                                       // 0x2F0(0x18)(Edit, BlueprintVisible, ExposeOnSpawn)
	enum class E_TemplateControlAxis             SettingName;                                       // 0x308(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	enum class E_AxisType                        AxisType;                                          // 0x309(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_2668[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FS_AxisKeySetting                     PrimaryKey;                                        // 0x310(0x30)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	struct FS_AxisKeySetting                     SecondaryKey;                                      // 0x340(0x30)(Edit, BlueprintVisible, ExposeOnSpawn, HasGetValueTypeHash)
	class UW_Options_C*                          OptionsRef;                                        // 0x370(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FInputAxisKeyMapping>          BackupAxis;                                        // 0x378(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         IsBackUp_;                                         // 0x388(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         AddSpace_;                                         // 0x389(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                        Pad_2678[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SpaceSize;                                         // 0x38C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         ForceHide_;                                        // 0x390(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_267E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  MappingName;                                       // 0x394(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                        AutoGeneralIndex;                                  // 0x39C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         MakeAnim_;                                         // 0x3A0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2684[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ActualLeft;                                        // 0x3A4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                    MyLeft;                                            // 0x3A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsHovered_;                                        // 0x3B0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class UW_TemplateInputAxis_C* GetDefaultObj();

	void MSG_RequestKey(bool Action_, enum class E_TemplateControlAction ActionName, enum class E_TemplateControlAxis AxisName, struct FInputChord* MyKey);
	void MSG_IsKeyEditing(bool* Editing_);
	void StartupMapping(enum class E_AxisType Temp_byte_Variable, bool Temp_bool_Variable, uint8 CallFunc_Subtract_ByteByte_ReturnValue, uint8 CallFunc_Add_ByteByte_ReturnValue, uint8 CallFunc_Percent_ByteByte_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, uint8 K2Node_Select_Default, uint8 K2Node_Select_Default_1, uint8 CallFunc_GetValidValue_ReturnValue, const class FString& CallFunc_GetEnumeratorUserFriendlyName_ReturnValue, const class FString& CallFunc_Replace_ReturnValue, class FName CallFunc_Conv_StringToName_ReturnValue);
	class UWidget* CustomNavigation_Down(enum class EUINavigation Navigation);
	class UWidget* CustomNavigation_Up(enum class EUINavigation Navigation);
	class UWidget* CustomNavigation_Right(enum class EUINavigation Navigation, bool CallFunc_HasUserFocus_ReturnValue);
	class UWidget* CustomNavigation_Left(enum class EUINavigation Navigation, bool CallFunc_HasUserFocus_ReturnValue);
	void CheckKeyBind(int32 Local_ActualLenght, bool CallFunc_Array_IsValidIndex_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue_1, bool CallFunc_EqualEqual_IntInt_ReturnValue_2, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue_3, const struct FKey& K2Node_MakeStruct_Key, const struct FInputAxisKeyMapping& K2Node_MakeStruct_InputAxisKeyMapping, const struct FKey& K2Node_MakeStruct_Key_1, TArray<struct FInputAxisKeyMapping>& K2Node_MakeArray_Array, const struct FS_MyAxisKeys& K2Node_MakeStruct_S_MyAxisKeys, const struct FInputAxisKeyMapping& K2Node_MakeStruct_InputAxisKeyMapping_1);
	void GetIndex(int32* NewParam, int32 CallFunc_Conv_ByteToInt_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, int32 CallFunc_Round_ReturnValue);
	void GetCorrectScale(const struct FKey& Key, float* Scale, enum class E_AxisType Temp_byte_Variable, bool CallFunc_EqualEqual_KeyKey_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue_1, bool CallFunc_EqualEqual_KeyKey_ReturnValue_2, bool CallFunc_EqualEqual_KeyKey_ReturnValue_3, float Temp_float_Variable, bool CallFunc_BooleanOR_ReturnValue, float Temp_float_Variable_1, float Temp_float_Variable_2, float Temp_float_Variable_3, float K2Node_Select_Default);
	void GetCorrectIndex(bool Primary_, int32* Index, enum class E_AxisType Temp_byte_Variable, int32 Temp_int_Variable, int32 Temp_int_Variable_1, int32 Temp_int_Variable_2, int32 Temp_int_Variable_3, enum class E_AxisType Temp_byte_Variable_1, int32 Temp_int_Variable_4, int32 Temp_int_Variable_5, int32 Temp_int_Variable_6, int32 Temp_int_Variable_7, bool Temp_bool_Variable, int32 K2Node_Select_Default, int32 K2Node_Select_Default_1, int32 K2Node_Select_Default_2);
	void ChangeTitleColor(const struct FSlateColor& TitleColor);
	void LoadDataAxis(const struct FInputAxisKeyMapping& K2Node_MakeStruct_InputAxisKeyMapping, const struct FInputAxisKeyMapping& K2Node_MakeStruct_InputAxisKeyMapping_1, int32 CallFunc_GetCorrectIndex_Index, int32 CallFunc_GetCorrectIndex_Index_1);
	void CheckAxisIsDefault(bool* IsDefault_, bool Temp_bool_Variable, bool Temp_bool_Variable_1, const struct FKey& K2Node_MakeStruct_Key, int32 CallFunc_GetCorrectIndex_Index, float CallFunc_GetCorrectScale_Scale, float CallFunc_GetCorrectScale_Scale_1, const struct FInputAxisKeyMapping& K2Node_MakeStruct_InputAxisKeyMapping, const struct FInputAxisKeyMapping& K2Node_MakeStruct_InputAxisKeyMapping_1, int32 CallFunc_GetCorrectIndex_Index_1, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Greater_IntInt_ReturnValue_1, const struct FInputAxisKeyMapping& K2Node_Select_Default, const struct FInputAxisKeyMapping& K2Node_Select_Default_1, bool CallFunc_EqualEqual_KeyKey_ReturnValue, bool CallFunc_EqualEqual_KeyKey_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue);
	void ActualiseInputKey(bool IgnoreCheckDefault, bool Temp_bool_Variable, bool Temp_bool_Variable_1, const struct FKey& K2Node_MakeStruct_Key, const struct FKey& K2Node_MakeStruct_Key_1, float CallFunc_GetCorrectScale_Scale, float CallFunc_GetCorrectScale_Scale_1, int32 CallFunc_GetCorrectIndex_Index, const struct FInputAxisKeyMapping& K2Node_MakeStruct_InputAxisKeyMapping, int32 CallFunc_GetCorrectIndex_Index_1, bool CallFunc_CheckAxisIsDefault_IsDefault_, const struct FKey& K2Node_MakeStruct_Key_2, const struct FInputAxisKeyMapping& K2Node_MakeStruct_InputAxisKeyMapping_1, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue_1, const struct FInputAxisKeyMapping& K2Node_Select_Default, const struct FInputAxisKeyMapping& K2Node_Select_Default_1, const struct FInputChord& K2Node_MakeStruct_InputChord, const struct FInputChord& K2Node_MakeStruct_InputChord_1);
	void CheckForRename(class UInputKeySelector* InputRef, const class FString& Local_found, class FText Local_Rename, int32 Temp_int_Array_Index_Variable, const class FString& CallFunc_GetDisplayName_ReturnValue, bool CallFunc_Contains_ReturnValue, const struct FKey& K2Node_MakeStruct_Key, int32 CallFunc_GetCorrectIndex_Index, const struct FInputChord& K2Node_MakeStruct_InputChord, bool Temp_bool_True_if_break_was_hit_Variable, bool CallFunc_Not_PreBool_ReturnValue, TArray<class FName>& CallFunc_GetDataTableRowNames_OutRowNames, class FName CallFunc_Array_Get_Item, const class FString& CallFunc_Conv_TextToString_ReturnValue, const struct FS_KeysName& CallFunc_GetDataTableRowFromName_OutRow, bool CallFunc_GetDataTableRowFromName_ReturnValue, const class FString& CallFunc_Replace_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, const class FString& CallFunc_Replace_ReturnValue_1, bool CallFunc_Contains_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class FText CallFunc_Key_GetDisplayName_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue);
	void MSG_ChangeSensitivity(float Sensitivity);
	void MSG_ChangeInvertMouse(bool InvertMouse);
	void MSG_ChangeGameplaySetting(enum class E_TemplateUI Setting, int32 Index, float Value);
	void RestoreAxis();
	void SetDefaultKey();
	void ReloadBackupAxis();
	void MakeBackupAxis();
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void BndEvt__InputKey_K2Node_ComponentBoundEvent_0_OnKeySelected__DelegateSignature(const struct FInputChord& SelectedKey);
	void BndEvt__InputKey_S_K2Node_ComponentBoundEvent_0_OnKeySelected__DelegateSignature(const struct FInputChord& SelectedKey);
	void EditMyKey(const struct FInputChord& SelectedKey);
	void OnMouseEnter(const struct FGeometry& MyGeometry, struct FPointerEvent& MouseEvent);
	void OnMouseLeave(struct FPointerEvent& MouseEvent);
	void MouseEnter();
	void MouseLeave();
	void MakeAnim();
	void BndEvt__InputKey_P_K2Node_ComponentBoundEvent_0_OnIsSelectingKeyChanged__DelegateSignature();
	void BndEvt__InputKey_S_K2Node_ComponentBoundEvent_3_OnIsSelectingKeyChanged__DelegateSignature();
	void CheckForStyle(bool ShowStyle_);
	void ExecuteUbergraph_W_TemplateInputAxis(int32 EntryPoint, class FText CallFunc_Key_GetDisplayName_ReturnValue, uint8 Temp_byte_Variable, uint8 Temp_byte_Variable_1, uint8 Temp_byte_Variable_2, enum class E_AxisType Temp_byte_Variable_3, uint8 Temp_byte_Variable_4, uint8 Temp_byte_Variable_5, uint8 Temp_byte_Variable_6, uint8 Temp_byte_Variable_7, bool Temp_bool_Variable, enum class ESlateVisibility Temp_byte_Variable_8, enum class ESlateVisibility Temp_byte_Variable_9, bool Temp_bool_Variable_1, enum class ESlateVisibility Temp_byte_Variable_10, int32 Temp_int_Array_Index_Variable, bool Temp_bool_IsClosed_Variable, bool Temp_bool_Has_Been_Initd_Variable, enum class ESlateVisibility Temp_byte_Variable_11, bool Temp_bool_IsClosed_Variable_1, bool Temp_bool_Has_Been_Initd_Variable_1, bool Temp_bool_IsClosed_Variable_2, bool Temp_bool_Has_Been_Initd_Variable_2, bool Temp_bool_Variable_2, bool Temp_bool_IsClosed_Variable_3, bool Temp_bool_Has_Been_Initd_Variable_3, float K2Node_Event_Sensitivity, bool K2Node_Event_InvertMouse, enum class E_TemplateUI K2Node_Event_Setting, int32 K2Node_Event_Index, float K2Node_Event_Value, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue, bool K2Node_Event_IsDesignTime, float CallFunc_FClamp_ReturnValue, uint8 Temp_byte_Variable_12, bool CallFunc_IsValid_ReturnValue, enum class E_AxisType Temp_byte_Variable_13, class UHorizontalBoxSlot* K2Node_DynamicCast_AsHorizontal_Box_Slot, bool K2Node_DynamicCast_bSuccess, const struct FInputChord& K2Node_ComponentBoundEvent_SelectedKey_2, const struct FInputChord& K2Node_ComponentBoundEvent_SelectedKey_1, int32 Temp_int_Array_Index_Variable_1, const struct FInputAxisKeyMapping& CallFunc_Array_Get_Item, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, const struct FInputChord& K2Node_ComponentBoundEvent_SelectedKey, int32 CallFunc_GetCorrectIndex_Index, const struct FKey& K2Node_MakeStruct_Key, const struct FGeometry& K2Node_Event_MyGeometry, const struct FPointerEvent& K2Node_Event_MouseEvent_1, bool CallFunc_EqualEqual_KeyKey_ReturnValue, const struct FPointerEvent& K2Node_Event_MouseEvent, float CallFunc_Add_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_FClamp_ReturnValue_1, float CallFunc_FClamp_ReturnValue_2, const struct FMargin& K2Node_MakeStruct_Margin, bool CallFunc_GreaterEqual_FloatFloat_ReturnValue, const struct FMargin& K2Node_MakeStruct_Margin_1, bool CallFunc_LessEqual_FloatFloat_ReturnValue, int32 CallFunc_GetCorrectIndex_Index_1, bool CallFunc_Not_PreBool_ReturnValue, int32 CallFunc_GetCorrectIndex_Index_2, bool Temp_bool_Variable_3, int32 CallFunc_GetIndex_NewParam, const struct FKey& K2Node_Select_Default, int32 Temp_int_Loop_Counter_Variable_2, const struct FInputChord& K2Node_MakeStruct_InputChord, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_2, float CallFunc_GetCorrectScale_Scale, const struct FInputAxisKeyMapping& K2Node_MakeStruct_InputAxisKeyMapping, bool CallFunc_SetMappingsAxis_KeyAlreadyExist_, TArray<struct FInputAxisKeyMapping>& CallFunc_SetMappingsAxis_NewMappings, bool CallFunc_EqualEqual_KeyKey_ReturnValue_1, TArray<class UW_TemplateInputAxis_C*>& CallFunc_GetAllWidgetsOfClass_FoundWidgets, int32 Temp_int_Array_Index_Variable_2, class UW_TemplateInputAxis_C* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, uint8 K2Node_Select_Default_1, float Temp_float_Variable, bool CallFunc_EqualEqual_ByteByte_ReturnValue, uint8 K2Node_Select_Default_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue_2, const struct FInputAxisKeyMapping& CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_2, int32 CallFunc_Array_Add_ReturnValue_1, bool Temp_bool_Variable_4, float K2Node_Select_Default_3, enum class ESlateVisibility Temp_byte_Variable_14, bool CallFunc_HasUserFocus_ReturnValue, bool CallFunc_HasUserFocus_ReturnValue_1, bool K2Node_Event_ShowStyle_, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, enum class ESlateVisibility K2Node_Select_Default_4, enum class ESlateVisibility K2Node_Select_Default_5, enum class ESlateVisibility K2Node_Select_Default_6, const struct FInputChord& K2Node_MakeStruct_InputChord_1, const struct FInputChord& K2Node_MakeStruct_InputChord_2, const struct FInputAxisKeyMapping& K2Node_MakeStruct_InputAxisKeyMapping_1, const struct FInputAxisKeyMapping& K2Node_MakeStruct_InputAxisKeyMapping_2, float CallFunc_GetCorrectScale_Scale_1, float CallFunc_GetCorrectScale_Scale_2, class FText CallFunc_Key_GetDisplayName_ReturnValue_1);
};

}


