#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x18C (0x3EC - 0x260)
// WidgetBlueprintGeneratedClass WB_Effect_Circular.WB_Effect_Circular_C
class UWB_Effect_Circular_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x260(0x8)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWidgetAnimation*                      HighlightLoop;                                     // 0x268(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      FadeHighlight2;                                    // 0x270(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      FadeHighlight1;                                    // 0x278(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      FadeIn;                                            // 0x280(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                               B_Content;                                         // 0x288(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               b_HighlightLoop;                                   // 0x290(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               B_Particle;                                        // 0x298(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               B_ParticleStretched;                               // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               B_Punctiform;                                      // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               B_SoundEffect;                                     // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               B_Stretched;                                       // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                ImagePunctiform;                                   // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                ImageStretched;                                    // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              OV_Particle;                                       // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              OV_Particle_Container;                             // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              OV_ParticleContainer_Stretched;                    // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              OV_Punctiform;                                     // 0x2E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              OV_Punctiform_Scale;                               // 0x2F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              OV_Stretched_Scale;                                // 0x2F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              SB_Content;                                        // 0x300(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USizeBox*                              SB_Punctiform;                                     // 0x308(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                               Spacer_0;                                          // 0x310(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          VB_Progress;                                       // 0x318(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       WS_EffectTextureType;                              // 0x320(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       WS_Punctiform;                                     // 0x328(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class EProgressBarFillType              FillType;                                          // 0x330(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2320[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CurrentPercent;                                    // 0x334(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FS_Effects                            Effect;                                            // 0x338(0x69)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2327[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Size;                                              // 0x3A8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LastPercent;                                       // 0x3AC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bIsDesignTime;                                     // 0x3B0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsActive;                                          // 0x3B1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2332[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAudioComponent*                       UIAudio;                                           // 0x3B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         EffectActive;                                      // 0x3C0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2338[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            StartProgressChangeColor;                          // 0x3C8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            StopProgressChangeColor;                           // 0x3D8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                        Thickness;                                         // 0x3E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UWB_Effect_Circular_C* GetDefaultObj();

	void RemoveParticleFromOverlay(class UOverlay* Overlay, int32 CallFunc_GetChildrenCount_ReturnValue, int32 Temp_int_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class UWidget* CallFunc_GetChildAt_ReturnValue, class UWB_Particle_C* K2Node_DynamicCast_AsWB_Particle, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsValid_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue);
	void SwitchPunctiform(int32 Index);
	void GetUseParticleStretched(bool* Use_Stretched_Particle);
	bool IsEffectTypeProgressChangeColor(enum class EEffectType CallFunc_GetEffectType_Effect_Texture_Type, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void GetDecayTime(float* Decay_Time);
	bool IsEffectTypeSoundEffectLooped(enum class EEffectType CallFunc_GetEffectType_Effect_Texture_Type, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void GetSoundVolume(float* Sound_Volume_Multiplier);
	bool IsEffectTypeSoundEffect(enum class EEffectType CallFunc_GetEffectType_Effect_Texture_Type, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void GetSoundEffect(class USoundBase** Sound_Effect);
	void GetAddRotationToParticles(bool* Add_Rotation_to_Particles);
	void GetParticleSpread(float* Particle_Spread);
	float FindMinSize(const struct FVector2D& Size, bool Temp_bool_Variable, float CallFunc_BreakVector2D_X, float CallFunc_BreakVector2D_Y, bool CallFunc_LessEqual_FloatFloat_ReturnValue, float K2Node_Select_Default);
	void AddAttributes(class UImage* Image, const struct FVector2D& CallFunc_GetEffectShear_Effect_Shear, float CallFunc_GetEffectAngle_Effect_Angle, class UObject* CallFunc_GetEffectTexture_Custom_Effect_Texture, const struct FLinearColor& CallFunc_GetEffectColor_Effect_Color, const struct FVector2D& CallFunc_GetEffectTranslation_Transition, const struct FVector2D& CallFunc_GetEffectScale_EffectScale);
	void GetNumParticles(int32* NumParticles, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Clamp_ReturnValue);
	bool IsEffectTypeParticle(enum class EEffectType CallFunc_GetEffectType_Effect_Texture_Type, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void GetPlaybackSpeed(float* Playback_Speed);
	void GetEffectAngle(float* Effect_Angle, float CallFunc_FClamp_ReturnValue);
	void GetEffectShear(struct FVector2D* Effect_Shear);
	bool IsTriggeredAlwaysOnSpecificPercentValue(enum class ETriggerMethod CallFunc_GetTriggerMethod_Trigger, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	bool IsTriggerSpecificPercent(enum class ETriggerMethod CallFunc_GetTriggerMethod_Trigger, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_EqualEqual_ByteByte_ReturnValue_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue_2);
	void SwitchEffectType(int32 Index);
	void Anim_HighlightLoop(bool StartStop, float PlaybackSpeed, enum class EUMGSequencePlayMode Temp_byte_Variable, enum class EUMGSequencePlayMode Temp_byte_Variable_1, bool Temp_bool_Variable, int32 Temp_int_Variable, int32 Temp_int_Variable_1, bool Temp_bool_Variable_1, int32 K2Node_Select_Default, enum class EUMGSequencePlayMode K2Node_Select_Default_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);
	void Anim_Highlight2(float PlaybackSpeed, enum class EUMGSequencePlayMode Temp_byte_Variable, enum class EUMGSequencePlayMode Temp_byte_Variable_1, bool Temp_bool_Variable, int32 Temp_int_Variable, int32 Temp_int_Variable_1, bool Temp_bool_Variable_1, int32 K2Node_Select_Default, enum class EUMGSequencePlayMode K2Node_Select_Default_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);
	void Anim_Highlight1(float PlaybackSpeed, enum class EUMGSequencePlayMode Temp_byte_Variable, enum class EUMGSequencePlayMode Temp_byte_Variable_1, bool Temp_bool_Variable, int32 Temp_int_Variable, int32 Temp_int_Variable_1, bool Temp_bool_Variable_1, int32 K2Node_Select_Default, enum class EUMGSequencePlayMode K2Node_Select_Default_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);
	void GetEffectColor(struct FLinearColor* Effect_Color);
	void GetEffectScale(struct FVector2D* EffectScale);
	void Anim_Fade(bool FadeIn, float PlaybackSpeed, enum class EUMGSequencePlayMode Temp_byte_Variable, enum class EUMGSequencePlayMode Temp_byte_Variable_1, bool Temp_bool_Variable, int32 Temp_int_Variable, int32 Temp_int_Variable_1, bool Temp_bool_Variable_1, int32 K2Node_Select_Default, enum class EUMGSequencePlayMode K2Node_Select_Default_1, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue);
	bool IsTriggeredAlways(enum class ETriggerMethod CallFunc_GetTriggerMethod_Trigger, bool CallFunc_EqualEqual_ByteByte_ReturnValue);
	void GetEffectTexture(class UObject** Custom_Effect_Texture, class UObject* Temp_object_Variable, class UObject* Temp_object_Variable_1, class UObject* Temp_object_Variable_2, class UObject* Temp_object_Variable_3, class UObject* Temp_object_Variable_4, bool Temp_bool_Variable, class UObject* Temp_object_Variable_5, enum class EEffectType Temp_byte_Variable, enum class EEffectType CallFunc_GetEffectType_Effect_Texture_Type, class UObject* K2Node_Select_Default, bool CallFunc_IsValid_ReturnValue, class UObject* K2Node_Select_Default_1);
	void GetEffectType(enum class EEffectType* Effect_Texture_Type);
	void GetEffectTranslation(struct FVector2D* Transition);
	void GetSpecificPercentValue(float* Specific_Percent_Value, float CallFunc_FClamp_ReturnValue);
	void GetTriggerMethod(enum class ETriggerMethod* Trigger);
	void SetSize(float Size, float Thickness);
	void AddEffect(const struct FS_Effects& Effect);
	void StartEffect();
	void StopEffect();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void TriggerEffect();
	void AddEffectType();
	void EventPreConstruct(bool IsDesignTime);
	void Construct();
	void CreateParticle(int32 NumParticles);
	void ClearParticles();
	void OnAnimationFinished_Event_0();
	void GetProgressBar(class UProgressBarCircular_C* ProgressBar);
	void UpdatePercent(float Percent);
	void OnAudioFinished_Event_0();
	void ExecuteUbergraph_WB_Effect_Circular(int32 EntryPoint, bool Temp_bool_Variable, bool Temp_bool_Has_Been_Initd_Variable, bool Temp_bool_IsClosed_Variable, bool Temp_bool_Has_Been_Initd_Variable_1, bool Temp_bool_Has_Been_Initd_Variable_2, int32 Temp_int_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, bool Temp_bool_Has_Been_Initd_Variable_3, bool Temp_bool_Has_Been_Initd_Variable_4, bool Temp_bool_IsClosed_Variable_1, bool Temp_bool_IsClosed_Variable_2, bool Temp_bool_Has_Been_Initd_Variable_5, bool Temp_bool_IsClosed_Variable_3, float Temp_float_Variable, bool Temp_bool_Variable_1, bool Temp_bool_Has_Been_Initd_Variable_6, int32 Temp_int_Variable_2, bool CallFunc_IsValid_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_2, bool Temp_bool_IsClosed_Variable_4, bool CallFunc_GetUseParticleStretched_Use_Stretched_Particle, class UPanelWidget* K2Node_Select_Default, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class UWidget* CallFunc_GetChildAt_ReturnValue, int32 CallFunc_GetChildrenCount_ReturnValue, class UWB_Particle_C* K2Node_DynamicCast_AsWB_Particle, bool K2Node_DynamicCast_bSuccess, bool CallFunc_LessEqual_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue_1, bool Temp_bool_IsClosed_Variable_5, bool Temp_bool_IsClosed_Variable_6, bool CallFunc_GetUseParticleStretched_Use_Stretched_Particle_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, bool Temp_bool_IsClosed_Variable_7, bool Temp_bool_Has_Been_Initd_Variable_7, bool Temp_bool_Has_Been_Initd_Variable_8, bool Temp_bool_IsClosed_Variable_8, bool Temp_bool_Has_Been_Initd_Variable_9, bool Temp_bool_Variable_2, bool Temp_bool_IsClosed_Variable_9, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, float CallFunc_GetSpecificPercentValue_Specific_Percent_Value, float CallFunc_GetSpecificPercentValue_Specific_Percent_Value_1, bool CallFunc_Greater_FloatFloat_ReturnValue, bool CallFunc_Less_FloatFloat_ReturnValue, class UWB_Particle_C* CallFunc_Create_ReturnValue, bool CallFunc_NearlyEqual_FloatFloat_ReturnValue, bool Temp_bool_Variable_3, bool Temp_bool_Has_Been_Initd_Variable_10, bool CallFunc_NearlyEqual_FloatFloat_ReturnValue_1, float CallFunc_GetSpecificPercentValue_Specific_Percent_Value_2, float Temp_float_Variable_1, bool CallFunc_NearlyEqual_FloatFloat_ReturnValue_2, float CallFunc_GetSpecificPercentValue_Specific_Percent_Value_3, bool CallFunc_NearlyEqual_FloatFloat_ReturnValue_3, bool Temp_bool_IsClosed_Variable_10, bool CallFunc_Less_FloatFloat_ReturnValue_1, float CallFunc_GetSpecificPercentValue_Specific_Percent_Value_4, bool CallFunc_NearlyEqual_FloatFloat_ReturnValue_4, bool Temp_bool_Variable_4, bool CallFunc_Less_FloatFloat_ReturnValue_2, bool Temp_bool_Variable_5, bool CallFunc_NotEqual_FloatFloat_ReturnValue, bool CallFunc_Less_FloatFloat_ReturnValue_3, bool Temp_bool_Variable_6, bool CallFunc_Less_FloatFloat_ReturnValue_4, bool Temp_bool_Has_Been_Initd_Variable_11, bool Temp_bool_Variable_7, float K2Node_CustomEvent_Size, float K2Node_CustomEvent_Thickness, bool CallFunc_EqualEqual_FloatFloat_ReturnValue, const struct FS_Effects& K2Node_CustomEvent_Effect, float K2Node_Select_Default_1, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, enum class EEffectType CallFunc_GetEffectType_Effect_Texture_Type, bool K2Node_SwitchEnum_CmpSuccess, bool K2Node_CustomEvent_IsDesignTime, bool Temp_bool_IsClosed_Variable_11, bool Temp_bool_Has_Been_Initd_Variable_12, bool Temp_bool_IsClosed_Variable_12, bool CallFunc_Not_PreBool_ReturnValue, int32 K2Node_CustomEvent_NumParticles, bool CallFunc_LessEqual_IntInt_ReturnValue_1, class UObject* CallFunc_GetEffectTexture_Custom_Effect_Texture, float CallFunc_GetPlaybackSpeed_Playback_Speed, const struct FLinearColor& CallFunc_GetEffectColor_Effect_Color, const struct FVector2D& CallFunc_GetEffectScale_EffectScale, const struct FVector2D& CallFunc_GetEffectTranslation_Transition, float CallFunc_GetEffectAngle_Effect_Angle, const struct FVector2D& CallFunc_GetEffectShear_Effect_Shear, int32 Temp_int_Variable_3, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, enum class ETriggerMethod CallFunc_GetTriggerMethod_Trigger, float CallFunc_GetParticleSpread_Particle_Spread, bool CallFunc_GetAddRotationToParticles_Add_Rotation_to_Particles, class USoundBase* CallFunc_GetSoundEffect_Sound_Effect, bool CallFunc_IsEffectTypeSoundEffect_ReturnValue, float CallFunc_GetSoundVolume_Sound_Volume_Multiplier, bool CallFunc_IsEffectTypeSoundEffectLooped_ReturnValue, class UAudioComponent* CallFunc_CreateSound2D_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_IsEffectTypeSoundEffect_ReturnValue_1, bool CallFunc_IsEffectTypeSoundEffectLooped_ReturnValue_1, bool Temp_bool_Has_Been_Initd_Variable_13, bool CallFunc_BooleanOR_ReturnValue_1, float CallFunc_GetDecayTime_Decay_Time, const struct FLinearColor& CallFunc_GetEffectColor_Effect_Color_1, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_IsEffectTypeProgressChangeColor_ReturnValue, bool CallFunc_Less_FloatFloat_ReturnValue_5, float CallFunc_Divide_FloatFloat_ReturnValue, float K2Node_Select_Default_2, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_1, bool CallFunc_GetUseParticleStretched_Use_Stretched_Particle_2, bool CallFunc_GetUseParticleStretched_Use_Stretched_Particle_3, bool Temp_bool_IsClosed_Variable_13, bool CallFunc_Not_PreBool_ReturnValue_2, bool CallFunc_IsEffectTypeParticle_ReturnValue, bool Temp_bool_Has_Been_Initd_Variable_14, float CallFunc_GetSpecificPercentValue_Specific_Percent_Value_5, bool CallFunc_IsTriggerSpecificPercent_ReturnValue, float K2Node_Select_Default_3, int32 Temp_int_Variable_4, float CallFunc_MapRangeClamped_ReturnValue, float CallFunc_MapRangeClamped_ReturnValue_1, bool Temp_bool_IsClosed_Variable_14, bool Temp_bool_IsClosed_Variable_15, float CallFunc_GetWorldDeltaSeconds_ReturnValue, bool Temp_bool_Variable_8, bool CallFunc_IsEffectTypeSoundEffectLooped_ReturnValue_2, int32 K2Node_Select_Default_4, float K2Node_Select_Default_5, bool Temp_bool_Has_Been_Initd_Variable_15, bool Temp_bool_Has_Been_Initd_Variable_16, bool Temp_bool_IsClosed_Variable_16, bool Temp_bool_IsClosed_Variable_17, bool Temp_bool_IsClosed_Variable_18, enum class ETriggerMethod CallFunc_GetTriggerMethod_Trigger_1, bool K2Node_SwitchEnum_CmpSuccess_1, bool CallFunc_GetUseParticleStretched_Use_Stretched_Particle_4, bool Temp_bool_Variable_9, class UOverlay* K2Node_Select_Default_6, class UOverlaySlot* CallFunc_AddChildToOverlay_ReturnValue, bool Temp_bool_Has_Been_Initd_Variable_17, bool CallFunc_IsAnimationPlayingForward_ReturnValue, bool Temp_bool_Variable_10, bool CallFunc_Not_PreBool_ReturnValue_3, bool K2Node_Select_Default_7, bool Temp_bool_IsClosed_Variable_19, int32 CallFunc_GetNumParticles_NumParticles, bool CallFunc_IsEffectTypeParticle_ReturnValue_1, bool Temp_bool_Variable_11, bool Temp_bool_Has_Been_Initd_Variable_18, class UProgressBarCircular_C* K2Node_CustomEvent_ProgressBar, float K2Node_CustomEvent_Percent, float K2Node_Select_Default_8, bool Temp_bool_Has_Been_Initd_Variable_19, float CallFunc_FInterpTo_Constant_ReturnValue, float K2Node_Select_Default_9, bool Temp_bool_IsClosed_Variable_20, bool CallFunc_Not_PreBool_ReturnValue_4, bool Temp_bool_Has_Been_Initd_Variable_20, bool Temp_bool_Variable_12, bool K2Node_Select_Default_10, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_IsPlaying_ReturnValue, bool CallFunc_IsEffectTypeSoundEffect_ReturnValue_2, bool Temp_bool_Variable_13, bool CallFunc_IsEffectTypeParticle_ReturnValue_2, class UPanelWidget* K2Node_Select_Default_11, bool CallFunc_IsEffectTypeSoundEffectLooped_ReturnValue_3, class UWidget* CallFunc_GetChildAt_ReturnValue_1, int32 CallFunc_GetChildrenCount_ReturnValue_1, class UWB_Particle_C* K2Node_DynamicCast_AsWB_Particle_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_LessEqual_IntInt_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_IsEffectTypeSoundEffect_ReturnValue_3, bool CallFunc_IsEffectTypeProgressChangeColor_ReturnValue_1, bool CallFunc_IsTriggeredAlwaysOnSpecificPercentValue_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_2, bool CallFunc_IsTriggeredAlways_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue_4, bool CallFunc_BooleanOR_ReturnValue_5, bool CallFunc_Not_PreBool_ReturnValue_5, bool CallFunc_BooleanAND_ReturnValue, bool Temp_bool_Has_Been_Initd_Variable_21, bool Temp_bool_IsClosed_Variable_21);
	void StopProgressChangeColor__DelegateSignature();
	void StartProgressChangeColor__DelegateSignature(const struct FLinearColor& Color);
};

}


