#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x11 (0x11 - 0x0)
// Function WB_WindowSwitcher.WB_WindowSwitcher_C.Get UI Border Color
struct UWB_WindowSwitcher_C_Get_UI_Border_Color_Params
{
public:
	struct FLinearColor                          ReturnValue;                                       // 0x0(0x10)(Parm, OutParm, ZeroConstructor, ReturnParm, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue;                      // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x8C8 (0x8C8 - 0x0)
// Function WB_WindowSwitcher.WB_WindowSwitcher_C.ExecuteUbergraph_WB_WindowSwitcher
struct UWB_WindowSwitcher_C_ExecuteUbergraph_WB_WindowSwitcher_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_297[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ACharacter*                            CallFunc_GetPlayerCharacter_ReturnValue;           // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor;                      // 0x10(0x28)(None)
	class ABP_CombatCharacter_C*                 K2Node_DynamicCast_AsBP_Combat_Character;          // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2A2[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_1;                    // 0x48(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_2;                    // 0x70(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_3;                    // 0x98(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_4;                    // 0xC0(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_5;                    // 0xE8(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_6;                    // 0x110(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_7;                    // 0x138(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_8;                    // 0x160(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_9;                    // 0x188(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_10;                   // 0x1B0(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_11;                   // 0x1D8(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_12;                   // 0x200(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_13;                   // 0x228(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_14;                   // 0x250(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_15;                   // 0x278(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_16;                   // 0x2A0(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_17;                   // 0x2C8(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_18;                   // 0x2F0(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_19;                   // 0x318(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_20;                   // 0x340(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_21;                   // 0x368(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_22;                   // 0x390(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_23;                   // 0x3B8(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_24;                   // 0x3E0(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_25;                   // 0x408(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_26;                   // 0x430(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_27;                   // 0x458(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_28;                   // 0x480(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_29;                   // 0x4A8(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_30;                   // 0x4D0(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_31;                   // 0x4F8(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_32;                   // 0x520(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_33;                   // 0x548(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_34;                   // 0x570(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_35;                   // 0x598(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_36;                   // 0x5C0(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_37;                   // 0x5E8(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_38;                   // 0x610(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_39;                   // 0x638(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_40;                   // 0x660(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_41;                   // 0x688(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_42;                   // 0x6B0(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_43;                   // 0x6D8(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_44;                   // 0x700(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_45;                   // 0x728(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_46;                   // 0x750(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_47;                   // 0x778(0x28)(None)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_48;                   // 0x7A0(0x28)(None)
	class ABP_CombatCharacter_C*                 CallFunc_Get_Player_Reference_Player;              // 0x7C8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UAC_Crafting_C*                        CallFunc_Get_AC_Crafting_AC_Crafting;              // 0x7D0(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_WorldMap_C*                        CallFunc_Open_World_Map_Widget_World_Map_Ref;      // 0x7D8(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_WorldMap_C*                        CallFunc_Open_World_Map_Widget_World_Map_Ref_1;    // 0x7E0(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                            CallFunc_GetPlayerCharacter_ReturnValue_1;         // 0x7E8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                            CallFunc_GetPlayerCharacter_ReturnValue_2;         // 0x7F0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CombatCharacter_C*                 K2Node_DynamicCast_AsBP_Combat_Character_1;        // 0x7F8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess_1;                     // 0x800(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2FC[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_CombatCharacter_C*                 K2Node_DynamicCast_AsBP_Combat_Character_2;        // 0x808(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess_2;                     // 0x810(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_302[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ACharacter*                            CallFunc_GetPlayerCharacter_ReturnValue_3;         // 0x818(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsPackagedForDistribution_ReturnValue;    // 0x820(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_306[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_CombatCharacter_C*                 K2Node_DynamicCast_AsBP_Combat_Character_3;        // 0x828(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess_3;                     // 0x830(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_IsPackagedForDistribution_ReturnValue_1;  // 0x831(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_30C[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAC_Inventory_C*                       CallFunc_Get_AC_Inventory_AC_Inventory;            // 0x838(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ACharacter*                            CallFunc_GetPlayerCharacter_ReturnValue_4;         // 0x840(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_CombatCharacter_C*                 K2Node_DynamicCast_AsBP_Combat_Character_4;        // 0x848(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess_4;                     // 0x850(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_31A[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UWB_WorldMap_C*                        CallFunc_Open_World_Map_Widget_World_Map_Ref_2;    // 0x858(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsPackagedForDistribution_ReturnValue_2;  // 0x860(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_IsPackagedForDistribution_ReturnValue_3;  // 0x861(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_320[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ASEQ_Master_CharacterCustomization_C*  CallFunc_GetActorOfClass_ReturnValue;              // 0x868(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                           K2Node_MakeStruct_SlateColor_49;                   // 0x870(0x28)(None)
	bool                                         CallFunc_IsValid_ReturnValue;                      // 0x898(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_327[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAC_Inventory_C*                       CallFunc_Get_AC_Inventory_AC_Inventory_1;          // 0x8A0(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASEQ_Master_CharacterCustomization_C*  CallFunc_GetActorOfClass_ReturnValue_1;            // 0x8A8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASEQ_Master_CharacterCustomization_C*  CallFunc_GetActorOfClass_ReturnValue_2;            // 0x8B0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ASEQ_Master_CharacterCustomization_C*  CallFunc_GetActorOfClass_ReturnValue_3;            // 0x8B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWB_WorldMap_C*                        CallFunc_Open_World_Map_Widget_World_Map_Ref_3;    // 0x8C0(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


