#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x78 (0x298 - 0x220)
// BlueprintGeneratedClass ba_AdditionalRadiationController_01.ba_AdditionalRadiationController_01_C
class Aba_AdditionalRadiationController_01_C : public AActor
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x220(0x8)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UChildActorComponent*                  GlobalRadiation;                                   // 0x228(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x230(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	TArray<class Aba_rad_RadioactiveZone_01_C*>  Radiation_Low;                                     // 0x238(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class Aba_rad_RadioactiveZone_01_C*>  Radiation_Medium;                                  // 0x248(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TArray<class Aba_rad_RadioactiveZone_01_C*>  Radiation_High;                                    // 0x258(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	int32                                        Phase01_LastDay;                                   // 0x268(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Phase02_LastDay;                                   // 0x26C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Phase03_LastDay;                                   // 0x270(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        DebugDay;                                          // 0x274(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        GlobalRadiation_LastDay;                           // 0x278(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        GlobalRadiation_MaxValue;                          // 0x27C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        DefaultDaysToPlay;                                 // 0x280(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        DebugDistributors;                                 // 0x284(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class Aba_rad_RadioactiveZone_01_C*>  RadiationZones;                                    // 0x288(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class Aba_AdditionalRadiationController_01_C* GetDefaultObj();

	void ActivateSingleZone(class Aba_rad_RadioactiveZone_01_C* RadiationZoneActors, float MinRadiationValue, float MaxRadiationValue, float CallFunc_RandomFloatInRange_ReturnValue);
	void CalculateRadiationAmmount(int32 CurrentDay, int32 SpaceTimeDistributors, int32 GlobalMultiplier_Minus_very_easy, int32 GlobalMultiplier_Minus_easy, int32 GlobalMultiplier_Minus_medium, int32 GlobalMultiplier_Minus_hard, int32 GlobalMultiplier_Minus_insane, int32 STDMultiplier_Minus_very_easy, int32 STDMultiplier_Minus_easy, int32 STDMultiplier_Minus_medium, int32 STDMultiplier_Minus_hard, int32 STDMultiplier_Minus_insane, float* Return, int32 _STDMultiplier, int32 _GlobalMultiplier, int32 CallFunc_Multiply_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_Multiply_IntInt_ReturnValue_1, int32 CallFunc_Clamp_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, class UCGGameInstance_C* CallFunc_GetCGGameInstance_AsCGGame_Instance, enum class EDifficultyValue CallFunc_GetDifficultyValue_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess);
	void AdjustRadiation(int32 CurrentDay, int32 SpaceTimeDistributors, float _RadiationAmmount_High, float _RadiationAmmount_Medium, float _RadiationAmmount_Low, const struct FSt_AdditionalRadiationSetup_03& _Settings, const struct FSt_AdditionalRadiationSetup_01& Current, const struct FSt_AdditionalRadiationSetup_01& To, const struct FSt_AdditionalRadiationSetup_01& From, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue_1, class Aba_rad_RadioactiveZone_01_C* K2Node_DynamicCast_AsBa_Rad_Radioactive_Zone_01, bool K2Node_DynamicCast_bSuccess, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_FClamp_ReturnValue, class Aba_rad_RadioactiveZone_01_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, float CallFunc_Multiply_IntFloat_ReturnValue, float CallFunc_CalculateRadiationAmmount_Return, int32 CallFunc_FTrunc_ReturnValue, float CallFunc_Multiply_IntFloat_ReturnValue_1, float CallFunc_Multiply_IntFloat_ReturnValue_2, int32 CallFunc_FTrunc_ReturnValue_1, int32 CallFunc_FTrunc_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_3, float CallFunc_CalculateRadiationAmmount_Return_1, float CallFunc_CalculateRadiationAmmount_Return_2);
	void GetRadiationValueForUI(int32 DistributorsOffset, int32* Output_Get, float TotalRadiationValue, float _RadiationAmmount_High, float _RadiationAmmount_Medium, float _RadiationAmmount_Low, int32 SpaceTimeDistributors, int32 CurrentDay, int32 Temp_int_Array_Index_Variable, float CallFunc_Add_FloatFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue_1, float CallFunc_Add_FloatFloat_ReturnValue_2, float CallFunc_Add_FloatFloat_ReturnValue_3, float CallFunc_Add_FloatFloat_ReturnValue_4, float CallFunc_Divide_FloatFloat_ReturnValue, int32 Temp_int_Loop_Counter_Variable, float CallFunc_FClamp_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue_5, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_FCeil_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, float CallFunc_Multiply_IntFloat_ReturnValue, int32 CallFunc_FTrunc_ReturnValue, float CallFunc_Multiply_IntFloat_ReturnValue_1, float CallFunc_Multiply_IntFloat_ReturnValue_2, int32 CallFunc_FTrunc_ReturnValue_1, int32 CallFunc_FTrunc_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_3, class UCGGameInstance_C* CallFunc_GetCGGameInstance_AsCGGame_Instance, int32 CallFunc_Add_IntInt_ReturnValue_3, class UCGGameInstance_C* CallFunc_GetCGGameInstance_AsCGGame_Instance_1, int32 CallFunc_Add_IntInt_ReturnValue_4, int32 CallFunc_GetCurrentDay_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_5, float CallFunc_CalculateRadiationAmmount_Return, float CallFunc_CalculateRadiationAmmount_Return_1, float CallFunc_CalculateRadiationAmmount_Return_2);
	void InpActEvt_X_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_Z_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void ReceiveBeginPlay();
	void AddDebugDay();
	void ExecuteUbergraph_ba_AdditionalRadiationController_01(int32 EntryPoint, TArray<int32>& Temp_int_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_RandomIntegerInRange_ReturnValue, int32 CallFunc_Array_Get_Item, int32 Temp_int_Array_Index_Variable, const struct FKey& K2Node_InputKeyEvent_Key, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_2, const struct FKey& K2Node_InputKeyEvent_Key_1, TArray<int32>& Temp_int_Variable_1, TArray<class Aba_rad_RadioactiveZone_01_C*>& Temp_wildcard_Variable, int32 CallFunc_Array_Get_Item_1, const class FString& CallFunc_Conv_IntToString_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, int32 Temp_int_Variable_2, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_2, TArray<class Aba_rad_RadioactiveZone_01_C*>& CallFunc_GetAllActorsOfClass_OutActors, class Aba_rad_RadioactiveZone_01_C* CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Length_ReturnValue_2, int32 CallFunc_Array_Add_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue, const class FString& CallFunc_GetSublevelName_OutString, bool CallFunc_IsInPIE_ReturnValue, const class FString& CallFunc_GetSublevelName_OutString_1, bool CallFunc_EqualEqual_StrStr_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_3, class UCGGameInstance_C* CallFunc_GetCGGameInstance_AsCGGame_Instance, int32 CallFunc_GetCurrentDay_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_4, const class FString& CallFunc_BuildString_Int_ReturnValue, class Aba_rad_RadioactiveZone_01_C* K2Node_DynamicCast_AsBa_Rad_Radioactive_Zone_01, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsInPIE_ReturnValue_1, bool CallFunc_Array_RemoveItem_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_5, int32 Temp_int_Loop_Counter_Variable_2, int32 Temp_int_Variable_3, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_6, int32 Temp_int_Variable_4, class UCGGameInstance_C* CallFunc_GetCGGameInstance_AsCGGame_Instance_1, bool CallFunc_Array_RemoveItem_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_7, const class FString& CallFunc_Conv_IntToString_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue, class Aba_rad_RadioactiveZone_01_C* CallFunc_Array_Get_Item_3, const class FString& CallFunc_BuildString_Bool_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_3, const class FString& CallFunc_BuildString_Float_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_2, const class FString& CallFunc_BuildString_Object_ReturnValue, class UCGGameInstance_C* CallFunc_GetCGGameInstance_AsCGGame_Instance_2, int32 CallFunc_GetCurrentDay_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_8, const class FString& CallFunc_BuildString_Int_ReturnValue_1, class Aba_rad_RadioactiveZoneBox_01_C* K2Node_DynamicCast_AsBa_Rad_Radioactive_Zone_Box_01, bool K2Node_DynamicCast_bSuccess_1, int32 Temp_int_Variable_5, const class FString& CallFunc_BuildString_Float_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_9, class UCGGameInstance_C* CallFunc_GetCGGameInstance_AsCGGame_Instance_3, class Aba_rad_RadioactiveZone_01_C* CallFunc_Array_Get_Item_4, int32 CallFunc_Add_IntInt_ReturnValue_10, int32 CallFunc_Array_Add_ReturnValue_3, const class FString& CallFunc_BuildString_Int_ReturnValue_2, int32 CallFunc_Array_Length_ReturnValue_4, int32 CallFunc_Subtract_IntInt_ReturnValue_1, bool CallFunc_LessEqual_IntInt_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue_1);
};

}


