#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xD8 (0x420 - 0x348)
// BlueprintGeneratedClass ba_ia_Interactable_Random_Loot_01.ba_ia_Interactable_Random_Loot_01_C
class Aba_ia_Interactable_Random_Loot_01_C : public Aba_InteractableCustom_01_NoSave_C
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x348(0x8)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class USphereComponent*                      Sphere;                                            // 0x350(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWid_Loot_Main_C*                      LootMenu;                                          // 0x358(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UInventoryComponent2*                  EnemyInventory;                                    // 0x360(0x8)(Edit, BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         AcceptInput;                                       // 0x368(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3019[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             SelectedTile;                                      // 0x36C(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_301A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   LootSetID;                                         // 0x378(0x10)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	struct FSt_LootSet                           LootSet;                                           // 0x388(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            Emptied;                                           // 0x398(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class FText                                  NameOfTheLootable;                                 // 0x3A8(0x18)(Edit, BlueprintVisible, ExposeOnSpawn)
	bool                                         IsNotEmpty;                                        // 0x3C0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         LootNoticed;                                       // 0x3C1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3020[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            Noticed;                                           // 0x3C8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         RemoveIfEmpty;                                     // 0x3D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                         bIsInteractionUnlocked_0;                          // 0x3D9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         ShouldAwardInfluenceExpOnPickup;                   // 0x3DA(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                        Pad_3024[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        InfluenceExpToAward;                               // 0x3DC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         WasEmptyBeforeCurrentUse;                          // 0x3E0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3025[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MinItemsToSpawn;                                   // 0x3E4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	int32                                        MaxItemsToSpawn;                                   // 0x3E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_3027[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            ItemLooted;                                        // 0x3F0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         UseStorageUpdateDeleate;                           // 0x400(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         SendBroadcastsOnAddRemove;                         // 0x401(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_302B[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             Previous_Selection;                                // 0x404(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UseAdditionalLootPerDifficulty;                    // 0x40C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                        Pad_3033[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            ItemLootedWithOwner;                               // 0x410(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)

	static class UClass* StaticClass();
	static class Aba_ia_Interactable_Random_Loot_01_C* GetDefaultObj();

	void GetRandomUpgrades(class UDataTable* UpgradeDT, int32 Amount, class FName ItemId, TArray<class FName>* RandomUpgrades, const TArray<class FName>& DiscoveredUpgrades, const TArray<class FName>& ChosenUpgradeCategories, class FName RandomUpgrade, int32 RandomUpgradeIndex, const TArray<class FName>& ChosenUpgrades, const TArray<class FName>& AvailableUpgrdes, const struct FItemEntry& CallFunc_GetDataTableRowFromName_OutRow, bool CallFunc_GetDataTableRowFromName_ReturnValue, bool CallFunc_IsValid_ReturnValue, class ACh_Hero_00_C* CallFunc_GetCGPlayerCharacter_CGPlayerCharacter, bool CallFunc_Array_Contains_ReturnValue, TArray<class FName>& CallFunc_GetAvailableUpgrades_ReturnValue, int32 CallFunc_Array_AddUnique_ReturnValue, const struct FUpgradeEntry& CallFunc_GetDataTableRowFromName_OutRow_1, bool CallFunc_GetDataTableRowFromName_ReturnValue_1, TArray<class FName>& CallFunc_GetDataTableRowNames_OutRowNames, int32 CallFunc_Array_Add_ReturnValue, bool CallFunc_Array_Contains_ReturnValue_1, TArray<class FName>& K2Node_MakeArray_Array, bool CallFunc_BooleanOR_ReturnValue, class FName CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, int32 CallFunc_RandomIntegerInRange_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Greater_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void SelectItems(int32 B, TArray<struct FSt_LootItem>& TargetArray, TArray<struct FSt_LootItem>* ResultItems1, int32 LoopsCounter, const TArray<struct FSt_LootItem>& ResultItems, const TArray<enum class Enum_ItemNames>& SelectedItems, int32 CallFunc_Array_Length_ReturnValue, bool Temp_bool_True_if_break_was_hit_Variable, int32 Temp_int_Array_Index_Variable, const struct FSt_LootItem& CallFunc_Array_Get_Item, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_RandomBoolWithWeight_ReturnValue, bool CallFunc_GreaterEqual_FloatFloat_ReturnValue, int32 CallFunc_FTrunc_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 Temp_int_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1, int32 CallFunc_CountItems_Num, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_EqualEqual_IntInt_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_2, bool CallFunc_BooleanAND_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue);
	void CountItems(TArray<enum class Enum_ItemNames>& Array, enum class Enum_ItemNames Item, int32* Num, int32 Counter, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Variable, enum class Enum_ItemNames CallFunc_Array_Get_Item, bool CallFunc_EqualEqual_ByteByte_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1);
	void AwardInfluenceExperience(bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Greater_FloatFloat_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class UCGGameInstance_C* CallFunc_GetCGGameInstance_AsCGGame_Instance, bool CallFunc_BooleanAND_ReturnValue_1);
	void ResetLoot(class UDataTable* LootSetDT, class FName LootSetID, const struct FSt_LootSet& CallFunc_GetDataTableRowFromName_OutRow, bool CallFunc_GetDataTableRowFromName_ReturnValue, const struct FDataTableRowHandle& K2Node_MakeStruct_DataTableRowHandle, const struct FTransform& Temp_struct_Variable, class UInventoryComponent2* CallFunc_AddComponent_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue);
	void GetRandomLoot(int32 Min, int32 Max, struct FSt_LootSet* St_LootSet, const struct FSt_LootItem& RandomElement, const TArray<enum class Enum_ItemNames>& ResultingLootList, const TArray<struct FSt_LootItem>& ResultingLoot, int32 CallFunc_RandomIntegerInRange_ReturnValue, class UCGGameInstance_C* CallFunc_GetCGGameInstance_AsCGGame_Instance, float CallFunc_GetDifficultyModifierByType_ReturnValue, int32 CallFunc_FTrunc_ReturnValue, const struct FSt_LootSet& CallFunc_GetDataTableRowFromName_OutRow, bool CallFunc_GetDataTableRowFromName_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_SelectInt_ReturnValue, TArray<struct FSt_LootItem>& CallFunc_SelectItems_ResultItems1, const struct FSt_LootSet& K2Node_MakeStruct_st_LootSet);
	void AssignItemsFromLootSetIntoInventory(class UInventoryComponent2* Inventory, struct FSt_LootSet& LootSet, bool Wipe_existing_contents, float AmountToAddWithPerks, float ItemAmount, const TArray<class FName>& ChosenUpgrades, class FName Temp_name_Variable, bool Temp_bool_Variable, class ACh_Hero_00_C* CallFunc_GetCGPlayerCharacter_CGPlayerCharacter, float CallFunc_CheckPerk_ValueA, float CallFunc_CheckPerk_ValueB, bool CallFunc_CheckPerk_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, const struct FSt_LootItem& CallFunc_Array_Get_Item, float CallFunc_FMax_ReturnValue, float CallFunc_FMin_ReturnValue, float CallFunc_SelectFloat_ReturnValue, bool CallFunc_GreaterEqual_FloatFloat_ReturnValue, int32 CallFunc_FTrunc_ReturnValue, bool CallFunc_NotEqual_NameName_ReturnValue, float CallFunc_RandomFloatInRange_ReturnValue, int32 CallFunc_FTrunc_ReturnValue_1, class FName CallFunc_ItemEnumToNameID_Name, int32 CallFunc_RandomIntegerInRange_ReturnValue, enum class EResourceType CallFunc_NameIDToResourceEnum_Output, bool CallFunc_NameIDToResourceEnum_Found, float CallFunc_Conv_IntToFloat_ReturnValue, TArray<class FName>& CallFunc_GetRandomUpgrades_RandomUpgrades, float K2Node_Select_Default, class ACh_Hero_00_C* CallFunc_GetCGPlayerCharacter_CGPlayerCharacter_1, bool Temp_bool_Variable_1, float CallFunc_CheckPerk_ValueA_1, float CallFunc_CheckPerk_ValueB_1, bool CallFunc_CheckPerk_ReturnValue_1, bool CallFunc_GreaterEqual_FloatFloat_ReturnValue_1, bool Temp_bool_Variable_2, bool Temp_bool_Variable_3, float Temp_float_Variable, bool Temp_bool_Variable_4, int32 CallFunc_Array_Add_ReturnValue, float K2Node_Select_Default_1, float Temp_float_Variable_1, bool CallFunc_Array_RemoveItem_ReturnValue, float K2Node_Select_Default_2, float CallFunc_RandomFloat_ReturnValue, float K2Node_Select_Default_3, bool CallFunc_Greater_FloatFloat_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, bool CallFunc_BooleanOR_ReturnValue, float K2Node_Select_Default_4, class ACh_Hero_00_C* CallFunc_GetCGPlayerCharacter_CGPlayerCharacter_2, float CallFunc_Add_ReturnValue);
	void ClearInventory(class UInventoryComponent2* InputPin, TArray<struct FInventoryEntry>& CallFunc_GetItems_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Array_Length_ReturnValue, const struct FInventoryEntry& CallFunc_Array_Get_Item, int32 Temp_int_Loop_Counter_Variable, float CallFunc_Remove_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue);
	void InpActEvt_MouseScrollDown_K2Node_InputKeyEvent_1(const struct FKey& Key);
	void InpActEvt_MouseScrollUp_K2Node_InputKeyEvent_0(const struct FKey& Key);
	void InpActEvt_Console_Shortcuts_QuickUse1_K2Node_InputActionEvent_3(const struct FKey& Key);
	void InpActEvt_Console_Shortcuts_QuickUse2_K2Node_InputActionEvent_2(const struct FKey& Key);
	void InpActEvt_Console_Shortcuts_QuickUse3_K2Node_InputActionEvent_1(const struct FKey& Key);
	void InpActEvt_Console_Shortcuts_QuickUse4_K2Node_InputActionEvent_0(const struct FKey& Key);
	void ReceiveTick(float DeltaSeconds);
	void InternalShowNearInteractIcon();
	void InternalShowInteractIcon();
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void InternalHideInteractIcon();
	void UpdateVisibility(TSubclassOf<class ACGMovementState> InPreviousMovementState, TSubclassOf<class ACGMovementState> InNewMovementState);
	void ReceiveBeginPlay();
	void OnInteractionPressedComponent(class AMainPawnCpp* PlayerPawn, class UActorComponent* ComponentHit);
	void ExecuteUbergraph_ba_ia_Interactable_Random_Loot_01(int32 EntryPoint, class ACh_Hero_00_C* CallFunc_GetCGPlayerCharacter_CGPlayerCharacter, enum class ESlateVisibility Temp_byte_Variable, const struct FKey& K2Node_InputKeyEvent_Key_1, const struct FKey& K2Node_InputKeyEvent_Key, const struct FTransform& Temp_struct_Variable, class UInventoryComponent2* CallFunc_AddComponent_ReturnValue, const struct FKey& K2Node_InputActionEvent_Key_3, const struct FKey& K2Node_InputActionEvent_Key_2, const struct FKey& K2Node_InputActionEvent_Key_1, const struct FKey& K2Node_InputActionEvent_Key, bool Temp_bool_Variable, class UWid_Loot_Main_C* CallFunc_Create_ReturnValue, TArray<struct FAkExternalSourceInfo>& Temp_struct_Variable_1, FDelegateProperty_ Temp_delegate_Variable, int32 CallFunc_PostEvent_ReturnValue, bool CallFunc_NotEqual_Vector2DVector2D_ReturnValue, bool CallFunc_NotEqual_Vector2DVector2D_ReturnValue_1, bool Temp_bool_Variable_1, bool CallFunc_IsValid_ReturnValue, const struct FVector2D& CallFunc_GetDesiredSize_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue, float CallFunc_BreakVector2D_X, float CallFunc_BreakVector2D_Y, float K2Node_Event_DeltaSeconds, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, bool CallFunc_DoesSocketExist_ReturnValue, const struct FVector& CallFunc_GetSocketLocation_ReturnValue, const struct FVector2D& CallFunc_GetViewportSize_ReturnValue, const struct FVector& K2Node_Select_Default, float CallFunc_BreakVector2D_X_1, float CallFunc_BreakVector2D_Y_1, const struct FVector2D& CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition, bool CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_BreakVector2D_X_2, float CallFunc_BreakVector2D_Y_2, float CallFunc_Subtract_FloatFloat_ReturnValue_1, float CallFunc_FClamp_ReturnValue, float CallFunc_FClamp_ReturnValue_1, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue_1, bool CallFunc_NotEqual_ObjectObject_ReturnValue, class AActor* K2Node_Event_OtherActor, class ACh_Hero_00_C* CallFunc_GetCGPlayerCharacter_CGPlayerCharacter_1, TSubclassOf<class ACGMovementState> K2Node_CustomEvent_InPreviousMovementState, TSubclassOf<class ACGMovementState> K2Node_CustomEvent_InNewMovementState, bool CallFunc_EqualEqual_ClassClass_ReturnValue, TSubclassOf<class ACGMovementState> CallFunc_GetCurrentMovementState_ReturnValue, bool CallFunc_EqualEqual_ClassClass_ReturnValue_1, bool CallFunc_EqualEqual_ClassClass_ReturnValue_2, bool CallFunc_EqualEqual_ClassClass_ReturnValue_3, bool CallFunc_EqualEqual_ClassClass_ReturnValue_4, bool CallFunc_EqualEqual_ClassClass_ReturnValue_5, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue_3, bool CallFunc_NotEqual_ObjectObject_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanOR_ReturnValue_4, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, const struct FVector2D& CallFunc_GetTileByItemID_Index, const struct FVector2D& CallFunc_GetTileByItemID_Index_1, TArray<struct FInventoryEntry>& CallFunc_GetItems_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, class AMainPawnCpp* K2Node_Event_PlayerPawn, class UActorComponent* K2Node_Event_ComponentHit, const struct FVector2D& CallFunc_GetTileByItemID_Index_2, class ACh_Hero_00_C* CallFunc_GetCGPlayerCharacter_CGPlayerCharacter_2, float CallFunc_GetWorldDeltaSeconds_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, enum class ESlateVisibility Temp_byte_Variable_1, enum class ESlateVisibility K2Node_Select_Default_1, const struct FSt_LootSet& CallFunc_GetRandomLoot_st_LootSet, bool CallFunc_Not_PreBool_ReturnValue_1);
	void ItemLootedWithOwner__DelegateSignature(class FName ItemId, float Amount, class AActor* Actor);
	void ItemLooted__DelegateSignature(class FName ItemId, float Amount);
	void Noticed__DelegateSignature();
	void Emptied__DelegateSignature();
};

}


