#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x269 (0x489 - 0x220)
// BlueprintGeneratedClass ba_IndoorLightingSetup_01.ba_IndoorLightingSetup_01_C
class Aba_IndoorLightingSetup_01_C : public AActor
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x220(0x8)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UBoxComponent*                         Box;                                               // 0x228(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTextRenderComponent*                  TextRender;                                        // 0x230(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBillboardComponent*                   Billboard;                                         // 0x238(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x240(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	bool                                         GetOnlyLightsInsideVolume;                         // 0x248(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1767[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                LastRefresh;                                       // 0x250(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash)
	TArray<class AActor*>                        ExcludedList;                                      // 0x260(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class AStaticMeshActor*>              AdditionalMeshesToHide;                            // 0x270(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                         TogglePointLights;                                 // 0x280(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1777[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class APointLight*>                   PointLightsList;                                   // 0x288(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                         ToggleSpotLights;                                  // 0x298(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1784[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ASpotLight*>                    SpotLightsList;                                    // 0x2A0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                         ToggleRectLights;                                  // 0x2B0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_178B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ARectLight*>                    RectLightsList;                                    // 0x2B8(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                         ToggleLightBeams;                                  // 0x2C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1799[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class Abp_LightBeam_01_C*>            LightBeamsList;                                    // 0x2D0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate)
	TArray<class Abp_LightBeam_01_C*>            LightBeamsList__Type2_;                            // 0x2E0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate)
	bool                                         EnableState;                                       // 0x2F0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_17A0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class ULightComponent*, float>          LightsVolumetricScatteringIntensity;               // 0x2F8(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class ULightComponent*, float>          LightsSpecularScale;                               // 0x348(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class ULightComponent*, float>          LightsIntensity;                                   // 0x398(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<class Abp_LightBeam_01_C*, float>       LightBeamA_Brightness;                             // 0x3E8(0x50)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	TMap<class Abp_LightBeam_01_C*, float>       LightBeamB_Brightness;                             // 0x438(0x50)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	bool                                         ShouldBeAdjustedByStorm;                           // 0x488(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class Aba_IndoorLightingSetup_01_C* GetDefaultObj();

	void SaveOriginalLightsSetup(const TArray<class ULightComponent*>& _LightsComponents, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Array_Index_Variable_2, int32 Temp_int_Loop_Counter_Variable_2, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Array_Index_Variable_3, int32 Temp_int_Loop_Counter_Variable_3, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 Temp_int_Loop_Counter_Variable_4, int32 Temp_int_Loop_Counter_Variable_5, int32 CallFunc_Add_IntInt_ReturnValue_4, int32 CallFunc_Add_IntInt_ReturnValue_5, int32 Temp_int_Array_Index_Variable_4, int32 Temp_int_Array_Index_Variable_5, int32 CallFunc_Array_Length_ReturnValue, class Abp_LightBeam_01_C* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, class Abp_LightBeam_01_C* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, class ULightComponent* CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_2, class ARectLight* CallFunc_Array_Get_Item_3, int32 CallFunc_Array_Length_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_3, int32 CallFunc_Array_AddUnique_ReturnValue, class ASpotLight* CallFunc_Array_Get_Item_4, int32 CallFunc_Array_Length_ReturnValue_4, bool CallFunc_Less_IntInt_ReturnValue_4, int32 CallFunc_Array_AddUnique_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_5, class APointLight* CallFunc_Array_Get_Item_5, bool CallFunc_Less_IntInt_ReturnValue_5, int32 CallFunc_Array_AddUnique_ReturnValue_2);
	void StormAdjust(float VolumetricScatteringIntensityMultiplier, float SpecularScaleMultiplier, float IntensityMultiplier, float BeamBrightnessMultiplier, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_2, TArray<class Abp_LightBeam_01_C*>& CallFunc_Map_Keys_Keys, class Abp_LightBeam_01_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, float CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, int32 Temp_int_Loop_Counter_Variable_2, float CallFunc_Multiply_FloatFloat_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_2, TArray<class Abp_LightBeam_01_C*>& CallFunc_Map_Keys_Keys_1, class Abp_LightBeam_01_C* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, float CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue_1, TArray<class ULightComponent*>& CallFunc_Map_Keys_Keys_2, int32 CallFunc_Array_Length_ReturnValue_2, class ULightComponent* CallFunc_Array_Get_Item_2, bool CallFunc_Less_IntInt_ReturnValue_2, float CallFunc_Map_Find_Value_2, bool CallFunc_Map_Find_ReturnValue_2, float CallFunc_Multiply_FloatFloat_ReturnValue_2, float CallFunc_Map_Find_Value_3, bool CallFunc_Map_Find_ReturnValue_3, float CallFunc_Multiply_FloatFloat_ReturnValue_3, float CallFunc_Map_Find_Value_4, bool CallFunc_Map_Find_ReturnValue_4, float CallFunc_Multiply_FloatFloat_ReturnValue_4);
	void Zero3_DisableLights();
	void Zero2_EnableLights();
	void Zero1_RefreshLightsList(bool CallFunc_Not_PreBool_ReturnValue, const struct FVector& CallFunc_GetUnscaledBoxExtent_ReturnValue, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue, int32 Temp_int_Loop_Counter_Variable, const struct FVector& CallFunc_GetUnscaledBoxExtent_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue_1, int32 Temp_int_Array_Index_Variable, bool CallFunc_Not_PreBool_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_Not_PreBool_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_2, const struct FVector& CallFunc_GetUnscaledBoxExtent_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_2, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue_2, int32 Temp_int_Array_Index_Variable_1, bool CallFunc_Not_PreBool_ReturnValue_3, int32 Temp_int_Loop_Counter_Variable_3, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 Temp_int_Array_Index_Variable_2, const struct FVector& CallFunc_GetUnscaledBoxExtent_ReturnValue_3, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue_3, int32 Temp_int_Array_Index_Variable_3, int32 Temp_int_Loop_Counter_Variable_4, int32 CallFunc_Add_IntInt_ReturnValue_4, int32 Temp_int_Array_Index_Variable_4, class FName CallFunc_GetLevelFromActor_ReturnValue, TArray<class AActor*>& CallFunc_GetAllActorsFromLevel_ReturnValue, class AActor* CallFunc_Array_Get_Item, const struct FVector& CallFunc_GetUnscaledBoxExtent_ReturnValue_4, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, class Abp_LightBeam_01_C* K2Node_DynamicCast_AsBp_Light_Beam_01, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Array_Contains_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue_4, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_IsPointInBoxWithTransform_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, const struct FDateTime& CallFunc_Now_ReturnValue, class FText CallFunc_AsDateTime_DateTime_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue, class FName CallFunc_GetLevelFromActor_ReturnValue_1, TArray<class AActor*>& CallFunc_GetAllActorsFromLevel_ReturnValue_1, class FName CallFunc_GetLevelFromActor_ReturnValue_2, class AActor* CallFunc_Array_Get_Item_1, TArray<class AActor*>& CallFunc_GetAllActorsFromLevel_ReturnValue_2, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, class AActor* CallFunc_Array_Get_Item_2, bool CallFunc_IsPointInBoxWithTransform_ReturnValue_1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_IsPointInBoxWithTransform_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue_1, class ARectLight* K2Node_DynamicCast_AsRect_Light, bool K2Node_DynamicCast_bSuccess_1, int32 CallFunc_Array_Add_ReturnValue_1, bool CallFunc_Array_Contains_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, class Abp_LightBeam_01_C* K2Node_DynamicCast_AsBp_Light_Beam_01_1, bool K2Node_DynamicCast_bSuccess_2, int32 CallFunc_Array_Add_ReturnValue_2, bool CallFunc_Array_Contains_ReturnValue_2, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_2, class FName CallFunc_GetLevelFromActor_ReturnValue_3, bool CallFunc_Not_PreBool_ReturnValue_4, TArray<class AActor*>& CallFunc_GetAllActorsFromLevel_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue_2, class AActor* CallFunc_Array_Get_Item_3, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_3, class ASpotLight* K2Node_DynamicCast_AsSpot_Light, bool K2Node_DynamicCast_bSuccess_3, bool CallFunc_IsPointInBoxWithTransform_ReturnValue_3, int32 CallFunc_Array_Add_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue_3, bool CallFunc_Array_Contains_ReturnValue_3, int32 CallFunc_Array_Length_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_3, class FName CallFunc_GetLevelFromActor_ReturnValue_4, TArray<class AActor*>& CallFunc_GetAllActorsFromLevel_ReturnValue_4, int32 CallFunc_Array_Length_ReturnValue_4, class AActor* CallFunc_Array_Get_Item_4, bool CallFunc_Less_IntInt_ReturnValue_4, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_4, bool CallFunc_IsPointInBoxWithTransform_ReturnValue_4, class APointLight* K2Node_DynamicCast_AsPoint_Light, bool K2Node_DynamicCast_bSuccess_4, bool CallFunc_BooleanOR_ReturnValue_4, int32 CallFunc_Array_Add_ReturnValue_4, bool CallFunc_Array_Contains_ReturnValue_4);
	void ToggleLights(bool Enable, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Loop_Counter_Variable, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_2, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Array_Index_Variable_2, int32 Temp_int_Array_Index_Variable_3, int32 Temp_int_Loop_Counter_Variable_3, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 Temp_int_Array_Index_Variable_4, int32 Temp_int_Loop_Counter_Variable_4, int32 CallFunc_Add_IntInt_ReturnValue_4, int32 Temp_int_Array_Index_Variable_5, bool CallFunc_Not_PreBool_ReturnValue, class Abp_LightBeam_01_C* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_IsValid_ReturnValue, int32 Temp_int_Loop_Counter_Variable_5, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_5, bool CallFunc_Not_PreBool_ReturnValue_1, class Abp_LightBeam_01_C* CallFunc_Array_Get_Item_1, class ARectLight* CallFunc_Array_Get_Item_2, bool CallFunc_IsValid_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_2, class ASpotLight* CallFunc_Array_Get_Item_3, class APointLight* CallFunc_Array_Get_Item_4, bool CallFunc_IsValid_ReturnValue_3, bool CallFunc_IsValid_ReturnValue_4, int32 CallFunc_Array_Length_ReturnValue_3, int32 CallFunc_Array_Length_ReturnValue_4, bool CallFunc_Less_IntInt_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_4, bool CallFunc_Not_PreBool_ReturnValue_2, class AStaticMeshActor* CallFunc_Array_Get_Item_5, int32 CallFunc_Array_Length_ReturnValue_5, bool CallFunc_IsValid_ReturnValue_5, bool CallFunc_Less_IntInt_ReturnValue_5);
	void UserConstructionScript(class FName CallFunc_GetLevelFromActor_ReturnValue, class FText CallFunc_Conv_NameToText_ReturnValue);
	void ReceiveActorEndOverlap(class AActor* OtherActor);
	void ReceiveActorBeginOverlap(class AActor* OtherActor);
	void ReceiveBeginPlay();
	void ExecuteUbergraph_ba_IndoorLightingSetup_01(int32 EntryPoint, class AActor* K2Node_Event_OtherActor_1, class ACh_Hero_00_C* CallFunc_GetCGPlayerCharacter_CGPlayerCharacter, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, class AActor* K2Node_Event_OtherActor, class ACh_Hero_00_C* CallFunc_GetCGPlayerCharacter_CGPlayerCharacter_1, bool CallFunc_EqualEqual_ObjectObject_ReturnValue_1, const class FString& CallFunc_BuildString_Object_ReturnValue, const class FString& CallFunc_BuildString_Object_ReturnValue_1, class UCGGameInstance_C* CallFunc_GetCGGameInstance_AsCGGame_Instance);
};

}


