#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x24 (0x24 - 0x0)
// UserDefinedStruct st_AdditionalRadiationSetup_03.st_AdditionalRadiationSetup_03
struct FSt_AdditionalRadiationSetup_03
{
public:
	float                                        Lowradiationareasnumbermultiplier_37_C083713F4C2F21FA6601FBA774AFDBA7; // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Mediumradiationareasnumbermultiplier_41_4B8F3A11469B9CC232D5C7BE32234531; // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Highradiationareasnumbermultiplier_42_DE264D6A48C150494A0A15A2E400FD3B; // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LowradiationareasMinusminvalue_20_A311F2234A663092E325FEAEA8788844; // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LowradiationareasMinusmaxvalue_21_16552F2D474085408E81D4A9E3656F19; // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        MediumradiationareasMinusminvalue_33_FAEADFAD46BAC82815BDF3AA02C6EC3E; // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        MediumradiationareasMinusmaxvalue_32_8A01DF42423DF3F994B8AF9D28E9E90E; // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        HighradiationareasMinusminvalue_31_2A2BD8194C753433649F4D955D51A257; // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        HighradiationareasMinusmaxvalue_34_AC96E41A47CC6A59B560A39F3CA3E73A; // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


