#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x59 (0x59 - 0x0)
// UserDefinedStruct st_col_InvestigationDescription_01.st_col_InvestigationDescription_01
struct FSt_col_InvestigationDescription_01
{
public:
	class FName                                  FirstObjectID_16_5D2532B04453CBCAF5C1118762F3798C; // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  FirstObjectPointID_19_CAEDC39B4D1383E17D5A4F8A793FBF94; // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  FirstObjectOptionID_14_FCF41872487D715D7A0585BB7BE4ADC0; // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  FirstObjectNoteID_26_772F1D024DEF81D71488C68B01F9F2AA; // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  SecondObjectID_15_3C5683CC461E37DE395BAA9632A0AEC3; // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  SecondObjectPointID_21_F1ECBE714F1DB1A4F47617BE28BCC1A2; // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  SecondObjectOptionID_13_EF2FC73741021737944F11853E8076A5; // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  SecondObjectNoteID_28_98EFDFAB42D06183824A68B1F858F639; // 0x38(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  SplineText_9_47D17686490373F7D4B3C88237374060;     // 0x40(0x18)(Edit, BlueprintVisible)
	bool                                         IsFinished_23_E9599EB948A673F83B9E868571C876D2;    // 0x58(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}


