#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x30 (0x30 - 0x0)
// UserDefinedStruct st_LightingSetup_01_SkyLight.st_LightingSetup_01_SkyLight
struct FSt_LightingSetup_01_SkyLight
{
public:
	float                                        LightIntensity_218_C98B9BEC40A0D976CC3B918AF9C0A66E; // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                LightColor_219_DEF6846D40CBE096882058B0FCB7B237;   // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LightIndirectLightingIntensity_220_256E8DD6407FC63B856E469D018950FE; // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LightVolumetricScatteringIntensity_221_C7571A03483A788CA9B0B7B0ADF1321F; // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FLinearColor                          LightLowerHemisphereColor_222_00EA67DA41CED448D06C9C9D880A4761; // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        DistanceFieldAmbientOcclusionContrast_224_4E6148FC4C20FD60F035638447387C06; // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        DistanceFieldAmbientOcclusionExponent_225_340649AC48A99F80D3D41AA343816258; // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        DistanceFieldAmbientOcclusionMinOcclusion_226_CBE952FD4536DAC15890A0A286182838; // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                DistanceFieldAmbientOcclusionTint_227_1FE550E6421985F43716009DF83E6EB3; // 0x2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


