#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x30 (0x30 - 0x0)
// UserDefinedStruct st_LightingSetup_01_AtmosphericFog.st_LightingSetup_01_AtmosphericFog
struct FSt_LightingSetup_01_AtmosphericFog
{
public:
	float                                        AtmosphereSunMultipler_214_AE9800B6471F6916BC31C087D89DBD1A; // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AtmosphereFogMultipler_215_B7D3E83D4D7D18F9119D64A4879836C7; // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AtmosphereDensityMultipler_216_CE4972E640A781DD604E4483624F9E85; // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AtmosphereDensityOffset_217_311E67F14A1942B41446E2938E3C0D64; // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AtmosphereDistanceScale_218_01410FAA42AFB7F33B924D947555B594; // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AtmosphereAltitudeScale_219_9BC200DF4DAB6972869A63A9C458DDC7; // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AtmosphereDistanceOffset_220_2AD6B45748E64AC19F8C3FB322D883FA; // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AtmosphereGroundOffset_221_D29FB1A74C4C0DE747241BA5D00EEAA4; // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AtmosphereStartDistance_210_14DDC6D8472F21247B767D8896A7336D; // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AtmosphereSunDiscScale_223_10312981412A62C6329802BD58D5C6D4; // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LightingDefaultBrightness_224_08E19D8946AD48F17251E89DBA9CD4CE; // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FColor                                LightingDefaultLightColor_225_D719C5B04FAC490B9FC37AB216432A7B; // 0x2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


