#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xE9 (0xE9 - 0x0)
// UserDefinedStruct struct_MapInformation.struct_MapInformation
struct FStruct_MapInformation
{
public:
	class FText                                  ReadableName_4_7652F4064F547B6838081E9B71B49342;   // 0x0(0x18)(Edit, BlueprintVisible)
	class FName                                  MapToLoad_7_9C81069D41BE5045CF715497F03D4F8C;      // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  Description_10_2EE8402947E7ACBA83FA7B953BFC13A4;   // 0x20(0x18)(Edit, BlueprintVisible)
	class UTexture2D*                            Texture_33_532BBFA74664080FD71FAD94D53FFD6E;       // 0x38(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UTexture2D*                            SmallTexture_18_B2AACC5244E6EAE7DF7ADD824459776B;  // 0x40(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>             SateliteMapTexture1_34_6E3778EF41ABA118EB44ED9CBECC38B8; // 0x48(0x28)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>             SateliteMapTexture2_35_23CDD077453245F4BF377A88B2109432; // 0x70(0x28)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>             SateliteMapTexture3_36_55E05F434F4DCF439BC08B93C0F6757B; // 0x98(0x28)(Edit, BlueprintVisible, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>             SateliteMapTexture4_37_C494BA9B43469AB31A1297A5B808C222; // 0xC0(0x28)(Edit, BlueprintVisible, HasGetValueTypeHash)
	bool                                         UseTextureOnMap_31_23B5EC4A4D523C46BF5B488C1B165588; // 0xE8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}


