#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x120 (0x380 - 0x260)
// WidgetBlueprintGeneratedClass wid_InvestigationBoard.wid_InvestigationBoard_C
class UWid_InvestigationBoard_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x260(0x8)(ZeroConstructor, Transient, DuplicateTransient, UObjectWrapper)
	class UWid_Investigation_Buttons_C*          Buttons;                                           // 0x268(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCanvasPanel*                          CanvasPanel_0;                                     // 0x270(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                        Clues;                                             // 0x278(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                        Facts;                                             // 0x280(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            GeneralNotesText;                                  // 0x288(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_1;                                           // 0x290(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_2;                                           // 0x298(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_24;                                          // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Image_25;                                          // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWid_PDA_Menu_C*                       Menu;                                              // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                            Scroll;                                            // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            TextBlock_116;                                     // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          TextBox;                                           // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          VerticalBox_5;                                     // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class URichTextBlock*                        WormholeStatusText;                                // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class Aba_InvestigationBoard_Parent_C*       Board;                                             // 0x2E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class UWid_InvestigationBoard_Entry_C*> Notes;                                             // 0x2E8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TMap<struct FVector2D, struct FVector2D>     NewVar_0;                                          // 0x2F8(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UWid_InvestigationBoard_Entry_C*       SelectedEntry;                                     // 0x348(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UWid_InvestigationBoard_Label_C*> Labels;                                            // 0x350(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                        FactsNum;                                          // 0x360(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CluesNum;                                          // 0x364(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        MaxFactsNum;                                       // 0x368(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        MaxCluesNum;                                       // 0x36C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector2D                             LastViewportSize;                                  // 0x370(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class Aba_InvestigationBoard_Controller_C*   BoardController;                                   // 0x378(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UWid_InvestigationBoard_C* GetDefaultObj();

	void GetCurrentlySelectedIndex(int32* Index);
	void SizeUpdate(const struct FVector2D& CallFunc_GetDesiredSize_ReturnValue, class UVerticalBoxSlot* CallFunc_SlotAsVerticalBoxSlot_ReturnValue, float CallFunc_BreakVector2D_X, float CallFunc_BreakVector2D_Y, const struct FVector2D& CallFunc_GetDesiredSize_ReturnValue_1, float CallFunc_BreakVector2D_X_1, float CallFunc_BreakVector2D_Y_1, class UCanvasPanelSlot* CallFunc_SlotAsCanvasSlot_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue_1, float CallFunc_Add_FloatFloat_ReturnValue_2, float CallFunc_Add_FloatFloat_ReturnValue_3, float CallFunc_FMax_ReturnValue, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue);
	void SetFactsAndCluesNum(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Variable, int32 Temp_int_Loop_Counter_Variable, int32 Temp_int_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_1, TArray<class AActor*>& CallFunc_GetAllChildActors_ChildActors, class AActor* CallFunc_Array_Get_Item, class Aba_NoteSpawnerComponentForInvestigationBoard_C* CallFunc_Array_Get_Item_1, class Aba_NoteSpawnerComponentForInvestigationBoard_C* K2Node_DynamicCast_AsBa_Note_Spawner_Component_for_Investigation_Board, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 Temp_int_Variable_2, int32 Temp_int_Variable_3, int32 CallFunc_Add_IntInt_ReturnValue_4, int32 CallFunc_Add_IntInt_ReturnValue_5, class FText CallFunc_MakeLiteralText_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue_1, const class FString& CallFunc_Conv_TextToString_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, const class FString& CallFunc_Conv_IntToString_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, const class FString& CallFunc_Concat_StrStr_ReturnValue_5, const class FString& CallFunc_Concat_StrStr_ReturnValue_6, const class FString& CallFunc_Conv_IntToString_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_7, class FText CallFunc_Conv_StringToText_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue_3, const class FString& CallFunc_Concat_StrStr_ReturnValue_8, const class FString& CallFunc_Concat_StrStr_ReturnValue_9, const class FString& CallFunc_Concat_StrStr_ReturnValue_10, const class FString& CallFunc_Concat_StrStr_ReturnValue_11, class FText CallFunc_Conv_StringToText_ReturnValue_1);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void Init();
	void SetSizes();
	void ForceBoard(int32 Index);
	void Destruct();
	void ExecuteUbergraph_wid_InvestigationBoard(int32 EntryPoint, class ACGHUD_C* CallFunc_GetCGHud_AsCGHUD, class UWid_InvestigationBoard_Label_C* CallFunc_Create_ReturnValue, bool Temp_bool_Variable, class UCanvasPanelSlot* CallFunc_SlotAsCanvasSlot_ReturnValue, uint8 Temp_byte_Variable, const struct FVector2D& CallFunc_GetSize_ReturnValue, float CallFunc_BreakVector2D_X, float CallFunc_BreakVector2D_Y, uint8 Temp_byte_Variable_1, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue_1, bool Temp_bool_Variable_1, uint8 Temp_byte_Variable_2, bool Temp_bool_Variable_2, class FText Temp_text_Variable, bool Temp_bool_Variable_3, class FText Temp_text_Variable_1, class FText Temp_text_Variable_2, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_2, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Array_Index_Variable_2, int32 Temp_int_Loop_Counter_Variable_3, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 Temp_int_Loop_Counter_Variable_4, int32 CallFunc_Add_IntInt_ReturnValue_4, int32 Temp_int_Array_Index_Variable_3, class UWid_InvestigationBoard_Entry_C* CallFunc_Create_ReturnValue_1, class UCanvasPanelSlot* CallFunc_SlotAsCanvasSlot_ReturnValue_1, const struct FVector2D& CallFunc_GetSize_ReturnValue_1, int32 Temp_int_Array_Index_Variable_4, float CallFunc_BreakVector2D_X_1, float CallFunc_BreakVector2D_Y_1, float CallFunc_Divide_FloatFloat_ReturnValue_2, float CallFunc_Divide_FloatFloat_ReturnValue_3, const struct FVector2D& CallFunc_GetDesiredSize_ReturnValue, class UVerticalBoxSlot* CallFunc_SlotAsVerticalBoxSlot_ReturnValue, float CallFunc_BreakVector2D_X_2, float CallFunc_BreakVector2D_Y_2, const struct FVector2D& CallFunc_GetDesiredSize_ReturnValue_1, float CallFunc_BreakVector2D_X_3, float CallFunc_BreakVector2D_Y_3, class UCanvasPanelSlot* CallFunc_SlotAsCanvasSlot_ReturnValue_2, float CallFunc_Add_FloatFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue_1, float CallFunc_Add_FloatFloat_ReturnValue_2, const struct FVector2D& CallFunc_GetDesiredSize_ReturnValue_2, float CallFunc_Add_FloatFloat_ReturnValue_3, float CallFunc_BreakVector2D_X_4, float CallFunc_BreakVector2D_Y_4, float CallFunc_FMax_ReturnValue, class UCanvasPanelSlot* CallFunc_SlotAsCanvasSlot_ReturnValue_3, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue, class UVerticalBoxSlot* CallFunc_SlotAsVerticalBoxSlot_ReturnValue_1, const struct FVector2D& CallFunc_GetDesiredSize_ReturnValue_3, float CallFunc_BreakVector2D_X_5, float CallFunc_BreakVector2D_Y_5, bool K2Node_Event_IsDesignTime, float CallFunc_Add_FloatFloat_ReturnValue_4, float CallFunc_Add_FloatFloat_ReturnValue_5, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, float CallFunc_Add_FloatFloat_ReturnValue_6, float CallFunc_Add_FloatFloat_ReturnValue_7, float CallFunc_FMax_ReturnValue_1, TArray<class AActor*>& CallFunc_GetAllChildActors_ChildActors, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_1, class AActor* CallFunc_Array_Get_Item, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, class Aba_InvestigationBoardLabelPositionTag_C* K2Node_DynamicCast_AsBa_Investigation_Board_Label_Position_Tag, bool K2Node_DynamicCast_bSuccess, class Aba_NoteSpawnerComponentForInvestigationBoard_C* K2Node_DynamicCast_AsBa_Note_Spawner_Component_for_Investigation_Board, bool K2Node_DynamicCast_bSuccess_1, const struct FVector& CallFunc_GetLocalBounds_Min, const struct FVector& CallFunc_GetLocalBounds_Max, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, const struct FVector& CallFunc_Divide_VectorInt_ReturnValue, const struct FTransform& CallFunc_MakeTransform_ReturnValue, const struct FVector& CallFunc_GetLocalBounds_Min_1, const struct FVector& CallFunc_GetLocalBounds_Max_1, const struct FVector& CallFunc_TransformLocation_ReturnValue, const struct FVector& CallFunc_TransformLocation_ReturnValue_1, const struct FVector& CallFunc_GetLocalBounds_Min_2, const struct FVector& CallFunc_GetLocalBounds_Max_2, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_2, const struct FVector& CallFunc_Divide_VectorInt_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue, const struct FVector2D& CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition, bool CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue, float CallFunc_BreakVector2D_X_6, float CallFunc_BreakVector2D_Y_6, float CallFunc_Subtract_FloatFloat_ReturnValue, class UCanvasPanelSlot* CallFunc_AddChildToCanvas_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue_1, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_2, int32 CallFunc_Array_Add_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue_1, const struct FVector2D& CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition_1, bool CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue_1, float CallFunc_BreakVector2D_X_7, float CallFunc_BreakVector2D_Y_7, const struct FVector2D& CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition_2, bool CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue_2, class APlayerController* CallFunc_GetPlayerController_ReturnValue_2, float CallFunc_BreakVector2D_X_8, float CallFunc_BreakVector2D_Y_8, float CallFunc_Subtract_FloatFloat_ReturnValue_2, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_3, class UWid_InvestigationBoard_Entry_C* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue_1, class APlayerController* CallFunc_GetPlayerController_ReturnValue_3, const struct FVector2D& CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition_3, bool CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue_3, class UCanvasPanelSlot* CallFunc_AddChildToCanvas_ReturnValue_1, float CallFunc_BreakVector2D_X_9, float CallFunc_BreakVector2D_Y_9, float CallFunc_Subtract_FloatFloat_ReturnValue_3, class UWid_InvestigationBoard_Label_C* CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_2, float CallFunc_Subtract_FloatFloat_ReturnValue_4, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_4, class APlayerController* CallFunc_GetPlayerController_ReturnValue_4, int32 CallFunc_Array_Find_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue_5, bool CallFunc_GreaterEqual_IntInt_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue_6, class UWid_InvestigationBoard_Entry_C* CallFunc_Array_Get_Item_3, int32 CallFunc_Array_Length_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_3, class UCanvasPanelSlot* CallFunc_SlotAsCanvasSlot_ReturnValue_4, const struct FVector2D& CallFunc_GetSize_ReturnValue_2, float CallFunc_BreakVector2D_X_10, float CallFunc_BreakVector2D_Y_10, float CallFunc_Divide_FloatFloat_ReturnValue_4, class Aba_NoteSpawnerComponentForInvestigationBoard_C* K2Node_DynamicCast_AsBa_Note_Spawner_Component_for_Investigation_Board_1, bool K2Node_DynamicCast_bSuccess_2, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_2, const struct FVector& CallFunc_GetLocalBounds_Min_3, const struct FVector& CallFunc_GetLocalBounds_Max_3, int32 CallFunc_Array_Find_ReturnValue_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_4, bool CallFunc_GreaterEqual_IntInt_ReturnValue_1, const struct FVector& CallFunc_Divide_VectorInt_ReturnValue_2, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_5, const struct FVector2D& CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition_4, bool CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue_4, const struct FTransform& CallFunc_K2_GetComponentToWorld_ReturnValue_1, float CallFunc_BreakVector2D_X_11, float CallFunc_BreakVector2D_Y_11, const struct FVector& CallFunc_BreakTransform_Location_1, const struct FRotator& CallFunc_BreakTransform_Rotation_1, const struct FVector& CallFunc_BreakTransform_Scale_1, float CallFunc_Subtract_FloatFloat_ReturnValue_5, const struct FTransform& CallFunc_MakeTransform_ReturnValue_1, const struct FVector& CallFunc_GetLocalBounds_Min_4, const struct FVector& CallFunc_GetLocalBounds_Max_4, float CallFunc_Divide_FloatFloat_ReturnValue_5, const struct FVector& CallFunc_TransformLocation_ReturnValue_2, float CallFunc_Subtract_FloatFloat_ReturnValue_6, const struct FVector2D& CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition_5, bool CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue_5, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_5, float CallFunc_BreakVector2D_X_12, float CallFunc_BreakVector2D_Y_12, const struct FVector& CallFunc_TransformLocation_ReturnValue_3, const struct FVector2D& CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition_6, bool CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue_6, TArray<class AActor*>& CallFunc_GetAllChildActors_ChildActors_1, float CallFunc_BreakVector2D_X_13, float CallFunc_BreakVector2D_Y_13, class AActor* CallFunc_Array_Get_Item_4, float CallFunc_Subtract_FloatFloat_ReturnValue_7, class Aba_InvestigationBoardLabelPositionTag_C* K2Node_DynamicCast_AsBa_Investigation_Board_Label_Position_Tag_1, bool K2Node_DynamicCast_bSuccess_3, float CallFunc_Subtract_FloatFloat_ReturnValue_8, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_6, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_3, const struct FVector& CallFunc_GetLocalBounds_Min_5, const struct FVector& CallFunc_GetLocalBounds_Max_5, class UCanvasPanelSlot* CallFunc_SlotAsCanvasSlot_ReturnValue_5, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_6, const struct FVector2D& CallFunc_GetSize_ReturnValue_3, const struct FVector& CallFunc_Divide_VectorInt_ReturnValue_3, float CallFunc_BreakVector2D_X_14, float CallFunc_BreakVector2D_Y_14, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_7, float CallFunc_Divide_FloatFloat_ReturnValue_6, const struct FVector2D& CallFunc_ProjectWorldLocationToWidgetPosition_ScreenPosition_7, bool CallFunc_ProjectWorldLocationToWidgetPosition_ReturnValue_7, float CallFunc_Divide_FloatFloat_ReturnValue_7, float CallFunc_BreakVector2D_X_15, float CallFunc_BreakVector2D_Y_15, int32 CallFunc_Array_Length_ReturnValue_4, float CallFunc_Subtract_FloatFloat_ReturnValue_9, bool CallFunc_Less_IntInt_ReturnValue_4, float CallFunc_Subtract_FloatFloat_ReturnValue_10, const struct FVector2D& CallFunc_MakeVector2D_ReturnValue_7, const struct FVector2D& CallFunc_GetViewportSize_ReturnValue, bool CallFunc_NotEqual_Vector2DVector2D_ReturnValue, class UCGGameInstance_C* CallFunc_GetCGGameInstance_AsCGGame_Instance, const struct FDataTableRowHandle& K2Node_MakeStruct_DataTableRowHandle, bool CallFunc_PermanentDataGetValue_ReturnValue, uint8 K2Node_Select_Default, uint8 K2Node_Select_Default_1, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class FText K2Node_Select_Default_2, class FText K2Node_Select_Default_3, const class FString& CallFunc_Conv_TextToString_ReturnValue, int32 K2Node_Event_Index, class ACGHUD_C* CallFunc_GetCGHud_AsCGHUD_1);
};

}


