#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0xD0 (0xD0 - 0x0)
// Function BPLibrary.BPLibrary_C.CalcResistsTemp
struct UBPLibrary_C_CalcResistsTemp_Params
{
public:
	float                                        Stat;                                              // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Bool;                                              // 0x4(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_13B1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               __WorldContext;                                    // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  Result;                                            // 0x10(0x18)(Parm, OutParm)
	bool                                         Temp_bool_Variable;                                // 0x28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_13B4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x2C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Temp_float_Variable;                               // 0x30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_1;                              // 0x34(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_13B7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Temp_float_Variable_1;                             // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Temp_float_Variable_2;                             // 0x3C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        K2Node_Select_Default;                             // 0x40(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Add_FloatFloat_ReturnValue;               // 0x44(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_LessEqual_FloatFloat_ReturnValue;         // 0x48(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_13C0[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        K2Node_Select_Default_1;                           // 0x4C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue;             // 0x50(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData;              // 0x68(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array;                            // 0xA8(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue;                       // 0xB8(0x18)(None)
};

// 0xAB0 (0xAB0 - 0x0)
// Function BPLibrary.BPLibrary_C.GetStatByEnumLegacy
struct UBPLibrary_C_GetStatByEnumLegacy_Params
{
public:
	enum class EPerkType                         Enum;                                              // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1490[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               __WorldContext;                                    // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  Text;                                              // 0x10(0x18)(Parm, OutParm)
	enum class EPerkType                         Temp_byte_Variable;                                // 0x28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1498[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Temp_text_Variable;                                // 0x30(0x18)(None)
	class FText                                  Temp_text_Variable_1;                              // 0x48(0x18)(None)
	class FText                                  Temp_text_Variable_2;                              // 0x60(0x18)(None)
	class FText                                  Temp_text_Variable_3;                              // 0x78(0x18)(None)
	class FText                                  Temp_text_Variable_4;                              // 0x90(0x18)(None)
	class FText                                  Temp_text_Variable_5;                              // 0xA8(0x18)(None)
	class FText                                  Temp_text_Variable_6;                              // 0xC0(0x18)(None)
	class FText                                  Temp_text_Variable_7;                              // 0xD8(0x18)(None)
	class FText                                  Temp_text_Variable_8;                              // 0xF0(0x18)(None)
	class FText                                  Temp_text_Variable_9;                              // 0x108(0x18)(None)
	class FText                                  Temp_text_Variable_10;                             // 0x120(0x18)(None)
	class FText                                  Temp_text_Variable_11;                             // 0x138(0x18)(None)
	class FText                                  Temp_text_Variable_12;                             // 0x150(0x18)(None)
	class FText                                  Temp_text_Variable_13;                             // 0x168(0x18)(None)
	class FText                                  Temp_text_Variable_14;                             // 0x180(0x18)(None)
	class FText                                  Temp_text_Variable_15;                             // 0x198(0x18)(None)
	class FText                                  Temp_text_Variable_16;                             // 0x1B0(0x18)(None)
	class FText                                  Temp_text_Variable_17;                             // 0x1C8(0x18)(None)
	class FText                                  Temp_text_Variable_18;                             // 0x1E0(0x18)(None)
	class FText                                  Temp_text_Variable_19;                             // 0x1F8(0x18)(None)
	class FText                                  Temp_text_Variable_20;                             // 0x210(0x18)(None)
	class FText                                  Temp_text_Variable_21;                             // 0x228(0x18)(None)
	class FText                                  Temp_text_Variable_22;                             // 0x240(0x18)(None)
	class FText                                  Temp_text_Variable_23;                             // 0x258(0x18)(None)
	class FText                                  Temp_text_Variable_24;                             // 0x270(0x18)(None)
	class FText                                  Temp_text_Variable_25;                             // 0x288(0x18)(None)
	class FText                                  Temp_text_Variable_26;                             // 0x2A0(0x18)(None)
	class FText                                  Temp_text_Variable_27;                             // 0x2B8(0x18)(None)
	class FText                                  Temp_text_Variable_28;                             // 0x2D0(0x18)(None)
	class FText                                  Temp_text_Variable_29;                             // 0x2E8(0x18)(None)
	class FText                                  Temp_text_Variable_30;                             // 0x300(0x18)(None)
	class FText                                  Temp_text_Variable_31;                             // 0x318(0x18)(None)
	class FText                                  Temp_text_Variable_32;                             // 0x330(0x18)(None)
	class FText                                  Temp_text_Variable_33;                             // 0x348(0x18)(None)
	class FText                                  Temp_text_Variable_34;                             // 0x360(0x18)(None)
	class FText                                  Temp_text_Variable_35;                             // 0x378(0x18)(None)
	class FText                                  Temp_text_Variable_36;                             // 0x390(0x18)(None)
	class FText                                  Temp_text_Variable_37;                             // 0x3A8(0x18)(None)
	class FText                                  Temp_text_Variable_38;                             // 0x3C0(0x18)(None)
	class FText                                  Temp_text_Variable_39;                             // 0x3D8(0x18)(None)
	class FText                                  Temp_text_Variable_40;                             // 0x3F0(0x18)(None)
	class FText                                  Temp_text_Variable_41;                             // 0x408(0x18)(None)
	class FText                                  Temp_text_Variable_42;                             // 0x420(0x18)(None)
	class FText                                  Temp_text_Variable_43;                             // 0x438(0x18)(None)
	class FText                                  Temp_text_Variable_44;                             // 0x450(0x18)(None)
	class FText                                  Temp_text_Variable_45;                             // 0x468(0x18)(None)
	class FText                                  Temp_text_Variable_46;                             // 0x480(0x18)(None)
	class FText                                  Temp_text_Variable_47;                             // 0x498(0x18)(None)
	class FText                                  Temp_text_Variable_48;                             // 0x4B0(0x18)(None)
	class FText                                  Temp_text_Variable_49;                             // 0x4C8(0x18)(None)
	class FText                                  Temp_text_Variable_50;                             // 0x4E0(0x18)(None)
	class FText                                  Temp_text_Variable_51;                             // 0x4F8(0x18)(None)
	class FText                                  Temp_text_Variable_52;                             // 0x510(0x18)(None)
	class FText                                  Temp_text_Variable_53;                             // 0x528(0x18)(None)
	class FText                                  Temp_text_Variable_54;                             // 0x540(0x18)(None)
	class FText                                  Temp_text_Variable_55;                             // 0x558(0x18)(None)
	class FText                                  Temp_text_Variable_56;                             // 0x570(0x18)(None)
	class FText                                  Temp_text_Variable_57;                             // 0x588(0x18)(None)
	class FText                                  Temp_text_Variable_58;                             // 0x5A0(0x18)(None)
	class FText                                  Temp_text_Variable_59;                             // 0x5B8(0x18)(None)
	class FText                                  Temp_text_Variable_60;                             // 0x5D0(0x18)(None)
	class FText                                  Temp_text_Variable_61;                             // 0x5E8(0x18)(None)
	class FText                                  Temp_text_Variable_62;                             // 0x600(0x18)(None)
	class FText                                  Temp_text_Variable_63;                             // 0x618(0x18)(None)
	class FText                                  Temp_text_Variable_64;                             // 0x630(0x18)(None)
	class FText                                  Temp_text_Variable_65;                             // 0x648(0x18)(None)
	class FText                                  Temp_text_Variable_66;                             // 0x660(0x18)(None)
	class FText                                  Temp_text_Variable_67;                             // 0x678(0x18)(None)
	class FText                                  Temp_text_Variable_68;                             // 0x690(0x18)(None)
	class FText                                  Temp_text_Variable_69;                             // 0x6A8(0x18)(None)
	class FText                                  Temp_text_Variable_70;                             // 0x6C0(0x18)(None)
	class FText                                  Temp_text_Variable_71;                             // 0x6D8(0x18)(None)
	class FText                                  Temp_text_Variable_72;                             // 0x6F0(0x18)(None)
	class FText                                  Temp_text_Variable_73;                             // 0x708(0x18)(None)
	class FText                                  Temp_text_Variable_74;                             // 0x720(0x18)(None)
	class FText                                  Temp_text_Variable_75;                             // 0x738(0x18)(None)
	class FText                                  Temp_text_Variable_76;                             // 0x750(0x18)(None)
	class FText                                  Temp_text_Variable_77;                             // 0x768(0x18)(None)
	class FText                                  Temp_text_Variable_78;                             // 0x780(0x18)(None)
	class FText                                  Temp_text_Variable_79;                             // 0x798(0x18)(None)
	class FText                                  Temp_text_Variable_80;                             // 0x7B0(0x18)(None)
	class FText                                  Temp_text_Variable_81;                             // 0x7C8(0x18)(None)
	class FText                                  Temp_text_Variable_82;                             // 0x7E0(0x18)(None)
	class FText                                  Temp_text_Variable_83;                             // 0x7F8(0x18)(None)
	class FText                                  Temp_text_Variable_84;                             // 0x810(0x18)(None)
	class FText                                  Temp_text_Variable_85;                             // 0x828(0x18)(None)
	class FText                                  Temp_text_Variable_86;                             // 0x840(0x18)(None)
	class FText                                  Temp_text_Variable_87;                             // 0x858(0x18)(None)
	class FText                                  Temp_text_Variable_88;                             // 0x870(0x18)(None)
	class FText                                  Temp_text_Variable_89;                             // 0x888(0x18)(None)
	class FText                                  Temp_text_Variable_90;                             // 0x8A0(0x18)(None)
	class FText                                  Temp_text_Variable_91;                             // 0x8B8(0x18)(None)
	class FText                                  Temp_text_Variable_92;                             // 0x8D0(0x18)(None)
	class FText                                  Temp_text_Variable_93;                             // 0x8E8(0x18)(None)
	class FText                                  Temp_text_Variable_94;                             // 0x900(0x18)(None)
	class FText                                  Temp_text_Variable_95;                             // 0x918(0x18)(None)
	class FText                                  Temp_text_Variable_96;                             // 0x930(0x18)(None)
	class FText                                  Temp_text_Variable_97;                             // 0x948(0x18)(None)
	class FText                                  Temp_text_Variable_98;                             // 0x960(0x18)(None)
	class FText                                  Temp_text_Variable_99;                             // 0x978(0x18)(None)
	class FText                                  Temp_text_Variable_100;                            // 0x990(0x18)(None)
	class FText                                  Temp_text_Variable_101;                            // 0x9A8(0x18)(None)
	class FText                                  Temp_text_Variable_102;                            // 0x9C0(0x18)(None)
	class FText                                  Temp_text_Variable_103;                            // 0x9D8(0x18)(None)
	class FText                                  Temp_text_Variable_104;                            // 0x9F0(0x18)(None)
	class FText                                  Temp_text_Variable_105;                            // 0xA08(0x18)(None)
	class FText                                  Temp_text_Variable_106;                            // 0xA20(0x18)(None)
	class FText                                  Temp_text_Variable_107;                            // 0xA38(0x18)(None)
	class FText                                  Temp_text_Variable_108;                            // 0xA50(0x18)(None)
	class FText                                  Temp_text_Variable_109;                            // 0xA68(0x18)(None)
	class FText                                  Temp_text_Variable_110;                            // 0xA80(0x18)(None)
	class FText                                  K2Node_Select_Default;                             // 0xA98(0x18)(None)
};

// 0x290 (0x290 - 0x0)
// Function BPLibrary.BPLibrary_C.CalcLegacyPerksDesc
struct UBPLibrary_C_CalcLegacyPerksDesc_Params
{
public:
	enum class EPerkType                         PerkType;                                          // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_156E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Text;                                              // 0x8(0x18)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               __WorldContext;                                    // 0x20(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  CompiledText;                                      // 0x28(0x18)(Parm, OutParm)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue;              // 0x40(0x18)(None)
	class FText                                  CallFunc_GetStatByEnumLegacy_Text;                 // 0x58(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData;              // 0x70(0x40)(HasGetValueTypeHash)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_1;            // 0xB0(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_2;            // 0xC8(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_1;            // 0xE0(0x40)(HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_2;            // 0x120(0x40)(HasGetValueTypeHash)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_3;            // 0x160(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_4;            // 0x178(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_3;            // 0x190(0x40)(HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_4;            // 0x1D0(0x40)(HasGetValueTypeHash)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_5;            // 0x210(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_5;            // 0x228(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array;                            // 0x268(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue;                       // 0x278(0x18)(None)
};

// 0x29 (0x29 - 0x0)
// Function BPLibrary.BPLibrary_C.GetUINpcColor
struct UBPLibrary_C_GetUINpcColor_Params
{
public:
	class UClass*                                NPC;                                               // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                               __WorldContext;                                    // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        ID;                                                // 0x10(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValidClass_ReturnValue;                 // 0x14(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_15A9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CallFunc_GetClassDisplayName_ReturnValue;          // 0x18(0x10)(ZeroConstructor, HasGetValueTypeHash)
	bool                                         K2Node_SwitchString_CmpSuccess;                    // 0x28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x450 (0x450 - 0x0)
// Function BPLibrary.BPLibrary_C.CalculateEffectsLine
struct UBPLibrary_C_CalculateEffectsLine_Params
{
public:
	struct FDebuffProperties                     DebuffProperty;                                    // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class ACharacter*                            Player;                                            // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                               __WorldContext;                                    // 0x10(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  Text;                                              // 0x18(0x18)(Parm, OutParm)
	float                                        Value__;                                           // 0x30(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Positive_;                                         // 0x34(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         StaticValue_;                                      // 0x35(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_163F[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            Icon;                                              // 0x38(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         InvertPositiveIcon;                                // 0x40(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Possitive_;                                        // 0x41(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1645[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_MakeLiteralText_ReturnValue;              // 0x48(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_1;            // 0x60(0x18)(None)
	bool                                         CallFunc_Less_FloatFloat_ReturnValue;              // 0x78(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_164A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_Divide_FloatFloat_ReturnValue;            // 0x7C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0x80(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_164D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x84(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Greater_FloatFloat_ReturnValue;           // 0x88(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_164F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_Abs_ReturnValue;                          // 0x8C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue_1;                // 0x90(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1652[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x94(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue_2;                // 0x98(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue_3;                // 0x99(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue_4;                // 0x9A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x9B(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x9C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue_5;                // 0x9D(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue_6;                // 0x9E(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue_7;                // 0x9F(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue_8;                // 0xA0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue_9;                // 0xA1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue_10;               // 0xA2(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue_11;               // 0xA3(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue_12;               // 0xA4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue_13;               // 0xA5(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0xA6(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1668[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0xA8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue_14;               // 0xAC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_166E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_Abs_ReturnValue_1;                        // 0xB0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue_15;               // 0xB4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1672[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0xB8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Not_PreBool_ReturnValue_16;               // 0xBC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue_17;               // 0xBD(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue_18;               // 0xBE(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         K2Node_SwitchEnum_CmpSuccess;                      // 0xBF(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_2;            // 0xC0(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_3;            // 0xD8(0x18)(None)
	class FText                                  CallFunc_TextToUpper_ReturnValue;                  // 0xF0(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_4;            // 0x108(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData;              // 0x120(0x40)(HasGetValueTypeHash)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_5;            // 0x160(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_6;            // 0x178(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_7;            // 0x190(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_8;            // 0x1A8(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_9;            // 0x1C0(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_10;           // 0x1D8(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_11;           // 0x1F0(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_12;           // 0x208(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_13;           // 0x220(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_14;           // 0x238(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_15;           // 0x250(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_16;           // 0x268(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_17;           // 0x280(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_18;           // 0x298(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_19;           // 0x2B0(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_20;           // 0x2C8(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_21;           // 0x2E0(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_22;           // 0x2F8(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_1;            // 0x310(0x40)(HasGetValueTypeHash)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_23;           // 0x350(0x18)(None)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array;                            // 0x368(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue;                       // 0x378(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_24;           // 0x390(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_25;           // 0x3A8(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_26;           // 0x3C0(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_27;           // 0x3D8(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_28;           // 0x3F0(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_29;           // 0x408(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_30;           // 0x420(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_31;           // 0x438(0x18)(None)
};

// 0x38 (0x38 - 0x0)
// Function BPLibrary.BPLibrary_C.FloatText
struct UBPLibrary_C_FloatText_Params
{
public:
	bool                                         IsPaused;                                          // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         IsReversed;                                        // 0x1(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_16F4[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Delta;                                             // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        FloatingValue;                                     // 0x8(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LocalValue;                                        // 0xC(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Time;                                              // 0x10(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_16F9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               __WorldContext;                                    // 0x18(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        MoveValue;                                         // 0x20(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Paused;                                            // 0x24(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Reverse;                                           // 0x25(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_16FD[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_FInterpTo_Constant_ReturnValue;           // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x2C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_FInterpTo_Constant_ReturnValue_1;         // 0x30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Less_FloatFloat_ReturnValue;              // 0x34(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Greater_FloatFloat_ReturnValue;           // 0x35(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0x36(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue_1;                // 0x37(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0xB0 (0xB0 - 0x0)
// Function BPLibrary.BPLibrary_C.CalcResists
struct UBPLibrary_C_CalcResists_Params
{
public:
	float                                        Stat;                                              // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1729[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               __WorldContext;                                    // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  Result;                                            // 0x10(0x18)(Parm, OutParm)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x2C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue;             // 0x30(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData;              // 0x48(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array;                            // 0x88(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue;                       // 0x98(0x18)(None)
};

// 0x21B0 (0x21B0 - 0x0)
// Function BPLibrary.BPLibrary_C.CalcStatisticsDesc
struct UBPLibrary_C_CalcStatisticsDesc_Params
{
public:
	class ASHPlayerCharacter*                    Player;                                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EUIStatisticsType                 Type;                                              // 0x8(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_198D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               __WorldContext;                                    // 0x10(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  Result;                                            // 0x18(0x18)(Parm, OutParm)
	bool                                         IsNegative_;                                       // 0x30(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_198E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Temp_float_Variable;                               // 0x34(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class APlayerController*                     CallFunc_GetPlayerController_ReturnValue;          // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_SwitchEnum_CmpSuccess;                      // 0x40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1991[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ASHPlayerState*                        K2Node_DynamicCast_AsSHPlayer_State;               // 0x48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x50(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1993[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ASHPlayerState*                        K2Node_DynamicCast_AsSHPlayer_State_1;             // 0x58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess_1;                     // 0x60(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1994[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Conv_IntToText_ReturnValue;               // 0x68(0x18)(None)
	class FText                                  CallFunc_Conv_IntToText_ReturnValue_1;             // 0x80(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData;              // 0x98(0x40)(HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_1;            // 0xD8(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array;                            // 0x118(0x10)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_1;                          // 0x128(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue;                       // 0x138(0x18)(None)
	class FText                                  CallFunc_Format_ReturnValue_1;                     // 0x150(0x18)(None)
	class ASHPlayerState*                        K2Node_DynamicCast_AsSHPlayer_State_2;             // 0x168(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess_2;                     // 0x170(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_199E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ASHPlayerState*                        K2Node_DynamicCast_AsSHPlayer_State_3;             // 0x178(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess_3;                     // 0x180(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_19A3[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Conv_IntToText_ReturnValue_2;             // 0x188(0x18)(None)
	class FText                                  CallFunc_Conv_IntToText_ReturnValue_3;             // 0x1A0(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_2;            // 0x1B8(0x40)(HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_3;            // 0x1F8(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_2;                          // 0x238(0x10)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_3;                          // 0x248(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_2;                     // 0x258(0x18)(None)
	class FText                                  CallFunc_Format_ReturnValue_3;                     // 0x270(0x18)(None)
	class ASHPlayerState*                        K2Node_DynamicCast_AsSHPlayer_State_4;             // 0x288(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess_4;                     // 0x290(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_19AE[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ASHPlayerState*                        K2Node_DynamicCast_AsSHPlayer_State_5;             // 0x298(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess_5;                     // 0x2A0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_19B1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_GetLongestRealTimeSurvived_ReturnValue;   // 0x2A4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Less_FloatFloat_ReturnValue;              // 0x2A8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_19B4[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_4;            // 0x2B0(0x40)(HasGetValueTypeHash)
	float                                        CallFunc_Divide_FloatFloat_ReturnValue;            // 0x2F0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_19B7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_4;                          // 0x2F8(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue;             // 0x308(0x18)(None)
	class FText                                  CallFunc_Format_ReturnValue_4;                     // 0x320(0x18)(None)
	class ASHPlayerState*                        K2Node_DynamicCast_AsSHPlayer_State_6;             // 0x338(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess_6;                     // 0x340(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_19C0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ASHPlayerState*                        K2Node_DynamicCast_AsSHPlayer_State_7;             // 0x348(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess_7;                     // 0x350(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_19C2[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Conv_IntToText_ReturnValue_4;             // 0x358(0x18)(None)
	bool                                         CallFunc_Less_FloatFloat_ReturnValue_1;            // 0x370(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_19C5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0x374(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_1;           // 0x378(0x18)(None)
	bool                                         CallFunc_IsHotBloodLearned_ReturnValue;            // 0x390(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_19CB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_GetActualLevel_ReturnValue;               // 0x394(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x398(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_19CF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Array_Length_ReturnValue;                 // 0x39C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_GreaterEqual_IntInt_ReturnValue_1;        // 0x3A0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_GreaterEqual_IntInt_ReturnValue_2;        // 0x3A1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_GreaterEqual_IntInt_ReturnValue_3;        // 0x3A2(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_GreaterEqual_IntInt_ReturnValue_4;        // 0x3A3(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_GreaterEqual_IntInt_ReturnValue_5;        // 0x3A4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_19DD[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Array_Length_ReturnValue_1;               // 0x3A8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Array_Length_ReturnValue_2;               // 0x3AC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Array_Length_ReturnValue_3;               // 0x3B0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Array_Length_ReturnValue_4;               // 0x3B4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Array_Length_ReturnValue_5;               // 0x3B8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Array_Length_ReturnValue_6;               // 0x3BC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_GetActualLevel_ReturnValue_1;             // 0x3C0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Array_Length_ReturnValue_7;               // 0x3C4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  CallFunc_Conv_IntToText_ReturnValue_5;             // 0x3C8(0x18)(None)
	TArray<int32>                                CallFunc_GetAllLearnedRecipes_ReturnValue;         // 0x3E0(0x10)(ReferenceParm, HasGetValueTypeHash)
	TArray<class FName>                          CallFunc_GetDataTableRowNames_OutRowNames;         // 0x3F0(0x10)(ReferenceParm, HasGetValueTypeHash)
	int32                                        CallFunc_Array_Length_ReturnValue_8;               // 0x400(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Array_Length_ReturnValue_9;               // 0x404(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_5;            // 0x408(0x40)(HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_6;            // 0x448(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_5;                          // 0x488(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_5;                     // 0x498(0x18)(None)
	int32                                        CallFunc_Array_Length_ReturnValue_10;              // 0x4B0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Array_Length_ReturnValue_11;              // 0x4B4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Array_Length_ReturnValue_12;              // 0x4B8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsLearned_ReturnValue;                    // 0x4BC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Greater_FloatFloat_ReturnValue;           // 0x4BD(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x4BE(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1A00[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_Add_FloatFloat_ReturnValue;               // 0x4C0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1A03[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_2;           // 0x4C8(0x18)(None)
	float                                        CallFunc_Add_FloatFloat_ReturnValue_1;             // 0x4E0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1A07[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_7;            // 0x4E8(0x40)(HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x528(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1A14[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_6;                          // 0x530(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_3;           // 0x540(0x18)(None)
	class FText                                  CallFunc_Format_ReturnValue_6;                     // 0x558(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_8;            // 0x570(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_7;                          // 0x5B0(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_7;                     // 0x5C0(0x18)(None)
	bool                                         CallFunc_IsLearned_ReturnValue_1;                  // 0x5D8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1A43[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_Add_FloatFloat_ReturnValue_2;             // 0x5DC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x5E0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1A4B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_4;           // 0x5E8(0x18)(None)
	bool                                         CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x600(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1A4D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_9;            // 0x608(0x40)(HasGetValueTypeHash)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_5;           // 0x648(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_10;           // 0x660(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_8;                          // 0x6A0(0x10)(ReferenceParm, HasGetValueTypeHash)
	bool                                         CallFunc_Greater_FloatFloat_ReturnValue_3;         // 0x6B0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1A5B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Format_ReturnValue_8;                     // 0x6B8(0x18)(None)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_6;           // 0x6D0(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_11;           // 0x6E8(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_9;                          // 0x728(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_9;                     // 0x738(0x18)(None)
	bool                                         CallFunc_Greater_FloatFloat_ReturnValue_4;         // 0x750(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1A63[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_7;           // 0x758(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_12;           // 0x770(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_10;                         // 0x7B0(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_10;                    // 0x7C0(0x18)(None)
	float                                        CallFunc_Add_FloatFloat_ReturnValue_3;             // 0x7D8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1A6B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_8;           // 0x7E0(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_13;           // 0x7F8(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_11;                         // 0x838(0x10)(ReferenceParm, HasGetValueTypeHash)
	float                                        CallFunc_Add_FloatFloat_ReturnValue_4;             // 0x848(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1A6F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Format_ReturnValue_11;                    // 0x850(0x18)(None)
	float                                        CallFunc_Add_FloatFloat_ReturnValue_5;             // 0x868(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x86C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_9;           // 0x870(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_14;           // 0x888(0x40)(HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue_3;        // 0x8C8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1A7C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_12;                         // 0x8D0(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_10;          // 0x8E0(0x18)(None)
	class FText                                  CallFunc_Format_ReturnValue_12;                    // 0x8F8(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_15;           // 0x910(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_13;                         // 0x950(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_13;                    // 0x960(0x18)(None)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue_4;        // 0x978(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1A88[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_11;          // 0x980(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_16;           // 0x998(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_14;                         // 0x9D8(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_14;                    // 0x9E8(0x18)(None)
	float                                        CallFunc_Add_FloatFloat_ReturnValue_6;             // 0xA00(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Add_FloatFloat_ReturnValue_7;             // 0xA04(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetFistDamageModifier_ReturnValue;        // 0xA08(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue_5;        // 0xA0C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue_6;        // 0xA10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1AB0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_12;          // 0xA18(0x18)(None)
	float                                        CallFunc_Subtract_FloatFloat_ReturnValue;          // 0xA30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1AB4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_17;           // 0xA38(0x40)(HasGetValueTypeHash)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_13;          // 0xA78(0x18)(None)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_15;                         // 0xA90(0x10)(ReferenceParm, HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_18;           // 0xAA0(0x40)(HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_15;                    // 0xAE0(0x18)(None)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_16;                         // 0xAF8(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_16;                    // 0xB08(0x18)(None)
	float                                        CallFunc_GetFistDamageModifier_ReturnValue_1;      // 0xB20(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue_7;        // 0xB24(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_14;          // 0xB28(0x18)(None)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_15;          // 0xB40(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_19;           // 0xB58(0x40)(HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_20;           // 0xB98(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_17;                         // 0xBD8(0x10)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_18;                         // 0xBE8(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_17;                    // 0xBF8(0x18)(None)
	class FText                                  CallFunc_Format_ReturnValue_18;                    // 0xC10(0x18)(None)
	bool                                         CallFunc_Greater_FloatFloat_ReturnValue_5;         // 0xC28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1AD4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue_8;        // 0xC2C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_16;          // 0xC30(0x18)(None)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue_9;        // 0xC48(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1AD6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_21;           // 0xC50(0x40)(HasGetValueTypeHash)
	bool                                         CallFunc_Less_FloatFloat_ReturnValue_2;            // 0xC90(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1AE2[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_19;                         // 0xC98(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_17;          // 0xCA8(0x18)(None)
	class FText                                  CallFunc_Format_ReturnValue_19;                    // 0xCC0(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_22;           // 0xCD8(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_20;                         // 0xD18(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_20;                    // 0xD28(0x18)(None)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue_10;       // 0xD40(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Less_FloatFloat_ReturnValue_3;            // 0xD44(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1AF1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_18;          // 0xD48(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_23;           // 0xD60(0x40)(HasGetValueTypeHash)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_19;          // 0xDA0(0x18)(None)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_21;                         // 0xDB8(0x10)(ReferenceParm, HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_24;           // 0xDC8(0x40)(HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_21;                    // 0xE08(0x18)(None)
	bool                                         CallFunc_Less_FloatFloat_ReturnValue_4;            // 0xE20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Greater_FloatFloat_ReturnValue_6;         // 0xE21(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1AFD[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue_11;       // 0xE24(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue_12;       // 0xE28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1B00[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_20;          // 0xE30(0x18)(None)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_21;          // 0xE48(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_25;           // 0xE60(0x40)(HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_26;           // 0xEA0(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_22;                         // 0xEE0(0x10)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_23;                         // 0xEF0(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_22;                    // 0xF00(0x18)(None)
	class FText                                  CallFunc_Format_ReturnValue_23;                    // 0xF18(0x18)(None)
	float                                        CallFunc_GetMaxValue_ReturnValue;                  // 0xF30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetMaxValue_ReturnValue_1;                // 0xF34(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetDefaultValue_ReturnValue;              // 0xF38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0xF3C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetDefaultValue_ReturnValue_1;            // 0xF40(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue_13;       // 0xF44(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0xF48(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue_14;       // 0xF4C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue_15;       // 0xF50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1B1C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_22;          // 0xF58(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_27;           // 0xF70(0x40)(HasGetValueTypeHash)
	float                                        CallFunc_Divide_FloatFloat_ReturnValue_4;          // 0xFB0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1B28[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_24;                         // 0xFB8(0x10)(ReferenceParm, HasGetValueTypeHash)
	bool                                         CallFunc_Less_FloatFloat_ReturnValue_5;            // 0xFC8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1B2F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Format_ReturnValue_24;                    // 0xFD0(0x18)(None)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_23;          // 0xFE8(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_28;           // 0x1000(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_25;                         // 0x1040(0x10)(ReferenceParm, HasGetValueTypeHash)
	float                                        CallFunc_GetMaxValue_ReturnValue_2;                // 0x1050(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1B3C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Format_ReturnValue_25;                    // 0x1058(0x18)(None)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_24;          // 0x1070(0x18)(None)
	float                                        CallFunc_GetMaxValue_ReturnValue_3;                // 0x1088(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_GetPsyDamageReduction_ReturnValue;        // 0x108C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_25;          // 0x1090(0x18)(None)
	class FText                                  CallFunc_CalcResists_Result;                       // 0x10A8(0x18)(None)
	float                                        CallFunc_GetAnomalyDamageReduction_ReturnValue;    // 0x10C0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1B7D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_CalcResists_Result_1;                     // 0x10C8(0x18)(None)
	class FText                                  CallFunc_CalcResists_Result_2;                     // 0x10E0(0x18)(None)
	float                                        CallFunc_GetTemperatureDamageReduction_ReturnValue; // 0x10F8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Temp_float_Variable_1;                             // 0x10FC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  CallFunc_CalcResistsTemp_Result;                   // 0x1100(0x18)(None)
	bool                                         Temp_bool_Variable;                                // 0x1118(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1B8C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Temp_text_Variable;                                // 0x1120(0x18)(None)
	class FText                                  Temp_text_Variable_1;                              // 0x1138(0x18)(None)
	bool                                         Temp_bool_Variable_1;                              // 0x1150(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1B95[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select_Default;                             // 0x1158(0x18)(None)
	class FText                                  Temp_text_Variable_2;                              // 0x1170(0x18)(None)
	bool                                         Temp_bool_Variable_2;                              // 0x1188(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1B9A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select_Default_1;                           // 0x1190(0x18)(None)
	class FText                                  Temp_text_Variable_3;                              // 0x11A8(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_29;           // 0x11C0(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_26;                         // 0x1200(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  Temp_text_Variable_4;                              // 0x1210(0x18)(None)
	class FText                                  CallFunc_Format_ReturnValue_26;                    // 0x1228(0x18)(None)
	class FText                                  K2Node_Select_Default_2;                           // 0x1240(0x18)(None)
	bool                                         Temp_bool_Variable_3;                              // 0x1258(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1BAE[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Temp_text_Variable_5;                              // 0x1260(0x18)(None)
	int32                                        Temp_int_Loop_Counter_Variable;                    // 0x1278(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1BB9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select_Default_3;                           // 0x1280(0x18)(None)
	bool                                         CallFunc_Less_IntInt_ReturnValue;                  // 0x1298(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1BBE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Add_IntInt_ReturnValue;                   // 0x129C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Array_Index_Variable;                     // 0x12A0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_4;                              // 0x12A4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1BCF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FReputationInfo                       CallFunc_Array_Get_Item;                           // 0x12A8(0x58)(None)
	float                                        K2Node_Select_Default_4;                           // 0x1300(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_GreaterEqual_IntInt_ReturnValue_6;        // 0x1304(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1BD9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_26;          // 0x1308(0x18)(None)
	class FText                                  CallFunc_Conv_IntToText_ReturnValue_6;             // 0x1320(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_30;           // 0x1338(0x40)(HasGetValueTypeHash)
	bool                                         CallFunc_EqualEqual_ClassClass_ReturnValue;        // 0x1378(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1BED[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_27;                         // 0x1380(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_27;                    // 0x1390(0x18)(None)
	int32                                        Temp_int_Array_Index_Variable_1;                   // 0x13A8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1BFB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FStorylineView                        CallFunc_Array_Get_Item_1;                         // 0x13B0(0x58)(None)
	int32                                        Temp_int_Loop_Counter_Variable_1;                  // 0x1408(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x140C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Less_IntInt_ReturnValue_1;                // 0x140D(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1C08[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Add_IntInt_ReturnValue_1;                 // 0x1410(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Conv_IntToFloat_ReturnValue;              // 0x1414(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Conv_IntToFloat_ReturnValue_1;            // 0x1418(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_MapRangeClamped_ReturnValue;              // 0x141C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Array_Index_Variable_2;                   // 0x1420(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_FCeil_ReturnValue;                        // 0x1424(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FReputationInfo                       CallFunc_Array_Get_Item_2;                         // 0x1428(0x58)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_31;           // 0x1480(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_28;                         // 0x14C0(0x10)(ReferenceParm, HasGetValueTypeHash)
	bool                                         CallFunc_GreaterEqual_IntInt_ReturnValue_7;        // 0x14D0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1C24[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Format_ReturnValue_28;                    // 0x14D8(0x18)(None)
	class FText                                  CallFunc_Conv_IntToText_ReturnValue_7;             // 0x14F0(0x18)(None)
	bool                                         CallFunc_EqualEqual_ClassClass_ReturnValue_1;      // 0x1508(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1C29[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Temp_int_Loop_Counter_Variable_2;                  // 0x150C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Loop_Counter_Variable_3;                  // 0x1510(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Less_IntInt_ReturnValue_2;                // 0x1514(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Less_IntInt_ReturnValue_3;                // 0x1515(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1C31[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Add_IntInt_ReturnValue_2;                 // 0x1518(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Add_IntInt_ReturnValue_3;                 // 0x151C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Array_Index_Variable_3;                   // 0x1520(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Temp_float_Variable_2;                             // 0x1524(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStorylineView                        CallFunc_Array_Get_Item_3;                         // 0x1528(0x58)(None)
	bool                                         CallFunc_EqualEqual_ObjectObject_ReturnValue_1;    // 0x1580(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1C3F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_Conv_IntToFloat_ReturnValue_2;            // 0x1584(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Conv_IntToFloat_ReturnValue_3;            // 0x1588(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_MapRangeClamped_ReturnValue_1;            // 0x158C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Array_Index_Variable_4;                   // 0x1590(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_FCeil_ReturnValue_1;                      // 0x1594(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStorylineView                        CallFunc_Array_Get_Item_4;                         // 0x1598(0x58)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_32;           // 0x15F0(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_29;                         // 0x1630(0x10)(ReferenceParm, HasGetValueTypeHash)
	bool                                         CallFunc_EqualEqual_ObjectObject_ReturnValue_2;    // 0x1640(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1C53[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Format_ReturnValue_29;                    // 0x1648(0x18)(None)
	float                                        CallFunc_Conv_IntToFloat_ReturnValue_4;            // 0x1660(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Conv_IntToFloat_ReturnValue_5;            // 0x1664(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_MapRangeClamped_ReturnValue_2;            // 0x1668(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Temp_float_Variable_3;                             // 0x166C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_FCeil_ReturnValue_2;                      // 0x1670(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1C60[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_33;           // 0x1678(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_30;                         // 0x16B8(0x10)(ReferenceParm, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_5;                              // 0x16C8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1C7C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Format_ReturnValue_30;                    // 0x16D0(0x18)(None)
	float                                        K2Node_Select_Default_5;                           // 0x16E8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1C83[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Temp_text_Variable_6;                              // 0x16F0(0x18)(None)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue_27;          // 0x1708(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_34;           // 0x1720(0x40)(HasGetValueTypeHash)
	class FText                                  Temp_text_Variable_7;                              // 0x1760(0x18)(None)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_31;                         // 0x1778(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_31;                    // 0x1788(0x18)(None)
	class FText                                  Temp_text_Variable_8;                              // 0x17A0(0x18)(None)
	int32                                        Temp_int_Loop_Counter_Variable_4;                  // 0x17B8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_6;                              // 0x17BC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Less_IntInt_ReturnValue_4;                // 0x17BD(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1CA2[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select_Default_6;                           // 0x17C0(0x18)(None)
	int32                                        CallFunc_Add_IntInt_ReturnValue_4;                 // 0x17D8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1CA8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_MakeLiteralText_ReturnValue;              // 0x17E0(0x18)(None)
	bool                                         Temp_bool_Variable_7;                              // 0x17F8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1D09[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_35;           // 0x1800(0x40)(HasGetValueTypeHash)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_1;            // 0x1840(0x18)(None)
	class FText                                  K2Node_Select_Default_7;                           // 0x1858(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_36;           // 0x1870(0x40)(HasGetValueTypeHash)
	class FText                                  Temp_text_Variable_9;                              // 0x18B0(0x18)(None)
	int32                                        Temp_int_Array_Index_Variable_5;                   // 0x18C8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1D18[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FStorylineView                        CallFunc_Array_Get_Item_5;                         // 0x18D0(0x58)(None)
	class FText                                  Temp_text_Variable_10;                             // 0x1928(0x18)(None)
	bool                                         CallFunc_EqualEqual_ObjectObject_ReturnValue_3;    // 0x1940(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1D20[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Subtract_IntInt_ReturnValue;              // 0x1944(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Conv_IntToFloat_ReturnValue_6;            // 0x1948(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Conv_IntToFloat_ReturnValue_7;            // 0x194C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_8;                              // 0x1950(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1D29[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_MapRangeClamped_ReturnValue_3;            // 0x1954(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_FCeil_ReturnValue_3;                      // 0x1958(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1D2D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select_Default_8;                           // 0x1960(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_37;           // 0x1978(0x40)(HasGetValueTypeHash)
	class FText                                  Temp_text_Variable_11;                             // 0x19B8(0x18)(None)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_32;                         // 0x19D0(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_32;                    // 0x19E0(0x18)(None)
	bool                                         Temp_bool_Variable_9;                              // 0x19F8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Temp_bool_Variable_10;                             // 0x19F9(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1D3B[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select_Default_9;                           // 0x1A00(0x18)(None)
	class FText                                  K2Node_Select_Default_10;                          // 0x1A18(0x18)(None)
	int32                                        Temp_int_Array_Index_Variable_6;                   // 0x1A30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1D3E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Temp_text_Variable_12;                             // 0x1A38(0x18)(None)
	struct FStorylineView                        CallFunc_Array_Get_Item_6;                         // 0x1A50(0x58)(None)
	bool                                         CallFunc_EqualEqual_ObjectObject_ReturnValue_4;    // 0x1AA8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1D43[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_Conv_IntToFloat_ReturnValue_8;            // 0x1AAC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Conv_IntToFloat_ReturnValue_9;            // 0x1AB0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_MapRangeClamped_ReturnValue_4;            // 0x1AB4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable_11;                             // 0x1AB8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1D4C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_FCeil_ReturnValue_4;                      // 0x1ABC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_38;           // 0x1AC0(0x40)(HasGetValueTypeHash)
	class FText                                  K2Node_Select_Default_11;                          // 0x1B00(0x18)(None)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_33;                         // 0x1B18(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_2;            // 0x1B28(0x18)(None)
	class FText                                  CallFunc_Format_ReturnValue_33;                    // 0x1B40(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_39;           // 0x1B58(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_34;                         // 0x1B98(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  Temp_text_Variable_13;                             // 0x1BA8(0x18)(None)
	class FText                                  CallFunc_Format_ReturnValue_34;                    // 0x1BC0(0x18)(None)
	class FText                                  Temp_text_Variable_14;                             // 0x1BD8(0x18)(None)
	bool                                         Temp_bool_Variable_12;                             // 0x1BF0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Temp_bool_Variable_13;                             // 0x1BF1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1D64[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select_Default_12;                          // 0x1BF8(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_40;           // 0x1C10(0x40)(HasGetValueTypeHash)
	class FText                                  K2Node_Select_Default_13;                          // 0x1C50(0x18)(None)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_35;                         // 0x1C68(0x10)(ReferenceParm, HasGetValueTypeHash)
	int32                                        Temp_int_Loop_Counter_Variable_5;                  // 0x1C78(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1D73[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Format_ReturnValue_35;                    // 0x1C80(0x18)(None)
	bool                                         CallFunc_Less_IntInt_ReturnValue_5;                // 0x1C98(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1D7B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Add_IntInt_ReturnValue_5;                 // 0x1C9C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  Temp_text_Variable_15;                             // 0x1CA0(0x18)(None)
	bool                                         Temp_bool_Variable_14;                             // 0x1CB8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1D85[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Temp_text_Variable_16;                             // 0x1CC0(0x18)(None)
	class FText                                  K2Node_Select_Default_14;                          // 0x1CD8(0x18)(None)
	bool                                         Temp_bool_Variable_15;                             // 0x1CF0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1D8C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Temp_text_Variable_17;                             // 0x1CF8(0x18)(None)
	class FText                                  K2Node_Select_Default_15;                          // 0x1D10(0x18)(None)
	bool                                         Temp_bool_Variable_16;                             // 0x1D28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1D94[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_41;           // 0x1D30(0x40)(HasGetValueTypeHash)
	int32                                        Temp_int_Loop_Counter_Variable_6;                  // 0x1D70(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1D99[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_36;                         // 0x1D78(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_36;                    // 0x1D88(0x18)(None)
	bool                                         CallFunc_Less_IntInt_ReturnValue_6;                // 0x1DA0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1DA0[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Add_IntInt_ReturnValue_6;                 // 0x1DA4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Array_Index_Variable_7;                   // 0x1DA8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1DA7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_3;            // 0x1DB0(0x18)(None)
	struct FStorylineView                        CallFunc_Array_Get_Item_7;                         // 0x1DC8(0x58)(None)
	class FText                                  CallFunc_TextToUpper_ReturnValue;                  // 0x1E20(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_42;           // 0x1E38(0x40)(HasGetValueTypeHash)
	bool                                         CallFunc_EqualEqual_ObjectObject_ReturnValue_5;    // 0x1E78(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1DB0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_37;                         // 0x1E80(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_37;                    // 0x1E90(0x18)(None)
	float                                        CallFunc_Conv_IntToFloat_ReturnValue_10;           // 0x1EA8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Conv_IntToFloat_ReturnValue_11;           // 0x1EAC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_MapRangeClamped_ReturnValue_5;            // 0x1EB0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_FCeil_ReturnValue_5;                      // 0x1EB4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Loop_Counter_Variable_7;                  // 0x1EB8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1DB9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_43;           // 0x1EC0(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_38;                         // 0x1F00(0x10)(ReferenceParm, HasGetValueTypeHash)
	bool                                         CallFunc_Less_IntInt_ReturnValue_7;                // 0x1F10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1DBD[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Format_ReturnValue_38;                    // 0x1F18(0x18)(None)
	int32                                        CallFunc_Add_IntInt_ReturnValue_7;                 // 0x1F30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Array_Index_Variable_8;                   // 0x1F34(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Array_Index_Variable_9;                   // 0x1F38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1DC5[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FStorylineView                        CallFunc_Array_Get_Item_8;                         // 0x1F40(0x58)(None)
	struct FReputationInfo                       CallFunc_Array_Get_Item_9;                         // 0x1F98(0x58)(None)
	bool                                         CallFunc_EqualEqual_ObjectObject_ReturnValue_6;    // 0x1FF0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_GreaterEqual_IntInt_ReturnValue_8;        // 0x1FF1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1DCB[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Conv_IntToText_ReturnValue_8;             // 0x1FF8(0x18)(None)
	bool                                         CallFunc_EqualEqual_ClassClass_ReturnValue_2;      // 0x2010(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1DCE[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select_Default_16;                          // 0x2018(0x18)(None)
	float                                        CallFunc_Conv_IntToFloat_ReturnValue_12;           // 0x2030(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Conv_IntToFloat_ReturnValue_13;           // 0x2034(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_MapRangeClamped_ReturnValue_6;            // 0x2038(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_FCeil_ReturnValue_6;                      // 0x203C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_44;           // 0x2040(0x40)(HasGetValueTypeHash)
	int32                                        Temp_int_Loop_Counter_Variable_8;                  // 0x2080(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1DDD[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_39;                         // 0x2088(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_39;                    // 0x2098(0x18)(None)
	bool                                         CallFunc_Less_IntInt_ReturnValue_8;                // 0x20B0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1DE2[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Add_IntInt_ReturnValue_8;                 // 0x20B4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Array_Index_Variable_10;                  // 0x20B8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1DE5[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FStorylineView                        CallFunc_Array_Get_Item_10;                        // 0x20C0(0x58)(None)
	int32                                        Temp_int_Loop_Counter_Variable_9;                  // 0x2118(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_EqualEqual_ObjectObject_ReturnValue_7;    // 0x211C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Less_IntInt_ReturnValue_9;                // 0x211D(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1DEF[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Add_IntInt_ReturnValue_9;                 // 0x2120(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Conv_IntToFloat_ReturnValue_14;           // 0x2124(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Conv_IntToFloat_ReturnValue_15;           // 0x2128(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Loop_Counter_Variable_10;                 // 0x212C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_MapRangeClamped_ReturnValue_7;            // 0x2130(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_FCeil_ReturnValue_7;                      // 0x2134(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Less_IntInt_ReturnValue_10;               // 0x2138(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1E04[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_45;           // 0x2140(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_40;                         // 0x2180(0x10)(ReferenceParm, HasGetValueTypeHash)
	int32                                        CallFunc_Add_IntInt_ReturnValue_10;                // 0x2190(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1E0F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Format_ReturnValue_40;                    // 0x2198(0x18)(None)
};

// 0x990 (0x990 - 0x0)
// Function BPLibrary.BPLibrary_C.GetStatByEnum
struct UBPLibrary_C_GetStatByEnum_Params
{
public:
	enum class ESkillType                        Index;                                             // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2069[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               __WorldContext;                                    // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  Text;                                              // 0x10(0x18)(Parm, OutParm)
	enum class ESkillType                        Temp_byte_Variable;                                // 0x28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_206D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Temp_text_Variable;                                // 0x30(0x18)(None)
	class FText                                  Temp_text_Variable_1;                              // 0x48(0x18)(None)
	class FText                                  Temp_text_Variable_2;                              // 0x60(0x18)(None)
	class FText                                  Temp_text_Variable_3;                              // 0x78(0x18)(None)
	class FText                                  Temp_text_Variable_4;                              // 0x90(0x18)(None)
	class FText                                  Temp_text_Variable_5;                              // 0xA8(0x18)(None)
	class FText                                  Temp_text_Variable_6;                              // 0xC0(0x18)(None)
	class FText                                  Temp_text_Variable_7;                              // 0xD8(0x18)(None)
	class FText                                  Temp_text_Variable_8;                              // 0xF0(0x18)(None)
	class FText                                  Temp_text_Variable_9;                              // 0x108(0x18)(None)
	class FText                                  Temp_text_Variable_10;                             // 0x120(0x18)(None)
	class FText                                  Temp_text_Variable_11;                             // 0x138(0x18)(None)
	class FText                                  Temp_text_Variable_12;                             // 0x150(0x18)(None)
	class FText                                  Temp_text_Variable_13;                             // 0x168(0x18)(None)
	class FText                                  Temp_text_Variable_14;                             // 0x180(0x18)(None)
	class FText                                  Temp_text_Variable_15;                             // 0x198(0x18)(None)
	class FText                                  Temp_text_Variable_16;                             // 0x1B0(0x18)(None)
	class FText                                  Temp_text_Variable_17;                             // 0x1C8(0x18)(None)
	class FText                                  Temp_text_Variable_18;                             // 0x1E0(0x18)(None)
	class FText                                  Temp_text_Variable_19;                             // 0x1F8(0x18)(None)
	class FText                                  Temp_text_Variable_20;                             // 0x210(0x18)(None)
	class FText                                  Temp_text_Variable_21;                             // 0x228(0x18)(None)
	class FText                                  Temp_text_Variable_22;                             // 0x240(0x18)(None)
	class FText                                  Temp_text_Variable_23;                             // 0x258(0x18)(None)
	class FText                                  Temp_text_Variable_24;                             // 0x270(0x18)(None)
	class FText                                  Temp_text_Variable_25;                             // 0x288(0x18)(None)
	class FText                                  Temp_text_Variable_26;                             // 0x2A0(0x18)(None)
	class FText                                  Temp_text_Variable_27;                             // 0x2B8(0x18)(None)
	class FText                                  Temp_text_Variable_28;                             // 0x2D0(0x18)(None)
	class FText                                  Temp_text_Variable_29;                             // 0x2E8(0x18)(None)
	class FText                                  Temp_text_Variable_30;                             // 0x300(0x18)(None)
	class FText                                  Temp_text_Variable_31;                             // 0x318(0x18)(None)
	class FText                                  Temp_text_Variable_32;                             // 0x330(0x18)(None)
	class FText                                  Temp_text_Variable_33;                             // 0x348(0x18)(None)
	class FText                                  Temp_text_Variable_34;                             // 0x360(0x18)(None)
	class FText                                  Temp_text_Variable_35;                             // 0x378(0x18)(None)
	class FText                                  Temp_text_Variable_36;                             // 0x390(0x18)(None)
	class FText                                  Temp_text_Variable_37;                             // 0x3A8(0x18)(None)
	class FText                                  Temp_text_Variable_38;                             // 0x3C0(0x18)(None)
	class FText                                  Temp_text_Variable_39;                             // 0x3D8(0x18)(None)
	class FText                                  Temp_text_Variable_40;                             // 0x3F0(0x18)(None)
	class FText                                  Temp_text_Variable_41;                             // 0x408(0x18)(None)
	class FText                                  Temp_text_Variable_42;                             // 0x420(0x18)(None)
	class FText                                  Temp_text_Variable_43;                             // 0x438(0x18)(None)
	class FText                                  Temp_text_Variable_44;                             // 0x450(0x18)(None)
	class FText                                  Temp_text_Variable_45;                             // 0x468(0x18)(None)
	class FText                                  Temp_text_Variable_46;                             // 0x480(0x18)(None)
	class FText                                  Temp_text_Variable_47;                             // 0x498(0x18)(None)
	class FText                                  Temp_text_Variable_48;                             // 0x4B0(0x18)(None)
	class FText                                  Temp_text_Variable_49;                             // 0x4C8(0x18)(None)
	class FText                                  Temp_text_Variable_50;                             // 0x4E0(0x18)(None)
	class FText                                  Temp_text_Variable_51;                             // 0x4F8(0x18)(None)
	class FText                                  Temp_text_Variable_52;                             // 0x510(0x18)(None)
	class FText                                  Temp_text_Variable_53;                             // 0x528(0x18)(None)
	class FText                                  Temp_text_Variable_54;                             // 0x540(0x18)(None)
	class FText                                  Temp_text_Variable_55;                             // 0x558(0x18)(None)
	class FText                                  Temp_text_Variable_56;                             // 0x570(0x18)(None)
	class FText                                  Temp_text_Variable_57;                             // 0x588(0x18)(None)
	class FText                                  Temp_text_Variable_58;                             // 0x5A0(0x18)(None)
	class FText                                  Temp_text_Variable_59;                             // 0x5B8(0x18)(None)
	class FText                                  Temp_text_Variable_60;                             // 0x5D0(0x18)(None)
	class FText                                  Temp_text_Variable_61;                             // 0x5E8(0x18)(None)
	class FText                                  Temp_text_Variable_62;                             // 0x600(0x18)(None)
	class FText                                  Temp_text_Variable_63;                             // 0x618(0x18)(None)
	class FText                                  Temp_text_Variable_64;                             // 0x630(0x18)(None)
	class FText                                  Temp_text_Variable_65;                             // 0x648(0x18)(None)
	class FText                                  Temp_text_Variable_66;                             // 0x660(0x18)(None)
	class FText                                  Temp_text_Variable_67;                             // 0x678(0x18)(None)
	class FText                                  Temp_text_Variable_68;                             // 0x690(0x18)(None)
	class FText                                  Temp_text_Variable_69;                             // 0x6A8(0x18)(None)
	class FText                                  Temp_text_Variable_70;                             // 0x6C0(0x18)(None)
	class FText                                  Temp_text_Variable_71;                             // 0x6D8(0x18)(None)
	class FText                                  Temp_text_Variable_72;                             // 0x6F0(0x18)(None)
	class FText                                  Temp_text_Variable_73;                             // 0x708(0x18)(None)
	class FText                                  Temp_text_Variable_74;                             // 0x720(0x18)(None)
	class FText                                  Temp_text_Variable_75;                             // 0x738(0x18)(None)
	class FText                                  Temp_text_Variable_76;                             // 0x750(0x18)(None)
	class FText                                  Temp_text_Variable_77;                             // 0x768(0x18)(None)
	class FText                                  Temp_text_Variable_78;                             // 0x780(0x18)(None)
	class FText                                  Temp_text_Variable_79;                             // 0x798(0x18)(None)
	class FText                                  Temp_text_Variable_80;                             // 0x7B0(0x18)(None)
	class FText                                  Temp_text_Variable_81;                             // 0x7C8(0x18)(None)
	class FText                                  Temp_text_Variable_82;                             // 0x7E0(0x18)(None)
	class FText                                  Temp_text_Variable_83;                             // 0x7F8(0x18)(None)
	class FText                                  Temp_text_Variable_84;                             // 0x810(0x18)(None)
	class FText                                  Temp_text_Variable_85;                             // 0x828(0x18)(None)
	class FText                                  Temp_text_Variable_86;                             // 0x840(0x18)(None)
	class FText                                  Temp_text_Variable_87;                             // 0x858(0x18)(None)
	class FText                                  Temp_text_Variable_88;                             // 0x870(0x18)(None)
	class FText                                  Temp_text_Variable_89;                             // 0x888(0x18)(None)
	class FText                                  Temp_text_Variable_90;                             // 0x8A0(0x18)(None)
	class FText                                  Temp_text_Variable_91;                             // 0x8B8(0x18)(None)
	class FText                                  Temp_text_Variable_92;                             // 0x8D0(0x18)(None)
	class FText                                  Temp_text_Variable_93;                             // 0x8E8(0x18)(None)
	class FText                                  Temp_text_Variable_94;                             // 0x900(0x18)(None)
	class FText                                  Temp_text_Variable_95;                             // 0x918(0x18)(None)
	class FText                                  Temp_text_Variable_96;                             // 0x930(0x18)(None)
	class FText                                  Temp_text_Variable_97;                             // 0x948(0x18)(None)
	class FText                                  Temp_text_Variable_98;                             // 0x960(0x18)(None)
	class FText                                  K2Node_Select_Default;                             // 0x978(0x18)(None)
};

// 0xBE8 (0xBE8 - 0x0)
// Function BPLibrary.BPLibrary_C.CalculatePerkDescription
struct UBPLibrary_C_CalculatePerkDescription_Params
{
public:
	enum class ESkillType                        CurrentPerk;                                       // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ESkillType                        NextPerk;                                          // 0x1(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_210F[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               __WorldContext;                                    // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  CurrentRankText;                                   // 0x10(0x18)(Parm, OutParm)
	class FText                                  NextRankText;                                      // 0x28(0x18)(Parm, OutParm)
	enum class ESkillType                        Temp_byte_Variable;                                // 0x40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2114[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_GetStatByEnum_Text;                       // 0x48(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue;              // 0x60(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_1;            // 0x78(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData;              // 0x90(0x40)(HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_1;            // 0xD0(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array;                            // 0x110(0x10)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_1;                          // 0x120(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_GetStatByEnum_Text_1;                     // 0x130(0x18)(None)
	bool                                         CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x148(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_211D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_2;            // 0x150(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_2;            // 0x168(0x40)(HasGetValueTypeHash)
	bool                                         CallFunc_NotEqual_ByteByte_ReturnValue_1;          // 0x1A8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2121[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_2;                          // 0x1B0(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  Temp_text_Variable;                                // 0x1C0(0x18)(None)
	class FText                                  Temp_text_Variable_1;                              // 0x1D8(0x18)(None)
	class FText                                  Temp_text_Variable_2;                              // 0x1F0(0x18)(None)
	class FText                                  Temp_text_Variable_3;                              // 0x208(0x18)(None)
	class FText                                  Temp_text_Variable_4;                              // 0x220(0x18)(None)
	class FText                                  Temp_text_Variable_5;                              // 0x238(0x18)(None)
	class FText                                  Temp_text_Variable_6;                              // 0x250(0x18)(None)
	class FText                                  Temp_text_Variable_7;                              // 0x268(0x18)(None)
	class FText                                  Temp_text_Variable_8;                              // 0x280(0x18)(None)
	class FText                                  Temp_text_Variable_9;                              // 0x298(0x18)(None)
	class FText                                  Temp_text_Variable_10;                             // 0x2B0(0x18)(None)
	class FText                                  Temp_text_Variable_11;                             // 0x2C8(0x18)(None)
	class FText                                  Temp_text_Variable_12;                             // 0x2E0(0x18)(None)
	class FText                                  Temp_text_Variable_13;                             // 0x2F8(0x18)(None)
	class FText                                  Temp_text_Variable_14;                             // 0x310(0x18)(None)
	class FText                                  Temp_text_Variable_15;                             // 0x328(0x18)(None)
	class FText                                  Temp_text_Variable_16;                             // 0x340(0x18)(None)
	class FText                                  Temp_text_Variable_17;                             // 0x358(0x18)(None)
	class FText                                  Temp_text_Variable_18;                             // 0x370(0x18)(None)
	class FText                                  Temp_text_Variable_19;                             // 0x388(0x18)(None)
	class FText                                  Temp_text_Variable_20;                             // 0x3A0(0x18)(None)
	class FText                                  Temp_text_Variable_21;                             // 0x3B8(0x18)(None)
	class FText                                  Temp_text_Variable_22;                             // 0x3D0(0x18)(None)
	class FText                                  Temp_text_Variable_23;                             // 0x3E8(0x18)(None)
	class FText                                  Temp_text_Variable_24;                             // 0x400(0x18)(None)
	class FText                                  Temp_text_Variable_25;                             // 0x418(0x18)(None)
	class FText                                  Temp_text_Variable_26;                             // 0x430(0x18)(None)
	class FText                                  Temp_text_Variable_27;                             // 0x448(0x18)(None)
	class FText                                  Temp_text_Variable_28;                             // 0x460(0x18)(None)
	class FText                                  Temp_text_Variable_29;                             // 0x478(0x18)(None)
	class FText                                  Temp_text_Variable_30;                             // 0x490(0x18)(None)
	class FText                                  Temp_text_Variable_31;                             // 0x4A8(0x18)(None)
	class FText                                  Temp_text_Variable_32;                             // 0x4C0(0x18)(None)
	class FText                                  Temp_text_Variable_33;                             // 0x4D8(0x18)(None)
	class FText                                  Temp_text_Variable_34;                             // 0x4F0(0x18)(None)
	class FText                                  Temp_text_Variable_35;                             // 0x508(0x18)(None)
	class FText                                  Temp_text_Variable_36;                             // 0x520(0x18)(None)
	class FText                                  Temp_text_Variable_37;                             // 0x538(0x18)(None)
	class FText                                  Temp_text_Variable_38;                             // 0x550(0x18)(None)
	class FText                                  Temp_text_Variable_39;                             // 0x568(0x18)(None)
	class FText                                  Temp_text_Variable_40;                             // 0x580(0x18)(None)
	class FText                                  Temp_text_Variable_41;                             // 0x598(0x18)(None)
	class FText                                  Temp_text_Variable_42;                             // 0x5B0(0x18)(None)
	class FText                                  Temp_text_Variable_43;                             // 0x5C8(0x18)(None)
	class FText                                  Temp_text_Variable_44;                             // 0x5E0(0x18)(None)
	class FText                                  Temp_text_Variable_45;                             // 0x5F8(0x18)(None)
	class FText                                  Temp_text_Variable_46;                             // 0x610(0x18)(None)
	class FText                                  Temp_text_Variable_47;                             // 0x628(0x18)(None)
	class FText                                  Temp_text_Variable_48;                             // 0x640(0x18)(None)
	class FText                                  Temp_text_Variable_49;                             // 0x658(0x18)(None)
	class FText                                  Temp_text_Variable_50;                             // 0x670(0x18)(None)
	class FText                                  Temp_text_Variable_51;                             // 0x688(0x18)(None)
	class FText                                  Temp_text_Variable_52;                             // 0x6A0(0x18)(None)
	class FText                                  Temp_text_Variable_53;                             // 0x6B8(0x18)(None)
	class FText                                  Temp_text_Variable_54;                             // 0x6D0(0x18)(None)
	class FText                                  Temp_text_Variable_55;                             // 0x6E8(0x18)(None)
	class FText                                  Temp_text_Variable_56;                             // 0x700(0x18)(None)
	class FText                                  Temp_text_Variable_57;                             // 0x718(0x18)(None)
	class FText                                  Temp_text_Variable_58;                             // 0x730(0x18)(None)
	class FText                                  Temp_text_Variable_59;                             // 0x748(0x18)(None)
	class FText                                  Temp_text_Variable_60;                             // 0x760(0x18)(None)
	class FText                                  Temp_text_Variable_61;                             // 0x778(0x18)(None)
	class FText                                  Temp_text_Variable_62;                             // 0x790(0x18)(None)
	class FText                                  Temp_text_Variable_63;                             // 0x7A8(0x18)(None)
	class FText                                  Temp_text_Variable_64;                             // 0x7C0(0x18)(None)
	class FText                                  Temp_text_Variable_65;                             // 0x7D8(0x18)(None)
	class FText                                  Temp_text_Variable_66;                             // 0x7F0(0x18)(None)
	class FText                                  Temp_text_Variable_67;                             // 0x808(0x18)(None)
	class FText                                  Temp_text_Variable_68;                             // 0x820(0x18)(None)
	class FText                                  Temp_text_Variable_69;                             // 0x838(0x18)(None)
	class FText                                  Temp_text_Variable_70;                             // 0x850(0x18)(None)
	class FText                                  Temp_text_Variable_71;                             // 0x868(0x18)(None)
	class FText                                  Temp_text_Variable_72;                             // 0x880(0x18)(None)
	class FText                                  Temp_text_Variable_73;                             // 0x898(0x18)(None)
	class FText                                  Temp_text_Variable_74;                             // 0x8B0(0x18)(None)
	class FText                                  Temp_text_Variable_75;                             // 0x8C8(0x18)(None)
	class FText                                  Temp_text_Variable_76;                             // 0x8E0(0x18)(None)
	class FText                                  Temp_text_Variable_77;                             // 0x8F8(0x18)(None)
	class FText                                  Temp_text_Variable_78;                             // 0x910(0x18)(None)
	class FText                                  Temp_text_Variable_79;                             // 0x928(0x18)(None)
	class FText                                  Temp_text_Variable_80;                             // 0x940(0x18)(None)
	class FText                                  Temp_text_Variable_81;                             // 0x958(0x18)(None)
	class FText                                  Temp_text_Variable_82;                             // 0x970(0x18)(None)
	class FText                                  Temp_text_Variable_83;                             // 0x988(0x18)(None)
	class FText                                  Temp_text_Variable_84;                             // 0x9A0(0x18)(None)
	class FText                                  Temp_text_Variable_85;                             // 0x9B8(0x18)(None)
	class FText                                  Temp_text_Variable_86;                             // 0x9D0(0x18)(None)
	class FText                                  Temp_text_Variable_87;                             // 0x9E8(0x18)(None)
	class FText                                  Temp_text_Variable_88;                             // 0xA00(0x18)(None)
	class FText                                  Temp_text_Variable_89;                             // 0xA18(0x18)(None)
	class FText                                  Temp_text_Variable_90;                             // 0xA30(0x18)(None)
	class FText                                  Temp_text_Variable_91;                             // 0xA48(0x18)(None)
	class FText                                  Temp_text_Variable_92;                             // 0xA60(0x18)(None)
	class FText                                  Temp_text_Variable_93;                             // 0xA78(0x18)(None)
	class FText                                  Temp_text_Variable_94;                             // 0xA90(0x18)(None)
	class FText                                  Temp_text_Variable_95;                             // 0xAA8(0x18)(None)
	class FText                                  Temp_text_Variable_96;                             // 0xAC0(0x18)(None)
	class FText                                  Temp_text_Variable_97;                             // 0xAD8(0x18)(None)
	class FText                                  Temp_text_Variable_98;                             // 0xAF0(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_3;            // 0xB08(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_3;            // 0xB20(0x40)(HasGetValueTypeHash)
	class FText                                  K2Node_Select_Default;                             // 0xB60(0x18)(None)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_3;                          // 0xB78(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue;                       // 0xB88(0x18)(None)
	class FText                                  CallFunc_Format_ReturnValue_1;                     // 0xBA0(0x18)(None)
	class FText                                  CallFunc_Format_ReturnValue_2;                     // 0xBB8(0x18)(None)
	class FText                                  CallFunc_Format_ReturnValue_3;                     // 0xBD0(0x18)(None)
};

// 0x640 (0x640 - 0x0)
// Function BPLibrary.BPLibrary_C.CalculateMonstrumPerk
struct UBPLibrary_C_CalculateMonstrumPerk_Params
{
public:
	struct FMonstrumPerksDataTable               MonstrumPerk;                                      // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, Parm)
	class UObject*                               __WorldContext;                                    // 0x18(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  Description;                                       // 0x20(0x18)(Parm, OutParm)
	int32                                        PerkLevel;                                         // 0x38(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_21A8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_MakeLiteralText_ReturnValue;              // 0x40(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData;              // 0x58(0x40)(HasGetValueTypeHash)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x98(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_21A9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array;                            // 0xA0(0x10)(ReferenceParm, HasGetValueTypeHash)
	float                                        CallFunc_Subtract_FloatFloat_ReturnValue;          // 0xB0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_21AA[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Format_ReturnValue;                       // 0xB8(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_1;            // 0xD0(0x40)(HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_2;            // 0x110(0x40)(HasGetValueTypeHash)
	bool                                         K2Node_SwitchEnum_CmpSuccess;                      // 0x150(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_21AB[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_1;            // 0x158(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_2;            // 0x170(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_3;            // 0x188(0x40)(HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_4;            // 0x1C8(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_1;                          // 0x208(0x10)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_2;                          // 0x218(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_1;                     // 0x228(0x18)(None)
	class FText                                  CallFunc_Format_ReturnValue_2;                     // 0x240(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_3;            // 0x258(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_4;            // 0x270(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_5;            // 0x288(0x40)(HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_6;            // 0x2C8(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_3;                          // 0x308(0x10)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_4;                          // 0x318(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_3;                     // 0x328(0x18)(None)
	class FText                                  CallFunc_Format_ReturnValue_4;                     // 0x340(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_5;            // 0x358(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_6;            // 0x370(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_7;            // 0x388(0x40)(HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_8;            // 0x3C8(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_5;                          // 0x408(0x10)(ReferenceParm, HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_6;                          // 0x418(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_5;                     // 0x428(0x18)(None)
	class FText                                  CallFunc_Format_ReturnValue_6;                     // 0x440(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_9;            // 0x458(0x40)(HasGetValueTypeHash)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_7;            // 0x498(0x18)(None)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_7;                          // 0x4B0(0x10)(ReferenceParm, HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_10;           // 0x4C0(0x40)(HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_7;                     // 0x500(0x18)(None)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_8;                          // 0x518(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_8;                     // 0x528(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_8;            // 0x540(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_11;           // 0x558(0x40)(HasGetValueTypeHash)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_9;            // 0x598(0x18)(None)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_9;                          // 0x5B0(0x10)(ReferenceParm, HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_12;           // 0x5C0(0x40)(HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_9;                     // 0x600(0x18)(None)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_10;                         // 0x618(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_10;                    // 0x628(0x18)(None)
};

// 0x5A0 (0x5A0 - 0x0)
// Function BPLibrary.BPLibrary_C.CalculateDebuffProperty
struct UBPLibrary_C_CalculateDebuffProperty_Params
{
public:
	struct FDebuffProperties                     DebuffProperty;                                    // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	class ACharacter*                            Player;                                            // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                               __WorldContext;                                    // 0x10(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                  Description;                                       // 0x18(0x18)(Parm, OutParm)
	float                                        Value__;                                           // 0x30(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Positive_;                                         // 0x34(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         StaticValue_;                                      // 0x35(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_21E9[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Symbol;                                            // 0x38(0x18)(Parm, OutParm)
	int32                                        ArmorType;                                         // 0x50(0x4)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Possitive_;                                        // 0x54(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_21EC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_MakeLiteralText_ReturnValue;              // 0x58(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData;              // 0x70(0x40)(HasGetValueTypeHash)
	float                                        CallFunc_Divide_FloatFloat_ReturnValue;            // 0xB0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Divide_FloatFloat_ReturnValue_1;          // 0xB4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_1;            // 0xB8(0x40)(HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_2;            // 0xF8(0x40)(HasGetValueTypeHash)
	float                                        CallFunc_Divide_FloatFloat_ReturnValue_2;          // 0x138(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CallFunc_Divide_FloatFloat_ReturnValue_3;          // 0x13C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_3;            // 0x140(0x40)(HasGetValueTypeHash)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_4;            // 0x180(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array;                            // 0x1C0(0x10)(ReferenceParm, HasGetValueTypeHash)
	float                                        CallFunc_Subtract_FloatFloat_ReturnValue;          // 0x1D0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_21F3[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Format_ReturnValue;                       // 0x1D8(0x18)(None)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x1F0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Greater_FloatFloat_ReturnValue;           // 0x1F4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Less_FloatFloat_ReturnValue;              // 0x1F5(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Greater_FloatFloat_ReturnValue_1;         // 0x1F6(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Greater_FloatFloat_ReturnValue_2;         // 0x1F7(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	float                                        CallFunc_Subtract_FloatFloat_ReturnValue_1;        // 0x1F8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_SwitchEnum_CmpSuccess;                      // 0x1FC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_21F8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue_1;        // 0x200(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_21FA[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_1;            // 0x208(0x18)(None)
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue_2;        // 0x220(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_21FC[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_5;            // 0x228(0x40)(HasGetValueTypeHash)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_2;            // 0x268(0x18)(None)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_1;                          // 0x280(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_1;                     // 0x290(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_3;            // 0x2A8(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_4;            // 0x2C0(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_5;            // 0x2D8(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_6;            // 0x2F0(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_7;            // 0x308(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_8;            // 0x320(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_9;            // 0x338(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_10;           // 0x350(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_6;            // 0x368(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_2;                          // 0x3A8(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_2;                     // 0x3B8(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_11;           // 0x3D0(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_12;           // 0x3E8(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_13;           // 0x400(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_14;           // 0x418(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_15;           // 0x430(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_16;           // 0x448(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_17;           // 0x460(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_18;           // 0x478(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_19;           // 0x490(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_20;           // 0x4A8(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_21;           // 0x4C0(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_22;           // 0x4D8(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_23;           // 0x4F0(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_24;           // 0x508(0x18)(None)
	class FText                                  CallFunc_MakeLiteralText_ReturnValue_25;           // 0x520(0x18)(None)
	struct FFormatArgumentData                   K2Node_MakeStruct_FormatArgumentData_7;            // 0x538(0x40)(HasGetValueTypeHash)
	TArray<struct FFormatArgumentData>           K2Node_MakeArray_Array_3;                          // 0x578(0x10)(ReferenceParm, HasGetValueTypeHash)
	class FText                                  CallFunc_Format_ReturnValue_3;                     // 0x588(0x18)(None)
};

// 0x60 (0x60 - 0x0)
// Function BPLibrary.BPLibrary_C.SetGlow
struct UBPLibrary_C_SetGlow_Params
{
public:
	TArray<struct FDynamicMaterialGlowLink>      DynMatLinks;                                       // 0x0(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	bool                                         IsOn;                                              // 0x10(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2231[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Value;                                             // 0x14(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UObject*                               __WorldContext;                                    // 0x18(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable;                                // 0x20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2232[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Array_Length_ReturnValue;                 // 0x24(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Temp_float_Variable;                               // 0x28(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Array_Index_Variable;                     // 0x2C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Loop_Counter_Variable;                    // 0x30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2235[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDynamicMaterialGlowLink              CallFunc_Array_Get_Item;                           // 0x38(0x14)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2236[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         CallFunc_Less_IntInt_ReturnValue;                  // 0x50(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2238[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_Multiply_FloatFloat_ReturnValue;          // 0x54(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        K2Node_Select_Default;                             // 0x58(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Add_IntInt_ReturnValue;                   // 0x5C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0xC4 (0xC4 - 0x0)
// Function BPLibrary.BPLibrary_C.SetupDynamicMaterialsForGlow
struct UBPLibrary_C_SetupDynamicMaterialsForGlow_Params
{
public:
	class UStaticMeshComponent*                  StaticMesh;                                        // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FDynamicMaterialGlowLink>      DynMatGlow;                                        // 0x8(0x10)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ReferenceParm, HasGetValueTypeHash)
	class UObject*                               __WorldContext;                                    // 0x18(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bFound;                                            // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_224B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Array_Length_ReturnValue;                 // 0x24(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class UMaterialInterface*>            CallFunc_GetMaterials_ReturnValue;                 // 0x28(0x10)(ReferenceParm, HasGetValueTypeHash)
	int32                                        Temp_int_Loop_Counter_Variable;                    // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        CallFunc_Array_Length_ReturnValue_1;               // 0x3C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Less_IntInt_ReturnValue;                  // 0x40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_224C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Add_IntInt_ReturnValue;                   // 0x44(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_True_if_break_was_hit_Variable;          // 0x48(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_224D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Temp_int_Array_Index_Variable;                     // 0x4C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FDynamicMaterialGlowLink              CallFunc_Array_Get_Item;                           // 0x50(0x14)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_224E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0x68(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_BooleanAND_ReturnValue;                   // 0x69(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_224F[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Temp_int_Array_Index_Variable_1;                   // 0x6C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        Temp_int_Loop_Counter_Variable_1;                  // 0x70(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2250[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInterface*                    CallFunc_Array_Get_Item_1;                         // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              CallFunc_CreateDynamicMaterialInstance_ReturnValue; // 0x80(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*              K2Node_DynamicCast_AsMaterial_Instance_Dynamic;    // 0x88(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x90(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2251[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CallFunc_K2_GetScalarParameterValue_ReturnValue;   // 0x94(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_EqualEqual_ObjectObject_ReturnValue;      // 0x98(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2253[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDynamicMaterialGlowLink              K2Node_MakeStruct_DynamicMaterialGlowLink;         // 0xA0(0x14)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2254[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Array_Add_ReturnValue;                    // 0xB8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_Less_IntInt_ReturnValue_1;                // 0xBC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2255[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CallFunc_Add_IntInt_ReturnValue_1;                 // 0xC0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


