#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x28 - 0x28)
// Class SH.SHActorState
class ISHActorState : public IInterface
{
public:

	static class UClass* StaticClass();
	static class ISHActorState* GetDefaultObj();

	bool ShouldNotBeSaved();
	void SetActorState(class FName StateName);
	void OnStateRestored();
	class FName GetActorState();
};

// 0x0 (0x28 - 0x28)
// Class SH.SHOutline
class ISHOutline : public IInterface
{
public:

	static class UClass* StaticClass();
	static class ISHOutline* GetDefaultObj();

	void QuestOutline(bool IsHighlighted);
	void Outline(bool IsHighlighted);
};

// 0x18 (0xC8 - 0xB0)
// Class SH.SHNoiseGeneratingComponent
class USHNoiseGeneratingComponent : public UActorComponent
{
public:
	bool                                         bEnabled;                                          // 0xB0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bGenerateOnDamage;                                 // 0xB1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bGenerateOnThrowHit;                               // 0xB2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAttenuation;                                      // 0xB3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DamageHitNoise;                                    // 0xB4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ThrowHitNoise;                                     // 0xB8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NoiseRadius;                                       // 0xBC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDebugOn;                                          // 0xC0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4D7[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHNoiseGeneratingComponent* GetDefaultObj();

	void SetNextThrowHit();
	void SetEnabled(bool IsEnabled);
	void OnTakeDamage(class AActor* DamagedActor, float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void OnHit(class AActor* SelfActor, class AActor* OtherActor, const struct FVector& NormalImpulse, struct FHitResult& Hit);
	bool GetNextThrowHit();
};

// 0x18 (0x238 - 0x220)
// Class SH.RandomActor
class ARandomActor : public AActor
{
public:
	TArray<struct FTileInfo>                     Maze;                                              // 0x220(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MazeHeight;                                        // 0x230(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MazeWidth;                                         // 0x234(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ARandomActor* GetDefaultObj();

	TArray<struct FTileInfo> GetMap(int32 Height, int32 Width);
};

// 0x1E8 (0x408 - 0x220)
// Class SH.SHItem
class ASHItem : public AActor
{
public:
	uint8                                        Pad_779[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMeshComponent*                  PickupMesh;                                        // 0x230(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  Name;                                              // 0x238(0x18)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FString                                ClassDescriptionKey;                               // 0x250(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x260(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UTexture2D*                            Icon;                                              // 0x278(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Weight;                                            // 0x280(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MaxStack;                                          // 0x284(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_782[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        DurabilitySpawnMin;                                // 0x288(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DurabilitySpawnMax;                                // 0x28C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RepairCost;                                        // 0x290(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RepairAvailableMax;                                // 0x294(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsDisassemblable;                                  // 0x298(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsConsumable;                                      // 0x299(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsUsableOnPartyMate;                               // 0x29A(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsUsable;                                          // 0x29B(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OnUseCooldown;                                     // 0x29C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsEquippable;                                      // 0x2A0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFragile;                                          // 0x2A1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanGenerateQuest;                                 // 0x2A2(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanBeQuestTarget;                                 // 0x2A3(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RequiredForQuest;                                  // 0x2A4(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDoNotRemoveAfterDeath;                            // 0x2A8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7AE[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class USHNoiseGeneratingComponent*           NoiseComponent;                                    // 0x2B0(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             HitSound;                                          // 0x2B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             DestructionSound;                                  // 0x2C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EItemRarity                       ItemRarity;                                        // 0x2C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7BB[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BasePrice;                                         // 0x2CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DropChance;                                        // 0x2D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MaxDropCount;                                      // 0x2D4(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7C3[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HitThreshold;                                      // 0x2D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7C7[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAudioComponent*                       Audio;                                             // 0x2E0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bNormalOutlined;                                   // 0x2E8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bQuestOutlined;                                    // 0x2E9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPerkOutlined;                                     // 0x2EA(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsHoldenByPlayer;                                 // 0x2EB(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsLaunched;                                       // 0x2EC(0x1)(BlueprintVisible, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7D8[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItemLifetimeData                     ItemLifetimeData;                                  // 0x2F0(0x38)(Edit, BlueprintVisible, Net, Transient, RepNotify, NoDestructor, ExposeOnSpawn, NativeAccessSpecifierPublic)
	float                                        DurabilityCache;                                   // 0x328(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsWeaponMod;                                       // 0x32C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWeaponModifierType               ItemModType;                                       // 0x32D(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsSecondWeaponMod;                                 // 0x32E(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWeaponModifierType               ItemSecondModType;                                 // 0x32F(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsDraggable;                                       // 0x330(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsGlobalSpawner;                                   // 0x331(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7F2[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnIsGlobalSpawnerChanged;                          // 0x338(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UStaticMesh*                           GlobalSpawnerSpawnedMesh;                          // 0x348(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           GlobalSpawnerRespawnMesh;                          // 0x350(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ASHItem>                   GlobalSpawnerPickupItemClass;                      // 0x358(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsCollectible;                                     // 0x360(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7F9[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CollectibleVisibilityTick;                         // 0x364(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7FB[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ChanceToSpawn;                                     // 0x370(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Cooldown;                                          // 0x374(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             UseSound;                                          // 0x378(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             RepairSound;                                       // 0x380(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             DisassembleSound;                                  // 0x388(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ShouldBeHighlightedByPerk;                         // 0x390(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_810[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnItemStateChanged;                                // 0x398(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class ASHEffect>>         OnUseEffectsClasses;                               // 0x3A8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDropComponentsInfo>           DropComponentsInfo;                                // 0x3B8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSpawned;                                          // 0x3C8(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_81D[0xF];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ASHPlayerCharacter*                    OwnerPlayerCharacter;                              // 0x3D8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                LastThrowInstigator;                               // 0x3E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeToRespawn;                                     // 0x3E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_826[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                AchievementKey;                                    // 0x3F0(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        AchievementID;                                     // 0x400(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEquipped;                                         // 0x401(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_842[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        RespawnReadyTimeSaveData;                          // 0x404(0x4)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ASHItem* GetDefaultObj();

	bool Use(class ASHPlayerCharacter* Character);
	bool UpdateCollectibleVisibilityLocalEvent();
	void UpdateCollectibleVisibilityLocal();
	void UpdateCollectibleVisibility();
	bool UnEquip(class ASHPlayerCharacter* Character);
	void SubtractDurability(float Amount);
	void StopRespawnTimer();
	void StartRespawnTimer(float Time);
	void Respawn();
	void RequestItemLifetimeData();
	void QuestOutline(bool IsHighlighted);
	void PlayDestruction();
	bool Pickup(class ASHInventory* Inventory, class ASHPlayerCharacter* Character);
	void PerkOutline(bool IsHighlighted);
	void Outline(bool IsHighlighted);
	void OnUseImplementation(class ASHPlayerCharacter* Character);
	void OnUse(class ASHPlayerCharacter* Character);
	void OnUnEquipImplementation(class ASHPlayerCharacter* Character);
	void OnTakeDamage(class AActor* DamagedActor, float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void OnRep_Spawned();
	void OnPickup(class ASHInventory* Inventory, class ASHPlayerCharacter* Character);
	void OnItemLifetimeDataUpdated();
	void OnHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit);
	void OnEquipImplementation(class ASHPlayerCharacter* Character);
	void OnDetach();
	void OnAttach();
	void On_RepLifetimeData();
	void On_CDO_Initialize();
	bool LoadFromSave();
	bool IsPlayerAlreadyHave(class ASHPlayerCharacter* Player);
	bool IsOnCooldown();
	bool IsEquipped();
	bool IsCollectibleVisible();
	int32 GetServerTimeStamp();
	int32 GetPickupItemCount(class ASHInventory* Inventory, class ASHPlayerCharacter* PickupCharacter);
	class ASHPlayerCharacter* GetOwnedPlayerCharacter();
	int32 GetDisassembleMoney(class ASHPlayerCharacter* Character);
	void ForceSendItemLifetimeData(struct FItemLifetimeData& SendData);
	bool Equip(class ASHPlayerCharacter* Character);
	void EnableGlobalSpawner();
	bool Disassemble(class ASHPlayerCharacter* Character, float Money);
	void DisableGlobalSpawner();
	bool CanBeUsed();
	bool CanBeUnEquipped();
	bool CanBeEquipped();
	bool ApplyUseEffects(class ASHPlayerCharacter* Character);
	void AddDurabilityMax(float Amount);
	void AddDurability(int32 Amount);
};

// 0x0 (0x408 - 0x408)
// Class SH.SHBasePerkRewardItem
class ASHBasePerkRewardItem : public ASHItem
{
public:

	static class UClass* StaticClass();
	static class ASHBasePerkRewardItem* GetDefaultObj();

};

// 0x0 (0x408 - 0x408)
// Class SH.SHAbilityRewardItem
class ASHAbilityRewardItem : public ASHBasePerkRewardItem
{
public:

	static class UClass* StaticClass();
	static class ASHAbilityRewardItem* GetDefaultObj();

};

// 0x58 (0x108 - 0xB0)
// Class SH.SHAchievementsComponent
class USHAchievementsComponent : public UActorComponent
{
public:
	struct FAchievementsSaveInfo                 AchievementsSaveInfo;                              // 0xB0(0x40)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSubclassOf<class ASHAICharacter>            NPCBiologistClass;                                 // 0xF0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ASHAICharacter>            NPCEngineerClass;                                  // 0xF8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ASHAICharacter>            NPCScientistClass;                                 // 0x100(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class USHAchievementsComponent* GetDefaultObj();

	void ValidateAchievements();
	void SynchronizePlatinum();
	void ServerOnSuccessfulAchievementComplete(enum class EAchievement Achievement);
	void ServerGiveAchievement(enum class EAchievement Achievement);
	void OnTeleportationArtefactUsed();
	void OnSuccessfulAchievementComplete(enum class EAchievement Achievement);
	void OnPneumoliftUsed();
	void OnKunaiKill();
	void OnGrenadeKill();
	void OnGirlScreamerTriggered();
	void OnFlashbackScreamerTriggered();
	void OnContainerUnlocked();
	void OnAnomalyArtefactCaught();
	void OnAiKilled(enum class EAIAchievementType AIAchievementType);
	void GiveAllAchievements();
	class FName GetAchievementName(enum class EAchievement Achievement);
};

// 0x0 (0x28 - 0x28)
// Class SH.SHObject
class USHObject : public UObject
{
public:

	static class UClass* StaticClass();
	static class USHObject* GetDefaultObj();

	class UWorld* GetOwningWorld();
	class AActor* GetOwningActor();
};

// 0x8 (0x30 - 0x28)
// Class SH.SHAction
class USHAction : public USHObject
{
public:
	uint8                                        Pad_AF2[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHAction* GetDefaultObj();

	void Tick(float DeltaTime);
	void PlayStop();
	void PlayStart();
	void PlayInterrupt();
	bool IsPlaying();
	bool CanBePlayed();
	void BeginPlay();
};

// 0x78 (0x128 - 0xB0)
// Class SH.SHActionsComponent
class USHActionsComponent : public UActorComponent
{
public:
	TArray<TSubclassOf<class USHAction>>         AvailableActionClasses;                            // 0xB0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_BAF[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<TSubclassOf<class USHAction>, class USHAction*> ActionsMap;                                        // 0xC8(0x50)(Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class USHAction*>                     ReplicatedActions;                                 // 0x118(0x10)(Net, ZeroConstructor, Transient, RepNotify, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class USHActionsComponent* GetDefaultObj();

	void StopAction(TSubclassOf<class USHAction> ActionClass);
	void ServerStopAction(TSubclassOf<class USHAction> ActionClass);
	void ServerPlayAction(TSubclassOf<class USHAction> ActionClass);
	void PlayAction(TSubclassOf<class USHAction> ActionClass);
	void OnRep_ReplicatedActions();
	bool IsPlayingAction(TSubclassOf<class USHAction> ActionClass);
	class USHAction* GetAction(TSubclassOf<class USHAction> ActionClass);
};

// 0x10 (0x230 - 0x220)
// Class SH.SHCustomPlayerStart
class ASHCustomPlayerStart : public AActor
{
public:
	class UCapsuleComponent*                     CapsuleComponent;                                  // 0x220(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UArrowComponent*                       ArrowComponent;                                    // 0x228(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class ASHCustomPlayerStart* GetDefaultObj();

};

// 0x10 (0x240 - 0x230)
// Class SH.SHActivatedPlayerStart
class ASHActivatedPlayerStart : public ASHCustomPlayerStart
{
public:
	uint8                                        Pad_C24[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bActivated;                                        // 0x238(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, EditConst, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C27[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHActivatedPlayerStart* GetDefaultObj();

	bool IsActivated();
	void DeactivateSpawnPoint();
	void ActivateSpawnPoint();
};

// 0x80 (0x2A0 - 0x220)
// Class SH.SHAIBossRoom
class ASHAIBossRoom : public AActor
{
public:
	uint8                                        Pad_C9E[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ASHAICharacter*                        BossCharacter;                                     // 0x228(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ASHPlayerCharacter*>            OverlappedPlayers;                                 // 0x230(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ASHAIBossRoomTrap*>             Traps;                                             // 0x240(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ASHAIBossRoomTrap*>             ActiveTraps;                                       // 0x250(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_CA8[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bTrapsInitialized;                                 // 0x268(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_CAD[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        OnePlayerTrapsCount;                               // 0x26C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TwoPlayersTrapsCount;                              // 0x270(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ThreePlayersTrapsCount;                            // 0x274(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FourPlayersTrapsCount;                             // 0x278(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_CBA[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnPlayerEnterBossroom;                             // 0x280(0x10)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnPlayerLeaveBossroom;                             // 0x290(0x10)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ASHAIBossRoom* GetDefaultObj();

	void UpdateBoss();
	void OnEndOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnBeginOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void InitializeBoss();
	void Initialize();
	void DeactivateTraps();
	void ActivateTraps();
};

// 0x20 (0x240 - 0x220)
// Class SH.SHAIBossRoomTrap
class ASHAIBossRoomTrap : public AActor
{
public:
	class ASHAIBossRoom*                         BossRoom;                                          // 0x220(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsActive;                                         // 0x228(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D12[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Duration;                                          // 0x22C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D18[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class ASHLostControlEffect>      ControlEffectClass;                                // 0x238(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ASHAIBossRoomTrap* GetDefaultObj();

	void OnRep_IsActive();
	void OnDeactivateTrap();
	void OnBeginOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnActivateTrap();
	void DeactivateTrap();
	void ActivateTrap();
};

// 0x4D0 (0x988 - 0x4B8)
// Class SH.SHCharacter
class ASHCharacter : public ACharacter
{
public:
	class FText                                  CharacterName;                                     // 0x4B8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FName                                  HeadBoneName;                                      // 0x4D0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ASHInventory>              BagpackInventoryClass;                             // 0x4D8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASHInventory*                          BackpackInventory;                                 // 0x4E0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USHCombatManager*                      CombatManager;                                     // 0x4E8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USHCombatComponent*                    CombatComponent;                                   // 0x4F0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USHPlayerStat_Health*                  Health;                                            // 0x4F8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicalAnimationComponent*           PhysicalAnimation;                                 // 0x500(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUsePhysicalAnimation;                             // 0x508(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10E7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ApplyPhysAnimationBelowBone;                       // 0x50C(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10E8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          ExcludeBelowBones;                                 // 0x518(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  PhysicalAnimationProfileName;                      // 0x528(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefaultPhysicsBlendWeight;                         // 0x530(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInRagdoll;                                        // 0x534(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10EB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ControllerYaw;                                     // 0x538(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRunCantStrafe;                                    // 0x53C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCrouchCantStrafe;                                 // 0x53D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsInBlock;                                        // 0x53E(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECombatActionType                 CurrentCombatActionType;                           // 0x53F(0x1)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAttackActionType                 CurrentAttackActionType;                           // 0x540(0x1)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDebugOn;                                          // 0x541(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsPlayingLostControlEffect;                       // 0x542(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsPlayingWallCollision;                           // 0x543(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsSomethingClose;                                 // 0x544(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseNewCombatSystem;                               // 0x545(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10F1[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<struct FHitReactionInfo, class UAnimMontage*> HitReactionAnimations;                             // 0x548(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, NativeAccessSpecifierPublic)
	uint8                                        Pad_10F5[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimMontage*                          PostponedMontage;                                  // 0x5B8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10F7[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bPostponeMontage;                                  // 0x5CC(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bWantsTargeting : 1;                               // Mask: 0x1, PropSize: 0x10x5CD(0x1)(Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsTargeting : 1;                                  // Mask: 0x2, PropSize: 0x10x5CD(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_77 : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bIsKicking : 1;                                    // Mask: 0x80, PropSize: 0x10x5CD(0x1)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_78 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bIsParring : 1;                                    // Mask: 0x2, PropSize: 0x10x5CE(0x1)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsParryWindow : 1;                                // Mask: 0x4, PropSize: 0x10x5CE(0x1)(BlueprintVisible, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_79 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bDebugSpartanSkill : 1;                            // Mask: 0x20, PropSize: 0x10x5CE(0x1)(Edit, BlueprintVisible, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDebugVikingSkill : 1;                             // Mask: 0x40, PropSize: 0x10x5CE(0x1)(Edit, BlueprintVisible, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bInStun : 1;                                       // Mask: 0x80, PropSize: 0x10x5CE(0x1)(BlueprintVisible, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1103[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bIsDying : 1;                                      // Mask: 0x1, PropSize: 0x10x5D0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_7A : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1104[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CorpseLayTime;                                     // 0x5D4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RespawnTime;                                       // 0x5D8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_110B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USHEventsManager*                      EventsManager;                                     // 0x5E0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCharacterKilled;                                 // 0x5E8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UDataTable*                            KillRewardData;                                    // 0x5F8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsInSafeZone;                                     // 0x600(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1113[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class ASHItemContainer>          DeathContainerClass;                               // 0x608(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASHItemContainer*                      DeathContainer;                                    // 0x610(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class USHDamageType>>     IgnoredDamageTypes;                                // 0x618(0x10)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  RightWeaponSocket;                                 // 0x628(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  LeftWeaponSocket;                                  // 0x630(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASHWeapon*                             PendingWeapon;                                     // 0x638(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TargetingSpeedModifier;                            // 0x640(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        AnomalySlowModifier;                               // 0x644(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UPhysicalMaterial*                     HeadPhysMaterial;                                  // 0x648(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bWantsToRun : 1;                                   // Mask: 0x1, PropSize: 0x10x650(0x1)(BlueprintVisible, BlueprintReadOnly, Net, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_7B : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1124[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTakeHitInfo                          LastTakeHitInfo;                                   // 0x658(0x128)(Net, Transient, RepNotify, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1126[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnStartFire;                                       // 0x788(0x10)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnWeaponEquip;                                     // 0x798(0x10)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnWeaponUnequipEquip;                              // 0x7A8(0x10)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	class UAnimMontage*                          DeathAnim;                                         // 0x7B8(0x8)(Edit, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystem*                       RespawnFX;                                         // 0x7C0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundCue*                             RespawnSound;                                      // 0x7C8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1131[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class ASHWeapon_ThrowingItems>   ThrowingWeaponClass;                               // 0x7E8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ASHWeapon_ThrowingItems*               ThrowingWeapon;                                    // 0x7F0(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ASHWeapon*                             LocalLastWeapon;                                   // 0x7F8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ASHWeapon*                             CurrentWeapon;                                     // 0x800(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class ASHWeapon_Kick>            KickWeaponClass;                                   // 0x808(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASHWeapon*                             KickWeapon;                                        // 0x810(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  KickWeaponSocket;                                  // 0x818(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BattleStanceChangeTimeout;                         // 0x820(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GoIdleTimeout;                                     // 0x824(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1139[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EBattleStanceState                _battleStanceState;                                // 0x830(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_113B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          TH_BattleStanceWait;                               // 0x838(0x8)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        IKTraceDistance;                                   // 0x840(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  IKRootBoneName;                                    // 0x844(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  IKHipBoneName;                                     // 0x84C(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRotateRootBone;                                   // 0x854(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1142[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FIKFootInfo>                   TraceFeet;                                         // 0x858(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         DisableIK;                                         // 0x868(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1144[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        IKMeshRelativeZ;                                   // 0x86C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              IKRootBoneRotation;                                // 0x870(0xC)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                        IKMeshZOffset;                                     // 0x87C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        IKMeshDropHeight;                                  // 0x880(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1145[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSubclassOf<class USHDamageType>>     UnblockableDamageTypes;                            // 0x888(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1146[0xD8];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnCriticalDamageDealt;                             // 0x970(0x10)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                        CharacterAttackSize;                               // 0x980(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1149[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHCharacter* GetDefaultObj();

	bool TakeHit(const struct FHitInformation& HitInformation);
	void Suicide();
	void StopWeaponParry();
	void StopWeaponKick();
	void StopWeaponFire();
	void StopWeaponAltFire();
	void StopThrow();
	void StartWeaponParry();
	void StartWeaponKick();
	void StartWeaponFire();
	void StartWeaponAltFire();
	void StartThrow();
	void StartKick();
	void SetWantsThrow(bool bWantsThrow);
	void SetWantsKick(bool bWantsKick);
	void SetWantsFire(bool bWantsFire);
	void SetWantsAltFire(bool bWantsAltFire);
	void SetUpPhysicalAnimationSettings(class FName BoneName);
	void SetupPhysAnimationProfile();
	void SetTargeting(bool bNewTargeting);
	void SetRunning(bool bNewRunning, bool bToggle);
	void SetBattleStanceState(enum class EBattleStanceState DesiredState);
	void ServerSetTargeting(bool bNewTargeting);
	void ServerSetRunning(bool bNewRunning, bool bToggle);
	void ServerSetBattleStanceState(enum class EBattleStanceState DesiredState);
	void ServerEquipWeapon(class ASHWeapon* NewWeapon);
	void ReceiveOnKillSomebody(class ASHCharacter* Somebody);
	void ReceiveAnyDamageCustom(float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser, bool bDamageBlocked);
	void PushBackOnHit(const struct FVector& MovingDiretion, enum class EHitResult HitResult, enum class EMeleeWeaponType MeleeWeaponType);
	void ProcessHitResponse(const struct FHitInformation& HitInformation);
	void ProcessFeetIK(float DeltaTime);
	void PostponeCurrentMontage(float Seconds);
	float PlayWeaponAnimation(struct FWeaponAnimMontageInfo& AnimationInfo);
	bool PlayStoneHitReaction();
	void PlayHitReactionImpulse(const struct FVector& HitDirection, float DamageTypeImpulse, enum class EMeleeWeaponType MeleeWeaponType, enum class EAttackActionType AttackActionType, class USkeletalMeshComponent* SpecificMesh, class FName HittedBoneName);
	void PlayHitReactionAnimation(const struct FVector& HitDirection, enum class EAttackActionType AttackActionType, enum class EMeleeWeaponType MeleeWeaponType, enum class EDazeType WeaponDazeType, float WeaponDazeChance);
	void OnRep_LastTakeHitInfo();
	void OnRep_KickWeapon();
	void OnRep_CurrentWeapon(class ASHWeapon* LastWeapon);
	void OnRep_BackpackInventory();
	void OnKillSomebody(class ASHCharacter* Somebody);
	void OnHitSomebody(class APawn* Somebody);
	bool OnFootStep();
	void OnFire();
	bool OnDeathEvent();
	void OnDamageDealt(float Damage, class AActor* DamageTarget);
	void OnBackpackReplicated();
	bool KickCanMove();
	bool IsTargeting();
	bool IsRunning();
	bool IsMovingBackwards();
	bool IsInSafeZone();
	bool IsFiring();
	bool IsAlive();
	bool IKFootTrace(float TraceDistance, struct FIKFootInfo* FeetInfo, float DeltaTime);
	class ASHWeapon* GetWeapon();
	float GetTargetingSpeedModifier();
	float GetSquaredDistanceToClosestPlayerCharacter();
	float GetSquaredDistanceToClosestAi();
	float GetSquaredDistanceToCharacter(class ASHCharacter* Character);
	class ASHWeapon* GetKickWeapon();
	class ASHWeapon* GetCurrentWeapon();
	void GetCombatZone(const struct FVector& ObjectLocation, enum class ECombatZone* CombatZone);
	TArray<struct FVector> GetCircularMovementCoordinates(float Radius, int32 Coordinates);
	enum class EBattleStanceState GetBattleStance();
	float GetAnomalySlowModifier();
	struct FRotator GetAimOffsets();
	void FindCombatPosition(enum class ECombatZone CombatZone, const struct FVector& ObjectLocation, struct FVector* CombatPosition, bool* bIsCombatPositionValid);
	void EquipWeapon(class ASHWeapon* Weapon);
	void ClientOnCriticalDamageDealt();
	void CheckCriticalZone(const struct FVector& ObjectLocation, bool* bIsInCriticalZone);
	void CheckCombatZoneAvailability(enum class ECombatZone CombatZone, class ASHCharacter* CharToCheck, bool* bIsCombatZoneAvailable);
	bool CanSetBattleStance(enum class EBattleStanceState DesiredState);
	bool CanParry();
	bool CanKick();
	void CalcRootBoneRotation(float DeltaTime);
	void AnimateBlendWeight();
};

// 0x408 (0xD90 - 0x988)
// Class SH.SHAICharacter
class ASHAICharacter : public ASHCharacter
{
public:
	class USHPlayerStat_Armor*                   Armor;                                             // 0x988(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USHPlayerStat_Shield*                  Shield;                                            // 0x990(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          BlockHitAnim;                                      // 0x998(0x8)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          BlockBrokenAnim;                                   // 0x9A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          HittedBlockAnim;                                   // 0x9A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          HittedParryAnim;                                   // 0x9B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bLowerScoreAfterLastHitInSet : 1;                  // Mask: 0x1, PropSize: 0x10x9B8(0x1)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsHitted : 1;                                     // Mask: 0x2, PropSize: 0x10x9B8(0x1)(BlueprintVisible, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bWantsEscape : 1;                                  // Mask: 0x4, PropSize: 0x10x9B8(0x1)(BlueprintVisible, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_8A : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	enum class EAICombatState                    CurrentCombatState;                                // 0x9B9(0x1)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_172E[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        StressValue;                                       // 0x9BC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BonusSneakAttackDistance;                          // 0x9C0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bTakeHitFromOtherAI;                               // 0x9C4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bMeshRenderCustomDepth;                            // 0x9C5(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1732[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CustomDepthStencil;                                // 0x9C8(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1735[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FAIActionSet>                  ProactiveActionSets;                               // 0x9D0(0x10)(Edit, BlueprintVisible, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrentProactiveActionSetID;                       // 0x9E0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrentProactiveActionID;                          // 0x9E4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAIActionSet>                  ReactiveActionSets;                                // 0x9E8(0x10)(Edit, BlueprintVisible, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrentReactiveActionSetID;                        // 0x9F8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrentReactiveActionID;                           // 0x9FC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CurrentStealthSightRadius;                         // 0xA00(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LowStealthSightRadius;                             // 0xA04(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NormalStealthSightRadius;                          // 0xA08(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HighStealthSightRadius;                            // 0xA0C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CurrentSightRadius;                                // 0xA10(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LowSightRadius;                                    // 0xA14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NormalSightRadius;                                 // 0xA18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HighSightRadius;                                   // 0xA1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        bAllowedSafeZone;                                  // 0xA20(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LowHearingRange;                                   // 0xA24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NormalHearingRange;                                // 0xA28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HighHearingRange;                                  // 0xA2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CurrentHearingRange;                               // 0xA30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAIStates                         State;                                             // 0xA34(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAIStates                         PreviousState;                                     // 0xA35(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1759[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnCurrentStateChanged;                             // 0xA38(0x10)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                        PatrolStateMoveSpeed;                              // 0xA48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AlertStateMoveSpeed;                               // 0xA4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InspectStateMoveSpeed;                             // 0xA50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AttackStateMoveSpeed;                              // 0xA54(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AttackStateMeleeMoveSpeed;                         // 0xA58(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SpecialStateMoveSpeed;                             // 0xA5C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SecondSpecialStateMoveSpeed;                       // 0xA60(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ThirdSpecialStateMoveSpeed;                        // 0xA64(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FourthSpecialStateMoveSpeed;                       // 0xA68(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FifthSpecialStateMoveSpeed;                        // 0xA6C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EvadeStateMoveSpeed;                               // 0xA70(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DeathStateMoveSpeed;                               // 0xA74(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StunStateMoveSpeed;                                // 0xA78(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GroupMovingMoveSpeed;                              // 0xA7C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DazedMoveSpeed;                                    // 0xA80(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CircularMovementStateMoveSpeed;                    // 0xA84(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDebugAi;                                          // 0xA88(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1771[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  DefaultThrowItemSocket;                            // 0xA8C(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1772[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class ASHItem>                   DefaultThrownItemClass;                            // 0xA98(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefaultThrowItemLifetime;                          // 0xAA0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ThrowForce;                                        // 0xAA4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ThrowDistance;                                     // 0xAA8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bReduceThrowForce;                                 // 0xAAC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBlindManAchievement;                              // 0xAAD(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1778[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinimalNoiseVolume;                                // 0xAB0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bGroupMovingComplete;                              // 0xAB4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAIBehaviorType                   BehaviorType;                                      // 0xAB5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCalculateDistanceToEnemy;                         // 0xAB6(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_177D[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DistanceToEnemyCharacter;                          // 0xAB8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ClosestDistanceToEnemyCharacter;                   // 0xABC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Stamina;                                           // 0xAC0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StaminaRegenerationTime;                           // 0xAC4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1784[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ARecastNavMesh*                        MyRecastNavMesh;                                   // 0xAD0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                            MonstrumRewardData;                                // 0xAD8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bReadyToTargetChange;                              // 0xAE0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_178A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TargetChangeCooldown;                              // 0xAE4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_178C[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bCanBeDazedNormalAttack;                           // 0xAF0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanBeDazedHeavyAttack;                            // 0xAF1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanBeDazedAIAttackBlocked;                        // 0xAF2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1792[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DazeDuration;                                      // 0xAF4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1795[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ASHWeapon_MeleeModificationInfo*       ActiveWeapon_MeleeModificationInfo;                // 0xB00(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SoundIntegerParameter;                             // 0xB08(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CoopAiDamageScale;                                 // 0xB0C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class ASHCharacter>>      AllowedEnemies;                                    // 0xB10(0x10)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class ASHCharacter>>      AllowedFriends;                                    // 0xB20(0x10)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AttacksToBecomePlayerEnemy;                        // 0xB30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CoopAiHealthScale;                                 // 0xB34(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOneShotAlert;                                     // 0xB38(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOneShotAttack;                                    // 0xB39(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOneShotInspect;                                   // 0xB3A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOneShotPatrol;                                    // 0xB3B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOneShotSpecial;                                   // 0xB3C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOneShotSecondSpecial;                             // 0xB3D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOneShotThirdSpecial;                              // 0xB3E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOneShotFourthSpecial;                             // 0xB3F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOneShotFifthSpecial;                              // 0xB40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOneShotGroupMoving;                               // 0xB41(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOneShotDazed;                                     // 0xB42(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOneShotStun;                                      // 0xB43(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOneShotCircularMovement;                          // 0xB44(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStrongEnemy;                                      // 0xB45(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStunAlert;                                        // 0xB46(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStunAttack;                                       // 0xB47(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStunInspect;                                      // 0xB48(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStunPatrol;                                       // 0xB49(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStunSpecial;                                      // 0xB4A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStunSecondSpecial;                                // 0xB4B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStunThirdSpecial;                                 // 0xB4C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStunFourthSpecial;                                // 0xB4D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStunFifthSpecial;                                 // 0xB4E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStunStun;                                         // 0xB4F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStunGroupMoving;                                  // 0xB50(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStunDazed;                                        // 0xB51(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStunCircularMovement;                             // 0xB52(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStoneStunAlert;                                   // 0xB53(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStoneStunAttack;                                  // 0xB54(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStoneStunInspect;                                 // 0xB55(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStoneStunPatrol;                                  // 0xB56(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStoneStunSpecial;                                 // 0xB57(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStoneStunSecondSpecial;                           // 0xB58(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStoneStunThirdSpecial;                            // 0xB59(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStoneStunFourthSpecial;                           // 0xB5A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStoneStunFifthSpecial;                            // 0xB5B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStoneStunStun;                                    // 0xB5C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStoneStunGroupMoving;                             // 0xB5D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStoneStunDazed;                                   // 0xB5E(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStoneStunCircularMovement;                        // 0xB5F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        StunTime;                                          // 0xB60(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ModifiedStunTime;                                  // 0xB64(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        StunCooldown;                                      // 0xB68(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStunOnCooldown;                                   // 0xB6C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17C7[0xB];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bCalculateEvade;                                   // 0xB78(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17CA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               SpawnPoint;                                        // 0xB7C(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               EvadePoint;                                        // 0xB88(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        EvadeRadius;                                       // 0xB94(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ASHCharacter*                          EnemyCharacter;                                    // 0xB98(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ASHAISpawnPoint*                       AISpawnPoint;                                      // 0xBA0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ASHAIDirector*                         AiDirector;                                        // 0xBA8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               GroupMovingLocation;                               // 0xBB0(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAggroEmotionReady;                                // 0xBBC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAutoPatrolResetAggroEmotionReady;                 // 0xBBD(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCalculateAttackMeleeSpeed;                        // 0xBBE(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17CF[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AttackMeleeSpeedRadius;                            // 0xBC0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CurrentAttackStateSpeed;                           // 0xBC4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  HeadSocketName;                                    // 0xBC8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  BackBoneName;                                      // 0xBD0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bValidateBack;                                     // 0xBD8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17D2[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AggroEmotionIgnoreDistance;                        // 0xBDC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bThrowSlowProjectiles;                             // 0xBE0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17D5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CloseThrowSlowDistance;                            // 0xBE4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ThrowSlowDistance;                                 // 0xBE8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ThrowSlowCooldown;                                 // 0xBEC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class ASHEffect>                 ThrowSlowClass;                                    // 0xBF0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSlowProjectileReady;                              // 0xBF8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSlowProjectilePlayCharacterReaction;              // 0xBF9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSlowProjectileStopCharacter;                      // 0xBFA(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSlowProjectileThrowOnCooldown;                    // 0xBFB(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17E7[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bApplySlowProjectile;                              // 0xC08(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_17E9[0xF];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        HeadBoneIndex;                                     // 0xC18(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17EC[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            HeadSocketLocalTransform;                          // 0xC20(0x30)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                         bHeadBoneCached;                                   // 0xC50(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_17F2[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FDazeDescription>              NormalAttackDazeReactions;                         // 0xC58(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDazeDescription>              HeavyAttackDazeReactions;                          // 0xC68(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDazeDescription>              AttackBlockDazeReactions;                          // 0xC78(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDazeDescription>              BleedingAttackDazeReactions;                       // 0xC88(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDazeDescription>              ElectricAttackDazeReactions;                       // 0xC98(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDazeDescription>              PoisonAttackDazeReactions;                         // 0xCA8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDazeDescription>              FireAttackDazeReactions;                           // 0xCB8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDazeDescription>              ForgedAttackDazeReactions;                         // 0xCC8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDazeDescription>              IceAttackDazeReactions;                            // 0xCD8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsBossCharacter;                                  // 0xCE8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFractions                        CharacterFraction;                                 // 0xCE9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1800[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CharacterFractionWeight;                           // 0xCEC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPerkOutlined;                                     // 0xCF0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ShouldBeHighlightedByPerk;                         // 0xCF1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDodgingAttack;                                    // 0xCF2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1801[0xD];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bDodgingAttackReady;                               // 0xD00(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1802[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DodgeAttackAngle;                                  // 0xD04(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bValidateDodgeAngle;                               // 0xD08(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1805[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DodgeChance;                                       // 0xD0C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DodgingAttackCooldown;                             // 0xD10(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1807[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        DodgeCounts;                                       // 0xD20(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DodgeCountsLeft;                                   // 0xD24(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CircularMovementCanMoveCounterClockwise;           // 0xD28(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_180A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVector>                       CircularMovementCoordinates;                       // 0xD30(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CircularMovementIndex;                             // 0xD40(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCircularMovementClockwise;                        // 0xD44(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_180E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               NextCircularMovementLocation;                      // 0xD48(0xC)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCMFirstLocationReached;                           // 0xD54(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1812[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CircularMovementMaxDuration;                       // 0xD58(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1813[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CircularMovementChance;                            // 0xD68(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CircularMovementCooldown;                          // 0xD6C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCircularMovementReady;                            // 0xD70(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1815[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CircularMovementRadius;                            // 0xD74(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CircularMovementPointsAmount;                      // 0xD78(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1816[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EAIAchievementType                AIAchievementType;                                 // 0xD88(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1818[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHAICharacter* GetDefaultObj();

	float ValidateBackDamage(float Damage, class AActor* DamageCauser);
	void UseStamina(float Value);
	bool UpdateThirdSpecialState(float DeltaTime);
	bool UpdateStunState(float DeltaTime);
	bool UpdateSpecialState(float DeltaTime);
	bool UpdateSecondSpecialState(float DeltaTime);
	bool UpdatePatrolState(float DeltaTime);
	bool UpdateInspectState(float DeltaTime);
	bool UpdateGroupMovingState(float DeltaTime);
	bool UpdateFourthSpecialState(float DeltaTime);
	bool UpdateFifthSpecialState(float DeltaTime);
	bool UpdateEvadeState(float DeltaTime);
	bool UpdateDeathState(float DeltaTime);
	bool UpdateDazedState(float DeltaTime);
	bool UpdateCircularMovementState(float DeltaTime);
	bool UpdateAttackState(float DeltaTime);
	bool UpdateAlertState(float DeltaTime);
	void ThrowDefaultItem();
	bool StunCharacter(class ASHCharacter* Character);
	void StartThrowDefaultItem();
	void StartSlowProjectileThrowCooldown();
	void StartGroupMoving(const struct FVector& TargetLocation);
	void StartDodgingAttackCooldown();
	bool StartDodgingAttack(class UAnimMontage* Montage);
	void StartDazeType(enum class EDazeType DazeType, float Chance);
	void StartDaze(enum class EDazeType DazeType);
	bool StartCircularMovement();
	void SlowProjectileThrowed();
	void SlowProjectileApplied(class ASHCharacter* Character);
	bool SightRadiusChanged();
	void SetState(enum class EAIStates NewState);
	void SetSlowProjectileReady(bool NewValue);
	void SetIsKicking(bool bNewIsKicking);
	void SetEvadePoint(const struct FVector& NewEvadePoint);
	bool SetEnemyCharacter(class ASHCharacter* Character);
	void SetBehaviorType(enum class EAIBehaviorType NewBehaviorType);
	void SetAiDirector(class ASHAIDirector* NewDirector);
	void SetAggroEmotionReady(bool NewValue);
	void ServerThrowItem(class ASHItem* Item);
	void ServerStartThrowDefaultItem();
	bool SensingTakeDamage(class ASHCharacter* Character, bool FromSensor, float Damage);
	bool SensingSeePawn(class APawn* Pawn, bool FromSensor);
	bool SensingHearNoise(float Volume, class AActor* Actor, const struct FVector& Location, float Distance, bool FromSensor);
	void PlaySoundWithIntegerParameter(class USoundCue* Sound, class FName Name);
	void PerkOutline(bool IsHighlighted);
	void Outline(bool bOutline, int32 Stencil);
	bool OnThirdSpecialStateStop();
	bool OnThirdSpecialState();
	bool OnStunStateStop();
	bool OnStunState();
	void OnStunCooldown();
	bool OnStunComplete();
	bool OnStateChanged();
	void OnStaminaCooldown();
	bool OnSpecialStateStop();
	bool OnSpecialState();
	void OnSlowProjectileThrowCooldown();
	bool OnSecondSpecialStateStop();
	bool OnSecondSpecialState();
	void OnRep_MeshRenderCustomDepth();
	bool OnPatrolStateStop();
	bool OnPatrolState();
	bool OnLeaveFlashlight(class ASHFlashLight* Flashlight);
	bool OnInterruptAttackHit();
	bool OnInteractStateStop();
	bool OnInteractState();
	bool OnInspectStateStop();
	bool OnInspectState();
	void OnHearNoise(float Volume, class AActor* Actor, const struct FVector& Location, float Distance);
	bool OnGroupMovingStateStop();
	bool OnGroupMovingState();
	bool OnFourthSpecialStateStop();
	bool OnFourthSpecialState();
	bool OnFifthSpecialStateStop();
	bool OnFifthSpecialState();
	bool OnEvadeStateStop();
	bool OnEvadeState();
	bool OnEnterFlashlight(class ASHFlashLight* Flashlight);
	void OnDodgingAttackCooldown();
	void OnDodgingAttackComplete();
	bool OnDeathStateStop();
	bool OnDeathState();
	bool OnDazeStarted(enum class EDazeType DazeType);
	bool OnDazeEventStarted(class UAnimMontage* DazeMontage);
	bool OnDazedStateStop();
	bool OnDazedState();
	void OnDazeCooldown();
	void OnCircularMovementTimeout();
	bool OnCircularMovementStateStop();
	bool OnCircularMovementState();
	void OnCircularMovementCooldown();
	bool OnAttackStateStop();
	bool OnAttackState();
	bool OnAlertStateStop();
	bool OnAlertState();
	bool IsDodgingAttackValidAngle();
	bool IsDodgingAttackReady();
	bool IsDodgingAttack();
	bool IsCloseToCircularMovementLocation(float SquaredDistance);
	bool IsAllowedFriend(class AActor* TargetActor);
	bool IsAllowedEnemy(class AActor* TargetActor);
	void InterruptDaze();
	bool InitializeCircularMovement();
	struct FRotator GetViewRotation();
	struct FVector GetNextCircularMovementLocation();
	struct FRotator GetHeadRotation();
	class ASHCharacter* GetEnemyCharacter();
	float GetDotToEnemyCharacter();
	bool DoesPathExist(class AActor* TargetActor);
	bool DamageAllowEnemy(class AActor* TargetActor);
	bool CouldSeePawn(class APawn* Other);
	void CompleteGroupMoving();
	bool CanStartStunEvent();
	bool CanStartDazeEvent(enum class EDazeType DazeType);
	bool CanBeOneShotted(class ASHWeapon* Weapon, class AActor* DamageCauser);
	void CalculateNextCircularMovementLocation();
	bool BB_SyncState();
	bool BB_SynchronizeEnemyCharacter();
	bool BB_SyncBehaviorType();
	bool BB_SetSlowProjectileReady();
	bool BB_GroupMovingLocation();
	bool BB_EvadePoint();
	bool BB_AggroEmotionReady();
	bool ApplyStun(class ASHCharacter* EnemyCharacter, bool bFromStone, bool bFromWeaponThrow);
	bool AiSpawnPointUpdated();
	void AIAttack();
};

// 0x58 (0x278 - 0x220)
// Class SH.SHAICombatDirector
class ASHAICombatDirector : public AActor
{
public:
	TMap<class ASHCharacter*, struct FAgentGroup> EnemyToAgents;                                     // 0x220(0x50)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        bDebug : 1;                                        // Mask: 0x1, PropSize: 0x10x270(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_18C4[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHAICombatDirector* GetDefaultObj();

	void UnregisterEnemy(class ASHCharacter* Enemy);
	void UnregisterAIAgent(class ASHAICharacter* Agent);
	void RegisterAIAgent(class ASHAICharacter* NewAgent, class ASHCharacter* Enemy);
};

// 0x0 (0x328 - 0x328)
// Class SH.SHAIController
class ASHAIController : public AAIController
{
public:

	static class UClass* StaticClass();
	static class ASHAIController* GetDefaultObj();

};

// 0xA0 (0x150 - 0xB0)
// Class SH.SHAICustomizationComponent
class USHAICustomizationComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnApplyCustomization;                              // 0xB0(0x10)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	float                                        BeardChance;                                       // 0xC0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BeardIndex;                                        // 0xC4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USkeletalMesh*>                 Beards;                                            // 0xC8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HairChance;                                        // 0xD8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        HairIndex;                                         // 0xDC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USkeletalMesh*>                 Hairs;                                             // 0xE0(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        KitChance;                                         // 0xF0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        KitIndex;                                          // 0xF4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USkeletalMesh*>                 Kits;                                              // 0xF8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        HeadMaterialIndex;                                 // 0x108(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_18DC[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UMaterialInstance*>             HeadMaterials;                                     // 0x110(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BodyChance;                                        // 0x120(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BodyIndex;                                         // 0x124(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USkeletalMesh*>                 Bodies;                                            // 0x128(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PantsChance;                                       // 0x138(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PantsIndex;                                        // 0x13C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USkeletalMesh*>                 Pants;                                             // 0x140(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class USHAICustomizationComponent* GetDefaultObj();

	void ApplyCustomization();
};

// 0xA8 (0x2F0 - 0x248)
// Class SH.SHAIDirector
class ASHAIDirector : public ANavigationObjectBase
{
public:
	uint8                                        Pad_194D[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SpawnChance;                                       // 0x250(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSpawnAllowed;                                     // 0x254(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bInitialSpawnAllowed;                              // 0x255(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsQuestSpawn;                                     // 0x256(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bQuestStateActive;                                 // 0x257(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDestroyQuestSpawnedAi;                            // 0x258(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1953[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ActorState;                                        // 0x25C(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        CurrentWaypointIndex;                              // 0x264(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bGroupDamageSensing;                               // 0x268(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1957[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GroupDamageSensingRadius;                          // 0x26C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bGroupSeeSensing;                                  // 0x270(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1958[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GroupSeeSensingRadius;                             // 0x274(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bGroupHearSensing;                                 // 0x278(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_195A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GroupHearSensingRadius;                            // 0x27C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FCachedAiCharacterDescription> CachedGroup;                                       // 0x280(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class ASHAICharacter*>                AiCharacters;                                      // 0x290(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSkipFirstMinimalRadiusCheck;                      // 0x2A0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseSaves;                                         // 0x2A1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDontUseSaves;                                     // 0x2A2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1961[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAIDirectorSaveInfo                   AIDirectorSaveInfoData;                            // 0x2A8(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, SaveGame, Protected, NativeAccessSpecifierProtected)
	struct FDeathInfo                            DeathInfo;                                         // 0x2D8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, SaveGame, NoDestructor, Protected, NativeAccessSpecifierProtected)
	enum class EFractions                        CharacterFraction;                                 // 0x2E0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1966[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        FractionSpawnAggressionMin;                        // 0x2E4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FractionSpawnAggressionMax;                        // 0x2E8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1968[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHAIDirector* GetDefaultObj();

	void SetSpawnPointQuestState(bool bNewState);
	void SensingTakeDamage(class ASHAICharacter* AICharacter, class ASHCharacter* Character, bool FromSensor, float Damage);
	void SensingSeePawn(class ASHAICharacter* AICharacter, class APawn* Pawn, bool FromSensor);
	void SensingHearNoise(class ASHAICharacter* AICharacter, float Volume, class AActor* Actor, const struct FVector& Location, float Distance, bool FromSensor);
	int32 GetGroupSize();
};

// 0x18 (0x260 - 0x248)
// Class SH.SHAIEventSpawnPoint
class ASHAIEventSpawnPoint : public ANavigationObjectBase
{
public:
	class USkeletalMeshComponent*                SpawnMesh;                                         // 0x248(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ASHAICharacter>            DisplayAICharacterClass;                           // 0x250(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASHAICharacter*                        SpawnedCharacter;                                  // 0x258(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ASHAIEventSpawnPoint* GetDefaultObj();

};

// 0x1D0 (0x4C0 - 0x2F0)
// Class SH.SHAIGroupSpawnPoint
class ASHAIGroupSpawnPoint : public ASHAIDirector
{
public:
	class USkeletalMeshComponent*                Root;                                              // 0x2F0(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                Spawn1;                                            // 0x2F8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                Spawn2;                                            // 0x300(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                Spawn3;                                            // 0x308(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                Spawn4;                                            // 0x310(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class ASHAICharacter>>    AICharacterClass;                                  // 0x318(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SpawnDistanceMin;                                  // 0x328(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SpawnDistanceMax;                                  // 0x32C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FailedSpawnTimer;                                  // 0x330(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        RespawnTimer;                                      // 0x334(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAlwaysSpawn;                                      // 0x338(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_19E9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ASHAIWaypoint*>                 Waypoints1;                                        // 0x340(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class ASHAIWaypoint*>                 Waypoints2;                                        // 0x350(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class ASHAIWaypoint*>                 Waypoints3;                                        // 0x360(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class ASHAIWaypoint*>                 Waypoints4;                                        // 0x370(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCycleWaypoints;                                   // 0x380(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EAiSpawnType                      AiSpawnType;                                       // 0x381(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ESpawnerBehaviorType              SpawnerBehaviorType;                               // 0x382(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_19F4[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        WaypointsBehaviorUpdateTime;                       // 0x384(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ClosestDistance;                                   // 0x388(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsCharacterSpawned;                                // 0x38C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_19F7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            SpawnTransform1;                                   // 0x390(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FTransform                            SpawnTransform2;                                   // 0x3C0(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FTransform                            SpawnTransform3;                                   // 0x3F0(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FTransform                            SpawnTransform4;                                   // 0x420(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FTransform>                    CalculatePoints;                                   // 0x450(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class ASHAICharacter*>                SpawnedCharacters;                                 // 0x460(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MinGroupSize;                                      // 0x470(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxGroupSize;                                      // 0x474(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        GroupMovingTime;                                   // 0x478(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1A08[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ASHAICharacter*>                DeadCharacters;                                    // 0x480(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1A0C[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bGroupMoving;                                      // 0x4B0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bReadyToGroupMoving;                               // 0x4B1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1A13[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TimeToGroupMove;                                   // 0x4B4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bWaypointsInitialized;                             // 0x4B8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1A15[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHAIGroupSpawnPoint* GetDefaultObj();

	void UpdateDistance();
	bool UpdateAiCharacters();
	void StopDistanceTimer();
	void StartRespawnTimer(float Time);
	void StartDistanceTimer();
	void RespawnAiCharacters();
	void OnRespawnTimerCallback();
	void OnCharacterDeath(class ASHAICharacter* Character);
	class ASHAIWaypoint* GetCurrentWaypoint(int32 CharacterIndex);
	void DestroyAiCharacter(class ASHAICharacter* Character);
	int32 CalculateGroupSize();
	void CalculateDistance();
};

// 0x18 (0x440 - 0x428)
// Class SH.SHAIInteractionComponent
class USHAIInteractionComponent : public USphereComponent
{
public:
	class ASHAICharacter*                        OwnerCharacter;                                    // 0x428(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1A8A[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHAIInteractionComponent* GetDefaultObj();

	void UpdatePlayers();
	void OnEndOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnBeginOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
};

// 0xC0 (0x3B0 - 0x2F0)
// Class SH.SHAISpawnPoint
class ASHAISpawnPoint : public ASHAIDirector
{
public:
	class USkeletalMeshComponent*                SpawnMesh;                                         // 0x2F0(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ASHAIWaypoint*>                 Waypoints;                                         // 0x2F8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAiSpawnType                      AiSpawnType;                                       // 0x308(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESpawnerBehaviorType              SpawnerBehaviorType;                               // 0x309(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1B07[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        WaypointsBehaviorUpdateTime;                       // 0x30C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCycleWaypoints;                                   // 0x310(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1B0A[0x17];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SpawnDistanceMin;                                  // 0x328(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        SpawnDistanceMax;                                  // 0x32C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        EvadeRadius;                                       // 0x330(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ClosestDistance;                                   // 0x334(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsCharacterSpawned;                                // 0x338(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1B10[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ASHAICharacter*                        SpawnedCharacter;                                  // 0x340(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class ASHAICharacter>            AICharacterClass;                                  // 0x348(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FailedSpawnTimer;                                  // 0x350(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        RespawnTimer;                                      // 0x354(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class ASHAICharacter*>                DeadCharacters;                                    // 0x358(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1B15[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            SpawnTransform;                                    // 0x370(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1B16[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHAISpawnPoint* GetDefaultObj();

	void UpdateDistance();
	bool UpdateAiCharacter();
	void StopDistanceTimer();
	void StartRespawnTimer(float Time);
	void StartDistanceTimer();
	void RespawnAiCharacter();
	void OnRespawnTimerCallback();
	void OnCharacterDeath(class ASHAICharacter* Character);
	struct FVector GetNextWaypointLocation();
	struct FVector GetNextRandomWaypointLocation();
	void ForceAiRespawn();
	void DestroyAiCharacter(class ASHAICharacter* Character);
	void CalculateDistance();
	bool AiCharacterSpawned(class ASHAICharacter* AICharacter);
};

// 0x0 (0x220 - 0x220)
// Class SH.SHAIWaypoint
class ASHAIWaypoint : public AActor
{
public:

	static class UClass* StaticClass();
	static class ASHAIWaypoint* GetDefaultObj();

};

// 0x18 (0x420 - 0x408)
// Class SH.SHAmmoBox
class ASHAmmoBox : public ASHItem
{
public:
	TSubclassOf<class ASHWeapon_Ammo>            AmmoClass;                                         // 0x408(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AmmoCount;                                         // 0x410(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SpawnAmmoCountMin;                                 // 0x414(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SpawnAmmoCountMax;                                 // 0x418(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1B3E[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHAmmoBox* GetDefaultObj();

};

// 0x28 (0x248 - 0x220)
// Class SH.SHAnomaly
class ASHAnomaly : public AActor
{
public:
	uint8                                        Pad_1B99[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class ASHArtefact>               ArtefactClass;                                     // 0x228(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RespawnReadyTimeSaveData;                          // 0x230(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bisSpawnedSaveData;                                // 0x234(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsLoadedSaveData;                                 // 0x235(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAnomalyAchievementType           AnomalyAchievementType;                            // 0x236(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1BA2[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AnomalyParticleSystemTickUpdateTime;               // 0x238(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AnomalyParticleSystemTickUpdateDistance;           // 0x23C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AnomalyParticleSystemTickUpdateDistanceSQRT;       // 0x240(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1BA9[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHAnomaly* GetDefaultObj();

	void UpdateAnomalyParticleSystemTick();
	void TriggerAchievement(class ASHPlayerController* PlayerController);
	void SaveAnomaly(bool IsSpawned, float RespawnTime);
	void OnSaveLoaded(bool IsLoaded, bool IsSpawned, float RespawnTimeLeft);
	void EnableAnomalyParticleSystem();
	void DisableAnomalyParticleSystem();
};

// 0x28 (0xD8 - 0xB0)
// Class SH.SHAnomalyFishingComponent
class USHAnomalyFishingComponent : public UActorComponent
{
public:
	float                                        ArtefactSpawnChance;                               // 0xB0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DefaultArtefactSpawnChance;                        // 0xB4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ConstantRarityItemChance;                          // 0xB8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        NoneRarityItemChance;                              // 0xBC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CommonRarityItemChance;                            // 0xC0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        UncommonRarityItemChance;                          // 0xC4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        RareRarityItemChance;                              // 0xC8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LegendaryRarityItemChance;                         // 0xCC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ArtefactRarityItemChance;                          // 0xD0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1C49[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHAnomalyFishingComponent* GetDefaultObj();

	bool ShouldSpawnArtefact();
	void LoadSaveData(float SaveInfo);
	bool ItemCatched(class ASHItem* Item);
	float GetSaveData();
};

// 0x68 (0x470 - 0x408)
// Class SH.SHArmor
class ASHArmor : public ASHItem
{
public:
	enum class EArmorType                        ArmorType;                                         // 0x408(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CB4[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FDebuffProperties>             DebuffProperties;                                  // 0x410(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USHDebuff*>                     Debuffs;                                           // 0x420(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USHDebuff*>                     AppliedDebuffs;                                    // 0x430(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class ASHEffect>>         EffectsClasses;                                    // 0x440(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ASHEffect*>                     AppliedEffects;                                    // 0x450(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASHCharacter*                          MyPawn;                                            // 0x460(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         _initialized;                                      // 0x468(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1CCB[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHArmor* GetDefaultObj();

	void OnRep_MyPawn();
	void DetachMeshesMulticast();
	void DetachMeshesLocal();
	void AttachMeshesMulticast();
	void AttachMeshesLocal();
};

// 0x10 (0x480 - 0x470)
// Class SH.SHArmor_Backpack
class ASHArmor_Backpack : public ASHArmor
{
public:
	int32                                        UpgradeSlotCount;                                  // 0x470(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BonusWeight;                                       // 0x474(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                         BackpackMesh;                                      // 0x478(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ASHArmor_Backpack* GetDefaultObj();

};

// 0x8 (0x478 - 0x470)
// Class SH.SHArmor_Hat
class ASHArmor_Hat : public ASHArmor
{
public:
	class USkeletalMesh*                         HatMesh;                                           // 0x470(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ASHArmor_Hat* GetDefaultObj();

};

// 0xA8 (0x518 - 0x470)
// Class SH.SHArtefact
class ASHArtefact : public ASHArmor
{
public:
	class UParticleSystemComponent*              PickupMeshParticleSystem;                          // 0x470(0x8)(Edit, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FArtifactDebuffProperties>     DebuffProperties1;                                 // 0x478(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FArtifactDebuffProperties>     DebuffProperties2;                                 // 0x488(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FArtifactDebuffProperties>     DebuffProperties3;                                 // 0x498(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FArtifactDebuffProperties>     DebuffProperties4;                                 // 0x4A8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FArtifactDebuffProperties>     DebuffProperties5;                                 // 0x4B8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FArtifactDebuffProperties>     DebuffProperties6;                                 // 0x4C8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FArtifactDebuffProperties>     DebuffProperties7;                                 // 0x4D8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FArtifactDebuffProperties>     DebuffProperties8;                                 // 0x4E8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FArtifactDebuffProperties>     DebuffProperties9;                                 // 0x4F8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FArtifactDebuffProperties>     DebuffProperties10;                                // 0x508(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ASHArtefact* GetDefaultObj();

	TArray<struct FDebuffProperties> GetPropertiesFor(struct FItemLifetimeData& Data);
	TArray<struct FDebuffProperties> GetCurrentProperties();
	void GeneratePropertiesFor(class ASHPlayerCharacter* Player);
};

// 0x28 (0x50 - 0x28)
// Class SH.SHSpecialMove
class USHSpecialMove : public UObject
{
public:
	float                                        StaminaCost;                                       // 0x28(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAffectedBySenseiMod;                              // 0x2C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1D9F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ASHCharacter*                          OwnerCharacter;                                    // 0x30(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ASHPlayerCharacter*                    OwnerPlayerCharacter;                              // 0x38(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1DA1[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHSpecialMove* GetDefaultObj();

	void Start();
	void ServerStart();
	void MulticastStart();
	bool IsPlaying();
	bool CanBeTerminated();
	bool CanBePlayed();
};

// 0x48 (0x98 - 0x50)
// Class SH.SHAttack_Dodge
class USHAttack_Dodge : public USHSpecialMove
{
public:
	struct FWeaponAnimMontageInfo                LeftAnimation;                                     // 0x50(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FWeaponAnimMontageInfo                RightAnimation;                                    // 0x68(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FWeaponAnimMontageInfo                BackAnimation;                                     // 0x80(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class USHAttack_Dodge* GetDefaultObj();

	void ServerRight();
	void ServerLeft();
	void ServerBack();
	void MulticastRight();
	void MulticastLeft();
	void MulticastBack();
};

// 0x68 (0xB8 - 0x50)
// Class SH.SHAttack_Rolldown
class USHAttack_Rolldown : public USHSpecialMove
{
public:
	struct FWeaponDetailedAnimMontageInfo        RolldownMontage;                                   // 0x50(0x60)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class ASHLostControlEffect>      LostControlClass;                                  // 0xB0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class USHAttack_Rolldown* GetDefaultObj();

};

// 0x98 (0xC8 - 0x30)
// Class SH.SHCombatAction
class USHCombatAction : public USHAction
{
public:
	TArray<struct FAttackActionInfo>             Attacks;                                           // 0x30(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E09[0x78];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<uint8>                                AnimIDs;                                           // 0xB8(0x10)(Net, ZeroConstructor, RepNotify, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class USHCombatAction* GetDefaultObj();

	void OnRep_AnimIDs();
	void IncrementAnimID(uint8 AttackID);
	struct FCombatActionAnimSet GetCurrentAnimSet(uint8 AttackID);
};

// 0x38 (0x100 - 0xC8)
// Class SH.SHAttackAction
class USHAttackAction : public USHCombatAction
{
public:
	uint8                                        Pad_1E30[0x38];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHAttackAction* GetDefaultObj();

	void UnsetPowerAttack();
	void SetPowerAttack(const struct FWeaponAnimMontageInfo& PowerAnimInfo);
};

// 0x0 (0x308 - 0x308)
// Class SH.SHBaseGameMode
class ASHBaseGameMode : public AGameMode
{
public:

	static class UClass* StaticClass();
	static class ASHBaseGameMode* GetDefaultObj();

};

// 0x8 (0x228 - 0x220)
// Class SH.SHBaseScreamer
class ASHBaseScreamer : public AActor
{
public:
	enum class ETimeOfDayType                    TimeOfDayType;                                     // 0x220(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bScreamerEnabled;                                  // 0x221(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bMorningEnabled;                                   // 0x222(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bTwilightEnabled;                                  // 0x223(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bNightEnabled;                                     // 0x224(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1E4B[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHBaseScreamer* GetDefaultObj();

};

// 0x0 (0x408 - 0x408)
// Class SH.SHBlankItem
class ASHBlankItem : public ASHItem
{
public:

	static class UClass* StaticClass();
	static class ASHBlankItem* GetDefaultObj();

};

// 0x8 (0xD0 - 0xC8)
// Class SH.SHBlockAction
class USHBlockAction : public USHCombatAction
{
public:
	uint8                                        Pad_1E6B[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHBlockAction* GetDefaultObj();

	void OnBlockHit();
	void OnBlockBroken();
};

// 0xD0 (0x4F8 - 0x428)
// Class SH.SHButton
class USHButton : public UButton
{
public:
	class FText                                  Text;                                              // 0x428(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FSlateFontInfo                        TextFont;                                          // 0x440(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                           TextColorAndOpacity;                               // 0x490(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	struct FVector2D                             TextShadowOffset;                                  // 0x4B8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          TextShadowColorAndOpacity;                         // 0x4C0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMargin                               TextMargin;                                        // 0x4D0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class USlateWidgetStyleAsset*                CustomStyle;                                       // 0x4E0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E88[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHButton* GetDefaultObj();

	void SetTextColorAndOpacity(const struct FSlateColor& Color);
	struct FSlateColor GetTextColorAndOpacity();
};

// 0x8 (0x228 - 0x220)
// Class SH.SHCableActor
class ASHCableActor : public AActor
{
public:
	class USHCableComponent*                     CableComponent;                                    // 0x220(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ASHCableActor* GetDefaultObj();

};

// 0x20 (0x4E0 - 0x4C0)
// Class SH.SHCableComponent
class USHCableComponent : public UCableComponent
{
public:
	uint8                                        Pad_1EF9[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVector>                       SavedParticles;                                    // 0x4C8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1EFB[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHCableComponent* GetDefaultObj();

};

// 0x10 (0x620 - 0x610)
// Class SH.SHCharacterMovementComponent
class USHCharacterMovementComponent : public UCharacterMovementComponent
{
public:
	uint8                                        Pad_1F18[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHCharacterMovementComponent* GetDefaultObj();

	bool CanUnCrouch();
};

// 0x50 (0x100 - 0xB0)
// Class SH.SHCharacterReactionsComponent
class USHCharacterReactionsComponent : public UActorComponent
{
public:
	TArray<struct FCharacterReactionProperties>  Properties;                                        // 0xB0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASHPlayerCharacter*                    OwnerCharacter;                                    // 0xC0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerController*                     OwnerController;                                   // 0xC8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APlayerCameraManager*                  OwnerCameraManager;                                // 0xD0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F5E[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TraceDistance;                                     // 0xE8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TraceRate;                                         // 0xEC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F60[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        VolumeCooldown;                                    // 0xF8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bVolumeOnCooldown;                                 // 0xFC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F66[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHCharacterReactionsComponent* GetDefaultObj();

	void ApplyCharacterReactionVolume(const TArray<struct FCharacterReactionVariant>& Variants);
	void ApplyCharacterReaction(const TArray<struct FCharacterReactionVariant>& Variants);
};

// 0x10 (0x230 - 0x220)
// Class SH.SHCharacterReactionsVolume
class ASHCharacterReactionsVolume : public AActor
{
public:
	TArray<struct FCharacterReactionVariant>     CharacterReactionVariants;                         // 0x220(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ASHCharacterReactionsVolume* GetDefaultObj();

};

// 0x0 (0x220 - 0x220)
// Class SH.SHChatManager
class ASHChatManager : public AActor
{
public:

	static class UClass* StaticClass();
	static class ASHChatManager* GetDefaultObj();

	void Unstuck(class ASHPlayerController* PlayerController);
	void Teleport(class ASHPlayerController* PlayerController, float X, float Y);
	void Suicide(class ASHPlayerController* PlayerController);
	void StatGameClient(class ASHPlayerController* PlayerController);
	void StatGame(class ASHPlayerController* PlayerController);
	void SkipPrologue(class ASHPlayerController* PlayerController);
	void SkipActiveTasks(class ASHPlayerController* PlayerController);
	void SimulateFractions(class ASHPlayerController* PlayerController);
	void SetTimeOfDay(class ASHPlayerController* PlayerController, float NewTimeOfDay);
	void Menu(class ASHPlayerController* PlayerController);
	void Login(class ASHPlayerController* PlayerController, const class FString& Password);
	void LogFractions(class ASHPlayerController* PlayerController);
	void KillAllAi(class ASHPlayerController* PlayerController);
	void God(class ASHPlayerController* PlayerController);
	void GiveItemsQuest(class ASHPlayerController* PlayerController);
	void GiveItems(class ASHPlayerController* PlayerController);
	void GameDifficulty(class ASHPlayerController* PlayerController);
	void EnableUV(class ASHPlayerController* PlayerController);
	void EnableAiDebug(class ASHPlayerController* PlayerController);
	void DisableUV(class ASHPlayerController* PlayerController);
	void DisableAiDebug(class ASHPlayerController* PlayerController);
};

// 0xB8 (0x528 - 0x470)
// Class SH.SHChestArmor
class ASHChestArmor : public ASHArmor
{
public:
	struct FChestArmorMeshesList                 ChestArmorMeshesList;                              // 0x470(0xB0)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                        DurabilityTakeHitCost;                             // 0x520(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2038[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHChestArmor* GetDefaultObj();

};

// 0x138 (0x260 - 0x128)
// Class SH.SHCombatComponent
class USHCombatComponent : public USHActionsComponent
{
public:
	TMap<enum class ECombatActionType, TSubclassOf<class USHCombatAction>> AvailableCombatClasses;                            // 0x128(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, NativeAccessSpecifierPublic)
	float                                        ComboDelay;                                        // 0x178(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_208F[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSet<struct FCombo>                          Combos;                                            // 0x188(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	uint8                                        Pad_2090[0x88];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHCombatComponent* GetDefaultObj();

	void StopCombatAction(enum class ECombatActionType CombatActionT);
	void ServerStopCombatAction(enum class ECombatActionType CombatActionT);
	void ServerPlayCombatAction(enum class ECombatActionType CombatActionT);
	void ServerInterruptCombatAction(enum class ECombatActionType CombatActionT);
	void PlayCombatAction(enum class ECombatActionType CombatActionT);
	void MulticastStopCombatAction(enum class ECombatActionType CombatActionT);
	void MulticastPlayCombatAction(enum class ECombatActionType CombatActionT);
	void MulticastInterruptCombatAction(enum class ECombatActionType CombatActionT);
	void InterruptCombatAction(enum class ECombatActionType CombatActionT);
	bool CanBePlayed(enum class ECombatActionType CombatActionT);
};

// 0x70 (0x120 - 0xB0)
// Class SH.SHCombatManager
class USHCombatManager : public UActorComponent
{
public:
	float                                        PowerAttackInputDelay;                             // 0xB0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_20BF[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class USHSpecialMove>            RolldownClass;                                     // 0xB8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class USHSpecialMove>            DodgeClass;                                        // 0xC0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class USHMeleeAttack>            FromJumpAttackClass;                               // 0xC8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASHCharacter*                          OwnerCharacter;                                    // 0xD0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ASHPlayerCharacter*                    OwnerPlayerCharacter;                              // 0xD8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ASHWeapon_MeleeBase*                   CharacterMeleeWeapon;                              // 0xE0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USHMeleeAttack*                        CurrentMeleeAttack;                                // 0xE8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USHSpecialMove*                        CurrentSpecialMove;                                // 0xF0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_20C3[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class USHSpecialMove*                        RolldownInstance;                                  // 0x110(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USHSpecialMove*                        DodgeInstance;                                     // 0x118(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class USHCombatManager* GetDefaultObj();

	void TerminateAll();
	void StopWeaponFire();
	void StopWeaponAltFire();
	void StopSpartanAttack();
	void StartWeaponFire();
	void StartWeaponAltFire();
	void StartSpartanAttack();
	void OnStopThrow();
	void OnStartThrow();
	void OnCharacterWeaponChanged();
	bool MakeRolldown();
	bool MakeFromStealth(class ASHCharacter* Target);
	bool MakeDodge();
	bool CanBePlayed(enum class EMeleeAttackType Type);
};

// 0x98 (0x148 - 0xB0)
// Class SH.SHCraftComponent
class USHCraftComponent : public UActorComponent
{
public:
	uint8                                        Pad_217B[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UDataTable*                            CraftRecipesData;                                  // 0xC0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECraftRequiredEquipment           CurrentCraftEquipment;                             // 0xC8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_217C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class ECraftRequiredEquipment>   ActiveCraftEquipments;                             // 0xD0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TransmutationExpertCurrentValue;                   // 0xE0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TransmutationExpertModifiedValue;                  // 0xE4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TransmutationMasterCurrentValue;                   // 0xE8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TransmutationMasterModifiedValue;                  // 0xEC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ScavengerExpertCurrentValue;                       // 0xF0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ScavengerExpertModifiedValue;                      // 0xF4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ScavengerMasterCurrentValue;                       // 0xF8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ScavengerMasterModifiedValue;                      // 0xFC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         SkillDisassembleItemsCurrentValue;                 // 0x100(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2181[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ItemDurabilityPerCraft;                            // 0x104(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class ASHProjectileItem>> DemomanIllusionistItems;                           // 0x108(0x10)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ContextString;                                     // 0x118(0x10)(ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FRecipeLearnKey>               LearnedRecipes;                                    // 0x128(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, RepNotify, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ASHPlayerCharacter*                    OwnerPlayerCharacter;                              // 0x138(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCraftMasterOneLearned;                            // 0x140(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCraftMasterTwoLearned;                            // 0x141(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLocksmithLearned;                                 // 0x142(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDemomanIllusionistLearned;                        // 0x143(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2189[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHCraftComponent* GetDefaultObj();

	void UnLearnRecipeByKey(const struct FRecipeLearnKey& Key);
	void UnLearnRecipe(int32 RecipeID);
	void ServerCraftModForSlot(class USHInventorySlot* Slot, int32 RecipeID);
	void ServerCraft(int32 RecipeID, int32 Count);
	bool RequiredCraftingToolFor(int32 RecipeID);
	void OnUnlearnAllSkills();
	void OnTransmutationMasterSkillLearned();
	void OnTransmutationExpertSkillLearned();
	void OnScavengerMasterSkillLearned();
	void OnScavengerExpertSkillLearned();
	void OnRep_LearnedRecipes();
	void OnRemoveCraftZone(enum class ECraftRequiredEquipment CraftRequiredEquipment);
	void OnDisassembleItemsSkillLearned();
	void OnAddCraftZone(enum class ECraftRequiredEquipment CraftRequiredEquipment);
	void LoadSaveData(const TArray<struct FRecipeLearnKey>& SaveInfo);
	void LearnRecipeByKey(const struct FRecipeLearnKey& Key, bool HideNotify);
	void LearnRecipe(int32 RecipeID, bool HideNotify);
	bool IsRecipeLearnedByKey(const struct FRecipeLearnKey& Key);
	bool IsRecipeLearned(int32 RecipeID);
	int32 HaveWeaponsFor(int32 RecipeID);
	bool HaveSpaceFor(int32 RecipeID);
	int32 HaveCraftingToolsFor(int32 RecipeID);
	int32 HaveComponentsFor(int32 RecipeID);
	float GetTransmutationChance();
	TArray<struct FRecipeLearnKey> GetSaveData();
	struct FCraftRecipeData GetRecipe(int32 RecipeID, bool* Result);
	float GetDisassembleBonusModifier();
	float GetDetailsPriceModifier();
	class ASHInventory* GetCharacterInventory();
	TArray<int32> GetAllLearnedRecipes();
	bool CraftModForSlot(class USHInventorySlot* Slot, int32 RecipeID);
	bool Craft(int32 RecipeID, int32 Count);
	bool CanDisassemble();
	int32 CanCraftModForSlot(int32 RecipeID, class USHInventorySlot* Slot);
	int32 CanCraft(int32 RecipeID);
};

// 0x8 (0x228 - 0x220)
// Class SH.SHCraftEquipmentVolume
class ASHCraftEquipmentVolume : public AActor
{
public:
	enum class ECraftRequiredEquipment           CraftEquipment;                                    // 0x220(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_219B[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHCraftEquipmentVolume* GetDefaultObj();

	void PlayerLeave(class ASHPlayerCharacter* Character);
	void PlayerEnter(class ASHPlayerCharacter* Character);
	void OnEndOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnBeginOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
};

// 0x8 (0x410 - 0x408)
// Class SH.SHCraftingTool
class ASHCraftingTool : public ASHItem
{
public:
	bool                                         bInfiniteDurability;                               // 0x408(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_21A3[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHCraftingTool* GetDefaultObj();

};

// 0x38 (0x258 - 0x220)
// Class SH.SHCraftTable
class ASHCraftTable : public AActor
{
public:
	uint8                                        Pad_21B0[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMeshComponent*                  CraftTableMesh;                                    // 0x228(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECraftTableState                  CurrentState;                                      // 0x230(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, EditConst, SaveGame, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECraftRequiredEquipment           CurrentCraftEquipment;                             // 0x231(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECraftRequiredEquipment           LastCurrentCraftEquipment;                         // 0x232(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECraftTableState                  DefaultState;                                      // 0x233(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECraftTableState                  MaximumState;                                      // 0x234(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_21B4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMesh*                           BrokenStateMesh;                                   // 0x238(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           NormalStateMesh;                                   // 0x240(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           UpgradedStateMesh;                                 // 0x248(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECraftRequiredEquipment           BrokenVolumeType;                                  // 0x250(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECraftRequiredEquipment           NormalVolumeType;                                  // 0x251(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECraftRequiredEquipment           UpgradedVolumeType;                                // 0x252(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLoaded;                                           // 0x253(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_21B6[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHCraftTable* GetDefaultObj();

	void UpdateCraftTableMesh();
	void UpdateCraftEquipment();
	void SetState(enum class ECraftTableState NewState);
	void OnUpdateCraftTable();
	void OnRep_CurrentState();
	void OnCraftRequiredEquipmentUpdated();
	void IncreaseState();
};

// 0x88 (0xB8 - 0x30)
// Class SH.SHCreateSessionCallbackProxy
class USHCreateSessionCallbackProxy : public UOnlineBlueprintCallProxyBase
{
public:
	FMulticastInlineDelegateProperty_            OnSuccess;                                         // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFailure;                                         // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FString                                GameName;                                          // 0x50(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Password;                                          // 0x60(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_21C2[0x48];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHCreateSessionCallbackProxy* GetDefaultObj();

	class USHCreateSessionCallbackProxy* CreateSessionWithSettings(class UObject* WorldContextObject, class APlayerController* PlayerController, int32 PublicConnections, bool bUseLAN, const class FString& GameName, const class FString& Password);
};

// 0x0 (0x28 - 0x28)
// Class SH.SHEvent
class USHEvent : public UObject
{
public:

	static class UClass* StaticClass();
	static class USHEvent* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class SH.SHCuringEvent
class USHCuringEvent : public USHEvent
{
public:
	enum class ECuringType                       CuringType;                                        // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_21C7[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHCuringEvent* GetDefaultObj();

	class USHCuringEvent* CreateCuringEvent(enum class ECuringType NewCuringType, class AActor* OwnerActor);
};

// 0xD0 (0x180 - 0xB0)
// Class SH.SHCustomizationComponent
class USHCustomizationComponent : public UActorComponent
{
public:
	TArray<struct FMorphCategoryList>            Morphs;                                            // 0xB0(0x10)(Edit, BlueprintVisible, Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EmotionsChance;                                    // 0xC0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_21F5[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FMorphCategoryList>            Emotions;                                          // 0xC8(0x10)(Edit, BlueprintVisible, Net, ZeroConstructor, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCustomizationItem>            Hairs;                                             // 0xD8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCustomizationItem>            Mustaches;                                         // 0xE8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCustomizationItem>            Eyes;                                              // 0xF8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                  EyeColors;                                         // 0x108(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FLinearColor>                  HairColors;                                        // 0x118(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCustomizationItem>            Faces;                                             // 0x128(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                         HatMesh;                                           // 0x138(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              HairsDynamicMaterial;                              // 0x140(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              MustachesDynamicMaterial;                          // 0x148(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              FaceDynamicMaterial;                               // 0x150(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              EyeDynamicMaterial;                                // 0x158(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        HairIndex;                                         // 0x160(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        HairColorIndex;                                    // 0x164(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MustacheIndex;                                     // 0x168(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        EyesIndex;                                         // 0x16C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        EyeColorIndex;                                     // 0x170(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FaceIndex;                                         // 0x174(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Age;                                               // 0x178(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2203[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHCustomizationComponent* GetDefaultObj();

	void SetMustacheIndex(int32 Index);
	void SetHatMesh(class USkeletalMesh* NewMesh);
	void SetHairIndex(int32 Index);
	void SetHairColorsIndex(int32 Index);
	void SetFaceIndex(int32 Index);
	void SetEyeIndex(int32 Index);
	void SetEyeColorsIndex(int32 Index);
	void SetAge(float NewAge);
	void ApplyMorphs();
	void ApplyCustomization();
};

// 0x10 (0x50 - 0x40)
// Class SH.SHDamageType
class USHDamageType : public UDamageType
{
public:
	class UForceFeedbackEffect*                  HitForceFeedback;                                  // 0x40(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UForceFeedbackEffect*                  KilledForceFeedback;                               // 0x48(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class USHDamageType* GetDefaultObj();

	enum class EDamageType GetDamageType(class UDamageType* DamageType);
};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_AggrWorldEvent
class USHDamageType_AggrWorldEvent : public USHDamageType
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_AggrWorldEvent* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_Anomaly
class USHDamageType_Anomaly : public USHDamageType
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_Anomaly* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_Bleeding
class USHDamageType_Bleeding : public USHDamageType
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_Bleeding* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_Melee
class USHDamageType_Melee : public USHDamageType
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_Melee* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_Butcher
class USHDamageType_Butcher : public USHDamageType_Melee
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_Butcher* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_Explode
class USHDamageType_Explode : public USHDamageType
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_Explode* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_Fall
class USHDamageType_Fall : public USHDamageType
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_Fall* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_GrutchSpecial
class USHDamageType_GrutchSpecial : public USHDamageType_Melee
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_GrutchSpecial* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_Kick
class USHDamageType_Kick : public USHDamageType
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_Kick* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_MadmanSpecial
class USHDamageType_MadmanSpecial : public USHDamageType_Melee
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_MadmanSpecial* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_MeleeBleeding
class USHDamageType_MeleeBleeding : public USHDamageType_Melee
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_MeleeBleeding* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_MeleeElectric
class USHDamageType_MeleeElectric : public USHDamageType_Melee
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_MeleeElectric* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_MeleeFire
class USHDamageType_MeleeFire : public USHDamageType_Melee
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_MeleeFire* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_MeleeForged
class USHDamageType_MeleeForged : public USHDamageType
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_MeleeForged* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_MeleeIce
class USHDamageType_MeleeIce : public USHDamageType_Melee
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_MeleeIce* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_MeleeMod
class USHDamageType_MeleeMod : public USHDamageType
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_MeleeMod* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_MeleeModBleeding
class USHDamageType_MeleeModBleeding : public USHDamageType_MeleeMod
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_MeleeModBleeding* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_MeleeModElectric
class USHDamageType_MeleeModElectric : public USHDamageType_MeleeMod
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_MeleeModElectric* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_MeleeModFire
class USHDamageType_MeleeModFire : public USHDamageType_MeleeMod
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_MeleeModFire* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_MeleeModForged
class USHDamageType_MeleeModForged : public USHDamageType_MeleeMod
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_MeleeModForged* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_MeleeModIce
class USHDamageType_MeleeModIce : public USHDamageType_MeleeMod
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_MeleeModIce* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_MeleeModPoison
class USHDamageType_MeleeModPoison : public USHDamageType_MeleeMod
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_MeleeModPoison* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_MeleePoison
class USHDamageType_MeleePoison : public USHDamageType_Melee
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_MeleePoison* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_Molotov
class USHDamageType_Molotov : public USHDamageType
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_Molotov* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_Oxygen
class USHDamageType_Oxygen : public USHDamageType
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_Oxygen* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_Physical
class USHDamageType_Physical : public USHDamageType
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_Physical* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_Poisoning
class USHDamageType_Poisoning : public USHDamageType
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_Poisoning* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_QTE
class USHDamageType_QTE : public USHDamageType
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_QTE* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_QTE_Bleeding
class USHDamageType_QTE_Bleeding : public USHDamageType_QTE
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_QTE_Bleeding* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_QTE_Burning
class USHDamageType_QTE_Burning : public USHDamageType_QTE
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_QTE_Burning* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_QTE_Poisoning
class USHDamageType_QTE_Poisoning : public USHDamageType_QTE
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_QTE_Poisoning* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_QTE_Shocking
class USHDamageType_QTE_Shocking : public USHDamageType_QTE
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_QTE_Shocking* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_QTE_SpecialMob
class USHDamageType_QTE_SpecialMob : public USHDamageType_QTE
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_QTE_SpecialMob* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_Rifle
class USHDamageType_Rifle : public USHDamageType
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_Rifle* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_RifleFire
class USHDamageType_RifleFire : public USHDamageType_Rifle
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_RifleFire* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_Stone
class USHDamageType_Stone : public USHDamageType
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_Stone* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_Thermal
class USHDamageType_Thermal : public USHDamageType
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_Thermal* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_Throw
class USHDamageType_Throw : public USHDamageType
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_Throw* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_ThrowBleeding
class USHDamageType_ThrowBleeding : public USHDamageType_Throw
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_ThrowBleeding* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_ThrowElectric
class USHDamageType_ThrowElectric : public USHDamageType_Throw
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_ThrowElectric* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_ThrowFire
class USHDamageType_ThrowFire : public USHDamageType_Throw
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_ThrowFire* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_ThrowIce
class USHDamageType_ThrowIce : public USHDamageType_Throw
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_ThrowIce* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_ThrowPoison
class USHDamageType_ThrowPoison : public USHDamageType_Throw
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_ThrowPoison* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class SH.SHDamageType_VanogaPuke
class USHDamageType_VanogaPuke : public USHDamageType_Melee
{
public:

	static class UClass* StaticClass();
	static class USHDamageType_VanogaPuke* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class SH.SHDayNightInterface
class ISHDayNightInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class ISHDayNightInterface* GetDefaultObj();

	bool OnTimeOfDayTwilight();
	bool OnTimeOfDayNight();
	bool OnTimeOfDayMorning();
};

// 0x8 (0x30 - 0x28)
// Class SH.SHDebuff
class USHDebuff : public USHEvent
{
public:
	enum class EPlayerStatModificator            PlayerStatMod;                                     // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22AF[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHDebuff* GetDefaultObj();

};

// 0x18 (0x240 - 0x228)
// Class SH.SHDecalActor
class ASHDecalActor : public ADecalActor
{
public:
	class FText                                  DecalText;                                         // 0x228(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ASHDecalActor* GetDefaultObj();

};

// 0x130 (0x350 - 0x220)
// Class SH.SHEffect
class ASHEffect : public AActor
{
public:
	class FText                                  Name;                                              // 0x220(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                  ClassDescription;                                  // 0x238(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x250(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                        ApplyChance;                                       // 0x268(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22C5[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FDebuffProperties>             DebuffProperties;                                  // 0x270(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USHDebuff*>                     Debuffs;                                           // 0x280(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USHDebuff*>                     AppliedDebuffs;                                    // 0x290(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UObject*>                       Blendables;                                        // 0x2A0(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USoundCue*>                     Sounds;                                            // 0x2B0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTraumaProperties>             Trauma;                                            // 0x2C0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USoundCue*>                     OnStartSounds;                                     // 0x2D0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCharacterReactionVariant>     CharacterReactionVariants;                         // 0x2E0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDelayFirstDamageTick;                             // 0x2F0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22CC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TickTime;                                          // 0x2F4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DamagePerTick;                                     // 0x2F8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PsyDamagePerTick;                                  // 0x2FC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HealPerTickFlat;                                   // 0x300(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HealPerTickPercent;                                // 0x304(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class USHDamageType>             DamageTypeClass;                                   // 0x308(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22D1[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class ASHPlayerCharacter*                    OwnerCharacter;                                    // 0x320(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUnique;                                           // 0x328(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_22D3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LifeTime;                                          // 0x32C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        EffectStartTime;                                   // 0x330(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseSave;                                          // 0x334(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDestroyOnFinish;                                  // 0x335(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         _initialized;                                      // 0x336(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_22D5[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UAudioComponent*>               ActiveAudioComponents;                             // 0x338(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         _running;                                          // 0x348(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_22D7[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHEffect* GetDefaultObj();

	bool UseSave();
	void UpdateLifeTime(float NewLifeTime);
	void Stop();
	void Start();
	void SetRunningValue(bool NewRunning);
	void SetRunning(bool NewRunning);
	void OnRep_Running();
	bool IsUnique();
	bool IsRunning();
	float GetLifeTime();
	float GetEffectStartTime();
	class ASHEffect* CreateEffect(TSubclassOf<class ASHEffect> EffectClass, class AActor* OwnerActor);
};

// 0x8 (0x358 - 0x350)
// Class SH.SHDisease
class ASHDisease : public ASHEffect
{
public:
	enum class EDiseaseType                      DiseaseType;                                       // 0x350(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22DB[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHDisease* GetDefaultObj();

};

// 0x8 (0x358 - 0x350)
// Class SH.SHEffect_Buff
class ASHEffect_Buff : public ASHEffect
{
public:
	enum class EEffectBuffType                   BuffType;                                          // 0x350(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22E0[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHEffect_Buff* GetDefaultObj();

};

// 0x10 (0x360 - 0x350)
// Class SH.SHEffect_HealOverTime
class ASHEffect_HealOverTime : public ASHEffect
{
public:
	float                                        WorkTime;                                          // 0x350(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HealAmount;                                        // 0x354(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22E3[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHEffect_HealOverTime* GetDefaultObj();

};

// 0x90 (0x140 - 0xB0)
// Class SH.SHEffectsManager
class USHEffectsManager : public UActorComponent
{
public:
	uint8                                        Pad_22FF[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ASHEffect*>                     _activeEffects;                                    // 0xB8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class ASHDisease*>                    AllDiseases;                                       // 0xC8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ASHCharacter*                          OwnerCharacter;                                    // 0xD8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2301[0x50];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UObject*>                       ActiveBlendables;                                  // 0x130(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class USHEffectsManager* GetDefaultObj();

	bool RemoveEffect(class ASHEffect* Effect);
	bool HaveDisease();
	TArray<class ASHDisease*> GetAllDiseases();
	TArray<class ASHEffect*> GetActiveEffects();
	bool ClientRemoveEffect(class ASHEffect* Effect);
	bool ClientAddEffect(class ASHEffect* Effect);
	bool AddEffect(class ASHEffect* Effect);
};

// 0x50 (0x270 - 0x220)
// Class SH.SHEnvironment
class ASHEnvironment : public AActor
{
public:
	float                                        DefaultTimeOfDay;                                  // 0x220(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDelayedAnimateDayNightCycle;                      // 0x224(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2327[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TimeOfDay;                                         // 0x228(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ServerTimeStamp;                                   // 0x22C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ServerTimeStampTick;                               // 0x230(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInitialized;                                      // 0x234(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2329[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        WorldEventSkyColor;                                // 0x238(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DayLength;                                         // 0x23C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETimeOfDayType                    TimeOfDayType;                                     // 0x240(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECycleType                        CycleType;                                         // 0x241(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETimeOfDayType                    LastTimeOfDayType;                                 // 0x242(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         AnimateDayNightCycle;                              // 0x243(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         RandomInitialTimeOfDay;                            // 0x244(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWeatherType                      LocalWeather;                                      // 0x245(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWeatherType                      LastInitializedLocalWeather;                       // 0x246(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideGlobalWeather;                            // 0x247(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EWeatherType                      GlobalWeather;                                     // 0x248(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_232A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        GlobalWeatherDuration;                             // 0x24C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSkyStressEventActive;                             // 0x250(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEffectsStressEventActive;                         // 0x251(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bQuestStressEventActive;                           // 0x252(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_232D[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnTimeSkip;                                        // 0x258(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_232E[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHEnvironment* GetDefaultObj();

	void UpdateDayNightInterface(class AActor* Actor);
	float TimeOfDayIntoRange();
	void StopQuestStressEvent();
	void StopGlobalWeather();
	void StartQuestStressEvent();
	void StartLocalWeatherBlueprintEvents();
	void StartGlobalWeather(enum class EWeatherType NewWeather, float Duration);
	void ServerDoRest(float Hours);
	void PendingTimeSkip(int32 Hours);
	bool OnWorldEventSkyColorUpdated();
	bool OnToxicRainWeatherStop();
	bool OnToxicRainWeatherStart();
	bool OnTimeOfDayTypeChange();
	bool OnSnowWeatherStop();
	bool OnSnowWeatherStart();
	bool OnSmallRainWeatherStop();
	bool OnSmallRainWeatherStart();
	bool OnSkyStressEventStopped();
	bool OnSkyStressEventStarted();
	void OnRep_WorldEventSkyColor();
	bool OnQuestStressEventStopped();
	bool OnQuestStressEventStarted();
	bool OnNoneWeatherStop();
	bool OnNoneWeatherStart();
	bool OnMediumRainWeatherStop();
	bool OnMediumRainWeatherStart();
	bool OnFogWeatherStop();
	bool OnFogWeatherStart();
	bool OnEffectsStressEventStopped();
	bool OnEffectsStressEventStarted();
	void OnCycleTypeChange();
	bool OnBigRainWeatherStop();
	bool OnBigRainWeatherStart();
	bool OnAshWeatherStop();
	bool OnAshWeatherStart();
	bool IsOverrideGlobalWeather();
	enum class ETimeOfDayType GetTimeOfDayType();
	int32 GetServerTimeStamp();
	float GetGlobalWeatherDuration();
	enum class EWeatherType GetGlobalWeather();
	float GetCurrentTimeInMilliseconds();
	float GetClampValue(float From, float To, float Step);
	bool ClampOriginalVariable(float& OriginalVariable, float GoalVariable, float Step);
};

// 0x30 (0x288 - 0x258)
// Class SH.SHEventTriggerVolume
class ASHEventTriggerVolume : public ATriggerVolume
{
public:
	int32                                        EventTimeLimit;                                    // 0x258(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CooldownTime;                                      // 0x25C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class USHQuestEvent>             EventClass;                                        // 0x260(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ASHQuestManager*                       Manager;                                           // 0x268(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USHQuestEvent*                         SpawnedEvent;                                      // 0x270(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_233A[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHEventTriggerVolume* GetDefaultObj();

	void SpawnEvent();
	void OnEventFinished(class USHQuest* Event);
	void OnEndOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnCooldownEnd();
	void OnBeginOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
};

// 0x18 (0x2A0 - 0x288)
// Class SH.SHEventDefenceTriggerVolume
class ASHEventDefenceTriggerVolume : public ASHEventTriggerVolume
{
public:
	class ASHLocationPoint*                      EnemySpawnPoint;                                   // 0x288(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASHLocationPoint*                      VictimSpawnPoint;                                  // 0x290(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2343[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHEventDefenceTriggerVolume* GetDefaultObj();

};

// 0x118 (0x1C8 - 0xB0)
// Class SH.SHEventsManager
class USHEventsManager : public UActorComponent
{
public:
	bool                                         bDebug;                                            // 0xB0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_234F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class USHDebuff*>                     ActiveDebuffs;                                     // 0xB8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2350[0x100];                                   // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHEventsManager* GetDefaultObj();

	bool RemoveTrauma(class USHTraumaEvent* Trauma);
	bool RemoveDebuff(class USHDebuff* Debuff);
	bool Remove(class USHCuringEvent* Curing);
	bool ApplyTraumaCuring(class USHTraumaCuringEvent* TraumaCuringEvent);
	bool ApplyTrauma(class USHTraumaEvent* Trauma);
	bool ApplyDebuff(class USHDebuff* Debuff);
	bool Apply(class USHCuringEvent* Curing);
};

// 0x0 (0x28 - 0x28)
// Class SH.SHExplorationInterface
class ISHExplorationInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class ISHExplorationInterface* GetDefaultObj();

	bool StopExploration(class ASHPlayerCharacter* PlayerCharacter);
	bool StartExploration(class ASHPlayerCharacter* PlayerCharacter);
	bool ShouldNotBeExplored(class ASHPlayerCharacter* PlayerCharacter);
	bool IsExplored();
	float GetExplorationTime();
	class USoundCue* GetExplorationSound();
};

// 0x88 (0xB8 - 0x30)
// Class SH.SHFindFrndsSessionsCallbackProxy
class USHFindFrndsSessionsCallbackProxy : public UOnlineBlueprintCallProxyBase
{
public:
	FMulticastInlineDelegateProperty_            OnSuccess;                                         // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFailure;                                         // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_235D[0x68];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHFindFrndsSessionsCallbackProxy* GetDefaultObj();

	class FString GetServerName(struct FBlueprintSessionResult& Result);
	int32 GetPingInMs(struct FBlueprintSessionResult& Result);
	int32 GetMaxPlayers(struct FBlueprintSessionResult& Result);
	int32 GetCurrentPlayers(struct FBlueprintSessionResult& Result);
	class USHFindFrndsSessionsCallbackProxy* FindFriendsSessions(class UObject* WorldContextObject, class APlayerController* PlayerController, const struct FOnlineSubsystemFriendInfo& FriendsList);
};

// 0x68 (0x98 - 0x30)
// Class SH.SHFindSessionsCallbackProxy
class USHFindSessionsCallbackProxy : public UOnlineBlueprintCallProxyBase
{
public:
	FMulticastInlineDelegateProperty_            OnSuccess;                                         // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFailure;                                         // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2368[0x48];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHFindSessionsCallbackProxy* GetDefaultObj();

	class FString GetServerName(struct FBlueprintSessionResult& Result);
	int32 GetPingInMs(struct FBlueprintSessionResult& Result);
	int32 GetMaxPlayers(struct FBlueprintSessionResult& Result);
	int32 GetCurrentPlayers(struct FBlueprintSessionResult& Result);
	class USHFindSessionsCallbackProxy* FindSessions(class UObject* WorldContextObject, class APlayerController* PlayerController, int32 MaxResults, bool bUseLAN, bool bUsePresence);
};

// 0x0 (0xC8 - 0xC8)
// Class SH.SHFinisherAction
class USHFinisherAction : public USHCombatAction
{
public:

	static class UClass* StaticClass();
	static class USHFinisherAction* GetDefaultObj();

};

// 0xB8 (0x2D8 - 0x220)
// Class SH.SHFlashLight
class ASHFlashLight : public AActor
{
public:
	class USceneComponent*                       Root;                                              // 0x220(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USpotLightComponent*                   Flashlight;                                        // 0x228(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                  LightConeMesh;                                     // 0x230(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                  CollideCone;                                       // 0x238(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsOn;                                              // 0x240(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         LastIsOn;                                          // 0x241(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2393[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ASHAICharacter*>                Characters;                                        // 0x248(0x10)(Edit, BlueprintVisible, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                    FlashlightMaterial;                                // 0x258(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstanceDynamic*              DynamicFlashlightMaterial;                         // 0x260(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASHPlayerCharacter*                    PlayerCharacter;                                   // 0x268(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASHPlayerState*                        OwnerPlayerState;                                  // 0x270(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFlashLightStage                  FlashLightStage;                                   // 0x278(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         FlashLightStageIsOn;                               // 0x279(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2396[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FullFlashLightStageIntensity;                      // 0x27C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MediumFlashLightStageEnergy;                       // 0x280(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MediumFlashLightStageIntensity;                    // 0x284(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LowFlashLightStageEnergy;                          // 0x288(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LowFlashLightStageIntensity;                       // 0x28C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EFlashLightMode                   FlashLightMode;                                    // 0x290(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2397[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Energy;                                            // 0x294(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        EnergyLosePerSecond;                               // 0x298(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        EnergyAddPerSecond;                                // 0x29C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        EnergyRegenerationDelay;                           // 0x2A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        HorrorFlashlightCooldown;                          // 0x2A4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bReadyForHorror;                                   // 0x2A8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bInHorrorVolume;                                   // 0x2A9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2398[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAudioComponent*                       TurnOnAudio;                                       // 0x2B0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAudioComponent*                       TurnOffAudio;                                      // 0x2B8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bInitialized;                                      // 0x2C0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bRegenerate;                                       // 0x2C1(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2399[0x16];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHFlashLight* GetDefaultObj();

	void UpdateHorror();
	void UpdateFlashlightStage();
	void UpdateEnergyRegeneration();
	void UpdateEnergyMaterial(float NewValue);
	void UpdateCharacters();
	void TurnOn();
	void TurnOff();
	void ToggleMode();
	void Toggle();
	void StopEnergyRegeneration();
	bool StartHorrorEvent();
	void StartEnergyRegenerationCallback();
	void StartEnergyRegeneration();
	void SetFlashlightStage(enum class EFlashLightStage NewFlashLightStage);
	void SetFlashLightMode(enum class EFlashLightMode NewFlashLightMode);
	void SetFlashLight(bool NewIsOn);
	void SetEnergy(float NewValue);
	void ServerToggleMode();
	void ServerToggle();
	void OnUltravioletMediumStage();
	void OnUltravioletLowStage();
	void OnUltravioletFullStage();
	void OnRep_isOn();
	void OnRep_FlashLightMode();
	void OnLeaveFlashlightHorrorVolume(class ASHFlashlightVolume* FlashlightVolume);
	void OnEnterFlashlightHorrorVolume(class ASHFlashlightVolume* FlashlightVolume);
	void OnEndOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnDefaultStage();
	void OnBeginOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	bool IsActive();
	void HorrorTimerHandleCallback();
	enum class EFlashLightMode GetFlashLightMode();
	void CharacterLeave(class ASHAICharacter* Character);
	void CharacterEnter(class ASHAICharacter* Character);
	bool CanUltraviolet();
};

// 0x0 (0x220 - 0x220)
// Class SH.SHFlashlightVolume
class ASHFlashlightVolume : public AActor
{
public:

	static class UClass* StaticClass();
	static class ASHFlashlightVolume* GetDefaultObj();

	void PlayerLeave(class ASHPlayerCharacter* Character);
	void PlayerEnter(class ASHPlayerCharacter* Character);
	void OnEndOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnBeginOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
};

// 0x68 (0x288 - 0x220)
// Class SH.SHFractionsManager
class ASHFractionsManager : public AActor
{
public:
	int32                                        MutantsFractionWeight;                             // 0x220(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaraudersFractionWeight;                           // 0x224(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NewLightFractionWeight;                            // 0x228(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MutantsDailyChange;                                // 0x22C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaraudersDailyChange;                              // 0x230(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NewLightDailyChange;                               // 0x234(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FLocationInvasionDescription>  InvadedLocations;                                  // 0x238(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<int32>                                LiberatedLocations;                                // 0x248(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsInvasionLoaded;                                 // 0x258(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23AB[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ASHLevelLocation*>              InvasionLoadingSubscribedLocations;                // 0x260(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MutantsFractionAggression;                         // 0x270(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaraudersFractionAggression;                       // 0x274(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NewLightFractionAggression;                        // 0x278(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FractionsWarDayChangeMin;                          // 0x27C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FractionsWarDayChangeMax;                          // 0x280(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23AC[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHFractionsManager* GetDefaultObj();

	void SimulateFractionsWarDayChange();
	void LiberateLocation(int32 LiberationLocationQuestID);
	bool IsLocationInvaded(class ASHLevelLocation* Location);
	bool IsInvasionLoaded(class ASHLevelLocation* Location);
	int32 GetNewLightFractionAggression();
	int32 GetMutantsFractionAggression();
	int32 GetMaraudersFractionAggression();
	void AddNewLightFractionAggression(int32 Value);
	void AddMutantsFractionAggression(int32 Value);
	void AddMaraudersFractionAggression(int32 Value);
	void AddFractionAggression(enum class EFractions Fraction, int32 Value);
};

// 0x270 (0x408 - 0x198)
// Class SH.SHGameInstance
class USHGameInstance : public UGameInstance
{
public:
	float                                        MasterAudioVolume;                                 // 0x198(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MusicAudioVolume;                                  // 0x19C(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SoundsAudioVolume;                                 // 0x1A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        VoiceAudioVolume;                                  // 0x1A4(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FOV;                                               // 0x1A8(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Gamma;                                             // 0x1AC(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MotionBlur;                                        // 0x1B0(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InvertYAxis;                                       // 0x1B4(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                SavedServerName;                                   // 0x1B8(0x10)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideCharacterModel;                               // 0x1C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisableIK;                                        // 0x1C9(0x1)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHardwareBenchmarkComplete;                        // 0x1CA(0x1)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisableTutorial;                                  // 0x1CB(0x1)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisableViewportMarks;                             // 0x1CC(0x1)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisableCameraShake;                               // 0x1CD(0x1)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideHud;                                          // 0x1CE(0x1)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23C0[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        GameType;                                          // 0x1D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsServer;                                          // 0x1D4(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsPrivate;                                         // 0x1D5(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23C1[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Password;                                          // 0x1D8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         HardMode;                                          // 0x1E8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23C2[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxPlayers;                                        // 0x1EC(0x4)(Edit, BlueprintVisible, ZeroConstructor, Config, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ServerName;                                        // 0x1F0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PublicIP;                                          // 0x200(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FServerID                             ServerID;                                          // 0x210(0x18)(NativeAccessSpecifierPublic)
	class ASHEnvironment*                        EnvironmentManager;                                // 0x228(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASHWorldEventsManager*                 WorldEventsManager;                                // 0x230(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASHChatManager*                        ChatManager;                                       // 0x238(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASHRadioManager*                       RadioManager;                                      // 0x240(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASHPersonalRoomsManager*               PersonalRoomsManager;                              // 0x248(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASHQuestManager*                       QuestManager;                                      // 0x250(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASHMapManager*                         MapManager;                                        // 0x258(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASHFractionsManager*                   FractionsManager;                                  // 0x260(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23C3[0x38];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class USHWorldSaveData*                      WorldSaveDataInstance;                             // 0x2A0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWorldSaveData                        WorldSaveData;                                     // 0x2A8(0xC8)(NativeAccessSpecifierPublic)
	bool                                         bFirstAppearanceComplete;                          // 0x370(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23C4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameDifficultySettings               GameDifficultySettings;                            // 0x374(0x50)(Edit, BlueprintVisible, Config, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_23C5[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USHSteamManager*                       SteamManager;                                      // 0x3D0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsSteamOverlayActive;                              // 0x3D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23C6[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnSteamOverlayIsEnabledEvent;                      // 0x3E0(0x10)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnSteamOverlayIsDisabledEvent;                     // 0x3F0(0x10)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         bSaveSlotInitialized;                              // 0x400(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESaveSlot                         CurrentSaveSlot;                                   // 0x401(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOldSavesRestored;                                 // 0x402(0x1)(Edit, BlueprintVisible, ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23C7[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHGameInstance* GetDefaultObj();

	void UpdateSession();
	void StopSessionUpdate();
	void StartSessionUpdate();
	void ShowSteamInviteFriendsOverlay();
	void SetWeaponDurabilityTakeHitCost(float NewValue);
	void SetStatusEffectsDamageModifier(float NewValue);
	void SetShowMapPosition(bool bNewValue);
	void SetShowLeaveNotifications(bool bNewValue);
	void SetShowJoinNotifications(bool bNewValue);
	void SetShowHud(bool bNewValue);
	void SetShowAim(bool bNewValue);
	void SetShowAiInfo(bool bNewValue);
	void SetSelfHealingType(enum class ESelfHealingType Type);
	void SetSaveSlot(enum class ESaveSlot NewSaveSlot);
	void SetQuestRewardExperienceModifier(float NewValue);
	void SetPveMode(bool bNewValue);
	void SetIncomingStressModifier(float NewValue);
	void SetHunterSpawnChance(float NewValue);
	void SetHideCharacterModel(bool bNewValue);
	void SetGameDifficultyPreset(enum class EGameDifficultyType Type);
	void SetGameDifficulty(float NewValue);
	void SetFullDropEnabled(bool bNewValue);
	void SetEventsDamageModifier(float NewValue);
	void SetDeathMoneyDropRate(float NewValue);
	void SetDayLength(float NewValue);
	void SetBaseRequirementsSpendingModifier(float NewValue);
	void SetArmorDurabilityTakeHitCost(float NewValue);
	void SetAnomalyDamageModifier(float NewValue);
	void SetAiHealthModifier(float NewValue);
	void SetAiDamageModifier(float NewValue);
	void SetAggressiveWorldEventsChanceModifier(float NewValue);
	void SaveSettings();
	bool IsFirstAppearanceComplete();
	bool InitializeSteamManager();
	struct FSaveInfo GetSlotSaveInfo(enum class ESaveSlot SaveSlot, bool* Result);
	TArray<struct FSaveInfo> GetSaveInfoListSorted();
	TArray<struct FSaveInfo> GetSaveInfoList();
	enum class ESaveSlot GetCurrentSaveSlot();
	enum class ESaveSlot FindBestSaveSlot();
	void CompleteFirstAppearance();
};

// 0x38 (0x340 - 0x308)
// Class SH.SHGameMode
class ASHGameMode : public ASHBaseGameMode
{
public:
	bool                                         UseSave;                                           // 0x308(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForceUseRooms;                                     // 0x309(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23CD[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FString>                        DedicatedIgnoreLoadLevelNames;                     // 0x310(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bServerManagersSaveEnabled;                        // 0x320(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23CE[0xF];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FString>                        BannedPlayers;                                     // 0x330(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class ASHGameMode* GetDefaultObj();

	void SaveAll();
	void KickPlayer(class APlayerController* KickedPlayer, class FText& KickReason);
	class AActor* FindBasePlayerStart(class AController* Player, const class FString& IncomingName);
	void BanPlayer(class APlayerController* KickedPlayer, class FText& KickReason);
};

// 0x10 (0x248 - 0x238)
// Class SH.SHGameSession
class ASHGameSession : public AGameSession
{
public:
	uint8                                        Pad_23D0[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHGameSession* GetDefaultObj();

};

// 0x70 (0x300 - 0x290)
// Class SH.SHGameState
class ASHGameState : public AGameState
{
public:
	class USHPlayerOnlineComponent*              PlayerOnlineComponent;                             // 0x290(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnPlayerStateListUpdate;                           // 0x298(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class ASHAICombatDirector*                   AICombatDirector;                                  // 0x2A8(0x8)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSet<enum class EPlayerUIColor>              UsedPlayerColors;                                  // 0x2B0(0x50)(NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class ASHGameState* GetDefaultObj();

};

// 0x0 (0x330 - 0x330)
// Class SH.SHGameViewportClient
class USHGameViewportClient : public UGameViewportClient
{
public:

	static class UClass* StaticClass();
	static class USHGameViewportClient* GetDefaultObj();

};

// 0x40 (0x70 - 0x30)
// Class SH.SHGetFriendsCallbackProxy
class USHGetFriendsCallbackProxy : public UOnlineBlueprintCallProxyBase
{
public:
	FMulticastInlineDelegateProperty_            OnSuccess;                                         // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnFailure;                                         // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_23D1[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHGetFriendsCallbackProxy* GetDefaultObj();

	class USHGetFriendsCallbackProxy* GetFriendsList(class UObject* WorldContextObject, class APlayerController* PlayerController);
};

// 0x28 (0x50 - 0x28)
// Class SH.SHGlobals
class USHGlobals : public UObject
{
public:
	class ASHQuestManager*                       QuestManager;                                      // 0x28(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USHWorldStateManager*                  WorldState;                                        // 0x30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASHMapManager*                         MapManager;                                        // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ASHFractionsManager*                   FractionsManager;                                  // 0x40(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bGamepadMode;                                      // 0x48(0x1)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23D2[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class USHGlobals* GetDefaultObj();

	void SetGamepadModeFromKey(const struct FKey& Key);
};

// 0x0 (0x220 - 0x220)
// Class SH.SHGrassVolume
class ASHGrassVolume : public AActor
{
public:

	static class UClass* StaticClass();
	static class ASHGrassVolume* GetDefaultObj();

	void PlayerLeave(class ASHPlayerCharacter* Character);
	void PlayerEnter(class ASHPlayerCharacter* Character);
	void OnEndOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnBeginOverlap(class AActor* OverlappedActor, class AActor* OtherActor);
};

// 0x58 (0x460 - 0x408)
// Class SH.SHHeavyItem
class ASHHeavyItem : public ASHItem
{
public:
	uint8                                        Pad_23D8[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            AttachOffsetTransform;                             // 0x410(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class ASHHeavyItem*                          HeavyItemSpawner;                                  // 0x440(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsCarriedByPlayer;                                 // 0x448(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23DA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMeshComponent*                  StaticHeavyItemMesh;                               // 0x450(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_23DB[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHHeavyItem* GetDefaultObj();

	void OnItemDropped();
	bool OnHeavyItemSpawnerSet();
	class UStaticMeshComponent* GetStaticHeavyItemMesh();
};

// 0x0 (0x310 - 0x310)
// Class SH.SHHUD
class ASHHUD : public AHUD
{
public:

	static class UClass* StaticClass();
	static class ASHHUD* GetDefaultObj();

};

// 0x130 (0x350 - 0x220)
// Class SH.SHImpactEffect
class ASHImpactEffect : public AActor
{
public:
	class UParticleSystem*                       DefaultFX;                                         // 0x220(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                       ConcreteFX;                                        // 0x228(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                       DirtFX;                                            // 0x230(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                       WaterFX;                                           // 0x238(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                       MetalFX;                                           // 0x240(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                       WoodFX;                                            // 0x248(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                       GlassFX;                                           // 0x250(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                       GrassFX;                                           // 0x258(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                       FleshFX;                                           // 0x260(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             DefaultSound;                                      // 0x268(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             ConcreteSound;                                     // 0x270(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             DirtSound;                                         // 0x278(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             WaterSound;                                        // 0x280(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             MetalSound;                                        // 0x288(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             WoodSound;                                         // 0x290(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             GlassSound;                                        // 0x298(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             GrassSound;                                        // 0x2A0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USoundCue*                             FleshSound;                                        // 0x2A8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDecalData                            DefaultDecal;                                      // 0x2B0(0x10)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FHitResult                            SurfaceHit;                                        // 0x2C0(0x88)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        Pad_23DF[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHImpactEffect* GetDefaultObj();

};

// 0x110 (0x330 - 0x220)
// Class SH.SHInventory
class ASHInventory : public AActor
{
public:
	uint8                                        Pad_2411[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Name;                                              // 0x238(0x18)(Edit, BlueprintVisible, Net, ExposeOnSpawn, NativeAccessSpecifierPublic)
	uint8                                        Size;                                              // 0x250(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        SlotsInRow;                                        // 0x251(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUnlimitedWeight;                                  // 0x252(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2414[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxWeight;                                         // 0x254(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CurrentWeight;                                     // 0x258(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         AutoResize;                                        // 0x25C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bMustCacheItemInstance;                            // 0x25D(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCantFitQuestItems;                                // 0x25E(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bReadOnlyInventory;                                // 0x25F(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCacheArmor;                                       // 0x260(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2418[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class USHInventorySlot*>              InventorySlots;                                    // 0x268(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, RepNotify, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        ContentChangeFlag;                                 // 0x278(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2419[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bOnlyOneExtend;                                    // 0x27C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsExtended;                                       // 0x27D(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_241A[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnExtended;                                        // 0x280(0x10)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnUnExtended;                                      // 0x290(0x10)(Edit, ZeroConstructor, EditConst, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnItemEnterInventory;                              // 0x2A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnItemLeaveInventory;                              // 0x2B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnItemDrop;                                        // 0x2C0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnContentChanged;                                  // 0x2D0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnStructureChanged;                                // 0x2E0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnWeightChanged;                                   // 0x2F0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         LoadedFromSave;                                    // 0x300(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_241D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class USHInventorySlot*>              ShrinkedSlots;                                     // 0x308(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class USHInventorySlot*>              UpgradeSlots;                                      // 0x318(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAutoEquipWeapons;                                 // 0x328(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsInLoadingState;                                 // 0x329(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_241E[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ASHInventory* GetDefaultObj();

	void UnExtend();
	bool SwapSlotsContent(class USHInventorySlot* Lhs, class USHInventorySlot* Rhs);
	void SplitStack(class USHInventorySlot* FromSlot, int32 Count);
	class ASHItem* SpawnSingleItem(class USHInventorySlot* Slot, const struct FTransform& Transform);
	class ASHItem* SpawnAndRemoveSingleItem(class USHInventorySlot* Slot, const struct FTransform& Transform);
	void SetTestSwapSlots(class USHInventorySlot* Slot1, class USHInventorySlot* Slot2);
	void SetNewSlotsInRow(int32 Value);
	void SetNewSize(int32 NewSize);
	int32 RemoveItemOfParentType(TSubclassOf<class ASHItem> ItemParentClass, int32 Count);
	int32 RemoveItem(TSubclassOf<class ASHItem> ItemClass, int32 Count);
	int32 RemoveFromSlot(class USHInventorySlot* FromSlot, int32 Count);
	void RemoveAllQuestItems();
	void OnRep_InventorySlots();
	void OnRep_CurrentWeight();
	void OnRep_ContentChanged();
