#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xC4F8 (0xCDC8 - 0x8D0)
// AnimBlueprintGeneratedClass Arsenal_AnimBP.Arsenal_AnimBP_C
class UArsenal_AnimBP_C : public UTTLArsenalAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x8D0(0x8)(Transient, DuplicateTransient)
	struct FAnimNode_Root                        AnimGraphNode_Root_2296BCC34851C7E0BEE431929976E2DF; // 0x8D8(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_75A366CD4968EE76F498DA92BB9071D8; // 0x920(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C4D306424AFF4E7385EC97AC09B37857; // 0x968(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_BCF49E434263FA07988F92A3155EFBFD; // 0x9B0(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_B077ADA940A85443F586DEBDF4159249; // 0x9F8(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2705B8ED44A8D161FB7EE9A9752A861C; // 0xA40(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7D6985A34AAE2CBEA0EF39BE3C19255E; // 0xA88(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C6FFC6F74A613F973D1CDE96556A8507; // 0xAD0(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5A8CFB064F555012C7AD48BAE17BE5BA; // 0xB18(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4D9D551F41F0B7C729F3D5A45C0111D1; // 0xB60(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CD63A1894DE69C8668655FA593A5CE63; // 0xBA8(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_B17826D14A4E85419DBEB488D786BD9D; // 0xBF0(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_BC7C4F4E4A1BC5ED59F16E95995FBCA5; // 0xC38(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C471D67E49F2CAD48B780D8E97912AFC; // 0xC80(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_FF263FAD441C7491CDB53D898D871834; // 0xCC8(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7ED2776B44648AB327898EBD1DE023BB; // 0xD10(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_98BBEA674C4391B4F8C383AC7BEBF55C; // 0xD58(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_056AB920495F21052A44EA9FE90217E3; // 0xDA0(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7133056C416F41F0161C51A1D1947907; // 0xDE8(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_28C709AC4CCD1D711F67A7A6CDC0BD87; // 0xE30(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_94B0041547C01F6039EAB38D77BBC05A; // 0xE78(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_167A85D84E64BB9EE2D605A7F1571C76; // 0xEC0(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_611DBE884DD9282E4AA0429476C0B80E; // 0xF08(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_AD0982434C7F70AB7E2040A30BA023E3; // 0xF50(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_D9F4A4E24D19568164A1059A1FD04087; // 0xF98(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_03F61E5140DF1DE77501D89D9550E642; // 0xFE0(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8249C8634566FA91B6A6C0AEC53F523D; // 0x1028(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7E0517E446240E1C7517A78DFD0029BA; // 0x1070(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_B4DEF9CB48F9395A35D363A090BCC4F9; // 0x10B8(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8AD2018A43914031CACEDE872EC11909; // 0x1100(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3ABDBBAD449AF5E0DAA85C905FF1AB3B; // 0x1148(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_38BFF53B42C4542A69C05B8A400A49FA; // 0x1190(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_973D08F545CFB7D889471980B27148DB; // 0x11D8(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_BC49B7434E9FBDC5C40F6AAF7DF08613; // 0x1220(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8A4B3E534D182208F2585D9597FAEF58; // 0x1268(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A71853EB42F92D74616615AF40BAC685; // 0x12B0(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_962BEA194999CA4BB7FCEAAB9BCD8C69; // 0x12F8(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C5CF6F76410AB111F92BE193272791A5; // 0x1340(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_053195444B42B959F9EDF286085E3EFD; // 0x1388(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_45F02F114B7E596683B081AB2002521B; // 0x13D0(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_DBF8F3FD4A3AE21006AEE783E288249B; // 0x1418(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_0B04152A41C4E4FE58DC25A0072903D2; // 0x1460(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6E480C9A4536140421976F90040724CF; // 0x14A8(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_691594F248052F66475FA0A50910A71F; // 0x14F0(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_DBF522DB43FD22A2CFAE06AA44C39E76; // 0x1538(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_FEBB53354A4F2BCA92B61DBC11BE0A33; // 0x1580(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_85CAAC7A4F390F10FB0759A06FEE2468; // 0x15C8(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4749B25E4E5B0E7F1AD8558B1BB73CD7; // 0x1610(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F8DAEAA9415095E6A1571E8A9559C1C2; // 0x1658(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_79E8328A46927DE9B674298FBA770F8F; // 0x16A0(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4C312BA649329BDCACF481B4D04C6B11; // 0x16E8(0xB0)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_C790512148019C552E7F9188BE95C360; // 0x1798(0xE0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7A0AD296470F7CA287686E961A133A61; // 0x1878(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_362B23E74E1D49B2777A7A9A562D0103; // 0x1928(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_87CCDADB44F7919F20FAE8B0654E4FB2; // 0x19D8(0xB0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_23C3C918488B81089E262CB5796F0C3B; // 0x1A88(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C5D0514A44BB88C55B1FFA904103C277; // 0x1AD0(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_A1D9F5BA42412C22465555BF2A176398; // 0x1B80(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_CA70C0A74D2664BBF7BA9F8FACC657D8; // 0x1C30(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_A361A82A4FB0A2A9560BAE92A628E984; // 0x1CE0(0xB0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_20D27CE64D556585CAF4468FDFBB45CA; // 0x1D90(0xD0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_A67985754D6D4DA29186FF939FF9C5C1; // 0x1E60(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_B970045F45E44372821B648911B68BDA; // 0x1F10(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_ABDEFB3A44544A489C1E778D39634461; // 0x1FC0(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_80CAF9AF43E7D485B87E14B1200C3024; // 0x2070(0xB0)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_31BC6C414DE35881200122A558330847; // 0x2120(0xE0)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_2A9EE95D4D97DF1AD7301A9B55B188EB; // 0x2200(0xE0)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_494FD66E4AE9C52AD504EB93931DEDA2; // 0x22E0(0xE0)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_7B0FE3C446E79ACF4A92B2A66E1E923D; // 0x23C0(0x128)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_FE36E51841A71FC64DB0E69304BEACC7; // 0x24E8(0xE0)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_7EA0ECE242612F951F54AE9BC0AE2554; // 0x25C8(0x128)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_42FD90F84D21C485D3CE5C9ED264655B; // 0x26F0(0x128)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_CF5E4E4341D8F210A23673BFD1E07C5E; // 0x2818(0x128)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_F1593A1B4D546566C2C6A98FC95587AC; // 0x2940(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_D9B399A24A72A469E65760B727FFCFA6; // 0x2988(0xB0)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_E0D5D64441196011F441779783A0F529; // 0x2A38(0xE0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1F42B8014B4811E2F65A48A3387440EC; // 0x2B18(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_CAE114BE4AA2B09BE76FE892E34A9BA6; // 0x2BC8(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_BC764CB147EBB584FF6236A685EDF4A7; // 0x2C78(0xB0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_B94D93D84F36D01DF03C5A9A810155B1; // 0x2D28(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E0D1FE4540A265E2F3A5A1BD73231400; // 0x2D70(0xB0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_1AFCCA044F777C94E0D440AB20DF38EF; // 0x2E20(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E8EB150F4AA5485A51B12997EB752454; // 0x2E68(0xB0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_1DE72A0B4ECA8F22967DB9AEA6024E07; // 0x2F18(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_FA7E3FE849A5D27C4BE0C49298FCC5A8; // 0x2F60(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_CA4DCB9747011B02A2EAC1860545A414; // 0x3010(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E332DB55464CDCD028BF0CB167623D9D; // 0x30C0(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_435C545F41816E41A3FE17B89707925B; // 0x3170(0xB0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_924E814043A224D81ADD0FB9DE6F1474; // 0x3220(0xD0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_A99C6BD443DC9573198B4789C40E597B; // 0x32F0(0xD0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_C0118A1240C8B9259834BD93A9EB14C2; // 0x33C0(0xD0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_778F9D854791C0DF7C2EF2966520079D; // 0x3490(0x48)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_94E2568642BA1A1772009F848DE88713; // 0x34D8(0x128)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_99DC2F8D486DD116B9AB398C1D8908A9; // 0x3600(0x48)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_CEAB6E964894C00C32419C9EB181E1E5; // 0x3648(0x128)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_283B2F314070B4A6A878FFA3F9364948; // 0x3770(0x48)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_2B1DC3A5473A4FDE960C108A533C611C; // 0x37B8(0xD0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3B0BA8504D6316715F3CDF825C414507; // 0x3888(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_D9E659EC4778EC45F29C00B1BB48907A; // 0x3938(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_591A3E3E440D04F8FDC99AA26B50F9C4; // 0x39E8(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_B4037D4F4DFEA67498D495A50BDFD5E0; // 0x3A98(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4542F1604CB49E338E3C60848B56239D; // 0x3B48(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_39FE66E147F64313FE260FB4D2A55BC3; // 0x3BF8(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_02815E924239D5B4295DA3971B0787EA; // 0x3CA8(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5A94FA6D49735DB2AFCCAB854FF3CA45; // 0x3D58(0xB0)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_3D4E09D54634CBCDE204E7B94286F8BC; // 0x3E08(0xE0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3D742C5C40FCFE1F150E748887613DFB; // 0x3EE8(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_936C01894E165F9C1C6994975C74615A; // 0x3F98(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_DF95CB494392190EEEDBA1BEF7280F86; // 0x4048(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_293CBEFA478F8BB07A0FFEA9CD9C009E; // 0x40F8(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_83CA699E41A6942633BF0FBF257520A2; // 0x41A8(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_68460DDD4FBA20D1BC3BFDA2596BD7C8; // 0x4258(0xB0)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_7F7D0A3C41273D9B03A7AE85DC8EF872; // 0x4308(0xE0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_AE6E55DF48BB3A53E6C976AA98604603; // 0x43E8(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C038951B43B4D106C2D9ADA631E7740A; // 0x4498(0xB0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_766A1812408CD8A7C02489B0F2C9404F; // 0x4548(0x48)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_2F637EAA44752F4C765006A097C91D40; // 0x4590(0x128)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_49F22C8A47E2DD7B9F2DC7866A269D23; // 0x46B8(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_41827E5D428BCC315CEAA2B8DB5AA5FD; // 0x4700(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8D17924943CBE657C803DF87C95CE361; // 0x47B0(0xB0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_20DF358D4111FBE7209C50A9CE487C15; // 0x4860(0xD0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_2B2EAA61464D2263BDFD0DBB848FF422; // 0x4930(0xD0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_D35DE1F840E1E7474A9652B117120F4B; // 0x4A00(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F38CF2214F4FE9D4FB0726A833CC6245; // 0x4AB0(0xB0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_9CCC575D460900980BA54380DEEDA80C; // 0x4B60(0xD0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_2EF784424B09981BECA072926665526B; // 0x4C30(0x48)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_F89D57A24CC34B211A4A1EAF118C9EA1; // 0x4C78(0x128)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_FCEF508742790E6BA3620286F7E34E16; // 0x4DA0(0x48)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_B3ACD9F64091D9299CA736894D640430; // 0x4DE8(0x128)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_F213BDBB48A771EEED4C0D97EEBE47BF; // 0x4F10(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_FCAD2E174F1E905905EE029BE31BDE60; // 0x4F58(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C2B40EFF4B98142655A55CB114E460E7; // 0x5008(0xB0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_0C62B9374F905DD831963EADCFCE1805; // 0x50B8(0xD0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_6243A1E54C1F9C5176E36AA3F835A5BC; // 0x5188(0xD0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C97FF531439208DC892FD989C4D94BA3; // 0x5258(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_0FC78BCE4CBB8F63ED165499497EBA44; // 0x5308(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C88873C0404D9589C6751EB63ECD5FC4; // 0x53B8(0xB0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_F23B6F804E9DCA74CEFAC0ACFAFA09C9; // 0x5468(0xD0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_C4C9402340022F5F86DF78A0D4E15F80; // 0x5538(0xD0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_A0F34136459EC35E7ED62A881AF59D70; // 0x5608(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E9937F164C2A3C657DA8428804FB1F00; // 0x56B8(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_03AB8751459945C7E162A0B6AAD85568; // 0x5768(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_A4D7D904439E03F4122689942A81BDA5; // 0x5818(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_EB2814204BF852898A36B0BA1DB4343B; // 0x58C8(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7EE0E60B4FC541E71CC430AF8F2878C6; // 0x5978(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_FA3F338C4C7C5959A7CE5AAACCB08C0E; // 0x5A28(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_658BA08F42760C3B04B34BA8BD56227C; // 0x5AD8(0xB0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_E870241540C609F7A17F24B899D5A98E; // 0x5B88(0xD0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_9855BF0F4B030EF57CE2F2A269C8DEF6; // 0x5C58(0xD0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_598AB839479A6094D55CB3829734C881; // 0x5D28(0xD0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_5F6F39174EAEC597C33A8D84E4589892; // 0x5DF8(0xD0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C06D334F484E0F75FA5FC19B9E9C278E; // 0x5EC8(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6275219643996487F43BF8AB0E2CEDD7; // 0x5F78(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7A9E5922481FDADBA63C42A0FF1113F9; // 0x6028(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_FDEC4E414D8477739B9706B1876596DC; // 0x60D8(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9F351B6841140D3A718AC396AC0B50A8; // 0x6188(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_82657F774051CA4D67D76D997F289539; // 0x6238(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E9BE19B048EB1E3478058ABE47E38128; // 0x62E8(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C7A244814DC7A223B3CB5C8E39357BE8; // 0x6398(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_25985CCB400F016ED25523B8EC0BC8DE; // 0x6448(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_0683546C48FE7CD0AEE32994961BA5E1; // 0x64F8(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E7FDEE714A78FFBF8343B199012CB70E; // 0x65A8(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6B66107349D07CA30FA515B8A83DF225; // 0x6658(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_3E44A3F94CFFBAAFEED1269E12F7246C; // 0x6708(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_FB23CBCF4000A0E80AAE88A5F07599B6; // 0x67B8(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_19ACE7AC460D66C99E5AE583DD7CC144; // 0x6868(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7E3455704E32A574A70E179F822DEB5D; // 0x6918(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_0B7B4CAD452C949DDAE887BF614F1E48; // 0x69C8(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_14192EE346B98C570F87A3BFED04FC18; // 0x6A78(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_D7A798D64B6B38FE3C970F811E5902C2; // 0x6B28(0xB0)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_F715DED94E6D92F1D898479B55A538FB; // 0x6BD8(0x128)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_15486272432DAAA42203058EB185BAFB; // 0x6D00(0xD0)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_C2A84ADE43A6B568AE983CBD86FE71A2; // 0x6DD0(0xE0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_645F998C49ED7C98F16FFB8360C82B2D; // 0x6EB0(0x48)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_E2C4111C410201AA7411CBB05F980D4A; // 0x6EF8(0x128)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_DD9F282F4CD609083CAF8083B7FE5152; // 0x7020(0x48)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_D9E0238E44B6BEBBE83235B69CF6B949; // 0x7068(0xD0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F46897884A3EB5A33135E8B717A811E7; // 0x7138(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_AF9F54EF42963A16F584CB972E60C958; // 0x71E8(0xB0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_06AEDA0C4941336BEED352AB9FDE342D; // 0x7298(0x48)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_B62C68A346140D2574E41596F4330786; // 0x72E0(0xD0)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_8B5D19BE42EA7891DE9656ABC9F67F55; // 0x73B0(0x128)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_790DBC6947E205191563998675DDC9C1; // 0x74D8(0xB0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_8C2A671B41E2744B3E16CFA1F99F7ECC; // 0x7588(0xD0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_2B8F2ACC4998A441A5ECD7ABE55BA5FE; // 0x7658(0xD0)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_9D1E44764F8082ADC5969B80D9021805; // 0x7728(0x128)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_E20F2F1242D3EDA761610F95F0FAD04D; // 0x7850(0x128)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_E82335DA42676C5FE67AEC9D30FD1D70; // 0x7978(0x48)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_C8A866F645111A2C901BF7AF8EA8583D; // 0x79C0(0xD0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_01ADF79649CF523ACA9FA2947F6E1E0E; // 0x7A90(0xB0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_82B379904E2612FEA837F0A97544D4A3; // 0x7B40(0xD0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_B4C369BE43EF9CF3347660AC3EA02553; // 0x7C10(0xD0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_10735B934754D3CB4AE8D2B8D6E07AE4; // 0x7CE0(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E1A392D24DDF6F3FC0A328ADB582D909; // 0x7D90(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_68F5796D425EF00F02D24BA197BA3C88; // 0x7E40(0xB0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_CF4A334941C5024BA815DDA18AE679E6; // 0x7EF0(0xD0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_86E5F1AC425B063D86F2D7BA9C975A0C; // 0x7FC0(0xD0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_7A0337B2444BFF48B9BFA4B24F0EE6D3; // 0x8090(0xD0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_FF2CA1B14910D40CA6EECCB5EC3FC05A; // 0x8160(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_23D72FEF4D2474ABF46F03B7232C2C56; // 0x8210(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6EC2465B493C2026B738CB9049ADF6BF; // 0x82C0(0xB0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_B7CA65B74B17F35EC3B7FE874BB78120; // 0x8370(0x48)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_1BB2217A4D5441B745256BB78AF228F4; // 0x83B8(0x128)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_5CBFEE49494DF928BE86C4836C1F1042; // 0x84E0(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C7B092264EC697266FE0EC9609E1F8EA; // 0x8528(0xB0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_42511E114C3AC010E151AB8E4A4D9607; // 0x85D8(0xD0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8F60490248EC15FDEA3033B7A6A53A98; // 0x86A8(0xB0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_CAA17B0441BBCC1E43566C96CABD8964; // 0x8758(0xD0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_69B6F15C42A015298ABD1A8F6C15F587; // 0x8828(0xB0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_D08BE09B46A954866CE54BAD6731F27A; // 0x88D8(0xD0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_DE458DA64ECF16FFDBB9B59E3C83C29B; // 0x89A8(0xB0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_39EACF7B428FBBA9566952B8EF97CFD5; // 0x8A58(0x48)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_22E7AFEE468E3E4AFDD7F497EAAEC44A; // 0x8AA0(0xE0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_8982151148B204AA20C23AA527BA447D; // 0x8B80(0xE0)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_6406EF74477FB837F50B5395DD7EE253; // 0x8C60(0x70)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_C2969D3F4ED57E5DB4FD70B2CBB694AD; // 0x8CD0(0xE0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_C00B8D8D40B48C253F516EBD3C486D4F; // 0x8DB0(0xE0)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_C3C01C1E4F264091C01E2D994006A207; // 0x8E90(0x70)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_94498C124634E5B7BD323799AD2E3AF9; // 0x8F00(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_4C085A7C4A870D052BAA1EBECD39C4B5; // 0x8FE0(0x50)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_F253178F4BD1FB248EED42BFA9026A80; // 0x9030(0xE0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_971DB4ED46125EB762376B99827D7D09; // 0x9110(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_37792E67417EEE46B23FE49CA36C0F15; // 0x91F0(0x50)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_352086084F980D08CB07B2B041FB5153; // 0x9240(0x120)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1211F961467F8859DEAA999BE4496F6B; // 0x9360(0x48)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_AFFDEE704E509B0C702C19A64D2CB31B; // 0x93A8(0x160)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5F5FE8824EFEC290DB015189E292D1BC; // 0x9508(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_D8EEFB554BE9458340384CB9F9E2C658; // 0x9550(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_9FD40E0C45D2E7A36559C1BC9A3121C9; // 0x9630(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_FE26A5094E1CEF27094542B95A0C9211; // 0x9680(0x50)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_DB12A147438B40BA3D30D5AC4F5A3C3D; // 0x96D0(0x120)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_02FFDE65427CB681D336B1B1261F1263; // 0x97F0(0x48)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_07CBC96F423D56E9ED3721B3C6FA8CC1; // 0x9838(0x160)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_84C9E2D74FF91D383F5929BBD06526DC; // 0x9998(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_C91AE35E40A354A8A98B5C861F5828F2; // 0x99E0(0xE0)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_41E5EDEA45A978C4D7406EBBCAA48765; // 0x9AC0(0x70)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_5ADCD39D45A6A2C91D81C7A36F0E6F42; // 0x9B30(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_F672D5C84F97CB704ABFD5A100F3705F; // 0x9C10(0x50)(None)
	struct FAnimNode_TwoBoneIK                   AnimGraphNode_TwoBoneIK_BA6EE3234F74A0CA7554C6905EF53154; // 0x9C60(0x270)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3306AACD41AB3D335B985BAD7ED0DBD0; // 0x9ED0(0x48)(None)
	uint8                                        Pad_DB1[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_TwoBoneIK                   AnimGraphNode_TwoBoneIK_89B0F25645F6C034450EB8B01BF80680; // 0x9F20(0x270)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4AB1533048BEB3FD06425F86B13B1C62; // 0xA190(0x48)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_9BD0604544D7CBB61D666C87E3E5A1F6; // 0xA1D8(0x160)(None)
	uint8                                        Pad_DB2[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_AD75E6FC451BE735561E6591A4309D75; // 0xA340(0x240)(None)
	struct FAnimNode_LookAt                      AnimGraphNode_LookAt_02A4DF5341CAD80C46860FBF988C6025; // 0xA580(0x240)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_1836E3604E818A017F2AD391B066E27D; // 0xA7C0(0x70)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_942D2E2640B34DCAE51D3C9C44B5007E; // 0xA830(0x70)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_C61830454A13C7ED2AB1649FBFAD04D3; // 0xA8A0(0xD0)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_13CB242D4AA76A295816B88A72DDC168; // 0xA970(0xE0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_20E051754CEEEE9BEA6E24A00C16DC63; // 0xAA50(0xD0)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_1CEF7D10416E1458D71681A8EEB7FA68; // 0xAB20(0x160)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_616581C1416D9F36462CC28C8E423C12; // 0xAC80(0x48)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_24DAC8E847C869A81FF9ABB41144C116; // 0xACC8(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_1783AFEE44FB81AD56BFAA902B9736B8; // 0xAD10(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_4E92901A466CCFA0BCA3FBAE600F1F8F; // 0xADF0(0x50)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_D3AF723E45C97FA37F0308A1D6A6590E; // 0xAE40(0x120)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_F799DF9E40719E94BC12E282447CDD7C; // 0xAF60(0x70)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_C373A74E48C554D400DE57961A9D2C13; // 0xAFD0(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_C3F74B48450B5E033B31A0AC2FDE994C; // 0xB020(0x50)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_6A3255904DD7613FC32414B08F4C408F; // 0xB070(0x160)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_8AEFF3DA4C153A7F8FB83CBA45BD3CBE; // 0xB1D0(0x48)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_8491D8004FFDB63A3E1A91AFEBA9239F; // 0xB218(0x120)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_5527512B446471EA604CB6A69FB91121; // 0xB338(0xE0)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_EB31C95B470AA7D635A3AF8C034AC0FB; // 0xB418(0x48)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_3B4B59054E03ECF2A5446ABF9A755496; // 0xB460(0x120)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_D2581D4D40930923F98B988D164882CA; // 0xB580(0x48)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_E03F1E7A47A621E085B562AD0D763F31; // 0xB5C8(0x160)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_050E349A419C5846534348BCF8D7E6F4; // 0xB728(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_E9979271497ECF95C5F82A89C370343A; // 0xB778(0x50)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1E50A85D40583AB1D40F8AA2C6370F41; // 0xB7C8(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_2DB2B7D6460B5F3D6D160EBBD99AE9B4; // 0xB810(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_A1573EB849EBE0576B47FD8BF6576153; // 0xB8F0(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_596349FA44759FA2DCB619A7A8DE9851; // 0xB940(0x50)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_38D628AB428F60A7B138FC8C81238E2C; // 0xB990(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_EE2060284C57AFE752D1319BD9FFC16E; // 0xBAF0(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_240429454386EC3AF3728E839D1992C5; // 0xBC50(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_8179E7234DF1CE216E7892879CAB57A3; // 0xBDB0(0x160)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_4397A44B4168BF78969F829DBACA811E; // 0xBF10(0x70)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_4BA4469B48AC579B6249E1A36FF24243; // 0xBF80(0x70)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_B82215974F81982EE63DF292440AA626; // 0xBFF0(0x70)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_6CF33FAA42EDEBFEE5C40382F77F7998; // 0xC060(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_B579A8ED47AE61AF47EEFEBD5CAB46F7; // 0xC0B0(0x50)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6397F4534BDD8E410EED778BCDAE810C; // 0xC100(0x48)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_229C57144A3F9DFB5CD8ABAD070B8B75; // 0xC148(0xD0)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_747697BC4F57DE4001B5C4B6542D713F; // 0xC218(0x48)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_4C64D9F142D1E6700AEA1483ED3E5A33; // 0xC260(0x70)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_ED45F2634353D1E8F5C7178EEDF8079F; // 0xC2D0(0x70)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_C932E80C4E1FEB652951FE9CB3726D1F; // 0xC340(0x70)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_6FACEB3C40B9CA698A2ED88B30499416; // 0xC3B0(0x70)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_35CF99E44CBB74580E1169B8E7795225; // 0xC420(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_3275A41B420A79F78BF07F821DCCB73C; // 0xC470(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_7F9EADC04461122DA304B08F037AD64F; // 0xC4C0(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_FE48FD54480395C20CEB14812E2D57C7; // 0xC510(0x50)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_D6565F2040F7D0AE75CBFA9C2854891E; // 0xC560(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_904BC1014EAE5E8372A6A29E9536D4AC; // 0xC640(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_6384783C466BDD7C24A883AC0697256E; // 0xC690(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_1B76ED5C43580DE8B4FB2EB03323F8F2; // 0xC6E0(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_DFA7F00F402B943302CD7B9F233783A3; // 0xC730(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_EA910E694DF9E7E5E165988340569987; // 0xC780(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_8AADE0F3436BE3B825393BA7DBF00587; // 0xC7D0(0x50)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_447D674A49443045BB8317943AEE288C; // 0xC820(0x70)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_08116B6D40E25309B73D77A0F40F898D; // 0xC890(0x70)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_71DD115841EAC437CB9FB98ED6308078; // 0xC900(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_4D86780B4CF74CBC0E63308C46E748F3; // 0xC9E0(0x50)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_AEFFD8B2401E1036A2F7F8AAD8D32CC3; // 0xCA30(0xD0)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_E04B63954D372099C1FE79A6D4B36660; // 0xCB00(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_CAFB22874DAF73BCB0EAA78D04130531; // 0xCBE0(0x50)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_D5E56AC64CAAC2F4B61F3A98C0725059; // 0xCC30(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_827FE03047815873124FD9A2D2FABF75; // 0xCD10(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_A743D41348C709B78F643B9143548809; // 0xCD60(0x50)(None)
	class ABaseCharacter_C*                      SelfArsenal;                                       // 0xCDB0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsDodgeInbincible;                                 // 0xCDB8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsCatchingLoop;                                    // 0xCDB9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_DC5[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SpineRoll;                                         // 0xCDBC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        SpinePitch;                                        // 0xCDC0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        PickEndBlendOut;                                   // 0xCDC4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UArsenal_AnimBP_C* GetDefaultObj();

	void ProcessUseCaptureOgreSword(bool CallFunc_Montage_IsPlaying_ReturnValue, bool CallFunc_CaptureWeapon_StartAiming_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_Montage_IsPlaying_ReturnValue1, bool K2Node_SwitchInteger_CmpSuccess, class FName CallFunc_Montage_GetCurrentSection_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue, bool CallFunc_Montage_IsPlaying_ReturnValue2, float CallFunc_Montage_Play_ReturnValue, class UTTLCptWpnBaseBossOgreSwordComp* K2Node_DynamicCast_AsTTLCpt_Wpn_Base_Boss_Ogre_Sword_Comp, bool K2Node_DynamicCast_bSuccess);
