#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x2459 (0x3459 - 0x1000)
// AnimBlueprintGeneratedClass DemoOuter_AnimBP.DemoOuter_AnimBP_C
class UDemoOuter_AnimBP_C : public UTTLDemoAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x1000(0x8)(Transient, DuplicateTransient)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_358896494679D4FA6200659705B0B031; // 0x1008(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_73616E06410FA48C3A347BB6D56F5D0B; // 0x1050(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_E8411AF842F009E1364F2294F0462502; // 0x1098(0xB0)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_0C5EA89044E364F6C5C7EBA0EBC8FB27; // 0x1148(0xE0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_6622A23D4B43F0CD475A6A93700951EC; // 0x1228(0x48)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_45ACD313491F91AEDE8B52895F55442B; // 0x1270(0x70)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_852C8E304B54057604982F9EA6FD0F09; // 0x12E0(0x48)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_3239075A4039C798A39A348A29643778; // 0x1328(0xE0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_91486F13479B340D99787FA98EBA394A; // 0x1408(0xE0)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_656E12EA4C928EB927D4ACB9C359E343; // 0x14E8(0x48)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_776B15574C94AE74B290F6B659F63692; // 0x1530(0x48)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_954D0BE9457B56B542DDEEA6ED350BEB; // 0x1578(0x50)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_1663511540CACFEA70560FA608EA8378; // 0x15C8(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_5D73A04C4F48F03CE9C964BEBC0D3BD5; // 0x1728(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_4CFCBE0F4284F009A2B28A97EFB6A74A; // 0x1888(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_CB94076740F6CE7EA3E42490246842C3; // 0x19E8(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_0B8873894F3609D96BEF6CB0F6127F68; // 0x1B48(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_E1CA517D448424D7B80ACD9EC0951804; // 0x1CA8(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_48F54CFD41BC8386E4BDC1A99F1E2393; // 0x1E08(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_808AC87C49C9C9257FE61BA9E7FB6C54; // 0x1F68(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_74C6ECE24FA49E8583BB01AACE19F1A5; // 0x20C8(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_2B495F5243D0A6DE753AA4A001004409; // 0x2228(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_1C335AE944C3F74FE865EDACB3DAA7D8; // 0x2388(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_4C70E47F4316ED9B557DE5877268CA7B; // 0x24E8(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_0EA258FA4E5C78F7BB7307A5BC615C6D; // 0x2648(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_ECBE38EF4758768DC11268B42203187E; // 0x27A8(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_6691110046DEC89DDE4A66B74D342F35; // 0x2908(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_7BA246184EDDBDD570950CB809903CEB; // 0x2A68(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_9440E0804CA802C87EA25B86F4AAEDD1; // 0x2BC8(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_498F4DE640D77AA5D5682690A9184BA6; // 0x2D28(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_AD3DDC0D46F3CE38D5E703B6D1C9E47E; // 0x2E88(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_15C2933045356A039BD377AEB453DC0B; // 0x2FE8(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_63542BE14DA8E3EE25C4CCB70F7674EF; // 0x3148(0x160)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_87C89287470C8DED152EFAA1E5E1CD7B; // 0x32A8(0x160)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root_5AAFB24146F97B2C71EC689CA9C15878; // 0x3408(0x48)(None)
	class AOuterCharacter_C*                     SelfCharacter;                                     // 0x3450(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EDemoOuterWaitAnim                WaitAnimationID;                                   // 0x3458(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UDemoOuter_AnimBP_C* GetDefaultObj();

	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_74C6ECE24FA49E8583BB01AACE19F1A5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_2B495F5243D0A6DE753AA4A001004409();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_1C335AE944C3F74FE865EDACB3DAA7D8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_4C70E47F4316ED9B557DE5877268CA7B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_0EA258FA4E5C78F7BB7307A5BC615C6D();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_ECBE38EF4758768DC11268B42203187E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_6691110046DEC89DDE4A66B74D342F35();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_7BA246184EDDBDD570950CB809903CEB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_9440E0804CA802C87EA25B86F4AAEDD1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_498F4DE640D77AA5D5682690A9184BA6();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_AD3DDC0D46F3CE38D5E703B6D1C9E47E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_15C2933045356A039BD377AEB453DC0B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_63542BE14DA8E3EE25C4CCB70F7674EF();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_87C89287470C8DED152EFAA1E5E1CD7B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_48F54CFD41BC8386E4BDC1A99F1E2393();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_E1CA517D448424D7B80ACD9EC0951804();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_0B8873894F3609D96BEF6CB0F6127F68();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_CB94076740F6CE7EA3E42490246842C3();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_4CFCBE0F4284F009A2B28A97EFB6A74A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_5D73A04C4F48F03CE9C964BEBC0D3BD5();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_1663511540CACFEA70560FA608EA8378();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_BlendListByEnum_0C5EA89044E364F6C5C7EBA0EBC8FB27();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_TransitionResult_73616E06410FA48C3A347BB6D56F5D0B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_TransitionResult_358896494679D4FA6200659705B0B031();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_DemoOuter_AnimBP_AnimGraphNode_ModifyBone_808AC87C49C9C9257FE61BA9E7FB6C54();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void StartMessageWaitBP(class FName AnimationName);
	void ExecuteUbergraph_DemoOuter_AnimBP(int32 EntryPoint, bool CallFunc_UpdateGender_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, float K2Node_Event_DeltaTimeX, class APawn* CallFunc_TryGetPawnOwner_ReturnValue, class AOuterCharacter_C* K2Node_DynamicCast_AsOuter_Character, bool K2Node_DynamicCast_bSuccess, class FName K2Node_Event_AnimationName, bool K2Node_SwitchName_CmpSuccess);
};

}


