#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x88 - 0x88)
// Class DXM.EnemyParam
class UEnemyParam : public UDataTable
{
public:

	static class UClass* StaticClass();
	static class UEnemyParam* GetDefaultObj();

};

// 0x0 (0x88 - 0x88)
// Class DXM.DroneParam
class UDroneParam : public UDataTable
{
public:

	static class UClass* StaticClass();
	static class UDroneParam* GetDefaultObj();

};

// 0x0 (0x88 - 0x88)
// Class DXM.TankParam
class UTankParam : public UDataTable
{
public:

	static class UClass* StaticClass();
	static class UTankParam* GetDefaultObj();

};

// 0x0 (0x88 - 0x88)
// Class DXM.HelicopterParam
class UHelicopterParam : public UDataTable
{
public:

	static class UClass* StaticClass();
	static class UHelicopterParam* GetDefaultObj();

};

// 0x0 (0x88 - 0x88)
// Class DXM.FighterParam
class UFighterParam : public UDataTable
{
public:

	static class UClass* StaticClass();
	static class UFighterParam* GetDefaultObj();

};

// 0x0 (0x88 - 0x88)
// Class DXM.FeryParam
class UFeryParam : public UDataTable
{
public:

	static class UClass* StaticClass();
	static class UFeryParam* GetDefaultObj();

};

// 0x0 (0x88 - 0x88)
// Class DXM.CannonParam
class UCannonParam : public UDataTable
{
public:

	static class UClass* StaticClass();
	static class UCannonParam* GetDefaultObj();

};

// 0x68 (0xA0 - 0x38)
// Class DXM.OuterEmoteAnimNotify
class UOuterEmoteAnimNotify : public UAnimNotify
{
public:
	TSoftObjectPtr<class UParticleSystem>        VFXForEmote;                                       // 0x38(0x28)(Edit, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  AttachSocket;                                      // 0x60(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_20C[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            AttachRelativeTransform;                           // 0x70(0x30)(Edit, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UOuterEmoteAnimNotify* GetDefaultObj();

};

// 0x28 (0x230 - 0x208)
// Class DXM.PlayerFlagWidget
class UPlayerFlagWidget : public UUserWidget
{
public:
	class UMultiLineEditableTextBox*             CMC_InfoText;                                      // 0x208(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMultiLineEditableTextBox*             CharaCommon_InfoText;                              // 0x210(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMultiLineEditableTextBox*             AMC_InfoText;                                      // 0x218(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMultiLineEditableTextBox*             AMC_InfoText2;                                     // 0x220(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ATTLCharacterCommon*                   PlayerCharaCommon;                                 // 0x228(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UPlayerFlagWidget* GetDefaultObj();

	void UpdateSelf();
	void InitializeSelf();
};

// 0x10 (0x338 - 0x328)
// Class DXM.TTLPauseMenuBase
class ATTLPauseMenuBase : public AActor
{
public:
	UMulticastDelegateProperty_                  OnPauseMenuBaseExit;                               // 0x328(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ATTLPauseMenuBase* GetDefaultObj();

};

// 0xF8 (0x430 - 0x338)
// Class DXM.TLLPauseMenu
class ATLLPauseMenu : public ATTLPauseMenuBase
{
public:
	class ATTLYesNoPopUp*                        ActorYesNoPop;                                     // 0x338(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATTLOkPopUp*                           ActorOkPop;                                        // 0x340(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                           WidgetPauseMenu;                                   // 0x348(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVerticalBox*                          Widget_MissionTopWidget;                           // 0x350(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTTLUITopMenuComponent*                TopMenuComponent;                                  // 0x358(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTTLPauseMenuComponent*                PauseMenuComponent;                                // 0x360(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTTLSurvivalMapUIComponent*            SurvivalMapComponent;                              // 0x368(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                           Widget_BattleTopWidget;                            // 0x370(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                            Widget_BattlePlayerHeadlineText;                   // 0x378(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                            Widget_BattleRankingHeadlineText;                  // 0x380(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                            Widget_BattleRankingNumText;                       // 0x388(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                            Widget_BattlePlayerNameText;                       // 0x390(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                            Widget_BattleClassNameText;                        // 0x398(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                            Widget_BattlePointNumText;                         // 0x3A0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTextBlock*                            Widget_BattleTitleText;                            // 0x3A8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                               Widget_MissionTitleTopWidget;                      // 0x3B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_294[0x58];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class ATTLOkPopUp>               OkPopupClass;                                      // 0x410(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_296[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ATLLPauseMenu* GetDefaultObj();

	void ToTitleSceneBP();
	void SetIsOpenOptionMenu(bool IsOpen);
	void OpenYesNoPopBP();
	void OpenYesNoPop(class ATTLYesNoPopUp* YesNoPop);
	void OpenOptionMenuBP();
	void OpenManualUIBP();
	void OpenedOtherWindowPopup();
	void OnTopMenuOutAnimeEnd();
	void OnTopMenuInAnimeEnd();
	void OnPauseMenuInfoOutAnimeEnd();
	void OnMissionRetired();
	void OnMissionFinished(enum class ETTLEMissionResult MissionResult);
	void OnMissionEventStarted(class FName EventID);
	void OnInputRepeatAction(enum class ETTLEActionType KeyType, int32 Count);
	void OnInputAction(enum class ETTLEActionType KeyType, bool IsPressed);
	void OnDecideOkPopup();
	void OnChangeReadyToMissionComplete(enum class ETTLEReadyToMissionErrorType ErrorType, bool IsReadyToMission);
	void Initialize(class UUserWidget* Widget);
	void GetKeyMove(enum class ETTLEActionType KeyType);
	void Finalize();
	void ExitSessionRoomBP();
	void ContinueMisisonBP();
	void CloseYesNoPopUpBP();
	void ClosePauseMenu();
	void ClosedOtherWindowPopup();
};

// 0x18 (0x340 - 0x328)
// Class DXM.TTLActor
class ATTLActor : public AActor
{
public:
	float                                        LockOn_Scale;                                      // 0x328(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LockOn_HUDScale;                                   // 0x32C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2B7[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UTTLBossWeakDamageComponent*           WeakCameraShake_Component;                         // 0x338(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ATTLActor* GetDefaultObj();

	void WeakCameraShake_Set(class AActor* InDamageCauser, const struct FVector& InLocation, float InDamage, bool InIsDefeat);
	void SetEventStart(class FName EventName);
	void SetEventResumeGame(class FName EventName);
	void SetEventFinish(class FName EventName);
};

// 0x38 (0x378 - 0x340)
// Class DXM.TTL3DInteractUIObject
class ATTL3DInteractUIObject : public ATTLActor
{
public:
	class UBoxComponent*                         UICollision;                                       // 0x340(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidgetComponent*                      WidgetComponent;                                   // 0x348(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  TextID;                                            // 0x350(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                SkeletalMeshComponent;                             // 0x358(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimationAsset*                       GateAnimationOpne;                                 // 0x360(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimationAsset*                       GateAnimationClose;                                // 0x368(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLEInteractType                 ConsoleType;                                       // 0x370(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2F8[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ATTL3DInteractUIObject* GetDefaultObj();

	void UIActorEndOverlap(class AActor* OverlapperdActor, class AActor* OtherActor);
	void UIActorBeginOverlap(class AActor* OverlapperdActor, class AActor* OtherActor);
	void SetVisibility(bool NewVisibility);
	void SetText(class FName& TextID);
	void PlayOutAnimation();
	void PlayAnimation();
	bool IsPlayingOutAnimation();
	void ChangeWidgetVisibility(bool NewVisibility);
};

// 0x2E0 (0x620 - 0x340)
// Class DXM.TTLExplosionActor
class ATTLExplosionActor : public ATTLActor
{
public:
	uint8                                        Pad_398[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTTLDamageParameterComponent*          DamageParameter;                                   // 0x358(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USphereComponent*                      ExplodeCollision;                                  // 0x360(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                  ExplodeMesh;                                       // 0x368(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           ExplosionFX;                                       // 0x370(0x98)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FTTLFxParam                           ExplosionFX_70Common;                              // 0x408(0x98)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FTTLFxParam                           ExplosionFX_100Common;                             // 0x4A0(0x98)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FTTLFxPlayback                        ExplosionPlayBack;                                 // 0x538(0x18)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                         CanChangeLargeTypeCommonVFX;                       // 0x550(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_39B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LifeTime_Common;                                   // 0x554(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ExplosionTMPRise;                                  // 0x558(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLExplosionSize                 StandardSize;                                      // 0x55C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_39F[0x53];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class ATTLExplosionActor>        AbnormalSpaceClass;                                // 0x5B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A0[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AActor*>                        TargetList;                                        // 0x5C0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        IgnoreActorList;                                   // 0x5D0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_3A4[0x14];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        VFXScale;                                          // 0x5F4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         VFXScaleForce;                                     // 0x5F8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         FriendlyFireEnabled;                               // 0x5F9(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3A7[0xA];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaterialSmallValue;                                // 0x604(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaterialMiddleValue;                               // 0x608(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaterialLargeValue;                                // 0x60C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaterialIndex;                                     // 0x610(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PostProcessLimitRadius;                            // 0x614(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstanceDynamic*              MaterialInstance;                                  // 0x618(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class ATTLExplosionActor* GetDefaultObj();

	void OnExplosionEnd(class AActor* DestroyedActor);
	void OnendOverLap(class AActor* OverlappedActor, class AActor* OtherActor);
	void OnBeginOverLap(class AActor* OverlappedActor, class AActor* OtherActor);
	class AActor* CreateExplosionActor(class UObject* WorldContextObject, class UClass* ExplosionClass, enum class ETTLEStatusType Type, class AActor* ExplosionOwner, const struct FTransform& Transform, float Damage, float Radius, float Time, float TmpRise, float KnockOut, float KnockBack, float MinDamageRate, float MaxDamageRadius, bool FriendlyFireEnabled, class APawn* ExplosionInstigator, enum class ETTLEAbnormalStatusType AbnormalType, float AbnormalValue, float ExplodeAbnormalValue, float WhiteOutContinuationTime, float TMPRiseOnAbnormalSpace, float AddValueOnAbnormalSpace, float AbnormalSpaceContinuationTime, float AbnormalSpaceRadius, float AbnormalSpaceAppearDelay, float AbnormalSpaceAppearTime, float AbnormalSpaceDisappearTime, float HealVPValue, float HealAbnormalStatusRate, float HealPartsHPValue, float WeakHealContinuationTime, float WeakHealRate, enum class ETTLMissileExplosionVFXType MissileVFXType);
	void AddAbnormalStatus(class UTTLBasicStatusComponent* TargetStatus);
};

// 0xA0 (0x6C0 - 0x620)
// Class DXM.TTLFiniteExplosionActorBase
class ATTLFiniteExplosionActorBase : public ATTLExplosionActor
{
public:
	struct FTTLFxParam                           FxEndSE;                                           // 0x620(0x98)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_3D1[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ATTLFiniteExplosionActorBase* GetDefaultObj();

};

// 0x8 (0x6C8 - 0x6C0)
// Class DXM.TTLAcidSpaceActor
class ATTLAcidSpaceActor : public ATTLFiniteExplosionActorBase
{
public:
	bool                                         IsNoScaling;                                       // 0x6C0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3F7[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ATTLAcidSpaceActor* GetDefaultObj();

	void InitializeDynamicAcidSpaceList(class UObject* WorldContextObject);
	void FinalizeDynamicAcidSpaceList();
};

// 0x98 (0xC0 - 0x28)
// Class DXM.TTLActionVoiceManager
class UTTLActionVoiceManager : public UObject
{
public:
	uint8                                        Pad_40A[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FTTLActionVoiceParamMap>       ActionVoiceParamMap;                               // 0x30(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FTTLActionVoicePathMap>        ActionVoicePathMap;                                // 0x40(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	class UAtomComponent*                        VoiceComponent;                                    // 0x50(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class FName, class UAtomComponent*>     VoiceComponentList;                                // 0x58(0x50)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TArray<struct FTTLActionVoicePlayedTime>     ActionVoicePlayedTimeList;                         // 0xA8(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_415[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLActionVoiceManager* GetDefaultObj();

	void SetEnableActionVoice(bool Flag);
};

// 0x0 (0x88 - 0x88)
// Class DXM.TTLActionVoiceParam
class UTTLActionVoiceParam : public UDataTable
{
public:

	static class UClass* StaticClass();
	static class UTTLActionVoiceParam* GetDefaultObj();

};

// 0x198 (0x4D8 - 0x340)
// Class DXM.TTLWeaponBase
class ATTLWeaponBase : public ATTLActor
{
public:
	uint8                                        Pad_6F4[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USkeletalMeshComponent*                WeaponMesh;                                        // 0x360(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTTLDamageParameterComponent*          DamageParameter;                                   // 0x368(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLWeaponType                    WeaponType;                                        // 0x370(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         UnavailableFlag;                                   // 0x371(0x1)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F9[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         IsAttached;                                        // 0x378(0x1)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsChargeAttack;                                    // 0x379(0x1)(Edit, BlueprintVisible, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6FC[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  WeaponID;                                          // 0x380(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  WeaponName;                                        // 0x388(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Range;                                             // 0x390(0x4)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ForceHideName;                                     // 0x394(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         CanAddOwnerSpeed;                                  // 0x395(0x1)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_701[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  AttachmentID1;                                     // 0x398(0x8)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  AttachmentID2;                                     // 0x3A0(0x8)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  AttachmentID3;                                     // 0x3A8(0x8)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_703[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimationAsset*                       DeployWeaponRightAnimAsset;                        // 0x3D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimationAsset*                       DeployWeaponLeftAnimAsset;                         // 0x3D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  Equipment_RightAttachSocketName;                   // 0x3E0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_706[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            Equipment_RightOffset;                             // 0x3F0(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                  Equipment_LeftAttachSocketName;                    // 0x420(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_709[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            Equipment_LeftOffset;                              // 0x430(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         IsBossWeapon;                                      // 0x460(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_70E[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTTLMaterialInstanceDynamic           CutoffMaterialInstanceOnDestroy;                   // 0x468(0x10)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FTTLPartsCutoffParam                  CutoffParamOnDestroy;                              // 0x478(0x14)(NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_712[0x14];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTTLWeaponAddTMPObject*                AddTMPObject;                                      // 0x4A0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         TractorBeam_StealFlag;                             // 0x4A8(0x1)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_717[0x2F];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ATTLWeaponBase* GetDefaultObj();

	void Wreck(bool IsLeft, const struct FVector& Position, const struct FRotator& Rotator);
	void StartUnFire();
	void StartStore();
	void StartReload(int32 BulletRemain);
	void StartPurge();
	void StartPick(enum class ETTLWeaponSlot WeaponSlotType);
	void StartPartsDestroyed(bool IsCompletelyDestroyed);
	void StartFalling();
	void SetWeaponDuarability(float Duarability);
	void SetUniqueIdByPartsInfo(struct FTTLAssemblePartsInfoRow& PartsInfo);
	void SetUniqueIdByInventoryItem(struct FTTLInventoryItem& InventoryItem);
	void SetUniqueId(int32 Value);
	void SetRootComponentVisible(bool Visibility, bool PropagateToChildren);
	void SetBulletRemainParameter(struct FTTLBulletRemainParameter* bulletRemainParam);
	class UParticleSystemComponent* SetAndAttachLoopEffect(class UParticleSystem* LoopEffect, class USkeletalMeshComponent* TargetMesh, class FName MuzzleSocketName);
	bool ProcessStore(float DeltaSeconds);
	bool ProcessReload(float DeltaSeconds);
	bool ProcessPurge(float DeltaSeconds);
	void PlayReloadFx(bool IsLeft);
	void OnTakeEndBP();
	void OnReloadEndBP();
	void OnPurgeEndBP();
	void OnInputStartBP();
	void OnInputStart();
	void OnInputEndBP();
	void OnInputEnd();
	bool IsUnFiring();
	bool IsUnavailable();
	bool IsTargetInScreen(const struct FVector& TargetPos);
	bool IsTaking();
	bool IsSwitchEnabled();
	bool IsSingleShootStiffWeapon();
	bool IsReloading();
	bool IsPurging();
	bool IsPunchWeapon();
	bool IsLaserWeaponSelf();
	bool IsInputStart();
	bool IsFiringWeapon();
	bool IsBrokenWeapon();
	void InitializeParameter();
	int32 GetUniqueID();
	bool GetParametersShield(struct FTTLWeaponWorkParametersShield* Parameters);
	bool GetParametersLongRange(struct FTTLWeaponWorkParametersLongRange* Parameters);
	bool GetParametersCloseRange(struct FTTLWeaponWorkParametersCloseRange* Parameters);
	struct FTransform GetMuzzleTransform();
	struct FVector GetLockOnPos();
	void GetCenterScreenLocationForWeapon(struct FVector* RetVector, float Range);
	void GetBulletRemainParameter(struct FTTLBulletRemainParameter* bulletRemainParam);
	class UAnimMontage* GetArsenalAttackMontageFromWeapon(enum class ETTLWeaponMotionType MotionType);
	void FinishStore();
	void FinishReload();
	void FinishPurge();
	void ExtraActionOnDamaged();
	void ExecuteAttack();
	void EndUnFire();
	bool CouldTake();
	bool CouldStartAttack();
	bool CouldReload();
	bool CouldPurge();
	bool CouldContinueAttack();
	bool CheckWeaponTestMode();
	void CheckShortageAttackSource();
	bool CheckBulletInfinityMode();
	void ChangeWeaponMeshFromLeftToRight();
	bool CanStartMotionPlay();
};

// 0x9D0 (0xEA8 - 0x4D8)
// Class DXM.TTLLongRangeWeapon
class ATTLLongRangeWeapon : public ATTLWeaponBase
{
public:
	class UTTLLongRangeWeaponParameter*          WeaponParameter;                                   // 0x4D8(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class ATTLProjectileBase>        BulletClass;                                       // 0x4E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           MuzzleLoopEffect;                                  // 0x4E8(0x98)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UParticleSystem*                       CartridgeEffect;                                   // 0x580(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           AssultShiftVFX;                                    // 0x588(0x98)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTTLFxPlayback                        MuzzleLoopEffectPlayBack;                          // 0x620(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           MuzzleFxParam;                                     // 0x638(0x98)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           MuzzleFinishFxParam;                               // 0x6D0(0x98)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           ArkGunChargeEffect;                                // 0x768(0x98)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTTLFxPlayback                        ArkGunChargeEffectPlayback;                        // 0x800(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           FxLoopEffect;                                      // 0x818(0x98)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTTLFxPlayback                        FxLoopEffectPlayBack;                              // 0x8B0(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           FxMuzzleChargeMaxEffect;                           // 0x8C8(0x98)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           FxLoopChargeMaxEffect;                             // 0x960(0x98)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           LaserNoticeEffect;                                 // 0x9F8(0x98)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           LaserNoticeSE;                                     // 0xA90(0x98)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTTLFxPlayback                        LaserNoticeEffectPlayback;                         // 0xB28(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class FName                                  MuzzleEffectSocketName;                            // 0xB40(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  LaserNoticeSocketName;                             // 0xB48(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  MuzzleSocketName;                                  // 0xB50(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           FxDamageReactionEffect;                            // 0xB58(0x98)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           FxWeaponDestroyEffect;                             // 0xBF0(0x98)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class AActor*                                IgnoredActor;                                      // 0xC88(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ATTLFemtoLaserBase*>            LaserList;                                         // 0xC90(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FVector                               LaserShootDirection;                               // 0xCA0(0xC)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_850[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ATTLArkGunLaserBase*                   ArkGunLaser;                                       // 0xCB0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          LeftShootAnime;                                    // 0xCB8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          RightShootAnime;                                   // 0xCC0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          LeftReloadAnime_Extra;                             // 0xCC8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          RightReloadAnime_Extra;                            // 0xCD0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsGunArm;                                          // 0xCD8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_859[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SpreadAngleCorrection;                             // 0xCDC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        IdleSpreadAngleCorrection;                         // 0xCE0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RunningSpreadAngleCorrection;                      // 0xCE4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        QuickBoostSpreadAngleCorrection;                   // 0xCE8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CurrentSpreadRate;                                 // 0xCEC(0x4)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CurrentCoolTime;                                   // 0xCF0(0x4)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CurrentChargeTime;                                 // 0xCF4(0x4)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CurrentChargeLaserChargeTime;                      // 0xCF8(0x4)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CurrentDamageBonusTime;                            // 0xCFC(0x4)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CurrentReloadTime;                                 // 0xD00(0x4)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MagazineBulletRemain;                              // 0xD04(0x4)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        BulletRemain;                                      // 0xD08(0x4)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_865[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         IsPressed;                                         // 0xD0D(0x1)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_868[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UForceFeedbackEffect*                  ForceFeedbackEffect;                               // 0xD10(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UForceFeedbackEffect>   ForceFeedbackReloadL;                              // 0xD18(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UForceFeedbackEffect>   ForceFeedbackReloadR;                              // 0xD40(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsDisplayParam;                                    // 0xD68(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsOverrideCoolTime;                                // 0xD69(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_871[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        OverrideCoolTime;                                  // 0xD6C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_872[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ConsumeMagazineSecond;                             // 0xD80(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_876[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BeforeShootChargeTimer;                            // 0xD88(0x4)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_878[0x14];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                OldIgnoredActor;                                   // 0xDA0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTTLFxPlayback                        DamageReactionEffectPlayBack;                      // 0xDA8(0x18)(NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_87B[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        UnFireChargeTime;                                  // 0xDC8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_87E[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ATTLGravityGunBullet*                  GravityGunBullet;                                  // 0xDD0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_880[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimMontage*                          WeaponMontage;                                     // 0xDE8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimationAsset*                       StorageWeaponAnimAsset;                            // 0xDF0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_888[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class ETTLEOuterFunnelState             OuterFunnelState;                                  // 0xDFC(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_88C[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        StandbyWaitTime;                                   // 0xE00(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        UndockTime;                                        // 0xE04(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RotationTime;                                      // 0xE08(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MoveSpeed;                                         // 0xE0C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeToShoot;                                       // 0xE10(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_898[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ACharacter*                            OwnerCharacter;                                    // 0xE18(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               ShiftVector;                                       // 0xE20(0xC)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               UnDockLocation;                                    // 0xE2C(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LocationOffsetOpened;                              // 0xE38(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A0[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ATTLOuterSubWeapon*                    SubWeapon;                                         // 0xE48(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsChargeShot;                                      // 0xE50(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLEHumanCustomDLCSuitsType      DLCSuitsType;                                      // 0xE51(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_8A6[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInstanceDynamic*              WeaponMaterial;                                    // 0xE58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        WitcherStartEmissive;                              // 0xE60(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        WitcherEndEmissive;                                // 0xE64(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                           WitcherScaleCurve;                                 // 0xE68(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_8AD[0x1C];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        HitCountMax;                                       // 0xE8C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_8B0[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ATTLLongRangeWeapon* GetDefaultObj();

	void UpdateWeaponTransformPrepareOpening(float DeltaSeconds);
	void UpdateWeaponTransformOpening(float DeltaSeconds);
	void UpdateWeaponTransformOpened(float DeltaSeconds);
	void UpdateWeaponTransformClosingEnd(float DeltaSeconds);
	void UpdateWeaponTransformClosing(float DeltaSeconds);
	bool UpdateOuterFunnelOpened(float DeltaSeconds);
	void UpdateOuterFunnel(float DeltaSeconds);
	void ShootBullet(class APawn* Character);
	void ReattachWeaponBP();
	void PlayFireEffect();
	bool NeedsCalcDeviationWeaponType();
	bool IsShootDirectionLinkCamera();
	float GetShootMotionRate();
	struct FVector GetLocalFinalLocation();
	void GetBaseParam(struct FTTLWeaponParamRow* Param);
	void ExecSpinShootAttack();
	void ClampCameraRotation(struct FRotator& InRotation, struct FRotator* OutRotation);
	void CalcShiftVector();
	struct FVector CalcFunnelMovePoint(float DeltaSeconds, struct FVector& TargetPos);
	void Attack(const struct FVector& TargetPos);
	void AddExtraDummyMeshInAllMeshList(class USkeletalMeshComponent* Mesh);
};

// 0x20 (0xEC8 - 0xEA8)
// Class DXM.TTLShoulderWeaponBase
class ATTLShoulderWeaponBase : public ATTLLongRangeWeapon
{
public:
	class USkeletalMeshComponent*                WeaponMesh_R;                                      // 0xEA8(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          AttackMontage;                                     // 0xEB0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         HasNeedChargeAttack;                               // 0xEB8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_919[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimationAsset*                       DeployWeaponAnimAsset;                             // 0xEC0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ATTLShoulderWeaponBase* GetDefaultObj();

	void StartLaunch();
	void AttackWithTargetActor(class AActor* Target, TArray<struct FTransform>* SpawnTransformList, struct FVector* OwnerVelocity, TArray<float>* SpeedRandRateList, TArray<struct FVector>* ImpactRandOffsetList);
};

// 0x270 (0x1138 - 0xEC8)
// Class DXM.TTLShoulderMissilePot
class ATTLShoulderMissilePot : public ATTLShoulderWeaponBase
{
public:
	struct FTTLFxParam                           FxMuzzle;                                          // 0xEC8(0x98)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	int32                                        MaxProjectileNum;                                  // 0xF60(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_941[0xC];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                MuzzleSocketNameBase;                              // 0xF70(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_944[0x1C];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RandomAngleThreshold;                              // 0xF9C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         UseVerticalRandomAngle;                            // 0xFA0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_94A[0x10F];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                MissileMeshPath;                                   // 0x10B0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_94D[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UStaticMeshComponent*>          MissileGroup;                                      // 0x10C8(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UAnimationAsset*                       DeployWeaponAnimAsset_R;                           // 0x10D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimationAsset*                       StorageWeaponAnimAsset_R;                          // 0x10E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_958[0xC];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AnimationPlayTime;                                 // 0x10F4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        EndAnimationRagTime;                               // 0x10F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LoopMotionPlayRate;                                // 0x10FC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FRotator>                      DisseminationPotRotator;                           // 0x1100(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        MissileOffsetDepth;                                // 0x1110(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_963[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimMontage*                          AttackAirMontage;                                  // 0x1118(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_964[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ATTLShoulderMissilePot* GetDefaultObj();

	void GetMissileParam(struct FTTLMissileWeaponParamRow* Param);
};

// 0xA8 (0x11E0 - 0x1138)
// Class DXM.TTLActiveMissileLauncher
class ATTLActiveMissileLauncher : public ATTLShoulderMissilePot
{
public:
	TSubclassOf<class UUserWidget>               TargetMarkClass;                                   // 0x1138(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USoundAtomCue>          TargetMarkSE;                                      // 0x1140(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsLockOn;                                          // 0x1168(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_9C8[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FTTLMissileLockOnTarget>       TargetList;                                        // 0x1170(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_9CB[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             UIOffsetAtCenterSocket;                            // 0x1184(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_9CC[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UUserWidget*>                   TargetMarkList;                                    // 0x1190(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_9CE[0x40];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ATTLActiveMissileLauncher* GetDefaultObj();

	void UpdateLockOnUIPos();
	void UpdateLockOnUI(int32 Index, int32 Num);
	void UpdateLockOnList(float DeltaSeconds);
	void ProcessLockOn();
	void PlayMarkerAnimation(class UUserWidget* Marker);
	void OnDestroyedDelegate(class AActor* DestroyedActor);
	void LockOnEnd();
	void GetTargetList(TArray<class AActor*>* TargetList);
	class UTTLBasicStatusComponent* GetPlayerBasicStatusComponent();
	int32 GetCurrentLockOnNum();
	void ChangeMarkerVisibility(enum class ESlateVisibility NewVisibility);
	bool CanPlayFirstMotion();
};

// 0x8 (0xF8 - 0xF0)
// Class DXM.TTLActorComponent
class UTTLActorComponent : public UActorComponent
{
public:
	bool                                         TTLIsBegunPlay;                                    // 0xF0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A35[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLActorComponent* GetDefaultObj();

	void TTLCanBeginPlay(bool* CanBegin);
	void TTLBeginPlay();
	void SetFreeze(bool IsFreezed);
	void PlayFxAttached(struct FTTLFxParam& FxParam, class UParticleSystemComponent** VFX, class UAtomComponent** SFX, class USceneComponent* AttachToComponent, class FName AttachPointName, struct FVector& Location, struct FRotator& Rotation);
	void PlayFxAtLocationRotation(struct FTTLFxParam& FxParam, class UParticleSystemComponent** VFX, class UAtomComponent** SFX, class AActor* OwnerActor, struct FVector& Location, struct FRotator& Rotation, struct FVector& Scale);
	void PlayFxAtLocation(struct FTTLFxParam& FxParam, class UParticleSystemComponent** VFX, class UAtomComponent** SFX, class AActor* OwnerActor, struct FTransform& Transform);
	bool IsLockOnTarget();
	bool IsLocalControlPawnOwner();
	bool AreMainObjectsValid();
};

// 0x168 (0x490 - 0x328)
// Class DXM.TTLActorGenerator
class ATTLActorGenerator : public AActor
{
public:
	uint8                                        Pad_AB2[0x20];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FTTLGeneratorContainer>        SurfaceContainer;                                  // 0x348(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UAnimationAsset*                       OpenAnimationPtr;                                  // 0x358(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimationAsset*                       RiseAnimatinoPtr;                                  // 0x360(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ContainerAnimationSpeed;                           // 0x368(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        MaxSpawnNumAtSameTime;                             // 0x36C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        RespawnSpanTime;                                   // 0x370(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_AB5[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SpawnNum;                                          // 0x378(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsEnemy;                                           // 0x37C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_AB7[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FTTLGeneratorActorContainerList> SpawnContaienrList;                                // 0x380(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                         IsStartAuto;                                       // 0x390(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_ABB[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSubclassOf<class AActor>>            NeedFailCatchActors;                               // 0x398(0x10)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	uint8                                        Pad_ABD[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SpawnActorTime;                                    // 0x3B8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_ABE[0xC];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               CheckBoxHalfSize;                                  // 0x3C8(0xC)(Edit, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsDebugDrawCheckActor;                             // 0x3D4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsDebugDoCheckActor;                               // 0x3D5(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_AC2[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInstance*                     MaterialONClass;                                   // 0x3D8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInstance*                     MaterialOFFClass;                                  // 0x3E0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UTTLAdjustActiveEmissiveComponent> EmissiveComponentClass;                            // 0x3E8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_AC7[0xA0];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ATTLActorGenerator* GetDefaultObj();

	void StopThink();
	void StartThink(float StartTime);
	void Spawn();
	void OnEventStart(class FName EventName);
	void OnEventFinish(class FName EventName, enum class ETTLEventFinishedType EventFinishedType);
	void OnEndAdjustEmissive(class AActor* Actor);
	void OnDeadSpawnActor(class AActor* DeadActor);
	void OnDeadInSpawning(class AActor* DeadActor);
};

// 0xE8 (0x5C0 - 0x4D8)
// Class DXM.TTLSupportWeaponBase
class ATTLSupportWeaponBase : public ATTLWeaponBase
{
public:
	class USkeletalMeshComponent*                WeaponMesh_R;                                      // 0x4D8(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AEB[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         IsEnabled;                                         // 0x4E1(0x1)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AED[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UTTLLongRangeWeaponParameter*          WeaponParameter;                                   // 0x4E8(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BulletRemain;                                      // 0x4F0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BulletMax;                                         // 0x4F4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           ShootReactionFx;                                   // 0x4F8(0x98)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_AF5[0xC];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TotalDeployAnimTime;                               // 0x59C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        TotalStorageAnimTime;                              // 0x5A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_AF6[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimMontage*                          WeaponLeftMontage;                                 // 0x5A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimMontage*                          WeaponRightMontage;                                // 0x5B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsReverseMontagePlay;                              // 0x5B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_AFD[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ATTLSupportWeaponBase* GetDefaultObj();

	void UseBulletRemain();
	void SetEnable(bool NewEnable);
	void PlayMuzzleEffect(bool IsLeft);
};

// 0x10 (0x5D0 - 0x5C0)
// Class DXM.TTLSupportOneActionWeapon
class ATTLSupportOneActionWeapon : public ATTLSupportWeaponBase
{
public:
	uint8                                        Pad_B05[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ATTLSupportOneActionWeapon* GetDefaultObj();

};

// 0x20 (0x5F0 - 0x5D0)
// Class DXM.TTLAdditionalMagazine
class ATTLAdditionalMagazine : public ATTLSupportOneActionWeapon
{
public:
	uint8                                        Pad_B0B[0x20];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ATTLAdditionalMagazine* GetDefaultObj();

};

// 0x20 (0x48 - 0x28)
// Class DXM.TTLMaterialContainer
class UTTLMaterialContainer : public UObject
{
public:
	class UMaterialInstanceDynamic*              DynamicalInterface;                                // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B0F[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLMaterialContainer* GetDefaultObj();

};

// 0x0 (0x48 - 0x48)
// Class DXM.TTLMaterialScalarContainer
class UTTLMaterialScalarContainer : public UTTLMaterialContainer
{
public:

	static class UClass* StaticClass();
	static class UTTLMaterialScalarContainer* GetDefaultObj();

};

// 0x10 (0x58 - 0x48)
// Class DXM.TTLMaterialColorRedContainer
class UTTLMaterialColorRedContainer : public UTTLMaterialContainer
{
public:
	uint8                                        Pad_B17[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLMaterialColorRedContainer* GetDefaultObj();

};

// 0xA8 (0x198 - 0xF0)
// Class DXM.TTLAdjustActiveEmissiveComponent
class UTTLAdjustActiveEmissiveComponent : public UActorComponent
{
public:
	uint8                                        Pad_B1A[0x1C];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class ETTLActiveEmissiveCharacterType   CharacterType;                                     // 0x10C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_B1B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class ATTLCharacterCommon>       ArsenalClassType;                                  // 0x110(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_B1D[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UTTLMaterialContainer*>         TargetMaterialArray;                               // 0x120(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class FName                                  EmissiveParameterName;                             // 0x130(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                           ActiveCurveObj;                                    // 0x138(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UCurveFloat*                           DeActiveCurveObj;                                  // 0x140(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsChoiceMaterial;                                  // 0x148(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_B20[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                ChoiceMaterialIndexArray;                          // 0x150(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FTTLCurveContainer>            ActiveCurveContainerArray;                         // 0x160(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FTTLCurveContainer>            DeactiveCurveContainerArray;                       // 0x170(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_B24[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class ETTLAdjustMaterialParamType       AdjustParamType;                                   // 0x190(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_B25[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAdjustActiveEmissiveComponent* GetDefaultObj();

};

// 0x340 (0x438 - 0xF8)
// Class DXM.TTLAIActionComponent
class UTTLAIActionComponent : public UTTLActorComponent
{
public:
	UMulticastDelegateProperty_                  OnActionChanged;                                   // 0xF8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnAttackActionChanged;                             // 0x108(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnHateTargetChanged;                               // 0x118(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnReactionWithParam;                               // 0x128(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	class AActor*                                OwnerActor;                                        // 0x138(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTTLBasicStatusComponent*              OwnerBasicStatus;                                  // 0x140(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLAIActionType                  SelectedAction;                                    // 0x148(0x1)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLAIActionType                  SelectedAttackAction;                              // 0x149(0x1)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DA9[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                ActTarget;                                         // 0x150(0x8)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                LastActTarget;                                     // 0x158(0x8)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                ActAttackTarget;                                   // 0x160(0x8)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ActDistance;                                       // 0x168(0x4)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ActAngle;                                          // 0x16C(0x4)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ActHeight;                                         // 0x170(0x4)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               ActDirection;                                      // 0x174(0xC)(BlueprintVisible, Net, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              ActRotation;                                       // 0x180(0xC)(BlueprintVisible, Net, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                        ActDuration;                                       // 0x18C(0x4)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ActCount;                                          // 0x190(0x4)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ActPower;                                          // 0x194(0x4)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ActRatio;                                          // 0x198(0x4)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLAIMoveMode                    ActMoveType;                                       // 0x19C(0x1)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DAC[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ActName;                                           // 0x1A0(0x8)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ActFlag;                                           // 0x1A8(0x1)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ActFlag2;                                          // 0x1A9(0x1)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLAISlot                        ActSlot;                                           // 0x1AA(0x1)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLAIState                       ActAIState;                                        // 0x1AB(0x1)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ProcessInterval;                                   // 0x1AC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LockOnDegree;                                      // 0x1B0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BattleRange;                                       // 0x1B4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsEnabledCheckCollision;                           // 0x1B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsEnabledCheckBattleRange;                         // 0x1B9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DAF[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LostTimeLimit;                                     // 0x1BC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CombatDistance;                                    // 0x1C0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HPThreshold;                                       // 0x1C4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HPThresholdForProcess1;                            // 0x1C8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HPThresholdForProcess2;                            // 0x1CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HPThresholdForProcess3;                            // 0x1D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HPThresholdForProcess4;                            // 0x1D4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AttackDelayTimeMin;                                // 0x1D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AttackDelayTimeMax;                                // 0x1DC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GoHealAreaVPRate;                                  // 0x1E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GoAroundDegree;                                    // 0x1E4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsEnabledCheckShootColli;                          // 0x1E8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DB4[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ShootAimRate;                                      // 0x1EC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RightWeaponRange;                                  // 0x1F0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LeftWeaponRange;                                   // 0x1F4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ShoulderWeaponRange;                               // 0x1F8(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SpecialWeaponRange;                                // 0x1FC(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseRightWeaponRange;                             // 0x200(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CloseLeftWeaponRange;                              // 0x204(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DB6[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FTTLActionStateParam>          ActionStateParams;                                 // 0x218(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class ATTLSplinePath*                        PatrolPath;                                        // 0x228(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATriggerBase*                          ActionArea;                                        // 0x230(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        MissionTargets;                                    // 0x238(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        MissionTargetSearchRange;                          // 0x248(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DB7[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ATargetPoint*>                  TargetPoints;                                      // 0x250(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTTLAIReactionSetting>         EnabledReactions;                                  // 0x260(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTTLAIReactionLimit>           ReactionLimits;                                    // 0x270(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        DodgeReactionRange;                                // 0x280(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TargetActorMinimumTime;                            // 0x284(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DB9[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FTTLDebugAIReactionHistoryInfo> ReactionHistory;                                   // 0x290(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTTLDebugAIActionHistoryInfo>  ActionHistroy;                                     // 0x2A0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        SupportTargets;                                    // 0x2B0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        SupporterActors;                                   // 0x2C0(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        SupportRate;                                       // 0x2D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DBB[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                CurrentSupportTarget;                              // 0x2D8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                       AIFlag;                                            // 0x2E0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        HateInitialOffset;                                 // 0x2E4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HateImportance;                                    // 0x2E8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        HateDecreasePerTime;                               // 0x2EC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HateDecreaseRateByAttack;                          // 0x2F0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HateDPSRate;                                       // 0x2F4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HateDPSDecreaseRate;                               // 0x2F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HateDPSIncreaseRate;                               // 0x2FC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HateDPSRateLimit;                                  // 0x300(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HateDiffuseDistance;                               // 0x304(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HateDiffuseValueRate;                              // 0x308(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DBD[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                MostHateTargetLast;                                // 0x310(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HateProcessTime;                                   // 0x318(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DBE[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FTTLHateTarget>                HateTargets;                                       // 0x320(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTTLHateAdditionDistanceParam> HateAdditionDistanceParams;                        // 0x330(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        HateIgnoreActorList;                               // 0x340(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class AActor*, struct FVector>          LastFoundLocations;                                // 0x350(0x50)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class AActor*                                LeaderActor;                                       // 0x3A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        FollowerActors;                                    // 0x3A8(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         SetLeaderPlayerOnBegin;                            // 0x3B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DBF[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FTTLAIFriendParam>             AIFriendParams;                                    // 0x3C0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        ContinuousDamageCounter;                           // 0x3D0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ContinuousDamageRate;                              // 0x3D4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsEnableContinuousDamageCounter;                   // 0x3D8(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DC2[0xB];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         IsDummyAttackForFlash;                             // 0x3E4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DC3[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<bool>                                 AIControllerSwitch;                                // 0x3E8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         IsSpyChara;                                        // 0x3F8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         HasNoHate;                                         // 0x3F9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         EnableAttackOnSpecialAction;                       // 0x3FA(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsReversePersonality;                              // 0x3FB(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DC4[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UTTLAISpecialActionComponent*          CurrentSpecialAction;                              // 0x400(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        AIActionComponentTimer;                            // 0x408(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ActionContinuedTime;                               // 0x40C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_DC6[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AttackDelayTimer;                                  // 0x414(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsFirstPlayerFound;                                // 0x418(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_DC7[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                JammingDummyActor;                                 // 0x420(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_DC8[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ChaseTimer;                                        // 0x430(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_DC9[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         IsDisplayParameters;                               // 0x435(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_DCA[0x2];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionComponent* GetDefaultObj();

	void UpdateHateTargets(float DeltaSeconds);
	void StartQuickBoost(float Seconds);
	bool StartMirage();
	void StartGetOnBP();
	bool StartGetOn();
	void StartGetOffBP();
	bool StartGetOff();
	bool StartFemtoShift(enum class ETTLAIFemtoShiftType Type);
	void StartChangeWeapon();
	void StartAttackWeaponSpecialBP(class AActor* TargetActor, bool* Result);
	bool StartAttackWeaponSpecial(class AActor* TargetActor, bool IsParallelAttack);
	void StartAttackWeaponShoulderBP(class AActor* TargetActor, bool* Result);
	bool StartAttackWeaponShoulder(class AActor* TargetActor, bool IsParallelAttack);
	bool StartAttackWeaponRightShoulder(class AActor* TargetActor, bool IsParallelAttack);
	void StartAttackWeaponRightBP(class AActor* TargetActor, bool* Result);
	bool StartAttackWeaponRight(class AActor* TargetActor, bool IsParallelAttack);
	bool StartAttackWeaponLeftShoulder(class AActor* TargetActor, bool IsParallelAttack);
	bool StartAttackWeaponLeftRight(class AActor* TargetActor, bool IsParallelAttack);
	void StartAttackWeaponLeftBP(class AActor* TargetActor, bool* Result);
	bool StartAttackWeaponLeft(class AActor* TargetActor, bool IsParallelAttack);
	bool StartAttackWeaponAll(class AActor* TargetActor, bool IsParallelAttack);
	void StartActionWaitBP(class AActor* TargetActor, float Distance, bool* Result);
	bool StartActionWait(class AActor* TargetActor, float Distance);
	void StartActionStraightMoveBP(const struct FVector& TargetDirection, bool* Result);
	bool StartActionStraightMove(const struct FVector& TargetDirection, float Time);
	void StartActionSpecialBP(class AActor* TargetActor, bool* Result);
	bool StartActionSpecial(class AActor* TargetActor);
	void StartActionPatrolTargetPointBP(class AActor* TargetActor, enum class ETTLAISlot Slot, bool* Result);
	bool StartActionPatrolTargetPoint(class AActor* TargetActor, enum class ETTLAISlot Slot);
	void StartActionPatrolDirectLocationBP(class AActor* TargetActor, const struct FVector& TargetLocation, float Distance, bool* Result);
	bool StartActionPatrolDirectLocation(class AActor* TargetActor, const struct FVector& TargetLocation, float Distance, bool IsFaceToTargetActor, bool IsForce);
	void StartActionPatrolBP(class AActor* TargetActor, bool* Result);
	void StartActionPatrolActionAreaBP(class AActor* TargetActor, bool* Result);
	bool StartActionPatrolActionArea(class AActor* TargetActor);
	bool StartActionPatrol(class AActor* TargetActor);
	bool StartActionNone();
	void StartActionKeepDistanceBP(class AActor* TargetActor, float Distance, bool* Result);
	bool StartActionKeepDistance(class AActor* TargetActor, float Distance);
	void StartActionGuardBP(class AActor* TargetActor, bool* Result);
	bool StartActionGuard(class AActor* TargetActor);
	bool StartActionGoToIncomingTargetPoint(class AActor* TargetActor);
	bool StartActionGoAroundSideWithHeight(class AActor* TargetActor, float Distance, float Angle, float Height, float HeightRange, bool UseCameraAngle);
	void StartActionGoAroundSideBP(class AActor* TargetActor, float Distance, float Degree, bool* Result);
	bool StartActionGoAroundSide(class AActor* TargetActor, float Distance, float Angle, bool UseCameraAngle);
	void StartActionFastApproachBP(class AActor* TargetActor, float Distance, bool* Result);
	bool StartActionFastApproach(class AActor* TargetActor, float Distance, bool DoGoAroundSide);
	void StartActionExchangeWeaponBP(bool IsLeft, bool* Result);
	bool StartActionExchangeWeapon(bool IsLeft);
	void StartActionEscapeBP(class AActor* TargetActor, bool* Result);
	bool StartActionEscape(class AActor* TargetActor);
	void StartActionChaseBP(class AActor* TargetActor, float Distance, bool* Result);
	bool StartActionChase(class AActor* TargetActor, float Distance, bool DoGoAroundSide);
	void StartActionChangeMoveTypeBP(enum class ETTLAIMoveMode Mode, bool* Result);
	bool StartActionChangeMoveType(enum class ETTLAIMoveMode Mode);
	void StartActionBlockAttackBP(class AActor* TargetActor, class AActor* SupportActor, float DistanceRate, bool* Result);
	bool StartActionBlockAttack(class AActor* TargetActor, class AActor* SupportActor, float DistanceRate);
	void SetWeaponRange();
	void SetBurstShootMode(bool Value, bool IsLeft);
	void SetAttackDelayTimer(bool IsParallelAttack);
	void SetAISpecialAction(class UTTLAISpecialActionComponent* SPActionComponent);
	void SetAIFlag(enum class ETTLAIFlag Flag, bool Value);
	bool SelectAction(enum class ETTLAIActionType Action, bool IsForce, bool IsParallelAttack);
	void ResetHateTargets();
	bool RequestCommunicationMessageFromNPC(enum class ETTLCommunicationTalkTerm TermIndex, int32 TermPhase);
	void RemoveFromMissionTargets(class AActor* RemoveTarget);
	void RemoveAllMissionTargets();
	void ProcessAttackedByHateTarget(class AActor* DamagedActor, float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void OnTakeDown(class AActor* TargetActor);
	void OnStatusDead();
	void OnStatusBeOverridden(class UTTLBasicStatusComponent* BasicStatus, struct FTTLEnemyParam& EnemyParam);
	void OnStartTsubazeriai(class ATTLCharacterCommon* EnemyArsenal);
	void OnStartDamageReactionDelegate(enum class ETTLDamageState NextState);
	void OnQuitOverHeatImplement();
	void OnQuitOverHeat();
	void OnPointAttackedByHateTargetDelegate(class AActor* DamagedActor, float Damage, class AController* InstigatedBy, const struct FVector& HitLocation, class UPrimitiveComponent* FHitComponent, class FName BoneName, const struct FVector& ShotFromDirection, class UDamageType* DamageType, class AActor* DamageCauser);
	void OnOverHeatImplement();
	void OnOverHeat();
	void OnGotFlash();
	void OnGotDown();
	void OnFinishDamageReactionDelegate(enum class ETTLDamageState PrevState);
	void OnDamageFriendlyFire(class AActor* Instigator);
	void OnCalculateHP(float OldHP, float Hp, float HPMax);
	void OnAttackedByHateTargetDelegate(class AActor* DamagedActor, float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
	void MultiRequestCommunicationMessageFromNPC(enum class ETTLCommunicationTalkTerm TermIndex, int32 TermPhase);
	bool IsWeaponConsumeFemto(enum class ETTLAIWeaponEnum Type);
	bool IsParallelAttack();
	bool IsNonParallelAttackAction();
	bool IsInPatrolPoint(class AActor* Actor, class ATargetPoint* TargetPoint, float ExtentRate);
	bool IsInActionArea(class AActor* Actor);
	bool InterruptAction(enum class ETTLAIActionType Action);
	void HateInit(class AActor* MyActor);
	bool GetWeaponType(enum class ETTLAIWeaponEnum Type, enum class ETTLWeaponType* ReturnType);
	float GetWeaponRangeMin();
	float GetWeaponRangeMax();
	float GetWeaponRange(enum class ETTLAIWeaponEnum Weapon);
	float GetWeaponCriticalRange(enum class ETTLAIWeaponEnum Weapon);
	class ATargetPoint* GetTargetPointImpl(enum class ETTLAISlot Slot);
	class ATargetPoint* GetTargetPoint(enum class ETTLAISlot Slot);
	bool GetTargetLastFoundLocation(class AActor* TargetActor, struct FVector* LastFondLocation);
	class AActor* GetNearestMissionTarget();
	class AActor* GetNearestActorByType(enum class ETTLEStatusType Type);
	float GetModifiedBattleRange(class AActor* TargetActor);
	bool GetIsPunch(enum class ETTLAIWeaponEnum Type);
	TArray<class AActor*> GetHateTargets();
	float GetEscapeDistance();
	float GetDistanceIgnoreGravity(enum class ETTLAIWeaponEnum Weapon);
	float GetCombatDistance();
	bool GetBurstShootMode(bool IsLeft);
	float GetAttackDelayTimer();
	class UTTLAISpecialActionComponent* GetAISpecialAction();
	bool GetAIFlag(enum class ETTLAIFlag Flag);
	float GetActionContinuedTime();
	bool FinishParallelAttack();
	void FinishGuardBP();
	bool FinishGuard();
	void FinishChaseBP();
	bool FinishChase();
	void FinishAttackWeaponSpecialBP();
	bool FinishAttackWeaponSpecial();
	void FinishAttackWeaponShoulderBP();
	bool FinishAttackWeaponShoulder();
	bool FinishAttackWeaponRightShoulder();
	void FinishAttackWeaponRightBP();
	bool FinishAttackWeaponRight();
	bool FinishAttackWeaponLeftShoulder();
	bool FinishAttackWeaponLeftRight();
	void FinishAttackWeaponLeftBP();
	bool FinishAttackWeaponLeft();
	bool FinishAttackWeaponAll();
	bool EndFemtoShift();
	void CopyAIActionParams(class UTTLAIActionComponent* OriginalComp, class UTTLAIActionComponent* DistComp);
	void ClearAttackDelayTimer();
	bool CheckNearGround(class AActor* CheckActor, float CheckHeight);
	void CheckMoveTypeBP(enum class ETTLAIMoveMode Mode, bool* Result);
	bool CheckMoveType(enum class ETTLAIMoveMode Mode);
	bool CheckAngleLessThan(class AActor* Actor, class AActor* CheckActor, const struct FVector& BaseDirection, float CheckAngle);
	bool CanParallelAttack();
	enum class ETTLAISlot CalcTargetPointEvaluate(enum class ETTLAIWeaponEnum CurrentWeapon);
	void AttackActionChangedBP(enum class ETTLAIActionType ActionPrev, enum class ETTLAIActionType ActionNext);
	bool AttackActionChanged(enum class ETTLAIActionType ActionPrev, enum class ETTLAIActionType ActionNext);
	void AIProcess();
	void AIInit(class AActor* MyActor);
	void AddWarningInfo(class AActor* OwnerActor, class AActor* TargetActor);
	void AddMissionTarget(class AActor* AddTarget);
	void AddHateTarget(class AActor* TargetActor, int32 CountAttacked);
	void AddHateCountAttacked(class AActor* TargetActor, int32 AddValue);
	void ActionChangedBP(enum class ETTLAIActionType ActionPrev, enum class ETTLAIActionType ActionNext);
	bool ActionChanged(enum class ETTLAIActionType ActionPrev, enum class ETTLAIActionType ActionNext);
};

// 0x28 (0x460 - 0x438)
// Class DXM.TTLAIActBaseBossOgreSwordComp
class UTTLAIActBaseBossOgreSwordComp : public UTTLAIActionComponent
{
public:
	class ATTLBaseBossOgreSwordPawn*             OwnerPawn;                                         // 0x438(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLBaseBossOgreSwordAIActNo      Action_No;                                         // 0x440(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DE5[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Action_Phase;                                      // 0x444(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DE6[0x18];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActBaseBossOgreSwordComp* GetDefaultObj();

	bool Wait_Set();
	bool Wait_InAction();
	bool Useless_Set();
	bool Useless_InAction();
	bool Lost_Set(bool RandomValue);
	bool Lost_InAction();
	bool Captured_StartControl();
	void Captured_Start();
	bool Captured_End();
	bool Captured_CanAccess();
	bool Captured_Attack();
	void AIInit_Implementation(class AActor* MyActor);
};

// 0x20 (0x458 - 0x438)
// Class DXM.TTLAIActionBaseCannonComponent
class UTTLAIActionBaseCannonComponent : public UTTLAIActionComponent
{
public:
	class ATTLBaseCannonPawn*                    SelfPawn;                                          // 0x438(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTTLFirearmControlComponent*           SelfFirearmCtrl;                                   // 0x440(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DE9[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionBaseCannonComponent* GetDefaultObj();

	void MulticastStart_Attack_SetMotion();
	void MulticastEnd_Attack();
	bool IsExistTarget(class AActor* TargetActor);
	void AIInit_Implementation(class AActor* MyActor);
};

// 0x8 (0x460 - 0x458)
// Class DXM.TTLAIActBaseENBossSnakCannonComp
class UTTLAIActBaseENBossSnakCannonComp : public UTTLAIActionBaseCannonComponent
{
public:
	uint8                                        Pad_DEA[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActBaseENBossSnakCannonComp* GetDefaultObj();

	void Process_Attack();
};

// 0x148 (0x580 - 0x438)
// Class DXM.TTLAIActBaseHelicopterComponent
class UTTLAIActBaseHelicopterComponent : public UTTLAIActionComponent
{
public:
	class ATTLBaseHelicopterPawn*                SelfPawn;                                          // 0x438(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATTLBaseHelicopterPawn*                LeaderPawn;                                        // 0x440(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCapsuleComponent*                     SelfCapsule;                                       // 0x448(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATargetPoint*                          Action_TargetPoint;                                // 0x450(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ATTLWarningArea*>               Action_WarningAreaList;                            // 0x458(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	enum class ETTLBaseHeliType                  Action_Type;                                       // 0x468(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Flags_IsDamaged;                                   // 0x469(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Flags_IsSearchEnemyRangeIntrusion;                 // 0x46A(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Flags_IsActivate;                                  // 0x46B(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E0A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AActor*>                        SupportActors;                                     // 0x470(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_E0B[0x100];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActBaseHelicopterComponent* GetDefaultObj();

	void Multicast_SetDamageAction(enum class ETTLBaseHeliDamageReact Type, const struct FVector& Direction);
	bool Knockback_Process(float DeltaSeconds);
	bool Down_Process(float DeltaSeconds);
	bool Death_Process(float DeltaSeconds);
	bool DamageAction_Process(float DeltaSeconds);
	bool DamageAction_InAction();
	class AActor* CheckSupportActor();
	void BaseHelicopter_Wait();
	bool BaseHelicopter_StopProcess();
	void BaseHelicopter_Special();
	void BaseHelicopter_PatrolTargetPoint();
	void BaseHelicopter_PatrolActionArea();
	void BaseHelicopter_Patrol();
	void BaseHelicopter_None();
	bool BaseHelicopter_MoveToLocationRange(const struct FVector& TargetLocation, float Range, float TargetRot);
	bool BaseHelicopter_MoveToActorRange(class AActor* Target, float Range, int32 IsWay);
	void BaseHelicopter_KeepDistance();
	void BaseHelicopter_GoAroundSide();
	void BaseHelicopter_Escape();
	void BaseHelicopter_Chase();
	void BaseHelicopter_Attack();
};

// 0xA0 (0x4D8 - 0x438)
// Class DXM.TTLAIActENBossTrtsLaser01Comp
class UTTLAIActENBossTrtsLaser01Comp : public UTTLAIActionComponent
{
public:
	uint8                                        Pad_E22[0x60];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ATTLENBossTrtsLaser01Pawn*             SelfPawn;                                          // 0x498(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E23[0x38];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActENBossTrtsLaser01Comp* GetDefaultObj();

	bool PlayerUse_StartControl();
	void PlayerUse_Start(float SpeedRate);
	bool PlayerUse_Shoot();
	bool PlayerUse_SetCaptureSpeedRate(float SpeedRate);
	bool PlayerUse_Hit();
	bool PlayerUse_End();
	bool Idle_Start();
	bool Idle_IsAction();
	bool DropOut_Start(const struct FVector& Point, float YawBias);
	void DropOut_Landing();
	bool DropOut_IsAction();
	bool DropOut_FindPoint(struct FVector* OutPoint, float* OutYawBias);
	bool DropOut_End();
	void AIInit_Implementation(class AActor* MyActor);
};

// 0x38 (0x470 - 0x438)
// Class DXM.TTLAIActENBossTrtsMissile01Comp
class UTTLAIActENBossTrtsMissile01Comp : public UTTLAIActionComponent
{
public:
	class ATTLENBossTrtsMissile01Pawn*           SelfPawn;                                          // 0x438(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E31[0x30];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActENBossTrtsMissile01Comp* GetDefaultObj();

	bool ShootMissile_Start();
	void ShootMissile_Process(float DeltaSeconds);
	bool ShootMissile_InAction();
	void ShootMissile_Cancel();
	bool Idle_Start();
	bool Idle_IsAction();
	bool Dead_Start();
	bool Dead_Set();
	bool Dead_IsAction();
	void AIInit_Implementation(class AActor* MyActor);
};

// 0x18 (0x450 - 0x438)
// Class DXM.TTLAIActionBaseTankComponent
class UTTLAIActionBaseTankComponent : public UTTLAIActionComponent
{
public:
	class ATTLBaseTankCharacter*                 SelfCharacter;                                     // 0x438(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTTLFirearmControlComponent*           SelfFirearmCtrl;                                   // 0x440(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E33[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionBaseTankComponent* GetDefaultObj();

};

// 0x0 (0x450 - 0x450)
// Class DXM.TTLAIActionStrongTankComponent
class UTTLAIActionStrongTankComponent : public UTTLAIActionBaseTankComponent
{
public:

	static class UClass* StaticClass();
	static class UTTLAIActionStrongTankComponent* GetDefaultObj();

};

// 0x18 (0x468 - 0x450)
// Class DXM.TTLAIActionArkTankComponent
class UTTLAIActionArkTankComponent : public UTTLAIActionStrongTankComponent
{
public:
	class ATTLArkTankPawn*                       SelfArkTankPawn;                                   // 0x450(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WeaponSpeed;                                       // 0x458(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E42[0xC];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionArkTankComponent* GetDefaultObj();

	bool IsLineTraceHitRight(class AActor* TargetActor);
	bool IsLineTraceHitLeft(class AActor* TargetActor);
	void ArkTankAction_StartAttackCenter(class AActor* TargetActor);
	void ArkTankAction_StartAttackBothSide(class AActor* TargetActor);
	void ArkTankAction_EndAttackCenter();
	void ArkTankAction_EndAttackBothSide();
	void ArkTankAction_AttackCenter();
	void ArkTankAction_AttackBothSide();
};

// 0x20 (0x470 - 0x450)
// Class DXM.TTLAIActionArmorTankComponent
class UTTLAIActionArmorTankComponent : public UTTLAIActionBaseTankComponent
{
public:
	TArray<class ATargetPoint*>                  EscapePoints;                                      // 0x450(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	enum class ETTLArmorTankType                 ProcessType;                                       // 0x460(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E4B[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class ATTLArmorTankCharacter*                SelfArmorTankCharacter;                            // 0x468(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UTTLAIActionArmorTankComponent* GetDefaultObj();

	bool IsLockonFromTarget(class AActor* TargetActor);
	enum class ETTLAISlot FindTargetPointSlot();
};

// 0x8 (0x478 - 0x470)
// Class DXM.TTLAIActionArmorJammerComponent
class UTTLAIActionArmorJammerComponent : public UTTLAIActionArmorTankComponent
{
public:
	uint8                                        Pad_E5C[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionArmorJammerComponent* GetDefaultObj();

};

// 0x188 (0x5C0 - 0x438)
// Class DXM.TTLAIActionArsenalComponent
class UTTLAIActionArsenalComponent : public UTTLAIActionComponent
{
public:
	bool                                         UseWingShiftAtMove;                                // 0x438(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         UseAssultShiftAtAttack;                            // 0x439(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsNearGround;                                      // 0x43A(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_EA0[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BoostChangedTime;                                  // 0x43C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        QuickBoostTime;                                    // 0x440(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_EA1[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         UseSpecialWait;                                    // 0x446(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_EA2[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NowTsubazeriaiScore;                               // 0x448(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxTsubazeriaiScore;                               // 0x44C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MinTsubazeriaiScore;                               // 0x450(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RotationRate;                                      // 0x454(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTTLArsenalBurstShootInfo             BurstShootInfoLeft;                                // 0x458(0x14)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FTTLArsenalBurstShootInfo             BurstShootInfoRight;                               // 0x46C(0x14)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FTTLArsenalBurstShootInfo             BurstShootInfoShoulder;                            // 0x480(0x14)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	float                                        CollisionAvoidJudgeHeight;                         // 0x494(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SniperShootRangeLimit;                             // 0x498(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLAIHeightThreshold             HeightThresholdType;                               // 0x49C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_EA3[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HeightThreshold;                                   // 0x4A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MirageCoolTime;                                    // 0x4A4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CanStartMirageFemtoRate;                           // 0x4A8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_EA4[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AController>               IncomingAIController;                              // 0x4B0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AController>               SurrenderAIController;                             // 0x4B8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AController>               EscapeAIController;                                // 0x4C0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATargetPoint*                          IncomingTargetPoint;                               // 0x4C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        IncomingStartDistance;                             // 0x4D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        IncomingStopDistance;                              // 0x4D4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        VPDownMessageRate_Medium;                          // 0x4D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        VPDownMessageRate_Large;                           // 0x4DC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  ImportantOuter1;                                   // 0x4E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  ImportantOuter2;                                   // 0x4E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  ImportantOuter3;                                   // 0x4F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        IdleTalkTime;                                      // 0x4F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         UseNewMethodAvoidCollision;                        // 0x4FC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsShowAvoidCollisionDebugInfo;                     // 0x4FD(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_EAB[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AvoidCollisionRate;                                // 0x500(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AvoidCollisionRayLength;                           // 0x504(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_EAD[0x60];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AvoidSoftCollisionRate;                            // 0x568(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UTTLArsenalMovementComponent> ArsenalMovementPtr;                                // 0x56C(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsAttackR;                                         // 0x574(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsAttackL;                                         // 0x575(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_EAE[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CollisionCheckInterval;                            // 0x57C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_EAF[0x34];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        UseRoutePathTime;                                  // 0x5B4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_EB0[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionArsenalComponent* GetDefaultObj();

	void SwitchFlyingCpp(class UTTLArsenalMovementComponent* ArsenalMovement);
	bool StartMirageBP();
	void SetQuickBoostCpp(enum class ETTLAIActionType NextAction);
	void RequestMessageMessageImportantFriendDestroyed(class ATTLCharacterCommon* TargetCharacter);
	void ProcessMirageIntervalTimer(float DeltaTime);
	void ProcessBoostCpp(float DeltaTime);
	bool ProcessAITsubazeriai(class UTTLArsenalMovementComponent* ArsenalMovement);
	void LookAtTargetCpp();
	void LookActorWhileMovingCpp(class AActor* LookTarget);
	bool IsDestroyedParts(enum class ETTLPartsType PartsType);
	bool GetTryAvoidJump();
	float GetRoutePathTime();
	struct FRotator GetLookAtLerpRotator(class AActor* LookTarget, bool RotatePitch);
	struct FVector GetCollisionAvoidVector();
	int32 GetBulletRemain(enum class ETTLAIWeaponPart WeaponPart);
	bool DoSelectedAttackAction(float DeltaTime);
	bool DoSelectedAction(float DeltaTime);
	void DoActionWait();
	void DoActionStraightMove();
	void DoActionSpecial(float DeltaTime);
	void DoActionPatrolTargetPoint();
	void DoActionPatrolTargetLocation();
	void DoActionPatrolActionArea();
	void DoActionPatrol();
	void DoActionNone();
	void DoActionKeepDistance();
	bool DoActionGuard();
	void DoActionGoAroundSide();
	void DoActionChase();
	void DoActionChangeMoveType();
	void DoActionBlockAttack();
	bool DoActionAttackWeaponSpecial();
	bool DoActionAttackWeaponShoulder();
	bool DoActionAttackWeaponRight();
	bool DoActionAttackWeaponLeftRight();
	bool DoActionAttackWeaponLeft();
	bool DoActionAttackWeaponAll();
	bool CheckTMPEnableQuickBoost();
	void CheckGroundWhileFlying();
	bool CanStartMirage();
	struct FVector CalcMovementInputForPatrolTargetPoint();
	struct FVector CalcMovementInputForPatrolActionArea(class UShapeComponent* CollisionComponent);
	struct FVector CalcMovementInputForPatrol(class ATTLSplinePath* SplinePath);
	struct FVector CalcMovementInputForKeepDistance(class AActor* TargetActor);
	struct FVector CalcMovementInputForGuard(class AActor* TargetActor);
	struct FVector CalcMovementInputForGoAroundSide();
	struct FVector CalcMovementInputForDirectLocation(const struct FVector& TargetLocation);
	struct FVector CalcMovementInputForChase(class AActor* TargetActor);
	void AddMovementInputCpp(const struct FVector& InputDirection, float Scale, bool FaceToTarget, bool FaceToAttackTarget);
};

// 0x58 (0x4B0 - 0x458)
// Class DXM.TTLAIActionBaseBossBallCanoComp
class UTTLAIActionBaseBossBallCanoComp : public UTTLAIActionBaseCannonComponent
{
public:
	enum class ETTLBossBallTurretShape           TurretShape;                                       // 0x458(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         DebugDrawCannonTargetDirection;                    // 0x459(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCallEndFireAfter;                                 // 0x45A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_EB2[0x4D];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInstanceDynamic*              DynamicMaterialBody;                               // 0x4A8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UTTLAIActionBaseBossBallCanoComp* GetDefaultObj();

	void AddIgnoreTargetOnShoot(TArray<class AActor*>* OutIgnoreActor);
};

// 0x50 (0x488 - 0x438)
// Class DXM.TTLAIActionBaseBossBallComponent
class UTTLAIActionBaseBossBallComponent : public UTTLAIActionComponent
{
public:
	class AActor*                                TargetActor;                                       // 0x438(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATTLBaseBossBallPawn*                  OwnerPawn;                                         // 0x440(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATTLBaseBossBallAIController*          OwnerAICtrl;                                       // 0x448(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLBaseBossBallAIActNo           ActionNo;                                          // 0x450(0x1)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_EB6[0x37];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionBaseBossBallComponent* GetDefaultObj();

	void AIInit_Implementation(class AActor* MyActor);
};

// 0x1A0 (0x5D8 - 0x438)
// Class DXM.TTLAIActionBaseBossFishComponent
class UTTLAIActionBaseBossFishComponent : public UTTLAIActionComponent
{
public:
	float                                        MoveDistance;                                      // 0x438(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaseDistance;                                     // 0x43C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InGroundTime;                                      // 0x440(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F23[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             RushAngleRange;                                    // 0x448(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                             RushDistanceRange;                                 // 0x450(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RushOutCheckCollisionSafeRate;                     // 0x458(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         RushOutDraw;                                       // 0x45C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F24[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class ETTLBaseBossFishMissileSocketID> MissileSockets;                                    // 0x460(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                        MissileInterval;                                   // 0x470(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MissileWaitTime;                                   // 0x474(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MissileCloseTime;                                  // 0x478(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MissileEnd;                                        // 0x47C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TurnMinDegree;                                     // 0x480(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OotGroundSignTime;                                 // 0x484(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OotGroundSignInteval;                              // 0x488(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsPlayGroundSign;                                  // 0x48C(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F28[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        WaitGroundSignStartTime;                           // 0x490(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BigLaserShootTime;                                 // 0x494(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               BigLaserRange;                                     // 0x498(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RotationPostureInterval;                           // 0x4A4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RotationDistance;                                  // 0x4A8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RotationAttackTimeMax;                             // 0x4AC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                             CannonAngle;                                       // 0x4B0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DamageTime;                                        // 0x4B8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DamageReactionValue;                               // 0x4BC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTTLMultiLaserPath>            MultiLaserPaths;                                   // 0x4C0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        MultiLaserHeight;                                  // 0x4D0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               RushRange;                                         // 0x4D4(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RushCountMin;                                      // 0x4E0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RushCountMax;                                      // 0x4E4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AngryTime;                                         // 0x4E8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EvacucateOverTime;                                 // 0x4EC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ATargetPoint*>                  EvacucateUnderPoints;                              // 0x4F0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class ATargetPoint*>                  JumpOutPoints;                                     // 0x500(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         JumpOutDraw;                                       // 0x510(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F2A[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PatrolTimeOut;                                     // 0x514(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PatrolTimeOutEscape;                               // 0x518(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaseTimeOut;                                      // 0x51C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AreaOutTimerMax;                                   // 0x520(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F2C[0xB4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionBaseBossFishComponent* GetDefaultObj();

	bool StopActionCannon();
	bool StartActionTurn(struct FVector& LookAt);
	bool StartActionSpring(class AActor* TargetActor);
	bool StartActionSpawnDrone();
	bool StartActionRushRand(class AActor* TargetAcotr);
	bool StartActionRush(class AActor* TargetAcotr, int32 TurnCount, bool IsDive);
	bool StartActionRotation();
	bool StartActionOutGround(class AActor* TargetActor);
	bool StartActionMultiLaser(int32 PathSeed);
	bool StartActionMissile(class AActor* TargetActor, bool IsParallelAttack);
	bool StartActionInGround();
	bool StartActionGroundSign(class AActor* TargetActor, int32 SocketNo);
	bool StartActionEvacucateUnder();
	bool StartActionEvacucateOver();
	bool StartActionDead();
	bool StartActionDamage(bool IsStartInGround, struct FVector& StartLocation);
	bool StartActionCannon(class AActor* TargetActor);
	bool StartActionBigLaser(class AActor* TargetActor);
	bool StartActionAngry();
	bool StartActionAcid(class AActor* TargetActor);
	bool StartAction(int32 ActionNo, int32 ExecuteLevel, class AActor* TargetActor);
	void MulticastStartTriggerActionDamage(bool IsStartInGround, const struct FVector& StartLocation);
	void MulticastStartTriggerAction(enum class ETTLBaseBossFishTriggerActionType Type);
	void MulticastStartActionSpring(class AActor* TargetActor, struct FVector& Location, struct FVector& VfxLocation, struct FVector& Direction, uint8 AfterType);
	void MulticastStartActionRush(class AActor* TargetActor, int8 TurnCount, bool IsDive);
	void MulticastStartActionOutGround(struct FVector& Location, class AActor* TargetActor);
	void MulticastStartActionGroundSign(class AActor* TargetActor, struct FVector& Location, struct FVector& VfxLocation, uint8 Type, int32 SocketNo);
	void MulticastStartActionAcid(class AActor* TargetActor, int8 TableNo, int8 bombRand);
	void MulticastStartAction(uint8 ActionNo, int32 ExecuteLevel, class AActor* TargetActor);
	bool IsInGround();
	enum class ETTLBaseBossFishAIActNo GetCurrentActionNo();
	bool CheckInGroundTime();
	bool CheckActionTurn(struct FVector& LookAt);
	bool CheckActionSpring(class AActor* TargetActor);
	bool CheckActionSpawnDrone();
	bool CheckActionRush(class AActor* TargetAcotr);
	bool CheckActionRotation(class AActor* TargetActor);
	bool CheckActionOutGround(bool IsInGroundAttack);
	bool CheckActionMultiLaser(class AActor* TargetActor);
	bool CheckActionMissile(class AActor* TargetActor, bool IsParallelAttack);
	bool CheckActionInGround();
	bool CheckActionGroundSign();
	bool CheckActionEvacucateUnder();
	bool CheckActionEvacucateOver();
	bool CheckActionDead();
	bool CheckActionDamage();
	bool CheckActionCannon(class AActor* TargetActor);
	bool CheckActionBigLaser(class AActor* TargetActor);
	bool CheckActionAcid(class AActor* TargetActor, bool IsContinue);
};

// 0x1C0 (0x5F8 - 0x438)
// Class DXM.TTLAIActionBaseBossLastComponent
class UTTLAIActionBaseBossLastComponent : public UTTLAIActionComponent
{
public:
	class ATTLBaseBossLastPawn*                  OwnerPawn;                                         // 0x438(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ATTLBaseBossLastAIController*          OwnerAICtrl;                                       // 0x440(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLBaseBossLastAIActSet          ActionSet_No;                                      // 0x448(0x1)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F96[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ActionSet_Phase;                                   // 0x44C(0x4)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLBaseBossLastAIActNo           ActionNo;                                          // 0x450(0x1)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F97[0x1A7];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionBaseBossLastComponent* GetDefaultObj();

	bool Wait_Set();
	bool Wait_InAction();
	bool TractorBeam_Set(int32 Level);
	bool TractorBeam_InAction();
	bool Rush_Set(int32 Level);
	bool Rush_InAction();
	void Multicast_AI_SetInfoValie(int32 Phase, int32 Value00_0, int32 Value00_1, int32 Value01_0, int32 Value01_1, int32 Value02_0, int32 Value02_1, int32 Value03_0, int32 Value03_1, int32 Value04_0, int32 Value04_1, int32 Value05_0, int32 Value05_1, int32 Value06_0, int32 Value06_1, int32 Value07_0, int32 Value07_1);
	void Multicast_ActionSet_Wait_Set(float WaitTime, int32 RandomValue);
	void Multicast_ActionSet_TractorBeam_Set(int32 MoveLevel, float WaitTime, int32 TractorBeamLevel, float AfterFixTime, int32 RandomValue, int32 AICtrlPhase, int32 AICtrlActionIndex);
	void Multicast_ActionSet_Stun_Set(int32 RandomValue);
	void Multicast_ActionSet_SmallDamage_Set(float DamageFixTime, float AfterFixTime, int32 RandomValue);
	void Multicast_ActionSet_Rush_Set(int32 MoveLevel, float WaitTime, int32 RushLevel, float AfterFixTime, int32 RandomValue, int32 AICtrlPhase, int32 AICtrlActionIndex);
	void Multicast_ActionSet_Move_Set(int32 MoveLevel, float WraparoundRate, float IntervalTime, float TotalTime, float AfterFixTime, int32 BodyShootLevel, enum class ETTLBaseBossLastFnelAIAct FunnelAction, int32 FunnelShootLevel, int32 FunnelNum, int32 RandomValue, int32 AICtrlPhase, int32 AICtrlActionIndex);
	void Multicast_ActionSet_EmergencyMove_Set(int32 MoveLevel, int32 BodyShootLevel, enum class ETTLBaseBossLastFnelAIAct FunnelAction, int32 FunnelShootLevel, int32 FunnelNum, int32 RandomValue, int32 AICtrlPhase, int32 AICtrlActionIndex);
	void Multicast_ActionSet_Death_Set(class AActor* DamageCasuer, int32 RandomValue);
	void Multicast_ActionSet_DawnHammer_Set(int32 MoveLevel, float WaitTime, int32 DawnHammerLevel, float AfterFixTime, int32 RandomValue, int32 AICtrlPhase, int32 AICtrlActionIndex);
	void Multicast_ActionSet_BigDamageToAnger_Set(float DamageFixTime, float IntervalTime, float AfterFixTime, int32 RandomValue);
	void Multicast_ActionSet_BigDamage_Set(float DamageFixTime, float AfterFixTime, int32 RandomValue);
	bool Move_Set(int32 Level, float WraparoundYaw);
	bool Move_InAction();
	bool Funnel_SetAction(enum class ETTLBaseBossLastFnelAIAct ActNo, int32 ShootLevel, int32 Num, int32 RandomValue);
	bool DawnHammer_Set(int32 Level);
	bool DawnHammer_InAction();
	bool Damage_Set(enum class ETTLBaseBossLastAIDamage Damage, float FixTime, const struct FVector& Velocity, int32 Progress);
	bool Damage_InAction();
	bool BodyShoot_Set(int32 Level);
	bool BodyShoot_InAction();
	bool Anger_Set();
	bool Anger_InAction();
	void AIInit_Implementation(class AActor* MyActor);
	bool ActionSet_Wait_Set(float WaitTime, bool IsForce);
	bool ActionSet_TractorBeam_Set(int32 MoveLevel, float WaitTime, int32 TractorBeamLevel, float AfterFixTime, int32 AICtrlPhase, int32 AICtrlActionIndex);
	bool ActionSet_TractorBeam_Check(int32 MoveLevel, int32 TractorBeamLevel);
	bool ActionSet_Stun_Set();
	bool ActionSet_SmallDamage_Set(float DamageFixTime, float AfterFixTime);
	bool ActionSet_Rush_Set(int32 MoveLevel, float WaitTime, int32 RushLevel, float AfterFixTime, int32 AICtrlPhase, int32 AICtrlActionIndex);
	bool ActionSet_Rush_Check(int32 MoveLevel, int32 RushLevel);
	bool ActionSet_Move_Set(int32 MoveLevel, float WraparoundRate, float IntervalTime, float TotalTime, float AfterFixTime, int32 BodyShootLevel, enum class ETTLBaseBossLastFnelAIAct FunnelAction, int32 FunnelShootLevel, int32 FunnelNum, int32 AICtrlPhase, int32 AICtrlActionIndex);
	bool ActionSet_Move_Check(int32 MoveLevel, int32 BodyShootLevel, enum class ETTLBaseBossLastFnelAIAct FunnelAction, int32 FunnelShootLevel);
	bool ActionSet_EmergencyMove_Set(int32 MoveLevel, int32 BodyShootLevel, enum class ETTLBaseBossLastFnelAIAct FunnelAction, int32 FunnelShootLevel, int32 FunnelNum, int32 AICtrlPhase, int32 AICtrlActionIndex);
	bool ActionSet_EmergencyMove_Check(int32 MoveLevel, int32 BodyShootLevel, enum class ETTLBaseBossLastFnelAIAct FunnelAction, int32 FunnelShootLevel);
	bool ActionSet_Death_Set(class AActor* DamageCauser);
	bool ActionSet_DawnHammer_Set(int32 MoveLevel, float WaitTime, int32 DawnHammerLevel, float AfterFixTime, int32 AICtrlPhase, int32 AICtrlActionIndex);
	bool ActionSet_DawnHammer_Check(int32 MoveLevel, int32 DawnHammerLevel);
	bool ActionSet_BigDamageToAnger_Set(float DamageFixTime, float IntervalTime, float AfterFixTime);
	bool ActionSet_BigDamage_Set(float DamageFixTime, float AfterFixTime);
};

// 0x28 (0x460 - 0x438)
// Class DXM.TTLAIActionBaseBossLastFnelComp
class UTTLAIActionBaseBossLastFnelComp : public UTTLAIActionComponent
{
public:
	class ATTLBaseBossLastFnelPawn*              OwnerPawn;                                         // 0x438(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLBaseBossLastFnelAIAct         ActionNo;                                          // 0x440(0x1)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_FA4[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ActionPhase;                                       // 0x444(0x4)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLBaseBossLastFnelAIAct         RequestActionNo;                                   // 0x448(0x1)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_FA5[0x17];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionBaseBossLastFnelComp* GetDefaultObj();

	bool FollowTargetShoot_Set(bool IsMulticast);
	bool FollowTargetShoot_InAction();
	bool FollowOwnerShoot_Set(bool IsMulticast);
	bool FollowOwnerShoot_InAction();
	bool FollowAttachShoot_Set(bool IsMulticast);
	bool FollowAttachShoot_InAction();
	bool DawnHammer_Set(int32 Level, int32 No, bool IsForce);
	bool DawnHammer_InAction();
	bool Damage_Set();
	bool Damage_InAction();
	bool AttachWait_Set(bool IsForce);
	bool AttachWait_IsAttached();
	bool AttachWait_InAction();
	void AIInit_Implementation(class AActor* MyActor);
};

// 0x20 (0x458 - 0x438)
// Class DXM.TTLAIActionBaseBossOgreComponent
class UTTLAIActionBaseBossOgreComponent : public UTTLAIActionComponent
{
public:
	class ATTLBaseBossOgreCharacter*             OwnerBoss;                                         // 0x438(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                TargetActor;                                       // 0x440(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLBaseBossOgreAIActNo           ActionNo;                                          // 0x448(0x1)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1057[0xF];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionBaseBossOgreComponent* GetDefaultObj();

	bool Walk_Set(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, int32 Level, class AActor* TargetAct, float Distance, bool IsSaveList);
	bool Walk_InAction();
	enum class ETTLBossAICtrlResult Walk_Check(int32 Level, class AActor** OutTargetActor, float* OutDistance);
	bool Wait_Set(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, class ATTLBaseBossOgreCharacter* Owner, bool IsSaveList, bool IsForce);
	bool Wait_InAction();
	void UpdateTargetActor(class AActor* Target);
	bool Turn_Set(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, float DeltaYaw, bool IsSaveList);
	bool Turn_InAction();
	enum class ETTLBossAICtrlResult Turn_Check(float* OutDeltaYaw);
	bool Tackle_Set(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, int32 Level, class AActor* TargetAct, bool IsSaveList);
	bool Tackle_InAction();
	enum class ETTLBossAICtrlResult Tackle_Check(int32 Level, class AActor** OutTargetActor);
	bool SwordStamp_Set(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, int32 Level, bool IsSaveList);
	bool SwordStamp_InAction();
	enum class ETTLBossAICtrlResult SwordStamp_Check(int32 Level);
	bool SwordSlash_Set(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, int32 Level, class AActor* TargetAct, bool IsSaveList);
	bool SwordSlash_InAction();
	enum class ETTLBossAICtrlResult SwordSlash_Check(int32 Level, class AActor** OutTargetActor);
	void MulticastWalkSet(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, int32 Level, class AActor* TargetAct, float Distance, bool IsSaveList);
	void MulticastWaitSet(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, class AActor* TempTargetActor, bool IsSaveList);
	void MulticastTurnSet(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, class AActor* TargetAct, float DeltaYaw, bool IsSaveList);
	void MulticastTackleSet(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, int32 Level, class AActor* TargetAct, bool IsSaveList);
	void MulticastSwordStampSet(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, class AActor* TargetAct, int32 Level, bool IsSaveList);
	void MulticastSwordSlashSet(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, int32 Level, class AActor* TargetAct, bool IsSaveList);
	void MulticastMissileSetParallel(int32 Level);
	void MulticastMissileSet(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, class AActor* TargetAct, int32 Level, bool IsSaveList);
	void MulticastKickSet(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, int32 Level, class AActor* TargetAct, int32 Type, bool IsSaveList);
	void MulticastJumpSet(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, int32 Level, const struct FVector& TargetLocation, class AActor* TargetAct, bool IsSaveList);
	void MulticastGuardSet(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, class AActor* TargetAct, int32 Level, bool IsSaveList);
	void MulticastGraspingSet(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, int32 Level, class AActor* TargetAct, bool IsSaveList);
	void MulticastFallSet();
	void MulticastDamageSet(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, class AActor* TargetAct, int32 Parts, class AActor* DamageCauser, bool IsSaveList);
	void MulticastBackHandBlowSet(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, int32 Level, class AActor* TargetAct, bool IsSaveList);
	void MulticastAngerSet(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, class AActor* TargetAct, bool IsSaveList);
	bool Missile_SetParallel(int32 Level);
	bool Missile_Set(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, int32 Level, bool IsSaveList);
	bool Missile_InAction();
	enum class ETTLBossAICtrlResult Missile_CheckParallel(int32 Level);
	enum class ETTLBossAICtrlResult Missile_Check(int32 Level);
	bool Kick_Set(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, int32 Level, class AActor* TargetAct, int32 Type, bool IsSaveList);
	bool Kick_InAction();
	enum class ETTLBossAICtrlResult Kick_Check(int32 Level, class AActor** OutTargetActor, int32* OutType);
	bool Jump_Set(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, int32 Level, const struct FVector& TargetLocation, class AActor* TargetAct, bool IsSaveList);
	bool Jump_InAction();
	enum class ETTLBossAICtrlResult Jump_Check(int32 Level, int32 Type, struct FVector* OutLocation, class AActor** OutTargetActor);
	bool Guard_Set(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, int32 Level, bool IsSaveList);
	bool Guard_InAction();
	enum class ETTLBossAICtrlResult Guard_Check(int32 Level);
	bool Grasping_Set(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, int32 Level, class AActor* TargetAct, bool IsSaveList);
	bool Grasping_InAction();
	enum class ETTLBossAICtrlResult Grasping_Check(int32 Level, class AActor** OutTargetActor);
	bool Damage_Set(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, int32 Parts, class AActor* DamageCauser, bool IsSaveList, bool IsForce);
	bool Damage_InAction();
	bool BackHandBlow_Set(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, int32 Level, class AActor* TargetAct, bool IsSaveList);
	bool BackHandBlow_InAction();
	enum class ETTLBossAICtrlResult BackHandBlow_Check(int32 Level, class AActor** OutTargetActor);
	bool Anger_Set(const struct FVector& BossLoc, const struct FRotator& BossRot, bool IsDisableDamage, bool IsDisableDeath, float AnimSpeed, bool IsSaveList);
	bool Anger_InAction();
	void AIInit_Implementation(class AActor* MyActor);
};

// 0x0 (0x438 - 0x438)
// Class DXM.TTLAIActionBaseBossSpedComponent
class UTTLAIActionBaseBossSpedComponent : public UTTLAIActionComponent
{
public:

	static class UClass* StaticClass();
	static class UTTLAIActionBaseBossSpedComponent* GetDefaultObj();

};

// 0x88 (0x4C0 - 0x438)
// Class DXM.TTLAIActionBaseBossTrinComponent
class UTTLAIActionBaseBossTrinComponent : public UTTLAIActionComponent
{
public:
	class ATTLBaseBossTrinCharacter*             OwnerBoss;                                         // 0x438(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1062[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                Action_Actor;                                      // 0x448(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1063[0x70];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionBaseBossTrinComponent* GetDefaultObj();

	void AIInit_Implementation(class AActor* MyActor);
};

// 0x10 (0x448 - 0x438)
// Class DXM.TTLAIActionBaseBossTrinContComp
class UTTLAIActionBaseBossTrinContComp : public UTTLAIActionComponent
{
public:
	class ATTLBaseBossTrinContCharacter*         OwnerCharacter;                                    // 0x438(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1067[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionBaseBossTrinContComp* GetDefaultObj();

	void AIInit_Implementation(class AActor* MyActor);
};

// 0xC0 (0x4F8 - 0x438)
// Class DXM.TTLAIActionBaseBossWyveComponent
class UTTLAIActionBaseBossWyveComponent : public UTTLAIActionComponent
{
public:
	class UTTLWyveAIDataAsset*                   AIParameterAsset;                                  // 0x438(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1076[0xB8];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionBaseBossWyveComponent* GetDefaultObj();

	void TTLMulticastSubMoveExecute(class AActor* Target, const struct FVector& Location, float Timer, int32 Flag);
	void TTLMultiCastStartActionMissile(enum class ETTLBaseBossWyveActionState ActionState, int32 ExecuteLevel, class AActor* Target, class AActor* Hate1, class AActor* Hate2, class AActor* Hate3, class AActor* Hate4, class AActor* Hate5, class AActor* Hate6, class AActor* Hate7, class AActor* Hate8);
	void TTLMultiCastStartAction(enum class ETTLBaseBossWyveActionState ActionState, int32 ExecuteLevel, class AActor* Target, int32 Parameter, float FParameter);
	void OnTakeAnyDamageDelegate(class AActor* DamagedActor, float Damage, class UDamageType* DamageType, class AController* InstigatedBy, class AActor* DamageCauser);
};

// 0x10 (0x448 - 0x438)
// Class DXM.TTLAIActionBaseCarComponent
class UTTLAIActionBaseCarComponent : public UTTLAIActionComponent
{
public:
	class ATTLBaseCarCharacter*                  SelfCharacter;                                     // 0x438(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1079[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionBaseCarComponent* GetDefaultObj();

	bool Attack_Start();
	bool Attack_End();
	void Action_Wait();
	void Action_PatrolTargetPoint();
	void Action_PatrolActionArea();
	void Action_Patrol();
	void Action_None();
	void Action_KeepDistance();
	void Action_GoAroundSide();
	void Action_Chase();
	void Action_Attack();
};

// 0x38 (0x470 - 0x438)
// Class DXM.TTLAIActionBaseDroneComponent
class UTTLAIActionBaseDroneComponent : public UTTLAIActionComponent
{
public:
	class ATTLBaseDronePawn*                     SelfPawn;                                          // 0x438(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTTLFirearmControlComponent*           SelfFirearmCtrl;                                   // 0x440(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_107A[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                FollowActor;                                       // 0x450(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FollowDistance;                                    // 0x458(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CombatRange;                                       // 0x45C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLBaseDroneSecuState            SecurityDrone_State;                               // 0x460(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_107B[0xF];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionBaseDroneComponent* GetDefaultObj();

	void SecurityDrone_Update(float DeltaSeconds);
};

// 0x0 (0x448 - 0x448)
// Class DXM.TTLAIActionBaseRushCarComponent
class UTTLAIActionBaseRushCarComponent : public UTTLAIActionBaseCarComponent
{
public:

	static class UClass* StaticClass();
	static class UTTLAIActionBaseRushCarComponent* GetDefaultObj();

	bool Action_InAttack();
};

// 0x18 (0x450 - 0x438)
// Class DXM.TTLAIActionBaseTurretComponent
class UTTLAIActionBaseTurretComponent : public UTTLAIActionComponent
{
public:
	class ATTLBaseTurretPawn*                    SelfPawn;                                          // 0x438(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTTLFirearmControlComponent*           SelfFirearmCtrl;                                   // 0x440(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1082[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionBaseTurretComponent* GetDefaultObj();

	void MulticastAttack_Start();
	void MulticastAttack_End();
	bool Attack_Start();
	bool Attack_End();
	void Action_Wait();
	void Action_PatrolTargetPoint();
	void Action_PatrolActionArea();
	void Action_Patrol();
	void Action_None();
	void Action_KeepDistance();
	void Action_GoAroundSide();
	void Action_Chase();
	void Action_Attack();
};

// 0x10 (0x448 - 0x438)
// Class DXM.TTLAIActionBossSnakFinComponent
class UTTLAIActionBossSnakFinComponent : public UTTLAIActionComponent
{
public:
	class ATTLBaseENBossSnakFin*                 SelfPawn;                                          // 0x438(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Initialized;                                       // 0x440(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1085[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionBossSnakFinComponent* GetDefaultObj();

	bool Start_Wait();
	bool Start_Attack();
	void Process_Wait();
	void Process_Attack();
	bool IsExistTarget();
	bool End_Attack();
};

// 0x0 (0x470 - 0x470)
// Class DXM.TTLAIActionSupportDroneComponent
class UTTLAIActionSupportDroneComponent : public UTTLAIActionBaseDroneComponent
{
public:

	static class UClass* StaticClass();
	static class UTTLAIActionSupportDroneComponent* GetDefaultObj();

};

// 0x10 (0x480 - 0x470)
// Class DXM.TTLAIActionDecoyCarrierComponent
class UTTLAIActionDecoyCarrierComponent : public UTTLAIActionSupportDroneComponent
{
public:
	float                                        DecoyCountMin;                                     // 0x470(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DecoyCountMax;                                     // 0x474(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ShootIntervalDefault;                              // 0x478(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ShootIntervalBattle;                               // 0x47C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UTTLAIActionDecoyCarrierComponent* GetDefaultObj();

	void SetBattleMode(bool IsBattle);
	void AIInit_Implementation(class AActor* MyActor);
};

// 0x218 (0x650 - 0x438)
// Class DXM.TTLAIActionENBossSnak01Component
class UTTLAIActionENBossSnak01Component : public UTTLAIActionComponent
{
public:
	TArray<struct FTTLENBossSnakPath>            FirstSnakPaths;                                    // 0x438(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTTLENBossSnakPath>            SecondSnakPaths;                                   // 0x448(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        SwitchPathTime;                                    // 0x458(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              SwithPathAngleLimit;                               // 0x45C(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                        ChangeSpeedCoolTime;                               // 0x468(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CheckNextPathDistance;                             // 0x46C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PitchAdjustAngle;                                  // 0x470(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RollDistance;                                      // 0x474(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RollCountMin;                                      // 0x478(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RollCountMax;                                      // 0x47C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EnemyAppInterval;                                  // 0x480(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MissileInterval;                                   // 0x484(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MissileNum;                                        // 0x488(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TailJointNum;                                      // 0x48C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TailRadius;                                        // 0x490(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1091[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class ETTLENBossSnakGenStopType, struct FTTLENBossSnakActionGenPoint> StopGenPoints;                                     // 0x498(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	float                                        CircleCapsuleHeight;                               // 0x4E8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CircleCapsuleRadius;                               // 0x4EC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  CircleWeaponName;                                  // 0x4F0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CircleAttackStartTime;                             // 0x4F8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CircleTime;                                        // 0x4FC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ATriggerBase*>                  CircleAreas;                                       // 0x500(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        CircleCoolTime;                                    // 0x510(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ArkGunModeAttackTime;                              // 0x514(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ArkGunModeCoolTime;                                // 0x518(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RightAngleTime;                                    // 0x51C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ATriggerBase*>                  ChaseAreas;                                        // 0x520(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        ChaceDistance;                                     // 0x530(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaceTime;                                         // 0x534(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaceRate;                                         // 0x538(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CheckAreaOutStartTime;                             // 0x53C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsUseTriggerBox;                                   // 0x540(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1094[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        NoTriggerChaseDistance;                            // 0x544(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaseCoolTime;                                     // 0x548(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Initialized;                                       // 0x54C(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1095[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                TargetActor;                                       // 0x550(0x8)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLENBossSnakActions             CurrentAction;                                     // 0x558(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsTransform;                                       // 0x559(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsTailAttack;                                      // 0x55A(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1096[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ChaseStartDir;                                     // 0x55C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ApproachTimeOut;                                   // 0x560(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CircleRadius;                                      // 0x564(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DiffZ;                                             // 0x568(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DiffZRate;                                         // 0x56C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1097[0x7C];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AutoArkGunWaitTime;                                // 0x5EC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AutoArkGunModeAttackTime;                          // 0x5F0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1098[0x5C];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionENBossSnak01Component* GetDefaultObj();

	void Transform_Start();
	void Transform_End();
	void Roll_Start();
	void RightAngle_Start();
	void OnComponentEndOverlapCircleArea(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnComponentBeginOverlapCircleArea(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void MulticastStartDonutsAttack();
	void MulticastStartAction(enum class ETTLENBossSnak01AICtrl ActionNo, int32 ExecuteLevel);
	void MulticastRollStart(int8 Direction, int8 Count);
	void MulticastCircleStart(int8 SurroundType);
	void Missile_Start();
	void EnemySpawn_Start();
	void DebugStartAction_Change();
	void DebugStartAction_ArkGun();
	bool DamageReaction_Start(enum class ETTLENBossSnakDamageType DamageType);
	void DamageReaction_End();
	void Circle_Start();
	bool CheckState(enum class ETTLENBossSnakActions Action);
	enum class ETTLBossAICtrlResult Check_Tail();
	enum class ETTLBossAICtrlResult Check_Roll();
	enum class ETTLBossAICtrlResult Check_RightAngle();
	enum class ETTLBossAICtrlResult Check_Missile();
	enum class ETTLBossAICtrlResult Check_EnemySpawn();
	enum class ETTLBossAICtrlResult Check_DamageReaction(int32* OutType);
	enum class ETTLBossAICtrlResult Check_Circle();
	enum class ETTLBossAICtrlResult Check_ChangeSpeed();
	enum class ETTLBossAICtrlResult Check_Chace();
	enum class ETTLBossAICtrlResult Check_ArkGunMode();
	void ChangeSpeed_Start(int32 Type);
	void Chace_Start(class AActor* TargetActor);
	void ArkGunMode_Start();
	void ActionTail_Start();
	void ActionTail_Finish();
	void ActionNone_Start();
};

// 0x128 (0x560 - 0x438)
// Class DXM.TTLAIActionENBossTrts01Component
class UTTLAIActionENBossTrts01Component : public UTTLAIActionComponent
{
public:
	class AActor*                                TargetActor;                                       // 0x438(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsEnableUpdateTargetActor;                         // 0x440(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10D9[0xAF];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class ATTLENBossTrts01Character*             SelfCharacter;                                     // 0x4F0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10DA[0x68];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionENBossTrts01Component* GetDefaultObj();

	bool WholeBodyBarrier_Start(int32 Level);
	bool WholeBodyBarrier_InAction();
	enum class ETTLBossAICtrlResult WholeBodyBarrier_Check();
	void UpdateTargetActor(class AActor* Target);
	bool Turn_Start(int32 Level, float Yaw);
	bool Turn_InAction();
	enum class ETTLBossAICtrlResult Turn_Check(int32 Level, float* OutYaw);
	bool Tackle_Start(int32 InLevel, class AActor* InTargetActor);
	bool Tackle_InAction();
	enum class ETTLBossAICtrlResult Tackle_Check(int32 ExecuteLevel, class AActor** OutTargetActor);
	bool SummonEnemy_Start(int32 Level);
	bool SummonEnemy_InAction();
	void SummonEnemy_Destroy();
	enum class ETTLBossAICtrlResult SummonEnemy_Check(int32* OutCount);
	void StampJump_TakeOff();
	bool StampJump_Start(int32 Level, const struct FVector& Point);
	bool StampJump_InAction();
	enum class ETTLBossAICtrlResult StampJump_Check(int32 ExecuteLevel, struct FVector* OutPoint);
	bool Stamp_Start(int32 Level, class AActor* Target, int32 Foot);
	bool Stamp_InAction();
	enum class ETTLBossAICtrlResult Stamp_Check(class AActor** OutTargetActor, int32* OutFoot);
	bool SliceLaser_Start(int32 Level);
	bool SliceLaser_InAction();
	enum class ETTLBossAICtrlResult SliceLaser_Check();
	void ShortJump_TakeOff();
	bool ShortJump_Start(int32 Level, const struct FVector& Point);
	bool ShortJump_InAction();
	enum class ETTLBossAICtrlResult ShortJump_Check(int32 ExecuteLevel, int32 CheckType, int32* OutDirection, struct FVector* OutPoint);
	bool ShootMissile_Start(int32 Level);
	bool ShootMissile_InAction();
	enum class ETTLBossAICtrlResult ShootMissile_Check(int32 ExecuteLevel);
	void MulticastStartDamageReaction(int32 No);
	void MulticastShootMissileStart(int32 Level);
	void MulticastEndDamageReaction();
	void MulticastCannonAttackStart(int32 Level);
	bool Move_Start(int32 Level);
	bool Move_InAction();
	void LongJump_TakeOff();
	bool LongJump_Start(int32 Level, const struct FVector& Point);
	bool LongJump_InAction();
	enum class ETTLBossAICtrlResult LongJump_Check(int32 Level, int32 CheckType, struct FVector* OutPoint);
	bool Idle_Start(class ATTLENBossTrts01Character* POwner);
	bool ExtraThickLaser_Start(int32 Level);
	bool ExtraThickLaser_InAction();
	enum class ETTLBossAICtrlResult ExtraThickLaser_Check(int32 Level);
	bool DeathIdle_Start();
	bool Death_Start();
	bool Death_InAction();
	enum class ETTLBossAICtrlResult Death_Check();
	bool DamageReaction_Start(int32 No);
	bool DamageReaction_RequestLaserDamage();
	bool DamageReaction_InAction();
	enum class ETTLBossAICtrlResult DamageReaction_Check(int32* OutType);
	bool CannonAttack_Start(int32 Level);
	bool CannonAttack_SetFree(bool Value, int32 Level);
	bool CannonAttack_IsFree();
	bool CannonAttack_InAction();
	enum class ETTLBossAICtrlResult CannonAttack_Check(int32* OutCount);
	bool Anger_Start();
	bool Anger_InAction();
	enum class ETTLBossAICtrlResult Anger_Check();
	void AIInit_Implementation(class AActor* MyActor);
};

// 0xA8 (0x4E0 - 0x438)
// Class DXM.TTLAIActionFeryBaseComponent
class UTTLAIActionFeryBaseComponent : public UTTLAIActionComponent
{
public:
	class ATTLENFeryBasePawn*                    SelfFeryPawn;                                      // 0x438(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBoxComponent*                         SelfBoxCollision;                                  // 0x440(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrentPointIndex;                                 // 0x448(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10E3[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ATriggerBase*>                  DischargeAreas;                                    // 0x450(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        DischargeTime;                                     // 0x460(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DischargeWaitTime;                                 // 0x464(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                          DischargeSockets;                                  // 0x468(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class ATTLSpawnContainerBaseCharacter*> DischargeActors;                                   // 0x478(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnHatchOpen;                                       // 0x488(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnHatchClose;                                      // 0x498(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	float                                        WaitTime;                                          // 0x4A8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WaitTimer;                                         // 0x4AC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        WaitFlags;                                         // 0x4B0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10E4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVector>                       DischargeDropVector;                               // 0x4B8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	uint8                                        Pad_10E5[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionFeryBaseComponent* GetDefaultObj();

	void SetTargetPointPawn(struct FVector& TargetPoint);
	void SetEnableMovePawn(bool Enable);
	void ReleaseContainer();
	bool IsInDischargeArea(class AActor* Actor);
	bool IsEndRotationPawn();
	struct FVector GetTargetPointPawn();
	float GetPitchMaxPawn();
	struct FRotator GetDeltaRotationPawn();
	int32 FindNearestPathPoint();
	void EndAction_Discharge();
	void CallWait(struct FVector& Target, float WaitTime, int32 WaitType, enum class ETTLAIActionType NextAction, enum class ETTLENFeryBossActions bossAction);
};

// 0xA70 (0xF50 - 0x4E0)
// Class DXM.TTLAIActionFeryBoss01Component
class UTTLAIActionFeryBoss01Component : public UTTLAIActionFeryBaseComponent
{
public:
	UMulticastDelegateProperty_                  OnAngry;                                           // 0x4E0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnACRush00Start;                                   // 0x4F0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnACRush00End;                                     // 0x500(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnReinforce;                                       // 0x510(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnSmallDamageNormal;                               // 0x520(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnLergeDamageNormal;                               // 0x530(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnSmallDamageAngry;                                // 0x540(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnLergeDamageAngry;                                // 0x550(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnMissileOpen;                                     // 0x560(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnMissileClose;                                    // 0x570(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnMissileFire;                                     // 0x580(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnMultiLaserOpen;                                  // 0x590(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnMultiLaserClose;                                 // 0x5A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnMotionDeath;                                     // 0x5B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	float                                        HeightMin;                                         // 0x5C0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1106[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ATargetPoint*>                  MinimumHeightCheckPoint;                           // 0x5C8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        ChaceHeightRange;                                  // 0x5D8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaceDistance;                                     // 0x5DC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaceDuration;                                     // 0x5E0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaceSpeed;                                        // 0x5E4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaceTurnSpeed;                                    // 0x5E8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaceAccelTime;                                    // 0x5EC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaceReduceTime;                                   // 0x5F0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaceWaitTime;                                     // 0x5F4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaceKeepDistance;                                 // 0x5F8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaceKeepTime;                                     // 0x5FC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           ChaceSignVFX;                                      // 0x600(0x98)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           ChaceThrusterVFX;                                  // 0x698(0x98)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           ChaceThrusterFinishVFX;                            // 0x730(0x98)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        ChaceOverlapActors;                                // 0x7C8(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        AngryChaceAccelTime;                               // 0x7D8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AngryChaceAccelRate;                               // 0x7DC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaceCameraShakeDistance;                          // 0x7E0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaceCameraShakeScale;                             // 0x7E4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaceHitCameraShakeScale;                          // 0x7E8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AngryMoveSpeedScale;                               // 0x7EC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AngryChaceTurnSpeedScale;                          // 0x7F0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AngryEyeAmpRate;                                   // 0x7F4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          AngryEyeColor;                                     // 0x7F8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           AngryEyeVFX;                                       // 0x808(0x98)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                         IsAngry;                                           // 0x8A0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1107[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ATargetPoint*>                  BreakAwayPoints;                                   // 0x8A8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        BreakAwayTurnTime;                                 // 0x8B8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BreakAwayMoveSpeed;                                // 0x8BC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BreakAwayCooldownTime;                             // 0x8C0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BreakAwayPlayerCheckTime;                          // 0x8C4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsBreakAway;                                       // 0x8C8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1109[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ATargetPoint*>                  FrontReturnPoints;                                 // 0x8D0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        FrontReturnSpeed;                                  // 0x8E0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FrontReturnReduceTime;                             // 0x8E4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class APawn>                     ReinforcePawn;                                     // 0x8E8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReinforceCountMax;                                 // 0x8F0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ReinforceCountMin;                                 // 0x8F4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReinforceDistane;                                  // 0x8F8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReinforceSpawnTime;                                // 0x8FC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class ATTLSplinePath*>                ReinforcePaths;                                    // 0x900(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           ReinforceVFX;                                      // 0x910(0x98)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                        ReinforceVFXTime;                                  // 0x9A8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReinforceWaitTime;                                 // 0x9AC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class APawn*>                         ReinforceSpawns;                                   // 0x9B0(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        MissileFireInterval;                               // 0x9C0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MissileCloseTime;                                  // 0x9C4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MissileWaitTime;                                   // 0x9C8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MissileFireMax;                                    // 0x9CC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LaserChargeTime;                                   // 0x9D0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LaserShootTime;                                    // 0x9D4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LaserWaitTime;                                     // 0x9D8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GunDistance;                                       // 0x9DC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GunDeltaRotation;                                  // 0x9E0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GunAprochTime;                                     // 0x9E4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DischargeCooldownTime;                             // 0x9E8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_110C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FTTLENBossferyContainerTable>  ContainerTables;                                   // 0x9F0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTTLENBossferyContainerCounter> ContainerCounters;                                 // 0xA00(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           DamageReactionVFX;                                 // 0xA10(0x98)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                        DamageReactionVFXTime;                             // 0xAA8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Initialized;                                       // 0xAAC(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_110D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ChaceDuration2;                                    // 0xAB0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaceSpeed2;                                       // 0xAB4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaceTurnSpeed2;                                   // 0xAB8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaceAccelTime2;                                   // 0xABC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaceReduceTime2;                                  // 0xAC0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaceWaitTime2;                                    // 0xAC4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaceKeepTime2;                                    // 0xAC8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ChaseHighDamageRate;                               // 0xACC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTTLBasicStatusComponent*              BasicStatus;                                       // 0xAD0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GunNearestDistance;                                // 0xAD8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GunFarDistance;                                    // 0xADC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PathPointNearestDistance;                          // 0xAE0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReachTargetDistance;                               // 0xAE4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_110E[0x28];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTTLFxPlayback                        ChaceSignVFXPlayback00;                            // 0xB10(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaceSignVFXPlayback01;                            // 0xB28(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaceSignVFXPlayback02;                            // 0xB40(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaceSignVFXPlayback03;                            // 0xB58(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaceThrusterVFXPlayback00;                        // 0xB70(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaceThrusterVFXPlayback01;                        // 0xB88(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaceThrusterVFXPlayback02;                        // 0xBA0(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaceThrusterVFXPlayback03;                        // 0xBB8(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaceThrusterVFXPlayback10;                        // 0xBD0(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaceThrusterVFXPlayback11;                        // 0xBE8(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaceThrusterVFXPlayback12;                        // 0xC00(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaceThrusterVFXPlayback13;                        // 0xC18(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaceThrusterVFXPlayback20;                        // 0xC30(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaceThrusterVFXPlayback21;                        // 0xC48(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaceThrusterVFXPlayback22;                        // 0xC60(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaceThrusterVFXPlayback23;                        // 0xC78(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaceThrusterVFXPlayback30;                        // 0xC90(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaceThrusterVFXPlayback31;                        // 0xCA8(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaceThrusterVFXPlayback32;                        // 0xCC0(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaceThrusterVFXPlayback33;                        // 0xCD8(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_110F[0x40];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTTLFxPlayback                        DamageReactionVFXPlayback;                         // 0xD30(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1110[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FTTLENBossGraveYard>           DeleteList;                                        // 0xD50(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1111[0x30];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTTLFxPlayback                        AngryVFXPlayback;                                  // 0xD90(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ReinforceVFXPlayback;                              // 0xDA8(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaseThrusterFinishVFXPlayback48;                  // 0xDC0(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaseThrusterFinishVFXPlayback49;                  // 0xDD8(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaseThrusterFinishVFXPlayback50;                  // 0xDF0(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaseThrusterFinishVFXPlayback51;                  // 0xE08(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaseThrusterFinishVFXPlayback40;                  // 0xE20(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaseThrusterFinishVFXPlayback41;                  // 0xE38(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaseThrusterFinishVFXPlayback42;                  // 0xE50(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaseThrusterFinishVFXPlayback43;                  // 0xE68(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaseThrusterFinishVFXPlayback52;                  // 0xE80(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaseThrusterFinishVFXPlayback53;                  // 0xE98(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaseThrusterFinishVFXPlayback54;                  // 0xEB0(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaseThrusterFinishVFXPlayback55;                  // 0xEC8(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaseThrusterFinishVFXPlayback44;                  // 0xEE0(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaseThrusterFinishVFXPlayback45;                  // 0xEF8(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaseThrusterFinishVFXPlayback46;                  // 0xF10(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FTTLFxPlayback                        ChaseThrusterFinishVFXPlayback47;                  // 0xF28(0x18)(NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1112[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionFeryBoss01Component* GetDefaultObj();

	bool WeaponRight_Check(class AActor* Actor);
	void WeakDestroyCountUp();
	bool TargetIsMinHeight(class AActor* Target);
	void StopShakeCamera();
	bool StartMultiLaser(int32 Parameter);
	bool StartMissileFire(class AActor* TargetActor);
	bool StartDamageReaction(enum class ETTLENFeryBossDamages DamageType);
	bool StartActionTurn(class AActor* TargetActor);
	bool StartActionReinforce();
	bool StartActionFrontReturn(class ATargetPoint* Point);
	bool StartActionBreakAway(class ATargetPoint* Point, int32 ActionNo);
	bool StartActionAngry();
	void ShakeCameraHitCharge(class AActor* Actor);
	void RequestSpawnReinforce(const struct FRotator& Rotation);
	void OnDestroyedDischargeActor(class AActor* Actor);
	void MultiLaserOpen();
	void MultiLaserClose();
	void MulticastStartAction(int32 ActionNo, int32 ExecuteLevel, class AActor* TargetActor, int8 Parameter);
	void MissileOpen();
	void MissileFireEnd();
	void MissileClose();
	bool IsReinforce();
	bool IsInChaceArea(class AActor* Actor);
	bool IsBreakAwayConditions();
	float GetTurnBlend();
	int32 GetReinforcePathsEmptyCount();
	struct FVector GetFowardLocationXY(float Distance);
	void ForceCoolDown();
	bool Discharge_Check(int32 PatternNo);
	void DestroyVFX();
	void DestroyContainers();
	void DestroyChaceThrusterVFXBP(float Delay);
	void DestroyChaceThrusterVFX();
	void DamageReactionEnd();
	void CreateContainers();
	void AngryEnd();
	void ACRush00StartEnd();
	void ACRush00EndEnd();
};

// 0x98 (0x578 - 0x4E0)
// Class DXM.TTLAIActionFeryNrml01Component
class UTTLAIActionFeryNrml01Component : public UTTLAIActionFeryBaseComponent
{
public:
	int32                                        PatrolMax;                                         // 0x4E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HeightMax;                                         // 0x4E4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HeightMin;                                         // 0x4E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1115[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSubclassOf<class ATTLSpawnContainerBaseCharacter>> DischargeClassesS;                                 // 0x4F0(0x10)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class ATTLSpawnContainerBaseCharacter>> DischargeClassesL;                                 // 0x500(0x10)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class FName                                  DischargeSocketL;                                  // 0x510(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsDischargedL;                                     // 0x518(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1116[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DischargeLTime;                                    // 0x51C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DischargeLTimer;                                   // 0x520(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DischargeLWaitTime;                                // 0x524(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DischargeLWaitTimer;                               // 0x528(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1117[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FTTLSpawnHateTarget>           SpawnHateTargets;                                  // 0x530(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        SpawnMissionTargets;                               // 0x540(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        DischargeMax;                                      // 0x550(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SpawnInGameMax;                                    // 0x554(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1118[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionFeryNrml01Component* GetDefaultObj();

	void OnDestroyedDischargeActor(class AActor* Actor);
	bool IsEndPatrol();
};

// 0x90 (0x4C8 - 0x438)
// Class DXM.TTLAIActionFighterComponent
class UTTLAIActionFighterComponent : public UTTLAIActionComponent
{
public:
	class ATTLFighterPawn*                       SelfFighterPawn;                                   // 0x438(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               ActionVelocity;                                    // 0x440(0xC)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Initialized;                                       // 0x44C(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1120[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ATTLEnemyWeaponBase*                   EnemyWeapon;                                       // 0x450(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxMoveSpeed;                                      // 0x458(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MoveSpeedChangeRate;                               // 0x45C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RotateSpeed;                                       // 0x460(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AlongValue;                                        // 0x464(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ZSpeedOnPatrol;                                    // 0x468(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RotateSpeedOnChase;                                // 0x46C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CheckSkipOnChase;                                  // 0x470(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AvoidDistanceMax;                                  // 0x474(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RotateSpeedOnAvoid;                                // 0x478(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ZMaxOnChase;                                       // 0x47C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ZMinOnChase;                                       // 0x480(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ZSpeedOnChase;                                     // 0x484(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsEnableAvoid;                                     // 0x488(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1121[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CheckDistanceInAvoid;                              // 0x48C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RotateSpeedOnInAvoid;                              // 0x490(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HitAfterSecondsInAvoid;                            // 0x494(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ShowDebugLineInAvoid;                              // 0x498(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1122[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxMoveSpeedInAvoid;                               // 0x49C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1123[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionFighterComponent* GetDefaultObj();

	void OpenHatch();
	void MoveZOnChase();
	bool IsTargetInRange(class AActor* TargetActor, float RangeDegree);
	bool IsTargetFront(class AActor* TargetActor);
	bool FighterAction_StartAttack(class AActor* TargetActor);
	void FighterAction_Patrol();
	bool FighterAction_EndAttack();
	void FighterAction_Chase();
	bool FighterAction_Avoid();
	void FighterAction_AttackCenter();
	void FighterAction_AttackBothSide();
	void CloseHatch();
	void AvoidOnChase(class AActor* TargetActor);
};

// 0x8 (0x478 - 0x470)
// Class DXM.TTLAIActionFunnelPawnComponent
class UTTLAIActionFunnelPawnComponent : public UTTLAIActionSupportDroneComponent
{
public:
	uint8                                        Pad_1124[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionFunnelPawnComponent* GetDefaultObj();

	void Action_Chase();
};

// 0x18 (0x488 - 0x470)
// Class DXM.TTLAIActionGuardDroneComponent
class UTTLAIActionGuardDroneComponent : public UTTLAIActionSupportDroneComponent
{
public:
	float                                        CoverInterval;                                     // 0x470(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AproachDistance;                                   // 0x474(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BreakAwayDistance;                                 // 0x478(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BlockDistance;                                     // 0x47C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1127[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionGuardDroneComponent* GetDefaultObj();

	bool IsLockonedAreaActors(class AActor* TargetActor);
	bool InBreakAwayRanget(class AActor* TargetActor);
	class AActor* GetFollowActorTarget();
};

// 0x28 (0x480 - 0x458)
// Class DXM.TTLAIActionHeliFlashComponent
class UTTLAIActionHeliFlashComponent : public UTTLAIActionBaseCannonComponent
{
public:
	float                                        DefaultDurationTime;                               // 0x458(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefaultIntervalTime;                               // 0x45C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DefaultRapidRate;                                  // 0x460(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FollowDurationTime;                                // 0x464(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FollowIntervalTime;                                // 0x468(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        FollowRapidRate;                                   // 0x46C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1128[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionHeliFlashComponent* GetDefaultObj();

	void SetFollowFirearm(bool IsFollow);
};

// 0x8 (0x4D0 - 0x4C8)
// Class DXM.TTLAIActionHFightStelComponent
class UTTLAIActionHFightStelComponent : public UTTLAIActionFighterComponent
{
public:
	class ATTLENFightStelPawn*                   SelfFightStelPawn;                                 // 0x4C8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UTTLAIActionHFightStelComponent* GetDefaultObj();

	void FighterAction_AttackPinpoint();
	void FighterAction_AttackMissile();
	void FighterAction_AttackDrop();
};

// 0x8 (0x478 - 0x470)
// Class DXM.TTLAIActionJammerDroneComponent
class UTTLAIActionJammerDroneComponent : public UTTLAIActionSupportDroneComponent
{
public:
	uint8                                        Pad_1129[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionJammerDroneComponent* GetDefaultObj();

};

// 0x98 (0x4D0 - 0x438)
// Class DXM.TTLAIActionLRangeLaserComponent
class UTTLAIActionLRangeLaserComponent : public UTTLAIActionComponent
{
public:
	bool                                         IsDynamicSearchRadius;                             // 0x438(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_112A[0x4B];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RotationSpeed;                                     // 0x484(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         IsLockOn;                                          // 0x488(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_112B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LockOnTargetTime;                                  // 0x48C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LockOnTargetTimeLimit;                             // 0x490(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ETTLAILRangeLaser_State           CurrentState;                                      // 0x494(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_112C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxNumOfShot;                                      // 0x498(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        CurrentShotNum;                                    // 0x49C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ShotInterval;                                      // 0x4A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CurrentShotTime;                                   // 0x4A4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CheckAttackRangeFrameSpan;                         // 0x4A8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_112D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        StartAttackInterval;                               // 0x4B0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CurrentStartAttackInterval;                        // 0x4B4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CurrentEndAttackInterval;                          // 0x4B8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CurrenWaitLaserEnd;                                // 0x4BC(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CurrenWaitTimeForBroken;                           // 0x4C0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_112E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ATTLLongRangeLaserCannon*              SelfPawn;                                          // 0x4C8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UTTLAIActionLRangeLaserComponent* GetDefaultObj();

	void Wait_LRangeLaser();
	bool StartWait_LRangeLaser();
	bool StartAttack_LRangeLaser();
	bool IsOverLockOnTimeLimit();
	bool IsInRaysForTarget();
	bool FinishAttack_LRangeLaser();
	void Attack_LRangeLaser();
};

// 0x20 (0x490 - 0x470)
// Class DXM.TTLAIActionMineThrowerComponent
class UTTLAIActionMineThrowerComponent : public UTTLAIActionSupportDroneComponent
{
public:
	float                                        MineCountMin;                                      // 0x470(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MineCountMax;                                      // 0x474(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_112F[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionMineThrowerComponent* GetDefaultObj();

	bool StartActionEscapeMine();
	bool IsShootInterval();
	bool IsInRangeMine();
};

// 0x10 (0x460 - 0x450)
// Class DXM.TTLAIActionMissilerTankComponent
class UTTLAIActionMissilerTankComponent : public UTTLAIActionStrongTankComponent
{
public:
	class ATTLMissilerTankPawn*                  SelfMissilerTankPawn;                              // 0x450(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTTLFirearmControlComponent*           SelfMissileFirearmControlComponent;                // 0x458(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UTTLAIActionMissilerTankComponent* GetDefaultObj();

	void TankMissilerAction_AttackNormalBullet();
	void TankMissilerAction_AttackMissile();
	bool Attack_Start();
	bool Attack_End();
};

// 0x68 (0x4A0 - 0x438)
// Class DXM.TTLAIActionOuterComponent
class UTTLAIActionOuterComponent : public UTTLAIActionComponent
{
public:
	class ATTLCharacterCommon*                   SelfOuterPawn;                                     // 0x438(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsInitialized;                                     // 0x440(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1134[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PathResearchInterval;                              // 0x444(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsBeginOuterSupportAttack;                         // 0x448(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1135[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                OwnerArsenal;                                      // 0x450(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RunSpeedRate;                                      // 0x458(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SetTrapDistanceMin;                                // 0x45C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsDrawDebugPath;                                   // 0x460(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1136[0x3F];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIActionOuterComponent* GetDefaultObj();

	void OuterAction_SelfExplosion();
	void OuterAction_PatrolTargetPoint();
	void OuterAction_PatrolActionArea();
	void OuterAction_Patrol();
	void OuterAction_None();
	void OuterAction_KeepDistance();
	void OuterAction_GoAroundSide();
	void OuterAction_Chase();
	void OuterAction_AttackSupport();
	void OuterAction_AttackSub();
	void OuterAction_AttackMain();
	bool FireOuterSupportWeapon();
	bool FireOuterSubWeapon();
	bool FireOuterSelfExplosion();
	bool FireOuterMainWeapon();
};

// 0x8 (0xF8 - 0xF0)
// Class DXM.TTLAISpecialActionComponent
class UTTLAISpecialActionComponent : public UActorComponent
{
public:
	float                                        CoolTime;                                          // 0xF0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CurrentCoolTime;                                   // 0xF4(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UTTLAISpecialActionComponent* GetDefaultObj();

	void StartActionBP(bool* IsBegun);
	bool StartAction();
	void InitializeAction(class AActor* Owner);
	bool ForceSetEndState();
	void ExecuteActionBP(float DeltaTime, class ATTLCharacter* Character, bool* IsEnd);
	bool ExecuteAction(float DeltaTime, class ATTLCharacter* Character);
	void EndActionBP(bool* RetVal);
	bool EndAction();
};

// 0x150 (0x248 - 0xF8)
// Class DXM.TTLAIBaseJammerComponent
class UTTLAIBaseJammerComponent : public UTTLAISpecialActionComponent
{
public:
	class UTTLDamageParameterComponent*          DamageParameter;                                   // 0xF8(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTTLFxParam                           JammerVFX;                                         // 0x100(0x98)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                        JammerTime;                                        // 0x198(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        JammerCooldownTime;                                // 0x19C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        JammerAreaRadius;                                  // 0x1A0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        JammerMaterialIndex;                               // 0x1A4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefaultBlinkRate;                                  // 0x1A8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefaultEmissionPower;                              // 0x1AC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          DefaultEmissionColor;                              // 0x1B0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        JammerBlinkRate;                                   // 0x1C0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        JammerEmissionPower;                               // 0x1C4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          JammerEmissionColor;                               // 0x1C8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1141[0x30];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTTLJammerControl                     JammerControl;                                     // 0x208(0x40)(NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UTTLAIBaseJammerComponent* GetDefaultObj();

	void OnJammerSphereEndOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnJammerSphereBeginOverlap(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void OnDestoryedOwner(class AActor* Actor);
	void Multicast_StartJammerWait();
	void Multicast_EndJammerWait();
};

// 0x18 (0x260 - 0x248)
// Class DXM.TTLAIArmorJammerComponent
class UTTLAIArmorJammerComponent : public UTTLAIBaseJammerComponent
{
public:
	class FName                                  VFXSocket;                                         // 0x248(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1142[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIArmorJammerComponent* GetDefaultObj();

};

// 0x80 (0x4B8 - 0x438)
// Class DXM.TTLAIController
class ATTLAIController : public AAIController
{
public:
	class AActor*                                MyActor;                                           // 0x438(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTTLAIActionComponent*                 MyAIAction;                                        // 0x440(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                PlayerActor;                                       // 0x448(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                TargetActor;                                       // 0x450(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ProcessCount;                                      // 0x458(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLAIState                       AIState;                                           // 0x45C(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETTLAIWeaponEnum                  AICurrentWeapon;                                   // 0x45D(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11E7[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTTLBasicStatusComponent*              MyStatus;                                          // 0x460(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TrackLeaderStartDistance;                          // 0x468(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TrackLeaderEndDistance;                            // 0x46C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsFollowingLeader;                                 // 0x470(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11E8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               FirstSpawnLocation;                                // 0x474(0xC)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ProcessTime;                                       // 0x480(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PauseTime;                                         // 0x484(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_11E9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        AIInnerState;                                      // 0x48C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_11EA[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FTTLAIBranchTimer>             BranchTimer;                                       // 0x4A0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	bool                                         IsStopAI;                                          // 0x4B0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         DebugIsMultiplayAi;                                // 0x4B1(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_11EB[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ATTLAIController* GetDefaultObj();

	void UpdateMyActorAndComponents();
	void UpdateLeaderLiving();
	void StartQuickBoost(float Seconds);
	bool StartMirage();
	void StartImpermanentStatusForAbyss(class AActor* StatusActor, float AttackBuffRate, float BuffLength, float DebuffLength);
	bool StartGuardWithMove();
	bool StartGetOnArsenal();
	bool StartGetOffArsenal();
	bool StartFemtoShift(enum class ETTLAIFemtoShiftType Type);
	void SetUseArsenalSpecialWait(class AActor* SetArsenal, bool Flag);
	void SetStopAI(bool Flag);
	bool SetNPCBelongingType(enum class ETTLNPCBelongingType Type);
	void SetLinkNPC();
	void SetLeaderActor(class AActor* Actor);
	void SetIsReversePersonality(bool Flag);
	void SetFriendAIParam();
	void SetCurrentSupportTarget(class AActor* Actor);
	void SetControllerSwitch(bool Value, enum class ETTLAIControllerSwitch SwitchIndex);
	void SetBurstShootMode(bool Value, bool IsLeft);
	void SetAIFlag(enum class ETTLAIFlag Flag, bool Value);
	void SelectWeaponManual(enum class ETTLAIWeaponEnum Weapon);
	void SelectWeapon(enum class ETTLAIWeaponEnum* OutputWeapon);
	void SelectSPMove(enum class ETTLAIYesNoEnum* OutputYesNo);
	void SelectGuard(enum class ETTLAIYesNoEnum* OutputYesNo);
	void ResetAttackDelayTimer();
	void RequestCommunicationMessageFromAIController(enum class ETTLCommunicationTalkTerm TermIndex);
	void RemoveAICallbackDelegate(class UTTLAIActionComponent* AIAction);
	bool OutOfSoftCollision(class AActor* Actor, struct FVector* NearestPos);
	void OnReactionWithParamDelegate(enum class ETTLAIReaction Type, const struct FTTLAIReactionParam& Param);
	void OnHateTargetChangedDelegate(class AActor* TargetActor);
	void OnGetOnArsenalBP();
	void OnGetOnArsenal();
	void OnGetOffArsenalBP();
	void OnGetOffArsenal();
	void OnActionChangedDelegate(enum class ETTLAIActionType before, enum class ETTLAIActionType After);
	void JudgeIsLeaderMyself(enum class ETTLAIYesNoEnum* OutputYesNo);
	void JudgeAndDoSpecialAction(enum class ETTLAIYesNoEnum* OutputYesNo);
	bool IsUsingSpecialWeapon();
	bool IsSupportTarget(class AActor* Actor);
	bool IsStunActor(class AActor* Actor);
	bool IsRunningForwardActor(class AActor* Actor);
	bool IsQuickBoosting();
	bool IsNoneTargetPoint();
	bool IsNonePatrolPath();
	bool IsMissionFinished();
	bool IsGroundOnlyWeapon(enum class ETTLAIWeaponEnum CheckWeapon);
	bool IsFemtoRateUpperValue(float Value);
	bool IsExistSupportTarget();
	bool IsExistNearArsenal(class AActor* Actor, float Distance);
	bool IsExistGround(float CheckHeight);
	bool IsExistFollower();
	bool IsExistActionArea();
	bool IsEquippedWeaponAtParts(enum class ETTLWeaponType WeaponType, enum class ETTLAIWeaponEnum Parts);
	bool IsEquippedWeapon(enum class ETTLWeaponType WeaponType, enum class ETTLAIWeaponEnum* Parts);
	bool IsEquipeedWeaponAtWeaponRack(enum class ETTLWeaponType WeaponType, enum class ETTLAIWeaponPart WeaponRackPart);
	bool IsEnableSeriousBoost();
	bool IsDoingSpecialAction();
	bool IsDeadActor(class AActor* Actor);
	bool IsContinuedSameAIAction(float CheckTime, enum class ETTLAIActionType* CurrentAction);
	bool IsCloseCurrentWeapon();
	bool IsAvailableTargetActor();
	bool IsAnyPartsDestroyed();
	bool IsActionNonParallelAttack(class AActor* Actor);
	bool IsAbnormalStatus(class AActor* Actor, enum class ETTLEAbnormalStatusType AbnormalStatusType);
	int32 GetTargetPointNum();
	class AActor* GetTargetActorOfSupportActor();
	class AActor* GetTargetActor(class AActor* Actor);
	class AActor* GetSupportTargetFromList(int32 Index);
	float GetSoftCollisionDistance(class AActor* Actor, struct FVector* NearestPosition);
	class AActor* GetRecoverTarget(float VPCoefficient, float DistCoefficient, float VPRateUpperLimit);
	float GetPauseTimerValue();
	enum class ETTLNPCBelongingType GetNPCBelongingType();
	class AActor* GetNearThrowTarget(const TArray<class UClass*>& IgnoreClasses);
	class ATTLHealBullet* GetNearestHealBullet(class AActor* BaseActor);
	class ATTLSplinePath* GetNearestEscapePath(class AActor* BaseActor, float* DistanceToPath);
	class AActor* GetNearestActorFromArray(const TArray<class AActor*>& ActorArray, bool ExcludeNearArsenal);
	class AActor* GetLowestHPAlly();
	class AActor* GetLeaderActor();
	bool GetIsStopAI();
	bool GetIsReversePersonality();
	int32 GetInnerStateValue();
	struct FVector GetEscapeTargetPosition(class AActor* Actor, float DistanceFromArea);
	float GetEquippedWeaponRange(enum class ETTLAIWeaponPart WeaponPart);
	float GetCurrentWeaponCriticalRange();
	class AActor* GetCurrentSupportTarget();
	float GetCurrentBattleRange();
	bool GetBurstShootMode(bool IsLeft);
	enum class ETTLAISlot GetBestEvaluateTargetPoint(enum class ETTLAIWeaponEnum CurrentWeapon);
	class AActor* GetBeLockedOnFriend(class AActor* CheckActor);
	float GetAIFriendParam(enum class ETTLAIFriendParamType Type);
	bool GetAIFlag(enum class ETTLAIFlag Flag);
	bool FinishParallelAttack();
	bool EndFemtoShift();
	void DoOnceEveryCountNum(enum class ETTLAIYesNoEnum* OutputYesNo, int32 CountNum);
	void DecideAvoidMissileAction(enum class ETTLAIAvoidMissileAction* OutputAvoidAction, float WeightNone, float WeightBoost, float WeightDescent, float WeightShield, float WeightFemto);
	void DebugSetStopAI(bool Flag);
	void DebugSetMultiplayAi();
	bool DebugIsStopAI();
	bool CheckWeaponIsValid(enum class ETTLAIWeaponEnum SelectedWeapon);
	bool CheckUpperAngleLessThan(class AActor* Actor, float CheckAngle);
	bool CheckShootCollision(class AActor* Actor, float* Distance);
	bool CheckOverheat();
	bool CheckMoveType(class AActor* Actor, enum class ETTLAIMoveMode Mode);
	bool CheckLockedOn(class AActor* Actor);
	bool CheckInPatrolPoint(class AActor* Actor, enum class ETTLAISlot Slot);
	bool CheckInPatrolArea(class AActor* Actor);
	bool CheckHPLessThan(class AActor* Actor, float HPPercent);
	bool CheckDistanceLessThan(class AActor* Actor, float Distance);
	bool CheckDamageMovement(class AActor* Actor);
	bool CheckAngleLessThan(class AActor* Actor, float CheckAngle);
	bool Check2DDistanceLessThan(class AActor* Actor, float Distance);
	void CanStartCatchActor(class AActor** CaughtActor, bool* IsCatch, bool* IsLeft);
	bool CanGetOnOffAction();
	void BranchWeaponRangeType(enum class ETTLAILongCloseEnum* OutputLongClose, enum class ETTLAIWeaponEnum Weapon);
	void BranchTimerProbability(enum class ETTLAIYesNoEnum* OutputYesNo, uint8 TimerIndex, float ProbavilityMaxValue);
	void BranchPercent(enum class ETTLAIYesNoEnum* OutputYesNo, float YesPercent);
	void BranchOnSwitch(enum class ETTLAITrueFalseEnum* OutputTrueFalse, enum class ETTLAIControllerSwitch SwitchIndex);
	bool AttackWeaponSpecial(class AActor* TargetActor, bool IsParallelAttack);
	bool AttackWeaponShoulder(class AActor* TargetActor, bool IsParallelAttack);
	bool AttackWeaponRight(class AActor* TargetActor, bool IsParallelAttack);
	bool AttackWeaponLeftRight(class AActor* TargetActor, bool IsParallelAttack);
	bool AttackWeaponLeft(class AActor* TargetActor, bool IsParallelAttack);
	bool AttackWeaponImpl(enum class ETTLAIWeaponEnum Weapon, class AActor* TargetActor, bool IsParallelAttack);
	bool AttackWeaponHandAndShoulder(class AActor* TargetActor, bool IsLeft, bool IsParallelAttack);
	bool AttackWeaponCurrent(class AActor* TargetActor, float Seconds, bool IsParallelAttack);
	bool AttackWeaponAuto(class AActor* TargetActor, float Seconds, bool IsParallelAttack);
	bool AttackWeaponAll(class AActor* TargetActor, bool IsParallelAttack);
	bool AttackAIPause(float Seconds);
	bool AreComponentsValid();
	void AISpecialActionInitialize();
	void AIReaction(enum class ETTLAIReaction Type, const struct FTTLAIReactionParam& Param);
	void AIProcessOuter();
	void AIProcessExHP4();
	void AIProcessExHP3();
	void AIProcessExHP2();
	void AIProcessExHP1();
	void AIProcess();
	void AIInit();
	void AIHateTargetChanged(class AActor* TargetActor);
	void AIAttackFinished();
	void AIActionChanged(enum class ETTLAIActionType before, enum class ETTLAIActionType After);
	void AddMyHateValue(class AActor* HateTarget, int32 AddValue);
	void AddFriendAIParam(enum class ETTLAIFriendParamType Type, float Value);
	void AddFollowerHateValue(class AActor* HateTarget, int32 AddValue);
	void AddAICallbackDelegate(class UTTLAIActionComponent* AIAction);
	bool ActionWait(class AActor* TargetActor, float Distance);
	bool ActionStraightMove(const struct FVector& TargetDirection, float Time);
	bool ActionSpecial(class AActor* TargetActor);
	bool ActionPatrolTargetPoint(class AActor* TargetActor, enum class ETTLAISlot Slot);
	bool ActionPatrolDirectLocation(class AActor* TargetActor, const struct FVector& TargetLocation, float Distance, bool IsFaceToTargetActor, bool IsForce);
	bool ActionPatrolActionArea(class AActor* TargetActor);
	bool ActionPatrol(class AActor* TargetActor);
	void ActionOutOfSoftCollision(enum class ETTLAIYesNoEnum* OutputYesNo);
	bool ActionNone();
	void ActionKeepOutArea(enum class ETTLAIYesNoEnum* OutputYesNo);
	bool ActionKeepDistance(class AActor* TargetActor, float Distance);
	bool ActionGuard(class AActor* TargetActor, float Seconds);
	bool ActionGoToIncomingTargetPoint(class AActor* TargetActor);
	void ActionGoToDefenceArea(enum class ETTLAIYesNoEnum* OutputYesNo);
	bool ActionGoAroundSide(class AActor* TargetActor, float Distance, float Angle, bool IsMoveVertical, float HeightDifference, float DifferenceRange, bool UseCameraAngle);
	void ActionFriendFollowPlayer(enum class ETTLAIYesNoEnum* OutputYesNo);
	void ActionFollowPlayer(enum class ETTLAIYesNoEnum* OutputYesNo);
	void ActionFollowLeader(enum class ETTLAIYesNoEnum* OutputYesNo);
	bool ActionFastApproach(class AActor* TargetActor, float Distance, bool DoGoAroundSide);
	bool ActionExchangeWeapon(bool IsLeft);
	bool ActionEscape(class AActor* TargetActor);
	bool ActionChase(class AActor* TargetActor, float Distance, bool DoGoAroundSide);
	bool ActionChangeWeapon();
	bool ActionChangeMoveType(enum class ETTLAIMoveMode Mode);
	bool ActionBlockAttack(class AActor* TargetActor, class AActor* SupportActor, float DistanceRate);
};

// 0x48 (0x140 - 0xF8)
// Class DXM.TTLAIDeltaAttackComponent
class UTTLAIDeltaAttackComponent : public UTTLAISpecialActionComponent
{
public:
	float                                        AttackDistance;                                    // 0xF8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AttackTime;                                        // 0xFC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OrbitingRatio;                                     // 0x100(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PositionAngle;                                     // 0x104(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AttackStartDelay;                                  // 0x108(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StandByTimeLimit;                                  // 0x10C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_120E[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ActionState;                                       // 0x118(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_120F[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               MoveTarget;                                        // 0x128(0xC)(BlueprintVisible, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        AttackTimeCount;                                   // 0x134(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1210[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIDeltaAttackComponent* GetDefaultObj();

	void SetMoveTarget(const struct FVector& Location);
	void MoveForTarget(class AActor* Actor);
	void MoveAroundTarget(class AActor* Actor);
	bool IsArrivedMoveTarget(class AActor* Owner);
	struct FVector GetMoveTarget();
	bool ActionAtState4(float DeltaTime, class ATTLCharacter* Owner);
	bool ActionAtState3(float DeltaTime, class ATTLCharacter* Owner);
	bool ActionAtState2(float DeltaTime, class ATTLCharacter* Owner);
	bool ActionAtState1(float DeltaTime, class ATTLCharacter* Owner);
	bool ActionAtState0(float DeltaTime, class ATTLCharacter* Owner);
};

// 0x18 (0x260 - 0x248)
// Class DXM.TTLAIDroneJammerComponent
class UTTLAIDroneJammerComponent : public UTTLAIBaseJammerComponent
{
public:
	class FName                                  VFXSocket;                                         // 0x248(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1216[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTTLAIDroneJammerComponent* GetDefaultObj();

	void Multicast_StopJammerVFX();
	void Multicast_PlayJammerVFX();
};

// 0x190 (0x288 - 0xF8)
// Class DXM.TTLAILightningMoveComponent
class UTTLAILightningMoveComponent : public UTTLAISpecialActionComponent
{
public:
	float                                        MoveScale;                                         // 0xF8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MoveAngleFar;                                      // 0xFC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MoveAngleNear;                                     // 0x100(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DoPercent;                                         // 0x104(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LightningMoveSpeed;                                // 0x108(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FinalTargetDistance;                               // 0x10C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1219[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
