#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x55AC (0x5904 - 0x358)
// AnimBlueprintGeneratedClass Test_Arsenal_AnimBP.Test_Arsenal_AnimBP_C
class UTest_Arsenal_AnimBP_C : public UAnimInstance
{
public:
	uint8                                        Pad_C50[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x360(0x8)(Transient, DuplicateTransient)
	struct FAnimNode_Root                        AnimGraphNode_Root_5A3157B8474B1854310F09A737BB8B66; // 0x368(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1B6CCC124AADA29B7E7961A2865A5855; // 0x3B0(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4B52FC3D4FAE9316EF07AA8198D9EC50; // 0x3F8(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9C54B1E94CDFC739118A918A3FA71C2B; // 0x440(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5F20E31C4D0B32822EB71EBF66485266; // 0x488(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A2A2E1E34D2F82B196991BABD660A0BB; // 0x4D0(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5FE771DA4C06917A5B7CB7BF2D932E4F; // 0x518(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F5E111AD44F4026E230934AB07FEF026; // 0x560(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_60FABE5041CC527041B307A454EB071C; // 0x5A8(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7872FC96404180CD3B967999AAEC74C8; // 0x5F0(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_23D9C68E4BFD695AE09E39AE91CAEA41; // 0x638(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2C308BE048AD39CBC713E796D9939AF4; // 0x680(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F24EC0EB401DF282936DD2963D262CD6; // 0x6C8(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9AFE14FD4A70EABFB858B8AC080E89FF; // 0x710(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_508DC98E438F48A65F588B84159F72AA; // 0x758(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_976F779142E773F56E29DBAF9C6766FE; // 0x7A0(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_23412ECC415002077DE2FF978E4F3776; // 0x7E8(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_D0E8F90B4347F3C935D5CA930FBBF4DC; // 0x830(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_96B08DF549F550B8131E5685FAD211F2; // 0x878(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5BC4A80D4EC09C92DD1A37B00C7BC766; // 0x8C0(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_DEA5E514420134E8080977990DDD1B37; // 0x908(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_DA54EF694A57FE51FBE08A9A3BF1E444; // 0x950(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2596467843768EECD2FC98A2C548939F; // 0x998(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4DC1FE7A4A7AF50247793D99740A8A45; // 0x9E0(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_094B8BF148CCFF8DA179DFBD11E40232; // 0xA28(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F81C74A6421976F32FEB77AD52B5F9A7; // 0xA70(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7F0CB7074B6B2241DD3311B46FAE90E0; // 0xAB8(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_12B8BC644C277E7320FAE49157E1B1D2; // 0xB00(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_97AC14CF4AFD13D131AEDB9961112FFA; // 0xB48(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_766394C04A7C8D7A24CAB690F87E3C0E; // 0xB90(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F6DD3AB2418855ADEBC25A88B7568435; // 0xBD8(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_D4F6D0EB4C12E0AED9B16D9AE3EA4853; // 0xC20(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_68CEF5E14E5FA2ECFDE4D8918FEFB350; // 0xC68(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_99099C1249D9EA9B4074B589093C4FA7; // 0xCB0(0x48)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_4C56563B4BF5865D85088FAA77882EEF; // 0xCF8(0xD0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_786A3B674AA2BAA9E729F8860190CB90; // 0xDC8(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_98DC04DA4EE2CC53D78BEA8B5D5AF60F; // 0xE78(0xB0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_B2CB840C455588CCB82DC6A781A35C5B; // 0xF28(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_7498B45F492D6B373D6623BA53CC0DA8; // 0xF70(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_824A7594496F82BEBEEB3A8852F8526C; // 0x1020(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C65BA7804AD6C60E708276A260F7B101; // 0x10D0(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_47D2308644C74A0172FCEB98808CEA60; // 0x1180(0xB0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_8DAA68814CDF10A5FF0A9DAD11204E8F; // 0x1230(0xD0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_45B3A033480C62AA9B3175AC0F607C20; // 0x1300(0xD0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_5DF3328449DDA31E5EF3D1B403309C03; // 0x13D0(0xD0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_2A1DA12443A831EC723A65B09EA4490A; // 0x14A0(0x48)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_BE3F19184F063F3CB3E6308A04C6CCF1; // 0x14E8(0xD0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_ADDC5CF44C1D1564EA0B219B57CBCEBF; // 0x15B8(0xD0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_4DEF2E7F441280EABD2749AE797CDD89; // 0x1688(0xD0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_AACB5DAD4ED6D45E0D20BA8695807B5B; // 0x1758(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_9009A2F64B16D918AB124AB674171B67; // 0x1808(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_5D718B664D65CA551C234E8FBA8CCC3E; // 0x18B8(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_F969F64D42DD8F2BED9CC0B167153C73; // 0x1968(0xB0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_F4394F104297759C3B525EBBD1991099; // 0x1A18(0x48)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_8DFE91CD408BE667A70701BA343FD518; // 0x1A60(0x128)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_881F116942C17D94F669719E81DDFD19; // 0x1B88(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1985C60E4BBA046A667D3A8F03F98361; // 0x1BD0(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_486E023C4674DCB9802348BFB9EC0129; // 0x1C80(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_EC3E1F564749BD9DE0701E8D746589FB; // 0x1D30(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1D5604374E19D283C95A9EB173DB83F4; // 0x1DE0(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_8283AA3D413F69E9CD2AF89E054AA895; // 0x1E90(0xB0)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_BDC2C02A4F3C21A0A536C995E0E7D079; // 0x1F40(0x128)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_B53FFD1441EFE96B038CF7B9F9532D53; // 0x2068(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6C0E8A4249E0E1C14713F38C621C7277; // 0x2118(0xB0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_E824A2D541B325BACB7ADCA63D3F17C7; // 0x21C8(0xD0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_50B86F294FB315C82244DB976CCD53AC; // 0x2298(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_6770B7EE48CC8FFAA90A2C8F788575D6; // 0x2348(0xB0)(None)
	struct FAnimNode_BlendListByEnum             AnimGraphNode_BlendListByEnum_733F3FB14763CA62FB4E96B12FC7FDAC; // 0x23F8(0xE0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_110FF286442FDD64988211ACF98C8F7F; // 0x24D8(0xB0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_2C597BAD47804611C72EA5B1B10050CE; // 0x2588(0xD0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_EA7F4ACE460B528ACE135B8874ACC48D; // 0x2658(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_905B7A5D40D493AD052950963E903E10; // 0x2708(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_ABA8763844E55BDDA590CFBB379DCE07; // 0x27B8(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_D7DFCE9B430A6F1565EFB2863A1B07BD; // 0x2868(0xB0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_995BEB5745B9489EF21E10A556C4C94B; // 0x2918(0xB0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_55A6ABE548681300D2AF7B97ADE9A07E; // 0x29C8(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_1EC952184B64BA372CC63CA365F6BFFC; // 0x2A10(0xB0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_8EBF6D2645482AA2A86C0BAF09913647; // 0x2AC0(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_B50AB1564B501EACD63EE68264D1D956; // 0x2B08(0xB0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_420FF73A4128DADC297809ABFFC18503; // 0x2BB8(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_57932F0C4E3AA37D8B7BDB8C4DE7B481; // 0x2C00(0xB0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_51D5D8F14AD339EA447E21B6B722E7FB; // 0x2CB0(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_4E0FB3BD46BB27E2EDDD0A938C86BBE1; // 0x2CF8(0xB0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_A94BE890484DE31C1DCA9F97A58ECE79; // 0x2DA8(0xD0)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_0090F2504C674F21DCBE00AF97A93F3D; // 0x2E78(0xD0)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_5FEC1424446E456BA3989C8E17098918; // 0x2F48(0x128)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_B598D67841AF11B1DCAF4B9DD67AF7CD; // 0x3070(0x128)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_FDEE715146A5775E00E667B1355839ED; // 0x3198(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C087D329445DC8CD0F8632B0F70E4347; // 0x31E0(0xB0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_5589D185411AD223577141AA14E9602B; // 0x3290(0x48)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_40AF9EED41D55986A84023A702983916; // 0x32D8(0x128)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_1B9CF01A457B76EF480372AA47318BFD; // 0x3400(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_EAFD21C64EA3434F62B7848B9C74045F; // 0x3448(0xB0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_2374A335493646E97688ECACBFF800A8; // 0x34F8(0x48)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_695460D8417DAEFB9DC555BA99E2157A; // 0x3540(0xE0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_71A750E1487ED1E9D8A935B399FD615D; // 0x3620(0xE0)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_55A22227416B9920DE29CBB4D1029760; // 0x3700(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_F2994FE04DF2F88ADF316BBED8F058EC; // 0x37E0(0x50)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_B47BE7C34353FE4DC43AAB9FC10F1069; // 0x3830(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_9F9F412B456C730F29F962B765BB8F45; // 0x3910(0x50)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_BA210B4B435606CD2342DFB9D949CAAF; // 0x3960(0xE0)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_7BF1F8F94569B9296829B09B8C474281; // 0x3A40(0x70)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_6F9FC51442487EE78ABEB8B2A8C06352; // 0x3AB0(0x70)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_2DD2955D4F25C413A0CF43B10AD723B1; // 0x3B20(0x70)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_C329C07B45DAC885D2A63280CC756A77; // 0x3B90(0x70)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_80EE270548AFEBDB41E07DB3176E457F; // 0x3C00(0x50)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_4987B0064C83D58C00796DBDBB61692E; // 0x3C50(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_874F76364085F14799740DBD832094D8; // 0x3D30(0x50)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_AB75DB4E42296386EF02609C2BC54D2C; // 0x3D80(0x70)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_613B5A664C2BA00A886E0E9FCB871EC0; // 0x3DF0(0xE0)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_F53904BF4B791BF21AF7A28E39EE124F; // 0x3ED0(0x70)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_81ED075A42EB6E24219572BDDF13B363; // 0x3F40(0x70)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_BF4E6DF64A631CA37EC9E4881FBA50A7; // 0x3FB0(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_41A2D3EC4CD23782D4BECD8C15CD342D; // 0x4090(0x50)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_B6F793FF4DD1D4C18144D1B73383E5BA; // 0x40E0(0x70)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_348FDE274CC51D0E7903BCBAA3C1DAC0; // 0x4150(0x50)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_76DF8BBA4D464926D8ADC080BD470BB2; // 0x41A0(0xE0)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_DE68BA6F43EA307E75F73A908B383FC6; // 0x4280(0x70)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_3DC5C6864DA61A6E23FD62BB5DE3F12F; // 0x42F0(0x70)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_7D18ED7B4773114FBF0C4188AC13AAE5; // 0x4360(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_54DCBD6446FD35109D80FB8EC6A9400F; // 0x4440(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_0D28769E4A458DAE3448E893D1F8AA9A; // 0x4490(0x50)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_A7CD28294909072C7D368C86B5E9C952; // 0x44E0(0xE0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_8374408A427F89E709B48CB8B3B6D729; // 0x45C0(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_FCBB615A41F3C21AC39381BAC06FFED9; // 0x46A0(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_F6CC2AE94E680F5BDF11808EDEDBEA36; // 0x46F0(0x50)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_32B9DA1C4B0BAFEE3C0B9F9A311C8133; // 0x4740(0x70)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_7C32C1354DD2DF77E2C4CCAA7B88398B; // 0x47B0(0xE0)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_88B9663D422BF9C1ADDA7BA61A2D3CAB; // 0x4890(0x70)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_13D442244B69881C6CED4890B7307E8B; // 0x4900(0x50)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_7F63D7424DB63E4B7E6C23AADB44EA46; // 0x4950(0xE0)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_8648032F4C1C25EA38F66B98163D47CD; // 0x4A30(0x70)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_0F8A51FF456194D5A82ED099AA005CE3; // 0x4AA0(0x50)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_A58D6D1C4BA99F86502D26AAC6654518; // 0x4AF0(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_81BAB833426437E5F27542AAE3393B5D; // 0x4BD0(0x50)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_167CB3EE420F4E49CB4537B814928D6F; // 0x4C20(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_5C1630E3467163C6AA9294BFCA4DD779; // 0x4D00(0x50)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_E27FB82B4C573A4BD9F5E58DCF3A0000; // 0x4D50(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_188ED747401AB07BD709498059885CB2; // 0x4E30(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_120F8E3A4BF32D1F49C73D9C52B948E9; // 0x4E80(0x50)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_195CF8CA4949DA8B6270E092349F807E; // 0x4ED0(0x70)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_4013D5FF413CCD68EDEA0ABCAAFDB062; // 0x4F40(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_E3BEEBFC45884413DCDC09A4B3D2A7E0; // 0x5020(0x50)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_4EC7B63C4CBB8C1B1D9699BADF293886; // 0x5070(0x120)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_82779F6E493D51424204979C4A8CBAD9; // 0x5190(0x50)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_92E01142409EBCCBA27A53AF3AE9D777; // 0x51E0(0x48)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_0E8296F043BD4D9634E381AE81FC4392; // 0x5228(0x160)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_091C0FDF407A58B0836E92BA17231F0D; // 0x5388(0x48)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_C1AAE13B46FFBF09932061B6A1A24630; // 0x53D0(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_A9A1A6E642414000B759E08788D5B66E; // 0x54B0(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_321C079E482F6EFFEAEFEC86F207E31E; // 0x5500(0x50)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_21BAF95148D2BDFEBC7BA7AF29D4BADA; // 0x5550(0x120)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_326B0A7448003319BC086CA991A651DA; // 0x5670(0x48)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_13648D1B4A9AC134D97F44989ACB6A5A; // 0x56B8(0x160)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5A6AABC84EE31F162D0B87BBF1159B64; // 0x5818(0x48)(None)
	class ABaseCharacter_C*                      SelfArsenal;                                       // 0x5860(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsJumping;                                         // 0x5868(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsDashing;                                         // 0x5869(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsBoosting;                                        // 0x586A(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsQuickMoving;                                     // 0x586B(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsJumpCharging;                                    // 0x586C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsLanding;                                         // 0x586D(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsFlying;                                          // 0x586E(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsFalling;                                         // 0x586F(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                        Speed;                                             // 0x5870(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Direction;                                         // 0x5874(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LastDirection;                                     // 0x5878(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        TurnDirection;                                     // 0x587C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsEnableInputDirection;                            // 0x5880(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_CBA[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               InputDirection;                                    // 0x5884(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsMovingInput;                                     // 0x5890(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsCatching;                                        // 0x5891(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsThrowing;                                        // 0x5892(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsDamaged;                                         // 0x5893(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsTurning;                                         // 0x5894(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsReadyCatch;                                      // 0x5895(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_CBE[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        InputThreshold;                                    // 0x5898(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        RightAttackPhase;                                  // 0x589C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        LeftAttackPhase;                                   // 0x58A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CloseRangeAttackMoveTime;                          // 0x58A4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETTLDamageState                   DamageState;                                       // 0x58A8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsPickableTarget;                                  // 0x58A9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         TargetCaught;                                      // 0x58AA(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsAming;                                           // 0x58AB(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                        QuickMoveVariationTime;                            // 0x58AC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        DamageDirection;                                   // 0x58B0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         EnableOffsetArmR;                                  // 0x58B4(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_CC3[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        OffsetArmRAlpha;                                   // 0x58B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        OffsetArmRFadeOutSeconds;                          // 0x58BC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        OffsetArmRAlphaPerSecond;                          // 0x58C0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              ArmRRotationOffset;                                // 0x58C4(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                        OffsetArmRRoll;                                    // 0x58D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        OffsetArmRYaw;                                     // 0x58D4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        OffsetArmRPitch;                                   // 0x58D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         EnableOffsetArmL;                                  // 0x58DC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_CC6[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        OffsetArmLAlpha;                                   // 0x58E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        OffsetArmLFadeOutSeconds;                          // 0x58E4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        OffsetArmLAlphaPerSecond;                          // 0x58E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                              ArmLRotationOffset;                                // 0x58EC(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                        OffsetArmLRoll;                                    // 0x58F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        OffsetArmLYaw;                                     // 0x58FC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        OffsetArmLPitch;                                   // 0x5900(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UTest_Arsenal_AnimBP_C* GetDefaultObj();

	void CalcOffsetAlpha(float CurrentAlpha, float AddAlphaPerSecond, float DeltaSecond, float* NewAlpha, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, float CallFunc_FClamp_ReturnValue);
