#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x780 (0x780 - 0x0)
// UserDefinedStruct AStruct_WeaponAnimContainer.AStruct_WeaponAnimContainer
struct FAStruct_WeaponAnimContainer
{
public:
	struct FAStruct_WeaponAnims                  Atlas_32_7983DEBF4AD7A6A73F08BCBA6CF78288;         // 0x0(0xC0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_WeaponAnims                  CoV_33_F229926049915AEDF28B79A2D018C54A;           // 0xC0(0xC0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_WeaponAnims                  Dahl_34_555317F84779A4DBF101349769BE7837;          // 0x180(0xC0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_WeaponAnims                  Hyperion_35_92D2563444D96BD6379D108794D7795D;      // 0x240(0xC0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_WeaponAnims                  Jakobs_36_131E838143A6ED04C9BF87BFFF30AB9C;        // 0x300(0xC0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_WeaponAnims                  Maliwan_37_74F57F794A655CE562217EBF9EE8F4FF;       // 0x3C0(0xC0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_WeaponAnims                  Tediore_38_2250107B4B6B2994C90581A79C1783F6;       // 0x480(0xC0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_WeaponAnims                  Torgue_39_B1E5970E436F516BA32D2B9A595EAD65;        // 0x540(0xC0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_WeaponAnims                  Vladof_40_31FF5A8E4EF20A81D7B8579220801E2E;        // 0x600(0xC0)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_WeaponAnims                  Eridian_43_B22907F2401246958C9D02B2CA7DC872;       // 0x6C0(0xC0)(Edit, BlueprintVisible, HasGetValueTypeHash)
};

}


