#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xA20 (0xA20 - 0x0)
// UserDefinedStruct AStruct_Generic_WeaponAnimContainer.AStruct_Generic_WeaponAnimContainer
struct FAStruct_Generic_WeaponAnimContainer
{
public:
	struct FAStruct_Generic_WeaponAnims          Atlas_41_7983DEBF4AD7A6A73F08BCBA6CF78288;         // 0x0(0x120)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_Generic_WeaponAnims          CoV_42_F229926049915AEDF28B79A2D018C54A;           // 0x120(0x120)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_Generic_WeaponAnims          Dahl_43_555317F84779A4DBF101349769BE7837;          // 0x240(0x120)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_Generic_WeaponAnims          Hyperion_44_92D2563444D96BD6379D108794D7795D;      // 0x360(0x120)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_Generic_WeaponAnims          Jakobs_45_131E838143A6ED04C9BF87BFFF30AB9C;        // 0x480(0x120)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_Generic_WeaponAnims          Maliwan_46_74F57F794A655CE562217EBF9EE8F4FF;       // 0x5A0(0x120)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_Generic_WeaponAnims          Tediore_47_2250107B4B6B2994C90581A79C1783F6;       // 0x6C0(0x120)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_Generic_WeaponAnims          Torgue_48_B1E5970E436F516BA32D2B9A595EAD65;        // 0x7E0(0x120)(Edit, BlueprintVisible, HasGetValueTypeHash)
	struct FAStruct_Generic_WeaponAnims          Vladof_49_31FF5A8E4EF20A81D7B8579220801E2E;        // 0x900(0x120)(Edit, BlueprintVisible, HasGetValueTypeHash)
};

}


