#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x4F21 (0x5A11 - 0xAF0)
// AnimBlueprintGeneratedClass BPAnim_Mushroom_Pet.BPAnim_Mushroom_Pet_C
class UBPAnim_Mushroom_Pet_C : public UOakCharacterAnimInstance
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xAF0(0x8)(Transient, DuplicateTransient)
	struct FAnimNode_Root                        AnimGraphNode_Root_E91C83A945634632F0D65CBE01559DF0; // 0xAF8(0x48)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_6D6444974781E8F19AC7048FCAFA4A1E; // 0xB40(0x120)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_F56654E14F92345E83B355863D26FC10; // 0xC60(0xB0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_46FC26BB49332B79854B1E9F7E302233; // 0xD10(0xE0)(None)
	struct FAnimNode_Slot                        AnimGraphNode_Slot_F758E85D46662EEB5E2AA396ECAE40F7; // 0xDF0(0xB0)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_C5F31CC443F49434862353BFA870AA95; // 0xEA0(0x48)(None)
	struct FAnimNode_RotationOffsetBlendSpace    AnimGraphNode_RotationOffsetBlendSpace_12DDC45F4AA930A714CB0C89BA3B0343; // 0xEE8(0x238)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_398D408A4C851279350D0D9A44CF8651; // 0x1120(0x50)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_935920EA4C4AFAC52494678B1C5FDEDB; // 0x1170(0x50)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_EAE978E44718991B2B32E9A0436A9F5D; // 0x11C0(0x50)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_A7EB72054F475416D1EEAA8D047AAD2F; // 0x1210(0x50)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_23876CCA43D130CD8C6DB69B26F0F95A; // 0x1260(0x50)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_BF716DEF4F25E58871CE8F83AED348DB; // 0x12B0(0x50)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_693ACBA54BFBDC261EFA9786AB85BC3B; // 0x1300(0xF0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_9FAE7B3443BB7B5E45F8AAB9157E3AF3; // 0x13F0(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_21B6112D4670B810C6F06DBB8D4111AD; // 0x1438(0xF0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_91C1DE1A456BBBA29A0BC7B229305CF1; // 0x1528(0x48)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_2C55046D49315A284F896CBA63A5FB33; // 0x1570(0x188)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_72472A4F4C506E43DC0969AB06B62E3E; // 0x16F8(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E3B7422A4EF6AB38947041B46E381E6D; // 0x1740(0x50)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_21BF8B5C4B49057ED12DF189BC3C24A7; // 0x1790(0x50)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E9751EF144DC7A768AEF4E8FBB34C933; // 0x17E0(0x50)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_83C4DDFA461323A5852DE78579F97FDE; // 0x1830(0x50)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_E00A5C1146007481809B9B87FB66624A; // 0x1880(0x50)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7DA8E4064B3D9521A77E71A2352FBD6E; // 0x18D0(0x50)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_C38CBDF644D750A4123E3BAA42472D5B; // 0x1920(0x50)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_59BDF9FE4E558E3F707B3EA238275DFE; // 0x1970(0xF0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_2A9016A84403C29CA283E9A74EE598C5; // 0x1A60(0x48)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_4276F8234CC4F961436E70BBA878604F; // 0x1AA8(0x160)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_8F71DF2C407373585A09679BE7664897; // 0x1C08(0x48)(None)
	struct FGbxAnimNode_AnimTable                GbxAnimGraphNode_AnimTable_454A590D4E3809997FB726A65CE21A48; // 0x1C50(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_1353189944DF94CE207D61B023D11F45; // 0x1CD8(0x48)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_DFD0E4F54F712EE4C4CA66B9C04073A1; // 0x1D20(0x160)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_A91BB9AA433B40C22B7E4CB589BCAAE3; // 0x1E80(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_DEFEE6674C19C690765831A9864D67C6; // 0x1EC8(0xF0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_C42A47654156F4B5F2F21EAB8026DBCA; // 0x1FB8(0x48)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_8F612144437791102C633C9E3C740AE2; // 0x2000(0x188)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_5D683D8944F96C4398E24AB920A9132F; // 0x2188(0x48)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_CA8403CE4AF1A7CC9C7232A7E1BC090D; // 0x21D0(0x50)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_B011B5974443E7F8E453ED944B9CDB9C; // 0x2220(0x50)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6101080F457D4762173F1A8124270229; // 0x2270(0x50)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_62A76B924988271BDEDFD6AB8C4F068D; // 0x22C0(0x50)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_F53C71D545FB166292E1799278BCF1B2; // 0x2310(0x50)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3165113E4AC60D480E278AAC56B37152; // 0x2360(0x50)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2BE56E8546FD67FAC7EA8A828756B747; // 0x23B0(0x50)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_C4E6F46541A4B1688F3189A0492CE0BE; // 0x2400(0xF0)(None)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_657853944ACA6A2E643FE48E29F74252; // 0x24F0(0xD0)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_BBF51372499570A4DB7FB088C6748A51; // 0x25C0(0xF0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_FC32EF274165A6E1560BD88DAEC267FF; // 0x26B0(0x48)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_21E2AC794022397D013D3A8A12EAC307; // 0x26F8(0x160)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_9AC8174F44962DED56EE6EB5646E1C22; // 0x2858(0x48)(None)
	struct FGbxAnimNode_AnimTable                GbxAnimGraphNode_AnimTable_8837B3EA4569182C12D4368E16EFC344; // 0x28A0(0x88)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_8F4026F94E50A529930EAEA7CE172B96; // 0x2928(0x48)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_10B24189418267C6FCFDA1A699158E3E; // 0x2970(0x160)(None)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_7413D08A4DD174C7D305E2B4CE20134B; // 0x2AD0(0xD0)(None)
	struct FAnimNode_BlendSpacePlayer            AnimGraphNode_BlendSpacePlayer_6C8B702C4DBBBBCB69FDC495DAC2385B; // 0x2BA0(0x160)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_F2D47CC34EF6800EDE6D44B944EA7AD7; // 0x2D00(0x48)(None)
	struct FAnimNode_SequencePlayer              AnimGraphNode_SequencePlayer_D8BE45094E2101ED3D99ADAFB1A7267F; // 0x2D48(0xF0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_859E5C1145EFA9C9CE7095B38572255C; // 0x2E38(0x48)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_106B630C4D46804934FBEE95F6E19B2A; // 0x2E80(0x188)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_01988E4D44852399F48B35948D469796; // 0x3008(0x48)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_A9C891E6442E6998FC9BD8975F0B1B56; // 0x3050(0x188)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_E324CD3D464F394DBA6C33914B088329; // 0x31D8(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_DD075C98487A8E615EB8E29667DF5DF0; // 0x32B8(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_2874904D431C1E38C7FDF0A85C038A95; // 0x3308(0x50)(None)
	uint8                                        Pad_2D5F[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_Slot                        AnimGraphNode_Slot_2C28039A4F98E79BF6A7D7B720E06415; // 0x3360(0xB0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_4D055D2442C9E6A5E0360B8C22B9F2FB; // 0x3410(0xE0)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_B353C3EE4240A1D0166B19ADCC67F4C1; // 0x34F0(0x120)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_22F22A3E45CB6864D1BC86AC47F7BC38; // 0x3610(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_BD3A92DF473FC9DB65BB2D9D9C450DD8; // 0x3660(0x50)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_14D81A434174BB82D844BBACEDB54E26; // 0x36B0(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_9F1229CB45756505B474908473BB12D9; // 0x3790(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_4893B083437BB6E9835C2C8C2EC9FB4F; // 0x37E0(0x50)(None)
	struct FGbxAnimNode_LegIK                    GbxAnimGraphNode_LegIK_87C6B0464546AB79D7E96C85525E662C; // 0x3830(0x8B0)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_0F73D3E44E02EECCF4DCB99CDA6B95EE; // 0x40E0(0x48)(None)
	struct FGbxAnimNode_ApplyBoneModifyProfile   GbxAnimGraphNode_ApplyBoneModifyProfile_9A3B1DF544C6CA7E996A4DB4D1F34D31; // 0x4128(0x180)(None)
	struct FAnimNode_TwoWayBlend                 AnimGraphNode_TwoWayBlend_A3E3761C462086F50CE3FBAC3F339749; // 0x42A8(0x120)(None)
	struct FAnimNode_LayeredBoneBlend            AnimGraphNode_LayeredBoneBlend_72D85FEE4785DA4E05528BA39882FF51; // 0x43C8(0x120)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8123DBA44D0E5E7AB8A2C591910E8ABD; // 0x44E8(0x50)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_B452E2CA427B209C8BDA2786A71B3294; // 0x4538(0x50)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_399A2A084E99FBE057F4048D8DD5671E; // 0x4588(0x80)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_F8CCFD8440A28431F39540AAAE12A494; // 0x4608(0x80)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_6B00AFFA4C83F2E403ED76AB8F8FD908; // 0x4688(0x80)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_C332927242DC3970DFE0EEBDA942F2E6; // 0x4708(0x80)(None)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_1A0D5DA74372702D9DC507BD33C3ECE1; // 0x4788(0xD0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_81F148F54E5ACE507C43F8AE9918D564; // 0x4858(0x48)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_21E75A9E4B555AB7C4CE6EBB31117A2C; // 0x48A0(0x80)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_96D156A14DDE84208B22BEB44459E73D; // 0x4920(0x80)(None)
	struct FAnimNode_SequenceEvaluator           AnimGraphNode_SequenceEvaluator_E2D4ABF746B9ED11E3078C8F79A190F7; // 0x49A0(0x80)(None)
	struct FAnimNode_BlendListByInt              AnimGraphNode_BlendListByInt_26AD3CC2457AD0AC580B7A8814B36CF0; // 0x4A20(0xD0)(None)
	struct FAnimNode_Root                        AnimGraphNode_StateResult_3C0A936B4B62B875692629892F3E7620; // 0x4AF0(0x48)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine_CC7276B2417A1EDD04187C941FF5EFE5; // 0x4B38(0x188)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_5D2EE235454E6E445250558188D24FEF; // 0x4CC0(0xE0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_E2A53A114E62F81859DA1BB4E748252E; // 0x4DA0(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_0A37DCB346E098A830CBD389F7E71EFE; // 0x4DF0(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_09FA1E7E4F432F238579CBB690008519; // 0x4E40(0x50)(None)
	struct FAnimNode_ApplyAdditive               AnimGraphNode_ApplyAdditive_67035375489DA0672A52D3ADE63D0E9C; // 0x4E90(0x118)(None)
	uint8                                        Pad_2DD0[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGbxAnimNode_ForwardDynamics          GbxAnimGraphNode_ForwardDynamics_14CB76014E47ECC2D5EAF5B124819992; // 0x4FB0(0x730)(None)
	struct FGbxAnimNode_LookAt                   GbxAnimGraphNode_LookAt_8C4DB15C46C6F7EF813187BF69F471EE; // 0x56E0(0x2D0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_870A851048B39EF0C3B1AEBF2D5A7B03; // 0x59B0(0x50)(None)
	enum class EMushroomVariations               EnemyVariant;                                      // 0x5A00(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         InPassiveStance;                                   // 0x5A01(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         InCombatStance;                                    // 0x5A02(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2DE5[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        HeadAngle;                                         // 0x5A04(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        HeadTiltWeight;                                    // 0x5A08(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        MoveSet;                                           // 0x5A0C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsMagic;                                           // 0x5A10(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class UBPAnim_Mushroom_Pet_C* GetDefaultObj();

	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_BlendSpacePlayer_21E2AC794022397D013D3A8A12EAC307();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_TransitionResult_3165113E4AC60D480E278AAC56B37152();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_BlendSpacePlayer_10B24189418267C6FCFDA1A699158E3E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_BlendListByInt_7413D08A4DD174C7D305E2B4CE20134B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_BlendSpacePlayer_6C8B702C4DBBBBCB69FDC495DAC2385B();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_TransitionResult_6101080F457D4762173F1A8124270229();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_TwoWayBlend_A3E3761C462086F50CE3FBAC3F339749();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_TransitionResult_8123DBA44D0E5E7AB8A2C591910E8ABD();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_TransitionResult_B452E2CA427B209C8BDA2786A71B3294();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_BlendListByInt_1A0D5DA74372702D9DC507BD33C3ECE1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_BlendSpacePlayer_DFD0E4F54F712EE4C4CA66B9C04073A1();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_BlendSpacePlayer_4276F8234CC4F961436E70BBA878604F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_BlendListByInt_26AD3CC2457AD0AC580B7A8814B36CF0();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_SequencePlayer_59BDF9FE4E558E3F707B3EA238275DFE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_TransitionResult_7DA8E4064B3D9521A77E71A2352FBD6E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_ApplyAdditive_67035375489DA0672A52D3ADE63D0E9C();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_GbxAnimGraphNode_ForwardDynamics_14CB76014E47ECC2D5EAF5B124819992();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_GbxAnimGraphNode_LookAt_8C4DB15C46C6F7EF813187BF69F471EE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_TransitionResult_E00A5C1146007481809B9B87FB66624A();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_TransitionResult_2BE56E8546FD67FAC7EA8A828756B747();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_TransitionResult_E9751EF144DC7A768AEF4E8FBB34C933();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_TransitionResult_BF716DEF4F25E58871CE8F83AED348DB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_TransitionResult_A7EB72054F475416D1EEAA8D047AAD2F();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_SequencePlayer_C4E6F46541A4B1688F3189A0492CE0BE();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_TransitionResult_935920EA4C4AFAC52494678B1C5FDEDB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_RotationOffsetBlendSpace_12DDC45F4AA930A714CB0C89BA3B0343();
	void OnStanceChanged();
	void OnAnimStyleChanged();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_SequencePlayer_BBF51372499570A4DB7FB088C6748A51();
	void AnimNotify_PickMoveSet();
	void BlueprintInitializeAnimation();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_BPAnim_Mushroom_Pet_AnimGraphNode_BlendListByInt_657853944ACA6A2E643FE48E29F74252();
	void ExecuteUbergraph_BPAnim_Mushroom_Pet(int32 EntryPoint, bool CallFunc_EqualEqual_NameName_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue1, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, float CallFunc_BreakRotator_Roll1, float CallFunc_BreakRotator_Pitch1, float CallFunc_BreakRotator_Yaw1, float CallFunc_BreakRotator_Roll2, float CallFunc_BreakRotator_Pitch2, float CallFunc_BreakRotator_Yaw2, bool CallFunc_Not_PreBool_ReturnValue, float CallFunc_RandomFloatInRange_ReturnValue, int32 CallFunc_RandomInteger_ReturnValue, int32 CallFunc_RandomInteger_ReturnValue1);
};

}


