#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1C3 (0x26F0 - 0x252D)
// BlueprintGeneratedClass BPChar_MushroomCompanion.BPChar_MushroomCompanion_C
class ABPChar_MushroomCompanion_C : public ABPChar_AI_C
{
public:
	uint8                                        Pad_242C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x2530(0x8)(Transient, DuplicateTransient)
	class UFoleyMainComponent*                   FoleyMain;                                         // 0x2538(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USocketComponent*                      NameplateSocket;                                   // 0x2540(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOakMinimapIconComponent*              OakMinimapIcon;                                    // 0x2548(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAIBalanceStateComponent*              AIBalanceState;                                    // 0x2550(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UAIExplosiveSpawningComponent_C*       AIExplosiveSpawningComponent;                      // 0x2558(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*              PS_Necromancer_15;                                 // 0x2560(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       Necromancer_15_FX_Off;                             // 0x2568(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       Necromancer_15_FX_On;                              // 0x2570(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneBodySwitchComponent*             Necromancer_15_FX;                                 // 0x2578(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UTerritoryComponent*                   Territory;                                         // 0x2580(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UOakInventoryListComponent*            OakInventoryList;                                  // 0x2588(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWwiseAudioComponent*                  WwiseAudio;                                        // 0x2590(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneBodySwitchComponent*             FFYLReviveFX;                                      // 0x2598(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*              PS_Companion_FFYL_Revive_Loop;                     // 0x25A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       FFYL_ReviveFX_Off;                                 // 0x25A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       FFYL_ReviveFX_On;                                  // 0x25B0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxCustomizationComponent*            GbxCustomization;                                  // 0x25B8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPNPCFightForYourLifeComponent_C*     BPNPCFightForYourLifeComponent;                    // 0x25C0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBP_UsableComponent_C*                 UsableComponentPet;                                // 0x25C8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter_Player*                  Ranger;                                            // 0x25D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, Transient, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                PetSpawnActionClass;                               // 0x25D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         bIsBeingReleased;                                  // 0x25E0(0x1)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2468[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UBPEventHub_PlayerCharacter_C*         PlayerEventHub;                                    // 0x25E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                ScriptedFFYLTarget;                                // 0x25F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<class AOakCharacter_Player*>          PlayerAllies;                                      // 0x25F8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance)
	struct FGbxAttributeFloat                    PetSkagFrenzyPlayRate;                             // 0x2608(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	uint8                                        Pad_2470[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCharacterSoundTag*                    CSTPet_Death;                                      // 0x2618(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UCharacterSoundTag*                    CSTPet_Retreat;                                    // 0x2620(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UStatusEffectData*                     PlayerStatusEffectData;                            // 0x2628(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FStatusEffectInstanceReference        PlayerStatusEffectRef;                             // 0x2630(0x18)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, ContainsInstancedReference)
	struct FGbxAttributeFloat                    Att_AttackCommand_Damage;                          // 0x2648(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FGbxAttributeFloat                    OnRep_TrackHealingFX;                              // 0x2654(0xC)(Edit, BlueprintVisible, Transient, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                         bIsInFFYL;                                         // 0x2660(0x1)(Edit, BlueprintVisible, ZeroConstructor, Transient, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_247E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UParticleSystemComponent*              ClassModTauntFX;                                   // 0x2668(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UGbxAbility*                           RangerFeat;                                        // 0x2670(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                Rep_ScriptedPetTarget;                             // 0x2678(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	TArray<struct FGbxAttributeDelegateBindingHandle> BindedAttributeEvents;                             // 0x2680(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UClass*                                SpawnFX;                                           // 0x2690(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                DespawnFX;                                         // 0x2698(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakPlayerAbilityManagerComponent*     OakPlayerAbilityManager;                           // 0x26A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                           Audio_MeleeSwing;                                  // 0x26A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                           Audio_Bite;                                        // 0x26B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                           Audio_HeadButt;                                    // 0x26B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                           Audio_BiteMulti;                                   // 0x26C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGbxAttributeInteger                  Att_KnightOfTheClaw_DragonAura_RebukingAura;       // 0x26C8(0xC)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	uint8                                        Pad_2492[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableValueHandle                 InteractionCooldownHandle;                         // 0x26D8(0x18)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

	static class UClass* StaticClass();
	static class ABPChar_MushroomCompanion_C* GetDefaultObj();

	void Passive_Ranger_11_Set_Enabled(bool Enabled, bool* Res, class UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue, const struct FGbxBlackboardKeySelector& K2Node_MakeStruct_GbxBlackboardKeySelector);
	void Passive_Ranger_07_Set_Enabled(bool Enabled, bool* Res, const struct FGbxBlackboardKeySelector& K2Node_MakeStruct_GbxBlackboardKeySelector, class UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue);
	void SetMushroomAttachmentEnabled(bool Enabled, class UGestaltPartData_Mesh* GestaltMeshPart);
	void TrackCompanion(bool TrackStatus, class UGameInstance* CallFunc_GetGameInstance_ReturnValue, class UOakGameInstance* K2Node_DynamicCast_AsOak_Game_Instance, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_GetManagedActorCount_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue);
	void OnRep_ScriptedPetTarget(const class FString& CallFunc_GetDisplayName_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void UpdateHealingFX(bool CallFunc_Not_PreBool_ReturnValue, float CallFunc_BreakGbxAttributeFloat_Value, float CallFunc_BreakGbxAttributeFloat_BaseValue, bool CallFunc_LessEqual_FloatFloat_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue1, bool CallFunc_BooleanAND_ReturnValue);
	void IncrementKillStat();
	void SetBlackboard_Aggro(bool Toggle, const struct FGbxBlackboardKeySelector& K2Node_MakeStruct_GbxBlackboardKeySelector, class UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue);
	void SecondWindInjuredAllies(TArray<class AOakCharacter_Player*>& Allies, class AOakCharacter_Player* NewAlly, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, class AOakCharacter_Player* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, class UBPFightForYourLifeComponent_C* CallFunc_GetComponentByClass_ReturnValue);
	void SetUltimateBlackboard(bool Value, const struct FGbxBlackboardKeySelector& K2Node_MakeStruct_GbxBlackboardKeySelector, class AController* CallFunc_GetAssociatedController_ReturnValue, class UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue);
	void ComparePetKillerToAllies(class AActor* Killer, bool* AssignPetToKiller, class AOakCharacter_Player* NewKiller, const TArray<class AOakCharacter_Player*>& NewPlayerAllies, class AOakCharacter_Player* K2Node_DynamicCast_AsOak_Character_Player, bool K2Node_DynamicCast_bSuccess, const struct FOakPlayerAbilityAllyQuerySpec& K2Node_MakeStruct_OakPlayerAbilityAllyQuerySpec, bool CallFunc_Array_Contains_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, const struct FOakPlayerAbilityAllyQueryResult& CallFunc_QueryAllies_ReturnValue);
	void PlaySpawnActions(const struct FVector& NewDirection, const struct FRelativeDirectionData& NewLocalVar_0, TArray<struct FGbxActionRegister>& Temp_struct_Variable, TArray<struct FGbxActionRegister>& Temp_struct_Variable1, class UGbxAction* CallFunc_K2Play_ReturnValue, class UGbxAction* CallFunc_K2Play_ReturnValue1);
	void IsOwnerInFFYL(bool* InFFYL, class UBPFightForYourLifeComponent_C* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue1, bool CallFunc_IsInDownState_ReturnValue);
	void UserConstructionScript();
	void OnDialogSequenceFinished_2();
	void BndEvt__BPNPCFightForYourLifeComponent_K2Node_ComponentBoundEvent_0_FightForYourLifeEvent__DelegateSignature_BPChar_Pet();
	void OnAggro_PlayerPets();
	void OnDeAggro_PlayerPets(float AggroDuration);
	void BndEvt__UsableComponentPet_K2Node_ComponentBoundEvent_0_UsableUsedOnChannelSignature__DelegateSignature_BPChar_Pet(class AController* UserController, class UPrimitiveComponent* UsedComponent);
	void BndEvt__BPNPCFightForYourLifeComponent_K2Node_ComponentBoundEvent_2_FightForYourLifeEvent__DelegateSignature_BPChar_Pet();
	void BndEvt__BPNPCFightForYourLifeComponent_K2Node_ComponentBoundEvent_4_FightForYourLifeEvent__DelegateSignature_BPChar_Pet();
	void BndEvt__OakDamageCauserComponent_K2Node_ComponentBoundEvent_5_CauseDeathDelegate__DelegateSignature_BPChar_Pet(class UDamageComponent* Damaged, struct FCausedDeathDetails& Details);
	void Pet_DownStateStart();
	void BndEvt__BPNPCFightForYourLifeComponent_K2Node_ComponentBoundEvent_1_FightForYourLifeEvent__DelegateSignature_BPChar_Pet();
	void OnHealingFXChanged(float OldValue, float NewValue);
	void ReceiveBeginPlay();
	void Necromancer_15_Buff_Activated();
	void Necromancer_15_Buff_Deactivated();
	void MushroomCompanionCleanup(bool bForced, enum class EPetReleaseReason Reason);
	void Ranger_FFYLStart();
	void Ranger_FFYLStop();
	void Health_Recalculate(float OldValue, float NewValue);
	void Ranger_FFYLCausedAnyDamage(class AActor* DamageInstigator, float Damage, class UGbxDamageType* DamageType, class UDamageSource* DamageSource, class AActor* DamagedActor, const struct FCausedDamageDetails& Details);
	void Audio_MeleeSwing_R();
	void Audio_MeleeSwing_L();
	void Audio_Bite_Attack();
	void Audio_Head_Butt();
	void Audio_Bite_Multi();
	void BndEvt__BPNPCFightForYourLifeComponent_K2Node_ComponentBoundEvent_3_FightForYourLifeWithBoolEvent__DelegateSignature_BPChar_MushroomCompanion(bool IsSuccessful);
	void SetPetUsable();
	void OnPlayerPing(class AActor* TargetActor, const struct FVector& TargetLocation, class AOakPlayerController* InstigatingController);
	void OverrideTargetDied(class AActor* DamageReceiver, class AActor* DamageCauser);
	void Player_OnLevelUp(int32 OldExperienceLevel, int32 NewExperienceLevel);
	void OnDeath_FFYLScriptedTarget(class AActor* DamageReceiver, class AActor* DamageCauser);
	void ExecuteUbergraph_BPChar_MushroomCompanion(int32 EntryPoint, bool CallFunc_HasAbility_ReturnValue, bool CallFunc_Passive_Ranger_11_Set_Enabled_Res, class AController* K2Node_ComponentBoundEvent_UserController, class UPrimitiveComponent* K2Node_ComponentBoundEvent_UsedComponent, bool K2Node_SwitchEnum_CmpSuccess, class UDamageComponent* K2Node_ComponentBoundEvent_Damaged, const struct FCausedDeathDetails& K2Node_ComponentBoundEvent_Details, class UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue, bool CallFunc_SetPlayerMaster_ReturnValue, float K2Node_CustomEvent_OldValue1, float K2Node_CustomEvent_NewValue1, class UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue1, bool K2Node_CustomEvent_bForced, enum class EPetReleaseReason K2Node_CustomEvent_Reason, bool CallFunc_IsOwnerInFFYL_InFFYL, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class UDamageCauserComponent* CallFunc_GetComponentByClass_ReturnValue, bool CallFunc_IsValid_ReturnValue, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate1, class UDamageCauserComponent* CallFunc_GetComponentByClass_ReturnValue1, TArray<struct FGbxActionRegister>& Temp_struct_Variable, float K2Node_CustomEvent_OldValue, float K2Node_CustomEvent_NewValue, class UGbxAction* CallFunc_K2Play_ReturnValue, class AActor* K2Node_CustomEvent_DamageInstigator, float K2Node_CustomEvent_Damage, class UGbxDamageType* K2Node_CustomEvent_DamageType, class UDamageSource* K2Node_CustomEvent_DamageSource, class AActor* K2Node_CustomEvent_DamagedActor, const struct FCausedDamageDetails& K2Node_CustomEvent_Details, bool CallFunc_ComparePetKillerToAllies_AssignPetToKiller, const struct FWwisePlaybackInstance& CallFunc_PostAttachedEvent_ReturnValue, const struct FWwisePlaybackInstance& CallFunc_PostAttachedEvent_ReturnValue1, const struct FWwisePlaybackInstance& CallFunc_PostAttachedEvent_ReturnValue2, const struct FWwisePlaybackInstance& CallFunc_PostAttachedEvent_ReturnValue3, const struct FWwisePlaybackInstance& CallFunc_PostAttachedEvent_ReturnValue4, float K2Node_CustomEvent_AggroDuration, bool K2Node_ComponentBoundEvent_IsSuccessful, const struct FHitResult& Temp_struct_Variable1, const struct FGbxBlackboardKeySelector& K2Node_MakeStruct_GbxBlackboardKeySelector, const struct FStatusEffectSpec& K2Node_MakeStruct_StatusEffectSpec, const struct FStatusEffectInstanceReference& CallFunc_AddStatusEffect_ReturnValue, float CallFunc_GetDataTableValueFromHandle_ReturnValue, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue2, class AActor* K2Node_CustomEvent_TargetActor, const struct FVector& K2Node_CustomEvent_TargetLocation, class AOakPlayerController* K2Node_CustomEvent_InstigatingController, class UOakDamageComponent* CallFunc_GetComponentByClass_ReturnValue2, class UTargetableComponent* CallFunc_GetComponentByClass_ReturnValue3, bool CallFunc_IsValid_ReturnValue1, bool CallFunc_IsTargetableByAIPlayers_ReturnValue, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate2, class AActor* K2Node_CustomEvent_DamageReceiver1, class AActor* K2Node_CustomEvent_DamageCauser1, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate3, class UOakDamageComponent* CallFunc_GetComponentByClass_ReturnValue4, class UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue3, bool CallFunc_IsServer_ReturnValue, class UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue4, bool CallFunc_EqualEqual_ObjectObject_ReturnValue, bool CallFunc_IsHostile_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue1, bool CallFunc_IsTargetableByActor_ReturnValue, bool CallFunc_BooleanAND_ReturnValue2, bool CallFunc_BooleanAND_ReturnValue3, class AActor* CallFunc_GetOwner_ReturnValue, class APlayerController* CallFunc_GetAssociatedPlayerController_ReturnValue, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate4, bool CallFunc_EqualEqual_ObjectObject_ReturnValue1, class UPlayerBalanceStateComponent* CallFunc_GetComponentByClass_ReturnValue5, int32 Temp_int_Array_Index_Variable, int32 CallFunc_GetExperienceLevel_ReturnValue, int32 K2Node_CustomEvent_OldExperienceLevel, int32 K2Node_CustomEvent_NewExperienceLevel, const struct FGbxBlackboardKeySelector& K2Node_MakeStruct_GbxBlackboardKeySelector1, class AActor* K2Node_CustomEvent_DamageReceiver, class AActor* K2Node_CustomEvent_DamageCauser, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate5, bool CallFunc_EqualEqual_ObjectObject_ReturnValue2, class AActor* CallFunc_GetOwner_ReturnValue1, class AOakCharacter_Player* K2Node_DynamicCast_AsOak_Character_Player, bool K2Node_DynamicCast_bSuccess, TScriptInterface<class IIBPChar_Player_C> K2Node_DynamicCast_AsIBPChar_Player, bool K2Node_DynamicCast_bSuccess1, const struct FGbxBlackboardKeySelector& K2Node_MakeStruct_GbxBlackboardKeySelector2, class UGbxAbility* CallFunc_GetClassFeat_Res, class UOakPlayerAbilityManagerComponent* CallFunc_GetComponentByClass_ReturnValue6, class UBPEventHub_PlayerCharacter_C* K2Node_DynamicCast_AsBPEvent_Hub_Player_Character, bool K2Node_DynamicCast_bSuccess2, class UDamageComponent* CallFunc_GetComponentByClass_ReturnValue7, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate6, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate7, const struct FGbxBlackboardKeySelector& K2Node_MakeStruct_GbxBlackboardKeySelector3, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate8, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate9, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate10, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate11, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate12, class AController* CallFunc_GetAssociatedController_ReturnValue, bool Temp_bool_Has_Been_Initd_Variable, class AGbxAIController* K2Node_DynamicCast_AsGbx_AIController, bool K2Node_DynamicCast_bSuccess3, const struct FDialogContext& CallFunc_NewDialogContext_ReturnValue, const struct FDialogConversation& CallFunc_FinishTriggerDialog_Conversation, int32 CallFunc_FinishTriggerDialog_SequenceID, bool CallFunc_FinishTriggerDialog_ReturnValue, class AController* CallFunc_GetAssociatedController_ReturnValue1, class UBlackboardComponent* CallFunc_GetBlackboard_ReturnValue5, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate13, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate14, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate15, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate16, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate17, class AController* CallFunc_GetAssociatedController_ReturnValue2, class AGbxAIController* K2Node_DynamicCast_AsGbx_AIController1, bool K2Node_DynamicCast_bSuccess4, const struct FGbxBlackboardKeySelector& K2Node_MakeStruct_GbxBlackboardKeySelector4, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate18, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate19, bool Temp_bool_IsClosed_Variable, const struct FGbxBlackboardKeySelector& K2Node_MakeStruct_GbxBlackboardKeySelector5, const struct FGbxBlackboardKeySelector& K2Node_MakeStruct_GbxBlackboardKeySelector6, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate20, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate21, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate22, const struct FGbxAttributeDelegateBindingHandle& CallFunc_BindEventToOnAttributeChanged_ReturnValue, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate23, const struct FGbxAttributeDelegateBindingHandle& CallFunc_BindEventToOnAttributeChanged_ReturnValue1, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate24, const struct FGbxAttributeDelegateBindingHandle& CallFunc_BindEventToOnAttributeChanged_ReturnValue2, const struct FDialogContext& CallFunc_NewDialogContext_ReturnValue1, const struct FGbxAttributeDelegateBindingHandle& CallFunc_BindEventToOnAttributeChanged_ReturnValue3, TArray<struct FGbxAttributeDelegateBindingHandle>& K2Node_MakeArray_Array, const struct FDialogConversation& CallFunc_FinishTriggerDialog_Conversation1, int32 CallFunc_FinishTriggerDialog_SequenceID1, bool CallFunc_FinishTriggerDialog_ReturnValue1, const struct FGbxAttributeDelegateBindingHandle& CallFunc_Array_Get_Item, bool CallFunc_HasAbility_ReturnValue1, bool CallFunc_Passive_Ranger_07_Set_Enabled_Res, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, class UOakPlayerAbilityManagerComponent* CallFunc_GetComponentByClass_ReturnValue8);
};

}


