#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x30 - 0x30)
// Class GbxGameSystemCore.StanceDataProvider
class UStanceDataProvider : public UGbxDataAsset
{
public:

	static class UClass* StaticClass();
	static class UStanceDataProvider* GetDefaultObj();

};

// 0x78 (0xA8 - 0x30)
// Class GbxGameSystemCore.StanceData
class UStanceData : public UStanceDataProvider
{
public:
	struct FStanceFloatValue                     MaxSpeed;                                          // 0x30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FStanceFloatValue                     MaxRotation;                                       // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FStanceFloatValue                     MaxAllowedAimOffset;                               // 0x40(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bUseMaxAllowedAimOffset;                           // 0x48(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_504[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FStanceFloatValue                     AimRotationRate;                                   // 0x4C(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bUseAimRotationRate;                               // 0x54(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_505[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FStanceFloatValue                     MaxIdleRotation;                                   // 0x58(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bUseMaxIdleRotation;                               // 0x60(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_508[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UStanceData*                           StanceDataToShowAnimSystem;                        // 0x68(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideSlowdownSpeed;                            // 0x70(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_50B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FStanceFloatValue                     SlowdownSpeed;                                     // 0x74(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bOverrideMaxAcceleration;                          // 0x7C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_50F[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxAcceleration;                                   // 0x80(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLockDodging;                                      // 0x84(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bLockTurns;                                        // 0x85(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bLockFootIK;                                       // 0x86(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bLockHandIK;                                       // 0x87(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bThisStanceAllowsFidgetAnims;                      // 0x88(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_513[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        WaitTimeBeforeFirstFidgetAnim;                     // 0x8C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPhysicalAnimationProfileAsset*        PhysicalAnimation;                                 // 0x90(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UHitReactionLayer>         HitReactionLayer;                                  // 0x98(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHitReactionData*                      HitReactionData;                                   // 0xA0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UStanceData* GetDefaultObj();

};

// 0x18 (0x48 - 0x30)
// Class GbxGameSystemCore.GbxAnimTable
class UGbxAnimTable : public UGbxDataAsset
{
public:
	struct FGbxTriggerProperty                   TriggerAutofill;                                   // 0x30(0x1)(Edit, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_52B[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UDataTable*                            DataTable;                                         // 0x38(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bScaleRateByMeshScale;                             // 0x40(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_52C[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGbxAnimTable* GetDefaultObj();

	void Autofill();
};

// 0x38 (0x60 - 0x28)
// Class GbxGameSystemCore.GbxAction
class UGbxAction : public UObject
{
public:
	uint8                                        Pad_5B8[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bCanUseCDO;                                        // 0x30(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_5BA[0x17];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ActionSlotName;                                    // 0x48(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EGbxActionPriority                ActionPriority;                                    // 0x50(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_5BD[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UScriptStruct*                         InstanceDataType;                                  // 0x58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UGbxAction* GetDefaultObj();

	void OnServerEnd(enum class EGbxActionEndState ActionEndState, class AActor* Actor);
	void OnServerBegin(class AActor* Actor);
	void OnEnd(enum class EGbxActionEndState ActionEndState, class AActor* Actor);
	void OnBegin(class AActor* Actor);
	bool K2_GetVectorRegisterValue(class FName InName, struct FVector* OutVector);
	float K2_GetTimeRemaining();
	bool K2_GetObjectRegisterValue(class FName InName, class UObject** OutObject);
	bool K2_GetNameRegisterValue(class FName InName, class FName* OutName);
	float K2_GetMaxCurrentTime();
	bool K2_GetIntRegisterValue(class FName InName, int32* OutInt);
	bool K2_GetFloatRegisterValue(class FName InName, float* OutFloat);
	float K2_GetCurrentTime();
	float K2_GetCurrentNormalizedTime();
	class AActor* K2_GetActor();
};

// 0x58 (0xB8 - 0x60)
// Class GbxGameSystemCore.GbxAction_SimpleAnim
class UGbxAction_SimpleAnim : public UGbxAction
{
public:
	uint8                                        Pad_62F[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bStopAI;                                           // 0x68(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAbortAI;                                          // 0x69(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStopMovement;                                     // 0x6A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisableHitReactions;                              // 0x6B(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUsePhysNoneWithRootMotion;                        // 0x6C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStopLook;                                         // 0x6D(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStopAimRotation;                                  // 0x6E(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStopHeadLook;                                     // 0x6F(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLockHeadLook;                                     // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisableAvoidance;                                 // 0x71(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bTickAndRefreshBones;                              // 0x72(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisableCollision;                                 // 0x73(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_63A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class ECollisionChannel>         DisableCollisionChannels;                          // 0x78(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bEnableLoopHelper;                                 // 0x88(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanInterruptSameSlotAnims;                        // 0x89(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bResetDynamicsOnBegin;                             // 0x8A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUsePhysicalAnimationProfile;                      // 0x8B(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_63E[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UPhysicalAnimationProfileAsset*        PhysicalAnimationProfile;                          // 0x90(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bRestorePreviousPhysicalAnimationProfileOnEnd;     // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseNewBoneSetFilter;                              // 0x99(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_644[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UGbxBoneSet*                           NewBoneSetFilter;                                  // 0xA0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bRestorePreviousBoneSetFilterProfileOnEnd;         // 0xA8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bResetBoneSetFilter;                               // 0xA9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_648[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DefaultInterruptBlendOutTime;                      // 0xAC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bReleaseResourceFlagsOnAnimEnd;                    // 0xB0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bEndActionOnBlendOut;                              // 0xB1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_64B[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGbxAction_SimpleAnim* GetDefaultObj();

	void OnAnimEnd(class AActor* Actor);
	void K2_SetTickAndRefreshBones(bool bLockResource);
	void K2_SetPhysNoneWithRootMotion(bool bEnable);
	void K2_SetMovement(bool bDisable);
	void K2_SetLook(bool bDisable);
	void K2_SetHitReactions(bool bDisable);
	void K2_SetHeadLookLocked(bool bLock);
	void K2_SetHeadLook(bool bDisable);
	void K2_SetCollision(bool bEnable);
	void K2_SetAvoidance(bool bDisable);
	void K2_SetAIThinking(bool bDisable);
	void K2_SetAimRotation(bool bDisable);
};

// 0x8 (0x130 - 0x128)
// Class GbxGameSystemCore.GbxAISystemBase
class UGbxAISystemBase : public UAISystem
{
public:
	class UGbxQueryManager*                      GbxQueryManager;                                   // 0x128(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UGbxAISystemBase* GetDefaultObj();

};

// 0xF8 (0x7E8 - 0x6F0)
// Class GbxGameSystemCore.PreviewComponent
class UPreviewComponent : public UPrimitiveComponent
{
public:
	bool                                         bSpawnInPIE;                                       // 0x6F0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPreviewEnabled;                                   // 0x6F1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_66F[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AActor>                    PreviewActor;                                      // 0x6F8(0x8)(Edit, ZeroConstructor, Transient, EditConst, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FPreviewState                         PreviewState;                                      // 0x700(0xD8)(Transient, DuplicateTransient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                         bEnabled;                                          // 0x7D8(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_672[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TWeakObjectPtr<class USkinnedMeshComponent>  SkinnedMeshComponent;                              // 0x7DC(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_673[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPreviewComponent* GetDefaultObj();

	void OnBlueprintCompiled(class Ublueprint* BP);
};

// 0xF0 (0x1A8 - 0xB8)
// Class GbxGameSystemCore.GbxAction_Anim
class UGbxAction_Anim : public UGbxAction_SimpleAnim
{
public:
	struct FAnimMeshList                         DefaultAnims;                                      // 0xB8(0x78)(Edit, NativeAccessSpecifierPublic)
	enum class EGbxActionEndCondition            DefaultEndCondition;                               // 0x130(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6C1[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  AnimationSlot;                                     // 0x138(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BlendInTime;                                       // 0x140(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPushBlendInTime;                                  // 0x144(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6C7[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DefaultBlendOutTime;                               // 0x148(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPushBlendOutTime;                                 // 0x14C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6C9[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PlayRate;                                          // 0x150(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bScalePlayrateWithCharacterScale;                  // 0x154(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6CC[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SourceCameraAlpha;                                 // 0x158(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MontageCameraAlpha;                                // 0x15C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisableFootIk;                                    // 0x160(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBody1stControlsDuration;                          // 0x161(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPlay1stPersonAnimationsOnRemotePlayers;           // 0x162(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6D5[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  AnimSlot3rd;                                       // 0x168(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  AnimSlot1st;                                       // 0x170(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHasAnimSlot3rdValue;                              // 0x178(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHasAnimSlot1stValue;                              // 0x179(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bGodMode;                                          // 0x17A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDemigodMode;                                      // 0x17B(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBlockCrouching;                                   // 0x17C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBlockMantling;                                    // 0x17D(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBlockLadders;                                     // 0x17E(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnableScaledRootMotion;                           // 0x17F(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bMaintainRootVelocity;                             // 0x180(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideDuration;                                 // 0x181(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6E0[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        OverrideDuration;                                  // 0x184(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideCount;                                    // 0x188(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6E2[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        OverrideCount;                                     // 0x18C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverridePlayRate;                                 // 0x190(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6E4[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        OverridePlayRate;                                  // 0x194(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  BlendSpaceXRegisterName;                           // 0x198(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  BlendSpaceYRegisterName;                           // 0x1A0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UGbxAction_Anim* GetDefaultObj();

	void K2_SetMantlingBlocked(bool bBlocked);
	void K2_SetLaddersBlocked(bool bBlocked);
	void K2_SetGodMode(bool bEnable);
	void K2_SetFootIK(bool bDisable);
	void K2_SetDemigodMode(bool bEnable);
	void K2_SetCrouchBlocked(bool bBlocked);
	void K2_Resume();
	void K2_RepProceedToNextSection();
	void K2_RepJumpToNextSection();
	void K2_ProceedToNextSection();
	void K2_Pause();
	void K2_JumpToNextSection();
};

// 0x40 (0x1B8 - 0x178)
// Class GbxGameSystemCore.TeamComponent
class UTeamComponent : public UActorComponent
{
public:
	uint8                                        Pad_76A[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UTeam*                                 Team;                                              // 0x180(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTeam*                                 TeamDefault;                                       // 0x188(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_76D[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bSetTeamCollision;                                 // 0x1A8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIgnoreCollisionWithTeam;                          // 0x1A9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bInheritSourceTeamFromInstigator;                  // 0x1AA(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_773[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UTeamComponent*                        SourceTeamComponent;                               // 0x1B0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UTeamComponent* GetDefaultObj();

	void SetTeamToDefault();
	void SetTeamCollision(bool bOn);
	void SetTeam(class UTeam* NewTeam);
	void SetSourceTeamComponent(class UTeamComponent* NewSourceTeamComponent);
	void SetCollidesWithTeam(bool bCollidesWithTeam);
	void OnRep_Team(class UTeam* OldTeam);
	void OnRep_bIgnoreCollisionWithTeam();
	bool IsNeutral(class AActor* Actor);
	bool IsHostile(class AActor* Actor);
	bool IsFriendly(class AActor* Actor);
	void InitializeTeam(class UTeam* NewTeam);
	enum class ETeamCollisionChannel GetTeamCollisionChannel();
	enum class ETeamAttitude GetTeamAttitudeTowardsTeam(class UTeam* OtherTeam);
	enum class ETeamAttitude GetTeamAttitudeTowardsActor(class AActor* Actor);
};

// 0x500 (0xDB0 - 0x8B0)
// Class GbxGameSystemCore.GbxCharacter
class AGbxCharacter : public ACharacter
{
public:
	uint8                                        Pad_8BE[0x50];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UGbxCharacterMovementComponent*        GbxCharacterMovement;                              // 0x900(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTargetableComponent*                  TargetableComponent;                               // 0x908(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDamageComponent*                      DamageComponent;                                   // 0x910(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDamageCauserComponent*                DamageCauserComponent;                             // 0x918(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGbxActionComponent*                   GbxAction;                                         // 0x920(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameplayTagContainerComponent*        GameplayTagContainerComponent;                     // 0x928(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UDynamicPhysicalAnimationComponent*    DynamicPhysicalAnimationComponent;                 // 0x930(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTargetingComponent*                   TargetingComponent;                                // 0x938(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGbxPerceptionComponent*               PerceptionComponent;                               // 0x940(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFirstPersonComponent*                 FirstPersonComponent;                              // 0x948(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_8CB[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ULandingData*                          LandingData;                                       // 0x960(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImpactData*                           JumpedImpact;                                      // 0x968(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPlayJumpAndLandImpactsOnAllFeet;                  // 0x970(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_8CE[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UImpactData*                           FootstepImpact;                                    // 0x978(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImpactData*                           GenericHandImpact;                                 // 0x980(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UImpactData*                           LadderHandImpact;                                  // 0x988(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                          FootstepSockets;                                   // 0x990(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                          HandAccessoryTags;                                 // 0x9A0(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	UMulticastDelegateProperty_                  LandingDataTriggeredDelegate;                      // 0x9B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	class AGbxPlayerController*                  OwnerPlayerController;                             // 0x9C0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AAIController*                         OwnerAIController;                                 // 0x9C8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AGbxCharacter*                         PlayerMaster;                                      // 0x9D0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AGbxCharacter*>                 Pets;                                              // 0x9D8(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	struct FMassSelection                        CharacterMass;                                     // 0x9E8(0x18)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FSpawnCostSelection                   SpawnCostSelection;                                // 0xA00(0x18)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	class UGbxSkeletalMeshComponent*             GbxMesh;                                           // 0xA18(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bOrientEyeHeight;                                  // 0xA20(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_8D9[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ViewSocket;                                        // 0xA28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                       ViewSocketComponent;                               // 0xA30(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_8DC[0xB0];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FReplicatedPawnAttachState            ReplicatedPawnAttachState;                         // 0xAE8(0x10)(Net, Transient, RepNotify, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FReplicatedPawnAttachState            PawnAttachState;                                   // 0xAF8(0x10)(Transient, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8E0[0xAC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BaseAimHeight;                                     // 0xBB4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseCustomBaseAimHeight;                           // 0xBB8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8E2[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AimHeightFromGround;                               // 0xBBC(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CrouchedAimHeight;                                 // 0xBC0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseCustomCrouchedAimHeight;                       // 0xBC4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8E7[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AimEyeHeightPct;                                   // 0xBC8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8E8[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  AimSocket;                                         // 0xBD0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                       AimSocketComponent;                                // 0xBD8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8E9[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFacingController                     FacingController;                                  // 0xBE8(0x110)(Net, Transient, NativeAccessSpecifierPublic)
	uint8                                        ClientTurnDelta;                                   // 0xCF8(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8EE[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSoftClassPath                        GbxInputComponentClass;                            // 0xD00(0x18)(Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class FName>                          DefaultSchemas;                                    // 0xD18(0x10)(ZeroConstructor, Config, GlobalConfig, NativeAccessSpecifierPrivate)
	class FName                                  DefaultContextName;                                // 0xD28(0x8)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFoleyAccessoryComponent*              GestaltFoleyAccessory;                             // 0xD30(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFoleyMainComponent*                   CachedFoleyMainComponent;                          // 0xD38(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameplayTasksComponent*               GameplayTasksComponent;                            // 0xD40(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULevelSequencePlayer*                  LevelSequencePlayerController;                     // 0xD48(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSavedCollision                       LevelSequenceCollisionState;                       // 0xD50(0x20)(Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UGbxBoneSet*                           AnimGraphBoneSetFilter;                            // 0xD70(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FAnimGraphBoneSet>             ActiveAnimGraphBoneSetFilterList;                  // 0xD78(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UGbxBoneSet*                           SmartObjectBoneSetFilter;                          // 0xD88(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGbxBoneSet*                           DefaultBoneSetFilter;                              // 0xD90(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxBoneSet*                           ActionBoneSetFilter;                               // 0xD98(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPauseAIWhileFalling;                              // 0xDA0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8F8[0xF];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AGbxCharacter* GetDefaultObj();

	void SetTeam(class UTeam* Team);
	void SetPlayerMaster(class AGbxCharacter* NewPlayerMaster);
	void SetCharacterUIName(class UGbxUIName* NewCharacterUIName);
	void SetCharacterNameFromString(const class FString& NewCharacterName);
	void SetCharacterName(class FText& NewCharacterName);
	void RotateCharacterTo(const struct FRotator& TargetRotation, float Duration, enum class EEasingFunc Easing);
	void ReceiveOwnerPlayerControllerChanged(class AGbxPlayerController* NewPlayerControllerOwner);
	void OnRep_ReplicatedPawnAttachState();
	void OnLandingDataTriggered(const struct FLandingInfo& LandingInfo, int32 Index);
	void NetMulticast_TriggerHitReactionSound(class UCharacterSoundTag* Tag);
	void NetMulticast_PlayLanded(struct FHitResult& Hit, float ImpactSpeed, bool bLandFromJump, class ULandingData* LandingDataOverride);
	void NetMulticast_PlayJumped();
	bool IsZoomed();
	class UTeamComponent* GetTeamComponent();
	class UTeam* GetTeam();
	class UTargetingComponent* GetTargetingComponent();
	class UTargetableComponent* GetTargetableComponent();
	class UGbxPerceptionComponent* GetPerceptionComponent();
	enum class EPawnAttachStatus GetPawnAttachStatus();
	class UPawnAttachSlotComponent* GetPawnAttachComponent();
	class AActor* GetPawnAttachActor();
	struct FVector GetLookAtLocation(float* OutWeight);
	float GetLookAt(struct FVector* HeadLocation, struct FVector* EyeLocation, float* HeadWeight);
	class USkeletalMeshComponent* GetFirstPersonMesh();
	class UFirstPersonComponent* GetFirstPersonComponent();
	class UBlackboardComponent* GetBlackboardComponent();
	class UBlackboardData* GetBlackboardAsset();
	void GetAvailableSocketNames(TArray<class FName>* Array);
	struct FVector GetAimVectorStartLocation();
	struct FRotator GetAimOffset();
	class UFirstPersonComponent* FindFirstPersonComponent();
	void DetachCharacter(enum class EDetachmentRule LocationRule);
	void ClientRotateCharacterTo(const struct FRotator& TargetRotation, float Duration, enum class EEasingFunc Easing);
	void CauseEveryoneToForgetMe();
	void AttachCharacterToComponent(class USceneComponent* Parent, class FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
	void AttachCharacterToActor(class AActor* ParentActor, class FName SocketName, enum class EAttachmentRule LocationRule, enum class EAttachmentRule RotationRule, enum class EAttachmentRule ScaleRule, bool bWeldSimulatedBodies);
};

// 0x60 (0x1D8 - 0x178)
// Class GbxGameSystemCore.BalanceStateComponent
class UBalanceStateComponent : public UActorComponent
{
public:
	uint8                                        Pad_933[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDataTableRowHandle                   BalanceTableRowHandle;                             // 0x180(0x10)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FDataTableRowHandle                   InheritedBalanceTableRowHandle;                    // 0x190(0x10)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_937[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        GameStage;                                         // 0x1A4(0x4)(Edit, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        ExperienceLevel;                                   // 0x1A8(0x4)(Edit, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_93A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnLevelChanged;                                    // 0x1B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_93B[0x10];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bAutoRefreshInheritedBalanceWhenSourceChangesLevel; // 0x1D0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_93F[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBalanceStateComponent* GetDefaultObj();

	void SetGameStage(int32 NewGameStage);
	void SetExperienceLevel(int32 NewExperienceLevel);
	void OnRep_ExperienceLevel(int32 OldExperienceLevel);
	void OnInheritedBalanceSourceLevelChanged(class UBalanceStateComponent* InheritedBalanceStateSource, int32 OldExperienceLevel, int32 NewExperienceLevel);
	int32 GetGameStage();
	int32 GetExperienceLevel();
	struct FDataTableRowHandle GetBalanceTableRow();
};

// 0x20 (0x320 - 0x300)
// Class GbxGameSystemCore.GbxChildActorComponent
class UGbxChildActorComponent : public UChildActorComponent
{
public:
	uint8                                        bAutoSpawnActor : 1;                               // Mask: 0x1, PropSize: 0x10x300(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAutoDestroyActor : 1;                             // Mask: 0x2, PropSize: 0x10x300(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDestroyExistingChildActorOnSpawn : 1;             // Mask: 0x4, PropSize: 0x10x300(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDeferChildActorClassUpdate : 1;                   // Mask: 0x8, PropSize: 0x10x300(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bClearChildActorReferenceToMeWhenChildActorIsDetached : 1; // Mask: 0x10, PropSize: 0x10x300(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDisableCollisionWithOwner : 1;                    // Mask: 0x20, PropSize: 0x10x300(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_47 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_954[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnChildActorSpawned;                               // 0x308(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_958[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGbxChildActorComponent* GetDefaultObj();

	void SpawnChildActor();
	void DespawnChildActor();
};

// 0x8 (0x40 - 0x38)
// Class GbxGameSystemCore.AnimNotify_PawnAttachSlotTransition
class UAnimNotify_PawnAttachSlotTransition : public UAnimNotify
{
public:
	uint8                                        bTriggerOnFirstPersonMesh : 1;                     // Mask: 0x1, PropSize: 0x10x38(0x1)(Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDetach : 1;                                       // Mask: 0x2, PropSize: 0x10x38(0x1)(Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAttach : 1;                                       // Mask: 0x4, PropSize: 0x10x38(0x1)(Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_968[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_PawnAttachSlotTransition* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class GbxGameSystemCore.AttributeEffectMutatorData
class UAttributeEffectMutatorData : public UGbxDataAsset
{
public:

	static class UClass* StaticClass();
	static class UAttributeEffectMutatorData* GetDefaultObj();

};

// 0xF8 (0x538 - 0x440)
// Class GbxGameSystemCore.GbxAnimInstance
class UGbxAnimInstance : public UAnimInstance
{
public:
	class UGbxSkeletalMeshComponent*             GbxSkeletalMeshComponent;                          // 0x440(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UGbxAnimStateMachineDefinition*> AnimStateMachineDefinitions;                       // 0x448(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FRuntimeStateMachineData>      RuntimeStateMachines;                              // 0x458(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TMap<class UGbxAnimTable*, struct FGbxAnimTableMapItem> AnimTableMap;                                      // 0x468(0x50)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_986[0x28];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGbxStateManagerRuntime               ManagerRuntime;                                    // 0x4E0(0x50)(NativeAccessSpecifierPrivate)
	bool                                         bEarlyBindBoneSetDelegates;                        // 0x530(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_98A[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGbxAnimInstance* GetDefaultObj();

	class UAnimSequence* GetAnimTableSequence(class UGbxAnimTable* AnimTable);
	bool CanUseAnimTable(class UGbxAnimTable* AnimTable);
};

// 0x68 (0x98 - 0x30)
// Class GbxGameSystemCore.ActorPartSelectionData
class UActorPartSelectionData : public UGbxDataAsset
{
public:
	class UActorPartSelectionData*               BaseSelectionData;                                 // 0x30(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UActorPartSetData*                     PartSetData;                                       // 0x38(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                 PartSetDataGuid;                                   // 0x40(0x10)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRuntimeActorPartListData             RuntimePartList;                                   // 0x50(0x28)(Protected, NativeAccessSpecifierProtected)
	struct FGuid                                 RuntimePartListGuid;                               // 0x78(0x10)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                 InheritedRuntimePartListGuid;                      // 0x88(0x10)(IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UActorPartSelectionData* GetDefaultObj();

};

// 0x60 (0x750 - 0x6F0)
// Class GbxGameSystemCore.GbxAreaComponent
class UGbxAreaComponent : public UPrimitiveComponent
{
public:
	TArray<class AVolume*>                       DetectionVolumes;                                  // 0x6F0(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	bool                                         bWorldAreaVolume;                                  // 0x700(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_996[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DetectionRadius;                                   // 0x704(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DetectionHalfHeight;                               // 0x708(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWorldAreaRadius;                                  // 0x70C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bManualTest;                                       // 0x70D(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_999[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnPlayerEnteredArea;                               // 0x710(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnPlayerExitedArea;                                // 0x720(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	enum class EGbxAreaDrawStyle                 DrawStyle;                                         // 0x730(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_99B[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TWeakObjectPtr<class APlayerController>> PlayersDetected;                                   // 0x738(0x10)(ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPrivate)
	uint8                                        Pad_99C[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGbxAreaComponent* GetDefaultObj();

	void AreaTest();
};

// 0x0 (0x28 - 0x28)
// Class GbxGameSystemCore.EffectCollectionData
class UEffectCollectionData : public UObject
{
public:

	static class UClass* StaticClass();
	static class UEffectCollectionData* GetDefaultObj();

	class UWwiseEvent* StaticGetWwiseEvent(TSubclassOf<class UEffectCollectionData> Collection, class UObject* ContextObject);
	void StaticGetParticleEffectAndWwiseEvent(TSubclassOf<class UEffectCollectionData> Collection, class UObject* ContextObject, class UParticleSystem** ParticleEffect, class UWwiseEvent** WwiseEvent);
	class UParticleSystem* StaticGetParticleEffect(TSubclassOf<class UEffectCollectionData> Collection, class UObject* ContextObject);
	class UWwiseEvent* GetWwiseEvent(class UObject* ContextObject);
	void GetParticleEffectAndWwiseEvent(class UObject* ContextObject, class UParticleSystem** ParticleEffect, class UWwiseEvent** WwiseEvent);
	class UParticleSystem* GetParticleEffect(class UObject* ContextObject);
};

// 0x0 (0x28 - 0x28)
// Class GbxGameSystemCore.AttributeValueResolver
class UAttributeValueResolver : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAttributeValueResolver* GetDefaultObj();

	bool SetValueForAttribute(class UGbxAttributeData* Attribute, class UObject* Context, float Value);
	float GetValueForAttribute(class UGbxAttributeData* Attribute, class UObject* Context);
};

// 0xB0 (0x110 - 0x60)
// Class GbxGameSystemCore.EnvQueryGenerator_TargetableActors
class UEnvQueryGenerator_TargetableActors : public UEnvQueryGenerator
{
public:
	struct FAIDataProviderFloatValue             DistanceMax;                                       // 0x60(0x30)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class UGbxCondition*                         TargetSkipDistanceCheckCondition;                  // 0x90(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowNonTargetableActors;                         // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowDeadActors;                                  // 0x99(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowQuerier;                                     // 0x9A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowHostiles;                                    // 0x9B(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowFriendlies;                                  // 0x9C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowNeutrals;                                    // 0x9D(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_9F3[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UGbxCondition*                         TargetCondition;                                   // 0xA0(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FActorTagCompositeQuery               TagQuery;                                          // 0xA8(0x10)(Edit, NativeAccessSpecifierPublic)
	TArray<TSoftClassPtr<class AActor>>          AllowedTypes;                                      // 0xB8(0x10)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                        bUseAllowedTypes : 1;                              // Mask: 0x1, PropSize: 0x10xC8(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_55 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_9F8[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSoftClassPtr<class AActor>>          DisallowedTypes;                                   // 0xD0(0x10)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                        bUseDisallowedTypes : 1;                           // Mask: 0x1, PropSize: 0x10xE0(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_56 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_9FA[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UClass*>                        AllowedTypesCache;                                 // 0xE8(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class UClass*>                        DisallowedTypesCache;                              // 0xF8(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                        Pad_9FC[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UEnvQueryGenerator_TargetableActors* GetDefaultObj();

};

// 0x260 (0x3D8 - 0x178)
// Class GbxGameSystemCore.UsableComponent
class UUsableComponent : public UActorComponent
{
public:
	struct FHoldToUseSettings                    HoldToUseSettings;                                 // 0x178(0x14)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_A29[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UUsabilityDataSelection*               UsabilityData;                                     // 0x190(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseEnabledCondition;                              // 0x198(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A2A[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UGbxCondition*                         EnabledCondition;                                  // 0x1A0(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FUseDefSelection                      PrimaryUseDefSelection;                            // 0x1A8(0x20)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FUseDefSelection                      PrimaryHoldUseDefSelection;                        // 0x1C8(0x20)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FUseDefSelection                      SecondaryUseDefSelection;                          // 0x1E8(0x20)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FUseDefSelection                      SecondaryHoldUseDefSelection;                      // 0x208(0x20)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        bCanBeUsedFromVehicle : 1;                         // Mask: 0x1, PropSize: 0x10x228(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanBeUsedFromMech : 1;                            // Mask: 0x2, PropSize: 0x10x228(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanOnlyBeUsedByOwner : 1;                         // Mask: 0x4, PropSize: 0x10x228(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDefaultIsBackupPrimaryData : 1;                   // Mask: 0x8, PropSize: 0x10x228(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_5B : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_A31[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        UsablePriority;                                    // 0x22C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWantsMaxUseCount;                                 // 0x230(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A32[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxUseCount;                                       // 0x234(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrentUseCount;                                   // 0x238(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOneUserAtATime;                                   // 0x23C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A36[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AController*                           CurrentUser;                                       // 0x240(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                          RequiredComponentNames;                            // 0x248(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                         bUseAngleRestriction;                              // 0x258(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A39[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FUsableAngleRestriction               AngleRestriction;                                  // 0x25C(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bRequiresNetAuthority;                             // 0x264(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A3A[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  HeaderName;                                        // 0x268(0x18)(NativeAccessSpecifierPublic)
	uint8                                        Pad_A3C[0xA0];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnUsed;                                            // 0x320(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnUsedPrimary;                                     // 0x330(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnUnfilteredStartUse;                              // 0x340(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnUnfilteredStopUse;                               // 0x350(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnUsedPrimaryHold;                                 // 0x360(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnUsedSecondary;                                   // 0x370(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnUsedSecondaryHold;                               // 0x380(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnLookedAt;                                        // 0x390(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnLookedAwayFrom;                                  // 0x3A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_A42[0x28];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UUsableComponent* GetDefaultObj();

	void SetUsableLocked(bool bLocked, class FName Reason);
	void SetPrimaryUseDefinition(class UUsableTypeDefinition* Def);
	void SetInteractionHeader(class FText& NewHeaderName);
	void ResetUseCount();
	class FText K2_GetOptionalErrorText();
	bool K2_CanBeUsed(struct FUsabilityQuery& Query);
	void GetValidPrimitiveComponentNames(TArray<class FName>* ComponentNames);
	class FText GetInteractionHeader();
};

// 0x1F0 (0x220 - 0x30)
// Class GbxGameSystemCore.GbxGameplayGlobals
class UGbxGameplayGlobals : public UGbxDataAsset
{
public:
	class UHealthTypeData*                       ShieldHealthType;                                  // 0x30(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEnvQuery*                             ProjectileReflectionQuery;                         // 0x38(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ProjectileReflectionSpeedScale;                    // 0x40(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ProjectileHitRegionRicochetSpeedScale;             // 0x44(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAttributeInitializationData          ProjectileReflectionInaccuracy;                    // 0x48(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class UImpactData*                           ProjectileReflectionImpact;                        // 0x80(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImpactData*                           ProjectileSelfReflectionImpact;                    // 0x88(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUsableTypeDefinition*                 DefaultUseDefinition;                              // 0x90(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAttributeInitializationData          InventoryScoreValueInitializer;                    // 0x98(0x38)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bUseGenericPrefixByDefault;                        // 0xD0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A51[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UGlobalAIData*                         GlobalAIData;                                      // 0xD8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ExplosionWindRadiusModifier;                       // 0xE0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinExplosionRadiusToTriggerRadialBlur;             // 0xE4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDefaultExplosionSettings>     DefaultExplosionSettings;                          // 0xE8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           ShortDurationTinnitusEvent;                        // 0xF8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           MediumDurationTinnitusEvent;                       // 0x100(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           LongDurationTinnitusEvent;                         // 0x108(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ExplosionSoundStackingMaxDistanceSquared;          // 0x110(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ExplosionSoundStackingPreventionDelay;             // 0x114(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDataTable*                            DefaultFeedbackTable;                              // 0x118(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FGameplayTag, class UGameStatData*> KillStatMap;                                       // 0x120(0x50)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class UGameStatList*>                 GameStatLists;                                     // 0x170(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class UChallengeList*>                GameChallengeLists;                                // 0x180(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	struct FMantleGlobalData                     MantleGlobals;                                     // 0x190(0x90)(Edit, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UGbxGameplayGlobals* GetDefaultObj();

};

// 0x418 (0x950 - 0x538)
// Class GbxGameSystemCore.GbxCharacterAnimInstance
class UGbxCharacterAnimInstance : public UGbxAnimInstance
{
public:
	uint8                                        Pad_A68[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               HeadLookAtLocation;                                // 0x540(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               EyeLookAtLocation;                                 // 0x54C(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HeadLookAtPercentage;                              // 0x558(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LookAtWeight;                                      // 0x55C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLookAtBlinkStarted;                               // 0x560(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A69[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ActiveStanceData;                                  // 0x568(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  ActiveStanceType;                                  // 0x570(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStanceDataProvider*                   CombatStance;                                      // 0x578(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStanceDataProvider*                   PassiveStance;                                     // 0x580(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStanceData*                           StanceData;                                        // 0x588(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStanceType*                           StanceType;                                        // 0x590(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStanceComponent*                      StanceComponent;                                   // 0x598(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInCombatStance;                                   // 0x5A0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInPassiveStance;                                  // 0x5A1(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsInAir;                                           // 0x5A2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsCrouching;                                       // 0x5A3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsFlying;                                         // 0x5A4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsFalling;                                        // 0x5A5(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHasBeenLaunched;                                  // 0x5A6(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bJumped;                                           // 0x5A7(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bForceFallingState;                                // 0x5A8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A74[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxWalkSpeed;                                      // 0x5AC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxSprintSpeed;                                    // 0x5B0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxWalkSpeedCrouched;                              // 0x5B4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Speed2D;                                           // 0x5B8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Speed2DRaw;                                        // 0x5BC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        VelocityZ;                                         // 0x5C0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ForwardDirection;                                  // 0x5C4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RightDirection;                                    // 0x5C8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        UpDirection;                                       // 0x5CC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               Acceleration;                                      // 0x5D0(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Direction;                                         // 0x5DC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BodyYaw;                                           // 0x5E0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReverseDirection;                                  // 0x5E4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              RotationalVelocity;                                // 0x5E8(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                               GroundLocation;                                    // 0x5F4(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Radius;                                            // 0x600(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HipsYawCurveMultiplier;                            // 0x604(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HipsYawCurveValue;                                 // 0x608(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         WantsToTurn;                                       // 0x60C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A82[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TurnAmount;                                        // 0x610(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         TurnIsActive;                                      // 0x614(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A83[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxPredictedTurnDegrees;                           // 0x618(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxPredictedTurnTime;                              // 0x61C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Pitch;                                             // 0x620(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Yaw;                                               // 0x624(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AimBlendWeight;                                    // 0x628(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               AimFacingLocation;                                 // 0x62C(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanAimInPassiveStance;                            // 0x638(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUpdateFootIK;                                     // 0x639(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUpdateHandIK;                                     // 0x63A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A89[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LeftHandIKWeight;                                  // 0x63C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RightHandIKWeight;                                 // 0x640(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LeftHandGripWeight;                                // 0x644(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RightHandGripWeight;                               // 0x648(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseLegIkBaseClass;                                // 0x64C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A8B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            LeftHandWeaponIKOffset;                            // 0x650(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                            RightHandWeaponIKOffset;                           // 0x680(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FTransform                            LeftHandWorldIKTarget;                             // 0x6B0(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bHasLeftHandWorldIKTarget;                         // 0x6E0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBlueprintForceLeftHandWorldIKTarget;              // 0x6E1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A8E[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  LeftHandIKTargetSocketName;                        // 0x6E8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                            RightHandWorldIKTarget;                            // 0x6F0(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bHasRightHandWorldIKTarget;                        // 0x720(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBlueprintForceRightHandWorldIKTarget;             // 0x721(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A91[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  RightHandIKTargetSocketName;                       // 0x728(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LeftFootWorldIKTargetLocation;                     // 0x730(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              LeftFootWorldIKTargetRotation;                     // 0x73C(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                               RightFootWorldIKTargetLocation;                    // 0x748(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              RightFootWorldIKTargetRotation;                    // 0x754(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bHasFootWorldIKTargets;                            // 0x760(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A9C[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AINavYaw;                                          // 0x764(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AINavTurnBlendDegrees;                             // 0x768(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AINavTransitionBlendDegrees;                       // 0x76C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                             AINavHopDirection;                                 // 0x770(0x8)(BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AINavHopDistance;                                  // 0x778(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AA0[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FNavAnimServerData                    AINavServerData;                                   // 0x780(0xA0)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	struct FNavAnimClientData                    AINavClientData;                                   // 0x820(0x1C)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	float                                        AINavState_IdleAlphaTime;                          // 0x83C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AINavState_IdleAlpha;                              // 0x840(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAINavState_Idle;                                  // 0x844(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAINavState_Move;                                  // 0x845(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAINavState_Start;                                 // 0x846(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAINavState_Stop;                                  // 0x847(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAINavState_Turn;                                  // 0x848(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EGbxCharacterBlendPoints          BlendPoints;                                       // 0x849(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAINavWantsForward;                                // 0x84A(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAINavWantsBackward;                               // 0x84B(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAINavWantsLeft;                                   // 0x84C(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAINavWantsRight;                                  // 0x84D(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAINavIsMoving2D;                                  // 0x84E(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAINavIsStill2D;                                   // 0x84F(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AINavPreviewTableIndex;                            // 0x850(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ENavAnimState                     AINavPreviewDesiredState;                          // 0x854(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAINav_UseDesired;                                 // 0x855(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAINav_CanStretch;                                 // 0x856(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AAC[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MeshScale;                                         // 0x858(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ENavAnimState                     AINavPreviewCurrentState;                          // 0x85C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AAF[0x53];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        StartTransitionTimeToEvaluate;                     // 0x8B0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StopTransitionTimeToEvaluate;                      // 0x8B4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TurningRotationTimeToEvaluate;                     // 0x8B8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_ABE[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UGbxBoneSet*                           ActiveAnimBoneSetFilter;                           // 0x8C0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxBoneSet*                           PrevAnimBoneSetFilter;                             // 0x8C8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AC2[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGaitScalingSettings                  GaitScalingSettings;                               // 0x8E8(0x38)(Edit, NativeAccessSpecifierPublic)
	float                                        FacialEmoteWeight;                                 // 0x920(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DesiredFacialEmoteWeight;                          // 0x924(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FacialEmoteWeightAlphaSpeed;                       // 0x928(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DesiredActionWeight;                               // 0x92C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BoneSetTransitionActionWeight;                     // 0x930(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BoneSetBlendWeight;                                // 0x934(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBoneSetTransitionBlendType       BoneSetTransitionBlendType;                        // 0x938(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_ACC[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BoneSetTransitionBlendSpeed;                       // 0x93C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        BoneSetBlendSpeed;                                 // 0x940(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        DefaultBoneSetBlendSpeed;                          // 0x944(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        DefaultBoneSetTransitionBlendSpeed;                // 0x948(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_AD0[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGbxCharacterAnimInstance* GetDefaultObj();

	void SetDesiredFacialEmoteWeight(float Weight, float BlendTime);
	void OnStanceChanged();
};

// 0x210 (0x238 - 0x28)
// Class GbxGameSystemCore.DamageData
class UDamageData : public UObject
{
public:
	struct FAttributeInitializationData          Damage;                                            // 0x28(0x38)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	struct FAttributeInitializationData          DamageMultiplier;                                  // 0x60(0x38)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	class UDamageAreaType*                       DamageAreaType;                                    // 0x98(0x8)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UDamageSource>             DamageSource;                                      // 0xA0(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGbxDamageType>            DamageType;                                        // 0xA8(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UConditionalDamageModifier*>    ConditionalDamageModifiers;                        // 0xB0(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bApplyUpwardForce;                                 // 0xC0(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B42[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        UpwardForceScalar;                                 // 0xC4(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FForceSelection                       ImpactForceSelection;                              // 0xC8(0x20)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	float                                        GoreModifier;                                      // 0xE8(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GibModifier;                                       // 0xEC(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bImpactForceFallsOff;                              // 0xF0(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B49[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              HitRotationOffset;                                 // 0xF4(0xC)(Edit, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bSimulatedOnClients;                               // 0x100(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bForceNoCrit;                                      // 0x101(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseTargetAsDamageEvaluationContext;               // 0x102(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanBeExecutedAsync;                               // 0x103(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxAsyncExecutionDeferTime;                        // 0x104(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  HitStartSocketOrBone;                              // 0x108(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBaseTransformComesFromActorTransform;             // 0x110(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B55[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               HitStartOffset;                                    // 0x114(0xC)(Edit, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              HitStartRotationOffset;                            // 0x120(0xC)(Edit, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FAttitudeDamageRules                  AttitudeDamageRules;                               // 0x12C(0x4)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bEnforceAttitudeRulesForHealing;                   // 0x130(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanHurtSelf;                                      // 0x131(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanHurtInstigator;                                // 0x132(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B5D[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bCausesDamageOverTime : 1;                         // Mask: 0x1, PropSize: 0x10x134(0x1)(Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowMultipleInstances : 1;                       // Mask: 0x2, PropSize: 0x10x134(0x1)(Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHitEachTargetOnlyOnce : 1;                        // Mask: 0x4, PropSize: 0x10x134(0x1)(Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCacheSourceLocationAndRotation : 1;               // Mask: 0x8, PropSize: 0x10x134(0x1)(Edit, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_6B : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_B6F[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxDamageDuration;                                 // 0x138(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B72[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAttributeInitializationData          DamageInterval;                                    // 0x140(0x38)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bCancelDamageOverTimeWhenOwnerDies;                // 0x178(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCancelDamageOverTimeWhenSourceOverrideIsDestroyed; // 0x179(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B7A[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UParticleSystem*                       DamageOverTimeParticleSystem;                      // 0x180(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           DamageOverTimeAudioEventStart;                     // 0x188(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           DamageOverTimeAudioEventStop;                      // 0x190(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFeedbackData*                         InstigatorFeedback;                                // 0x198(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UFeedbackData*>                 TargetFeedbacks;                                   // 0x1A0(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	class UImpactData*                           ImpactData;                                        // 0x1B0(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImpactData*                           CritImpactData;                                    // 0x1B8(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UExplosionData*                        ExplosionData;                                     // 0x1C0(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                       DefaultExplosionParticles;                         // 0x1C8(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxSignificanceEvent                 SignificanceEvent;                                 // 0x1D0(0x8)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           DefaultAudioEvent;                                 // 0x1D8(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImpactData*                           DefaultExplosionImpactData;                        // 0x1E0(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                    DefaultExplosionDecalOverride;                     // 0x1E8(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseExplosionSizeForDecal;                         // 0x1F0(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOnlyDrawParticleIfFacingDamage;                   // 0x1F1(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B94[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FScreenParticleInitParams             ScreenParticleParams;                              // 0x1F8(0x30)(Edit, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           PlayerAudioEvent;                                  // 0x228(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B97[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDamageData* GetDefaultObj();

	void OnKilledEnemy(class AActor* DamageInstigator, class AActor* DamageCauser, class AActor* DamageTarget, struct FDamageDataEventDetails& Details);
	void OnHitFriendly(class AActor* DamageInstigator, class AActor* DamageCauser, class AActor* DamageTarget, struct FDamageDataEventDetails& Details);
	void OnHitEnemy(class AActor* DamageInstigator, class AActor* DamageCauser, class AActor* DamageTarget, struct FDamageDataEventDetails& Details);
	void OnHitAnyAttitude(class AActor* DamageInstigator, class AActor* DamageCauser, class AActor* DamageTarget, struct FDamageDataEventDetails& Details);
};

// 0xB0 (0x228 - 0x178)
// Class GbxGameSystemCore.ProjectileHomingComponent
class UProjectileHomingComponent : public UActorComponent
{
public:
	bool                                         bMoveDirectlyToTarget;                             // 0x178(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_BC6[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TurnSpeed;                                         // 0x17C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bChangeTurnSpeed;                                  // 0x180(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_BC9[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FinalTurnSpeed;                                    // 0x184(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TurnAcceleration;                                  // 0x188(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TrueTargetDistance;                                // 0x18C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TrueTargetTime;                                    // 0x190(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OverrideHomingSpeed;                               // 0x194(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AccelerationScale;                                 // 0x198(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_BD2[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                HomingTarget;                                      // 0x1A0(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                       HomingTargetComponent;                             // 0x1A8(0x8)(Edit, BlueprintVisible, ExportObject, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  HomingSocketOverride;                              // 0x1B0(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               HomingTargetLocation;                              // 0x1B8(0xC)(Edit, BlueprintVisible, Net, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReachDistance;                                     // 0x1C4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReachDistanceSquared;                              // 0x1C8(0x4)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               HomingTargetLocalOffset;                           // 0x1CC(0xC)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StopHomingDistance;                                // 0x1D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_BDD[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnStopHomingDistanceReached;                       // 0x1E0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnReachedTargetLocation;                           // 0x1F0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         bHomeIn;                                           // 0x200(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_BE5[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UProjectileMovementComponent*          ProjectileMovement;                                // 0x208(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AActor*                                Projectile;                                        // 0x210(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bModifyDefault;                                    // 0x218(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_BE7[0xF];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UProjectileHomingComponent* GetDefaultObj();

	void ToggleHoming();
	void SetHomeIn(bool bEnabled);
	void SetAssociatedProjectileMovement(class UProjectileMovementComponent* ProjectileMovementComponent);
	struct FVector GetHomingLocation();
};

// 0x88 (0xB8 - 0x30)
// Class GbxGameSystemCore.UIStatData
class UUIStatData : public UGbxDataAsset
{
public:
	class FText                                  Description;                                       // 0x30(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	uint8                                        bCanDisplayMultipleTimes : 1;                      // Mask: 0x1, PropSize: 0x10x48(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bBiggerIsBetter : 1;                               // Mask: 0x2, PropSize: 0x10x48(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_7A : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_C50[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BasePriority;                                      // 0x4C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  SectionName;                                       // 0x50(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                IconFrameName;                                     // 0x58(0x10)(Edit, ZeroConstructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             Icon;                                              // 0x68(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UTexture2D>             SecondaryIcon;                                     // 0x90(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UUIStatData* GetDefaultObj();

	bool K2_ShouldDisplayStat(class UObject* Context);
	class FText K2_GetValueText(class UObject* Context, struct FUIStatCollector& Collector);
	float K2_GetComparisonValue(class UObject* Context, struct FUIStatCollector& Collector);
	void EnumerateSectionNames(TArray<class FName>* OutSectionNameList);
	float ComputeAttributeModification(class UGbxAttributeData* Attribute, bool bScale, bool bOnlyScale, struct FUIStatCollector& Collector);
};

// 0x1D0 (0x288 - 0xB8)
// Class GbxGameSystemCore.UIStatData_Numeric
class UUIStatData_Numeric : public UUIStatData
{
public:
	enum class EUIStatValueStyle                 ValueStyle;                                        // 0xB8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EUIStatValueSignStyle             SignStyle;                                         // 0xB9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EUIStatValueRoundingMode          RoundingMode;                                      // 0xBA(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C6B[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bDisplayAsPercentage : 1;                          // Mask: 0x1, PropSize: 0x10xBC(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDisplayPercentAsFloat : 1;                        // Mask: 0x2, PropSize: 0x10xBC(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDisplayAsInverse : 1;                             // Mask: 0x4, PropSize: 0x10xBC(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDisplayPlusSign : 1;                              // Mask: 0x8, PropSize: 0x10xBC(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDisplayAsOneMinus : 1;                            // Mask: 0x10, PropSize: 0x10xBC(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCalculateWithReductionMath : 1;                   // Mask: 0x20, PropSize: 0x10xBC(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseFormatText : 1;                                // Mask: 0x40, PropSize: 0x10xBC(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableValueRemapping : 1;                         // Mask: 0x80, PropSize: 0x10xBC(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseSupplementalStatFormatText : 1;                // Mask: 0x1, PropSize: 0x10xBD(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseMinValueCondition : 1;                         // Mask: 0x2, PropSize: 0x10xBD(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseMaxValueCondition : 1;                         // Mask: 0x4, PropSize: 0x10xBD(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bMinOrMaxValueCondition : 1;                       // Mask: 0x8, PropSize: 0x10xBD(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_7C : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_C7F[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAttributeInitializationData          MinValueCondition;                                 // 0xC0(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FAttributeInitializationData          MaxValueCondition;                                 // 0xF8(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class UGbxCondition*                         Condition;                                         // 0x130(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                       FloatPrecision;                                    // 0x138(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C8A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  FormatText;                                        // 0x140(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  AbbreviatedFormatText;                             // 0x158(0x18)(Edit, NativeAccessSpecifierPublic)
	struct FUIStatValueRemappingData             ValueRemapping;                                    // 0x170(0xE8)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class UUIStatData_Numeric*                   SupplementalStat;                                  // 0x258(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EUIStatCombinationMethod          SupplementalStatCombinationMethod;                 // 0x260(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C9A[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UGbxCondition*                         SupplementalStatCondition;                         // 0x268(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  SupplementalStatFormatText;                        // 0x270(0x18)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UUIStatData_Numeric* GetDefaultObj();

};

// 0x8 (0x30 - 0x28)
// Class GbxGameSystemCore.HitReactionLayer
class UHitReactionLayer : public UObject
{
public:
	bool                                         bStackable;                                        // 0x28(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_CAC[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UHitReactionLayer* GetDefaultObj();

};

// 0x28 (0x50 - 0x28)
// Class GbxGameSystemCore.AttributeContextResolver
class UAttributeContextResolver : public UObject
{
public:
	TSoftClassPtr<class UActorComponent>         ComponentTypeToFurtherResolveTo;                   // 0x28(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAttributeContextResolver* GetDefaultObj();

	TArray<class UObject*> GetContextForAttribute(class UGbxAttributeData* Attribute, class UObject* ContextSource);
};

// 0x0 (0x30 - 0x30)
// Class GbxGameSystemCore.SpawnPatternData
class USpawnPatternData : public UGbxDataAsset
{
public:

	static class UClass* StaticClass();
	static class USpawnPatternData* GetDefaultObj();

	void CalculateSpawnPoint(const struct FSpawnPatternInputs& Inputs, struct FSpawnPatternResult* Result);
};

// 0xC8 (0xF8 - 0x30)
// Class GbxGameSystemCore.PhysicsSpawnPatternData
class UPhysicsSpawnPatternData : public USpawnPatternData
{
public:
	uint8                                        bEnableSpeedRange : 1;                             // Mask: 0x1, PropSize: 0x10x30(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableAngularSpeedRange : 1;                      // Mask: 0x2, PropSize: 0x10x30(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bApplySpeedAsImpulse : 1;                          // Mask: 0x4, PropSize: 0x10x30(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bApplyAngularSpeedAsImpulse : 1;                   // Mask: 0x8, PropSize: 0x10x30(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPickRandomPointInActorBounds : 1;                 // Mask: 0x10, PropSize: 0x10x30(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bScaleSpeedByIncomingImpulse : 1;                  // Mask: 0x20, PropSize: 0x10x30(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_80 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_CFA[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Speed;                                             // 0x34(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxSpeed;                                          // 0x38(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_CFC[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRelativeDirectionData                Direction;                                         // 0x40(0x50)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	float                                        AngularSpeed;                                      // 0x90(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxAngularSpeed;                                   // 0x94(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRelativeDirectionData                RotationAxis;                                      // 0x98(0x50)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                               ActorBoundsScale;                                  // 0xE8(0xC)(Edit, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D06[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UPhysicsSpawnPatternData* GetDefaultObj();

};

// 0x18 (0x2C80 - 0x2C68)
// Class GbxGameSystemCore.GbxPlayerCameraManager
class AGbxPlayerCameraManager : public APlayerCameraManager
{
public:
	class AGbxPlayerController*                  GbxPCOwner;                                        // 0x2C68(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_D16[0x10];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AGbxPlayerCameraManager* GetDefaultObj();

};

// 0x58 (0x88 - 0x30)
// Class GbxGameSystemCore.StatusEffectData
class UStatusEffectData : public UDataAsset
{
public:
	class UStatusEffectStackingStrategyData*     StackingStrategy;                                  // 0x30(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FAttributeEffect>              AttributeEffects;                                  // 0x38(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	bool                                         bDoesDamageOverTime;                               // 0x48(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_D27[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UGbxDamageType>            DamageType;                                        // 0x50(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UDamageSource>             DamageSourceClass;                                 // 0x58(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTagContainer                 GameplayTags;                                      // 0x60(0x20)(Edit, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                        Pad_D2C[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UStatusEffectData* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class GbxGameSystemCore.CharacterAttributeContextResolver
class UCharacterAttributeContextResolver : public UAttributeContextResolver
{
public:

	static class UClass* StaticClass();
	static class UCharacterAttributeContextResolver* GetDefaultObj();

};

// 0x88 (0xB0 - 0x28)
// Class GbxGameSystemCore.AttributePropertyValueResolver
class UAttributePropertyValueResolver : public UAttributeValueResolver
{
public:
	bool                                         PropertySupportsModifierRemoval;                   // 0x28(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_D44[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FParsedProperty                       Property;                                          // 0x30(0x80)(Edit, DisableEditOnInstance, NoDestructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAttributePropertyValueResolver* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class GbxGameSystemCore.AchievementUtility
class UAchievementUtility : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAchievementUtility* GetDefaultObj();

};

// 0xD0 (0x130 - 0x60)
// Class GbxGameSystemCore.GbxAction_CoordinatedEffect
class UGbxAction_CoordinatedEffect : public UGbxAction
{
public:
	uint8                                        bInfiniteDuration : 1;                             // Mask: 0x1, PropSize: 0x10x60(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bLoop : 1;                                         // Mask: 0x2, PropSize: 0x10x60(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCensored : 1;                                     // Mask: 0x4, PropSize: 0x10x60(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDestroyActorOnEnd : 1;                            // Mask: 0x8, PropSize: 0x10x60(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUnhideActorOnBegin : 1;                           // Mask: 0x10, PropSize: 0x10x60(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHideActorOnEnd : 1;                               // Mask: 0x20, PropSize: 0x10x60(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_88 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_D75[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Duration;                                          // 0x64(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UGbxAction_CoordinatedEffect> NextEffect;                                        // 0x68(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  PermanentGroupTag;                                 // 0x70(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                    OverrideMaterial;                                  // 0x78(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                    MaskMaterial;                                      // 0x80(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UMaterialInterface*                    GlowMaterial;                                      // 0x88(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FCoordinatedConditionalMaterialData> ConditionalOverrideMaterials;                      // 0x90(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCoordinatedScalarParameter>   MaterialScalarParameters;                          // 0xA0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCoordinatedVectorParameter>   MaterialVectorParameters;                          // 0xB0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                          InheritedMaterialParameters;                       // 0xC0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	enum class EMaterialParameterCopyMethod      InheritMaterialParametersMethod;                   // 0xD0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bInheritAllMaterialParameters : 1;                 // Mask: 0x1, PropSize: 0x10xD1(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverwriteInstancedMaterialParameters : 1;         // Mask: 0x2, PropSize: 0x10xD1(0x1)(Deprecated, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bApplyToTranslucentMaterials : 1;                  // Mask: 0x4, PropSize: 0x10xD1(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bPermanentMaterialOverride : 1;                    // Mask: 0x8, PropSize: 0x10xD1(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAlwaysRestoreMaterialParametersAtEnd : 1;         // Mask: 0x10, PropSize: 0x10xD1(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bApplyMaterialParametersToBothOverrideAndMaskGlow : 1; // Mask: 0x20, PropSize: 0x10xD1(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_89 : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_D8D[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          ExcludedMaterialStaticParameters;                  // 0xD8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCoordinatedParticleSystemData> ParticleEffects;                                   // 0xE8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCoordinatedParticleSystemParameterData> ParticleParameters;                                // 0xF8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	float                                        ParticleSpeedMultiplier;                           // 0x108(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ECoordinatedOwnedParticleAction   OwnedParticleAction;                               // 0x10C(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAlwaysRestoreParticleParametersAtEnd : 1;         // Mask: 0x1, PropSize: 0x10x10D(0x1)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_8A : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	bool                                         bHideOwnedParticles;                               // 0x10E(0x1)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_D98[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCoordinatedAudioData>         AudioEffects;                                      // 0x110(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCoordinatedLightParameterData> LightParameters;                                   // 0x120(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UGbxAction_CoordinatedEffect* GetDefaultObj();

	void SetConstantMaterialVectorParamValue(class FName ParamName, struct FLinearColor& Color);
};

// 0x198 (0x1F8 - 0x60)
// Class GbxGameSystemCore.GbxAction_Gib
class UGbxAction_Gib : public UGbxAction
{
public:
	int32                                        MaxGibCount;                                       // 0x60(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E07[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FGibData>                      Gibs;                                              // 0x68(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                        GibMinScale;                                       // 0x78(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        GibMaxScale;                                       // 0x7C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USpawnPatternData*                     GibSpawnPattern;                                   // 0x80(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        GibMassScale;                                      // 0x88(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E17[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AActor>                    GibActorClass;                                     // 0x90(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E1C[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FImpactResponseEffect                 GibEffect;                                         // 0xA0(0x140)(Edit, Protected, NativeAccessSpecifierProtected)
	float                                        GibEffectScale;                                    // 0x1E0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_E1E[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UParticleSystem*                       GibParticle;                                       // 0x1E8(0x8)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWwiseEvent*                           GibSound;                                          // 0x1F0(0x8)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UGbxAction_Gib* GetDefaultObj();

};

// 0x300 (0x3B8 - 0xB8)
// Class GbxGameSystemCore.GbxAction_Loop
class UGbxAction_Loop : public UGbxAction_SimpleAnim
{
public:
	struct FAnimMeshList                         AnimStart;                                         // 0xB8(0x78)(Edit, NativeAccessSpecifierPrivate)
	TArray<struct FWeightedAnim>                 AnimLoopList;                                      // 0x130(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FAnimMeshList                         AnimStop;                                          // 0x140(0x78)(Edit, NativeAccessSpecifierPrivate)
	float                                        BlendInTime;                                       // 0x1B8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        BlendOutTime;                                      // 0x1BC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        StartToLoopBlendTime;                              // 0x1C0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        LoopToLoopBlendTime;                               // 0x1C4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        LoopToStopBlendTime;                               // 0x1C8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_E4C[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  AnimSlot;                                          // 0x1D0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bLetLoopFinish;                                    // 0x1D8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bEnableClientSynchronization;                      // 0x1D9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_E53[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGbxParam                             LoopCount;                                         // 0x1E0(0x80)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	bool                                         bUseLoopCount;                                     // 0x260(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_E56[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGbxParam                             LoopTime;                                          // 0x268(0x80)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	bool                                         bUseLoopTime;                                      // 0x2E8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_E58[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UGbxCondition*                         LoopCondition;                                     // 0x2F0(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bUseLoopCondition;                                 // 0x2F8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_E5D[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLoopAnimData                         AnimData3rd;                                       // 0x300(0x18)(Deprecated, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                         bPlay3rd;                                          // 0x318(0x1)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_E5F[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLoopAnimData                         AnimData1st;                                       // 0x320(0x18)(Deprecated, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                         bPlay1st;                                          // 0x338(0x1)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_E65[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimMeshList                         AnimLoop;                                          // 0x340(0x78)(Deprecated, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UGbxAction_Loop* GetDefaultObj();

	void OnStop(class AActor* Actor);
	void OnLoop(class AActor* Actor);
	void K2_StopLooping();
};

// 0x28 (0x1D0 - 0x1A8)
// Class GbxGameSystemCore.GbxAction_PhysicalAnim
class UGbxAction_PhysicalAnim : public UGbxAction_Anim
{
public:
	enum class EPhysicalAnimationRootMotionControl RootMotionControl;                                 // 0x1A8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EGbxPhysicalActionMovementLockMode MovementLockMode;                                  // 0x1A9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EGbxPhysicalActionDynamicBoneActivationMode DynamicBoneActivationMode;                         // 0x1AA(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E83[0x1];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBoneFatigueParams                    FatigueParams;                                     // 0x1AC(0x14)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	enum class EGbxPhysicalActionBeginCondition  BeginCondition;                                    // 0x1C0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        PhysicalBeginConditionFlags;                       // 0x1C1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        PhysicalEndConditionFlags;                         // 0x1C2(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EGbxPhysicalActionEndCondition    PhysicalEndCondition;                              // 0x1C3(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CustomForceMultiplier;                             // 0x1C4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        UpwardForceMultiplier;                             // 0x1C8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bForceAppliedAtLocation;                           // 0x1CC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHasValidHitForce;                                 // 0x1CD(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E86[0x2];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGbxAction_PhysicalAnim* GetDefaultObj();

	enum class EGbxPhysicalActionDynamicBodyState K2_GetDynamicBodyState(float AngularThreshold);
	void K2_FixupDynamicToKinematicIssues(float AngularThreshold);
};

// 0x30 (0x200 - 0x1D0)
// Class GbxGameSystemCore.GbxAction_PhysicalDeath
class UGbxAction_PhysicalDeath : public UGbxAction_PhysicalAnim
{
public:
	float                                        PhysicalAnimationDelayTime;                        // 0x1D0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCapPhysicalAnimationDelayToAnimationDuration;     // 0x1D4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E9F[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          PrematurePhysicalAnimationIgnoreBodyNames;         // 0x1D8(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bAllowPrematurePhysicalAnimation;                  // 0x1E8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bTearOffOnDeath;                                   // 0x1E9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_EA7[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxRagdollTime;                                    // 0x1EC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxSignificanceEvent                 SignificanceEvent;                                 // 0x1F0(0x8)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                        MinRagdollSignificance;                            // 0x1F8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_EAA[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGbxAction_PhysicalDeath* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class GbxGameSystemCore.AimAssistParameters
class UAimAssistParameters : public UGbxDataAsset
{
public:

	static class UClass* StaticClass();
	static class UAimAssistParameters* GetDefaultObj();

};

// 0x1B0 (0x9E0 - 0x830)
// Class GbxGameSystemCore.GbxPlayerController
class AGbxPlayerController : public APlayerController
{
public:
	uint8                                        Pad_1113[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class AGbxCharacter*                         GbxCharacter;                                      // 0x840(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AGbxCharacter*                         PrimaryCharacter;                                  // 0x848(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class URecentDamageTrackingComponent*        RecentDamageTrackingComponent;                     // 0x850(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGbxProfile*                           CurrentProfile;                                    // 0x858(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSoftClassPath                        GbxPlayerInputClass;                               // 0x860(0x18)(Config, GlobalConfig, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSoftClassPath                        GbxInputComponentClass;                            // 0x878(0x18)(Config, GlobalConfig, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                          DefaultSchemas;                                    // 0x890(0x10)(ZeroConstructor, Config, GlobalConfig, Protected, NativeAccessSpecifierProtected)
	class FName                                  DefaultContextName;                                // 0x8A0(0x8)(ZeroConstructor, Config, GlobalConfig, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class UAimAssistStrategy>        AimAssistStrategyClass;                            // 0x8A8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FSoftClassPath                        CheatClassGbx;                                     // 0x8B0(0x18)(Edit, DisableEditOnInstance, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1124[0x30];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnPrimaryCharacterChanged;                         // 0x8F8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnPauseChanged;                                    // 0x908(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1125[0x28];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EGbxGlyphSetOption                CachedGlyphMode;                                   // 0x940(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1128[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTargetingComponent*                   TargetingComponent;                                // 0x948(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTargetableComponent*                  TargetableComponent;                               // 0x950(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTeamComponent*                        TeamComponent;                                     // 0x958(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGbxPerceptionComponent*               PerceptionComponent;                               // 0x960(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UFirstPersonComponent*                 FirstPersonComponent;                              // 0x968(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAimAssistStrategy*                    AimAssistStrategy;                                 // 0x970(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWwiseListenerComponent*               WwiseListener;                                     // 0x978(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FActiveTrackedFeedback>        ActiveTrackedFeedbacks;                            // 0x980(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	bool                                         bUsingGamepad;                                     // 0x990(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1133[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UCinematicModeData*>            CinematicModeStack;                                // 0x998(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UCinematicModeData*                    CinematicMode;                                     // 0x9A8(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UScreenParticleManagerComponent*       ScreenParticleManagerComponent;                    // 0x9B0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_114A[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AGbxPlayerController* GetDefaultObj();

	void SetTeam(class UTeam* Team);
	void ServerRequestPawnSlotDetach(class APawn* Occupant);
	void ServerCanSplitscreenJoin(int32 ControllerId);
	void PushCinematicMode(class UCinematicModeData* InCinematicMode);
	void PopCinematicMode(class UCinematicModeData* InCinematicMode);
	void OnRep_PrimaryCharacter();
	void OnRep_CinematicMode();
	void OnPrimaryCharacterChanged__DelegateSignature(class AGbxCharacter* NewCharacter);
	void OnPausedChangedDelegate__DelegateSignature(bool bPaused);
	bool IsUsingGamepad();
	class UTeamComponent* GetTeamComponent();
	class UTeam* GetTeam();
	class UTargetingComponent* GetTargetingComponent();
	class UTargetableComponent* GetTargetableComponent();
	class AGbxCharacter* GetPrimaryCharacter();
	void GetPlayerViewportSize(int32* SizeX, int32* SizeY);
	void GetPlayerViewportOffset(int32* OffsetX, int32* OffsetY);
	class UGbxProfile* GetPlayerProfile();
	class UGbxPerceptionComponent* GetGbxPerceptionComponent();
	int32 GetCurrencyAmount(class UGbxInventoryCategoryData* CurrencyType);
	bool DeprojectViewportPositionToWorld(float ViewportX, float ViewportY, struct FVector* WorldLocation, struct FVector* WorldDirection, bool bUseForegroundProjection);
	void DebugCategory(class FName CategoryName);
	void ClientStopFeedback(class UFeedbackData* Data);
	void ClientPlayWwiseEvent(class UWwiseEvent* Event);
	void ClientPlayFeedback(class UFeedbackData* Data, float Scale, bool bLoop, class UObject* SourceContext);
	void ClientPerformFeedbackAtLocation(class UFeedbackData* FeedbackData, const struct FVector& SourceLocation, bool bLoop, class UObject* SourceContext, const struct FRangedDistanceOverrides& RangedOverrides);
	void ClientPerformFeedback(class UFeedbackData* FeedbackData, class UObject* SourceContext);
	void ClientNotifyActivateCheckpoint();
	void ClientCanSplitscreenJoin(int32 ControllerId, bool bCanJoin);
	void ClientApplyDamageDataPresentation(class UDamageData* DamageData, struct FPlayerDamageDataPresentation& PlayerPresentation);
	void Client_StopGbxFeedback(class UGbxFeedbackData* Data, class UObject* SourceContext);
	void Client_PlayGbxFeedback(class UGbxFeedbackData* Data, bool bIs3D, bool bLoop, float Scale, class UObject* SourceContext, const struct FVector& SourceLocation, float EffectFalloffMinDistance, float EffectFalloffMaxDistance);
	void ClearCinematicMode();
	void ClearAndSetCinematicMode(class UCinematicModeData* InCinematicMode);
	void AddCurrencyAmount(int32 Amount, class UGbxInventoryCategoryData* CurrencyType);
};

// 0x0 (0x28 - 0x28)
// Class GbxGameSystemCore.AimAssistStrategy
class UAimAssistStrategy : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAimAssistStrategy* GetDefaultObj();

};

// 0x40 (0x4F0 - 0x4B0)
// Class GbxGameSystemCore.GbxGameAssetManager
class UGbxGameAssetManager : public UGbxBaseAssetManager
{
public:
	TArray<struct FStartupAssetTypeData>         StartupAssetTypes;                                 // 0x4B0(0x10)(ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	TArray<class FName>                          StartupAssetFiles;                                 // 0x4C0(0x10)(ZeroConstructor, Config, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_119D[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGbxGameAssetManager* GetDefaultObj();

};

// 0x230 (0x260 - 0x30)
// Class GbxGameSystemCore.AssetMappingData
class UAssetMappingData : public UGbxDataAsset
{
public:
	TMap<uint32, class FString>                  ChallengesMap;                                     // 0x30(0x50)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TMap<uint32, class FString>                  GameStatDataMap;                                   // 0x80(0x50)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TMap<uint32, class FString>                  CustomizationDataMap;                              // 0xD0(0x50)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TMap<uint32, class FString>                  MissionsMap;                                       // 0x120(0x50)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TMap<uint32, class FString>                  ObjectiveSetsMap;                                  // 0x170(0x50)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TMap<uint32, class FString>                  InventoryCategoryMap;                              // 0x1C0(0x50)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	TMap<uint32, class FString>                  UINamesMap;                                        // 0x210(0x50)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAssetMappingData* GetDefaultObj();

};

// 0xF0 (0x118 - 0x28)
// Class GbxGameSystemCore.challenge
class UChallenge : public UObject
{
public:
	class UChallengesComponent*                  RegisteredOwner;                                   // 0x28(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class UChallenge>>        ParentChallenges;                                  // 0x30(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, UObjectWrapper, NativeAccessSpecifierPublic)
	class FText                                  ChallengeName;                                     // 0x40(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x58(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  CompletedDescription;                              // 0x70(0x18)(Edit, NativeAccessSpecifierPublic)
	bool                                         bShared;                                           // 0x88(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRepeatable;                                       // 0x89(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bReplicated;                                       // 0x8A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideInUI;                                         // 0x8B(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowActivationUI;                                 // 0x8C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowProgressUI;                                   // 0x8D(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowCompletionUI;                                 // 0x8E(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowAsUndiscoveredUntilProgressed;                // 0x8F(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  AssociatedMapName;                                 // 0x90(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EChallengeType                    ChallengeType;                                     // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1299[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FStatChallengeTest>            StatChallengeTests;                                // 0xA0(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bCompleteIfGoalValueReached;                       // 0xB0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bResetProgressWhenGoalValueReached;                // 0xB1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_129E[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FChallengeGoalValue>           ProgressGoalInfo;                                  // 0xB8(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<int32>                                ProgressGoalValues;                                // 0xC8(0x10)(ZeroConstructor, Deprecated, NativeAccessSpecifierPublic)
	class UChallengeCategoryData*                ChallengeCategoryData;                             // 0xD8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ProgressDuration;                                  // 0xE0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInitiallyActive;                                  // 0xE4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideFromCounts;                                   // 0xE5(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowSubChallengesAsCounts;                        // 0xE6(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12A5[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UChallenge>                PrerequisiteChallenge;                             // 0xE8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AssociatedCompletionAchievementId;                 // 0xF0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AssociatedProgressAchievementId;                   // 0xF4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bProfileChallenge;                                 // 0xF8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12A9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSubclassOf<class UChallenge>>        SubChallenges;                                     // 0x100(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                         CompletedBySubChallenges;                          // 0x110(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ActivateIfSubChallengesComplete;                   // 0x111(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIncrementProgressViaSubChallenges;                // 0x112(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12AA[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChallenge* GetDefaultObj();

	bool TestForCompleted(class AGbxPlayerController* PlayerToTest, class UObject* OtherObject, TArray<class FString>& EnumTag);
	void SetChallengeProgress(int32 NewProgress);
	void PlayerExitChallengeArea(class UChallengeLevelActorComponent* LevelActorComponent);
	void PlayerEnterChallengeArea(class UChallengeLevelActorComponent* LevelActorComponent);
	void OnLevelActorRegistered(class UChallengeLevelActorComponent* RegisteredLevelActor);
	void OnInitChallengeInstance(class UChallengesComponent* OwningChallenges, class AGbxCharacter* AssociatedCharacter);
	void OnChallengeActivated();
	bool IsChallengeComplete();
	bool IsChallengeActive();
	void IncrementChallengeProgressByValue(int32 Value);
	void IncrementChallengeProgress();
	void GetLevelActorComponents(TArray<class UChallengeLevelActorComponent*>* LevelActorList);
	int32 GetChallengeProgressGoalValue();
	int32 GetChallengeProgress();
	void GetChallengeCompleteInfo(int32* NumCompleted, int32* NumChallenges, bool bCheckReplicatedChallenges);
	bool CompletedConditional();
	void CompletedChallenge(class AGbxPlayerController* CompletedPlayer);
	void CompleteChallenge();
	void ActivateChallenge();
};

// 0x20 (0x50 - 0x30)
// Class GbxGameSystemCore.ChallengeCategoryData
class UChallengeCategoryData : public UGbxDataAsset
{
public:
	class FText                                  CategoryName;                                      // 0x30(0x18)(Edit, NativeAccessSpecifierPublic)
	float                                        ProgressWeight;                                    // 0x48(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12C1[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChallengeCategoryData* GetDefaultObj();

};

// 0x18 (0x48 - 0x30)
// Class GbxGameSystemCore.ChallengeList
class UChallengeList : public UGbxDataAsset
{
public:
	class UDownloadableContentData*              AssociatedDLC;                                     // 0x30(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSoftClassPtr<class UChallenge>>      Challenges;                                        // 0x38(0x10)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UChallengeList* GetDefaultObj();

};

// 0x1A8 (0x600 - 0x458)
// Class GbxGameSystemCore.ChallengeManager
class AChallengeManager : public AActor
{
public:
	uint8                                        Pad_12EF[0xA0];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FReplicatedChallengeDataArray         ReplicatedChallenges;                              // 0x4F8(0xC8)(Net, Transient, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                        Pad_12F1[0x40];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AChallengeManager* GetDefaultObj();

	void OnStatUpdate(class AActor* StatContext, class UGameStatData* StatId, int32 Amount);
	void OnStatIncrement(class AActor* StatContext, class UGameStatData* StatId, int32 Amount);
	void OnRep_ReplicatedChallenges();
};

// 0x0 (0x28 - 0x28)
// Class GbxGameSystemCore.CustomChallengePersistentState
class UCustomChallengePersistentState : public UObject
{
public:

	static class UClass* StaticClass();
	static class UCustomChallengePersistentState* GetDefaultObj();

};

// 0x90 (0x208 - 0x178)
// Class GbxGameSystemCore.ChallengesComponent
class UChallengesComponent : public UActorComponent
{
public:
	UMulticastDelegateProperty_                  OnChallengeRegistrationComplete;                   // 0x178(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnChallengeActivated;                              // 0x188(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnChallengeUpdated;                                // 0x198(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnChallengeCompleted;                              // 0x1A8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnChallengeChildCompleted;                         // 0x1B8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FChallengeInstanceData>        LocalChallengeDataCache;                           // 0x1C8(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                ChallengeRewardsEarned;                            // 0x1D8(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<int32>                                ChallengeRewardsToOfferNext;                       // 0x1E8(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class UGameStatsComponent*                   GameStatsComponent;                                // 0x1F8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1465[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UChallengesComponent* GetDefaultObj();

	void UnregisterInActivePlayerChallenges();
	void SetChallengeProgress(class UClass* ChalClass, int32 NewProgress);
	void SetChallengeActive(class UClass* ChalClass, bool bInIsActive);
	bool IsChallengeComplete(class UClass* ChalClass, bool bCheckReplicatedChallenges);
	bool IsChallengeActive(class UClass* ChalClass);
	void IncrementChallengeProgress(class UClass* ChalClass);
	int32 GetMaxChallengeTiers(class UClass* ChalClass);
	TArray<struct FChallengeInstanceData> GetLocalChallenges();
	int32 GetCompletedChallengeTiers(class UClass* ChalClass);
	int32 GetChallengeStatValue(class UClass* ChalClass, class UGameStatData* StatId);
	int32 GetChallengeStatGoalValue(class UClass* ChalClass, class UGameStatData* StatId);
	int32 GetChallengeProgressGoalValue(class UClass* ChalClass);
	int32 GetChallengeProgress(class UClass* ChalClass);
	void GetChallengeCompleteInfoForLevels(const TArray<class FName>& LevelsForChallenges, class UChallengeCategoryData* Category, int32* NumCompleted, int32* NumActive, bool bIgnoreHidden);
	void GetChallengeCompleteInfo(class UClass* ChalClass, int32* NumCompleted, int32* NumChallenges, bool bCheckReplicatedChallenges);
	void CompleteChallengeIfConditionsMet(class UClass* ChalClass);
	void CompleteChallenge(class UClass* ChalClass, bool bForceActive, bool bIgnoreRewards);
	void ClientChallengeUpdateProgress(class UClass* ChalClass, int32 NewProgress);
	void ClientChallengeCompleted(class UClass* ChalClass, int32 NumTiersComplete, bool bForceActive, bool bIgnoreRewards);
	void ClientActivateChallenge(class UClass* ChalClass);
	bool AreGlobalChallengesRegistered();
	void ActivateChallenge(class UClass* ChalClass);
};

// 0x1EA0 (0x2730 - 0x890)
// Class GbxGameSystemCore.GbxCharacterMovementComponent
class UGbxCharacterMovementComponent : public UCharacterMovementComponent
{
public:
	uint8                                        Pad_186C[0x7E0];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	class AGbxCharacter*                         GbxCharacterOwner;                                 // 0x1070(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGbxCharacterAnimInstance*             GbxAnimInstance;                                   // 0x1078(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimInstance*                         AnimInstance;                                      // 0x1080(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FallingFloorUpdateInterval;                        // 0x1088(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FallingFloorTraceDistance;                         // 0x108C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_187E[0x98];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCharacterMoveToState                 CurrentMoveToState;                                // 0x1128(0x30)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	struct FCharacterRotateToState               CurrentRotateToState;                              // 0x1158(0x68)(Transient, NativeAccessSpecifierPrivate)
	uint8                                        bCanCrouchInAir : 1;                               // Mask: 0x1, PropSize: 0x10x11C0(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanClimbLadders : 1;                              // Mask: 0x2, PropSize: 0x10x11C0(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCenterOnLadder : 1;                               // Mask: 0x4, PropSize: 0x10x11C0(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSlideAlongLadderCollision : 1;                    // Mask: 0x8, PropSize: 0x10x11C0(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bBlockMomentumAdd : 1;                             // Mask: 0x10, PropSize: 0x10x11C0(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_A8 : 3;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1896[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGbxAttributeFloat                    MaxGroundSpeedScale;                               // 0x11C4(0xC)(Edit, BlueprintVisible, Net, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LadderFriction;                                    // 0x11D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                    MaxLadderAscendSpeed;                              // 0x11D4(0xC)(Edit, BlueprintVisible, Net, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                    MaxLadderDescendSpeed;                             // 0x11E0(0xC)(Edit, BlueprintVisible, Net, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxLadderForwardSpeed;                             // 0x11EC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxLadderReverseSpeed;                             // 0x11F0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LadderBrakingDeceleration;                         // 0x11F4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LadderInterpSpeed;                                 // 0x11F8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LadderJumpVelocity;                                // 0x11FC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGbxAction>                EnterBottomAnimation;                              // 0x1200(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGbxAction>                ExitBottomAnimation;                               // 0x1208(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGbxAction>                EnterTopAnimation;                                 // 0x1210(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGbxAction>                ExitTopAnimation;                                  // 0x1218(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ULadderInteractData*                   LadderInteractData;                                // 0x1220(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnEnterLadder;                                     // 0x1228(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnExitLadderTop;                                   // 0x1238(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnExitLadderBottom;                                // 0x1248(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnJumpFromLadder;                                  // 0x1258(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnMantleStarted;                                   // 0x1268(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnMantleFinished;                                  // 0x1278(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UStanceComponent*                      StanceComponent;                                   // 0x1288(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGbxActionComponent*                   ActionComponent;                                   // 0x1290(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCharacterScriptedMeshOffsetState     ScriptedMeshOffsetState;                           // 0x1298(0x140)(Transient, Protected, NativeAccessSpecifierProtected)
	bool                                         bClientWasOnLadder;                                // 0x13D8(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_18CF[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TScriptInterface<class ILadderInterface>> OverlappingLadderVolumes;                          // 0x13E0(0x10)(ZeroConstructor, Transient, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TScriptInterface<class ILadderInterface>     CurrentLadderVolume;                               // 0x13F0(0x10)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TScriptInterface<class ILadderInterface>     JumpLadderVolume;                                  // 0x1400(0x10)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	float                                        LadderJumpTime;                                    // 0x1410(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bAlreadyCenteredOnLadder : 1;                      // Mask: 0x1, PropSize: 0x10x1414(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bWantsToBeOnLadder : 1;                            // Mask: 0x2, PropSize: 0x10x1414(0x1)(Transient, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_A9 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_18E6[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLadderAnimState                      LadderAnimState;                                   // 0x1418(0x28)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FReplicatedLadderState                ReplicatedLadderState;                             // 0x1440(0x2)(Net, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_18EE[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGbxAttributeFloat                    RotationRateYaw;                                   // 0x1444(0xC)(Net, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                    IdleRotationRateYaw;                               // 0x1450(0xC)(Edit, Net, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseIdleRotationRateYaw;                           // 0x145C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_18F4[0x97];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGbxAttributeFloat                    MaxAllowedAimOffset;                               // 0x14F4(0xC)(Edit, Net, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinTurnAimOffset;                                  // 0x1500(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinBodyFacingThreshold;                            // 0x1504(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxPredictedTurnDegrees;                           // 0x1508(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseMaxPredictedTurnDegrees;                       // 0x150C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1900[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxPredictedTurnTime;                              // 0x1510(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseMaxPredictedTurnTime;                          // 0x1514(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAlwaysFaceActorsCurrentLocation;                  // 0x1515(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_190E[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGbxAttributeFloat                    AimRotationRate;                                   // 0x1518(0xC)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LookAtAngleClamp;                                  // 0x1524(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LookRotationRate;                                  // 0x1528(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FastLookRotationRate;                              // 0x152C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseFastLookRotationRate;                          // 0x1530(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1926[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FNumericRange                         FastLookRotationSpeed;                             // 0x1534(0x8)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                        HeadLookPercent;                                   // 0x153C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNumericRange                         HeadLookPercentDistance;                           // 0x1540(0x8)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bUseHeadLookPercentDistance;                       // 0x1548(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_193B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HeadLookPercentInterpSpeed;                        // 0x154C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseLookAtParentBoneForAngleClamp;                 // 0x1550(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_193E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LookAtBlinkAngle;                                  // 0x1554(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseLookAtBlinkAngle;                              // 0x1558(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1943[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               LookAtHeadTargetOffset;                            // 0x155C(0xC)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseLookAtHeadTargetOffset;                        // 0x1568(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1947[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               LookAtEyeTargetOffset;                             // 0x156C(0xC)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseLookAtEyeTargetOffset;                         // 0x1578(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseLookAtTargetClearDelay;                        // 0x1579(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1955[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LookAtRate;                                        // 0x157C(0x4)(ZeroConstructor, Deprecated, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FootIkEnabledInterpolationSpeed;                   // 0x1580(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SlopeAdaptationOverrideInterpSpeed;                // 0x1584(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1961[0x280];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	struct FControlledMoveState                  ControlledMoveState;                               // 0x1808(0x160)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FControlledMoveReplicationData        ControlledMoveReplicationData;                     // 0x1968(0x48)(Net, Transient, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_196E[0x30];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnStopControlledMoveDelegate;                      // 0x19E0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, Protected, NativeAccessSpecifierProtected)
	class UMantleData*                           MantleData;                                        // 0x19F0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FMantleState                          MantleState;                                       // 0x19F8(0x6E8)(Transient, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	struct FReplicatedMantleState                ReplicatedMantleState;                             // 0x20E0(0x8)(Net, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_197F[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGbxCharacterNavWalking               GbxNavWalking;                                     // 0x20F0(0xB0)(Transient, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class UNavComponent*                         NavComponent;                                      // 0x21A0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        NavMeshProjectionDistance;                         // 0x21A8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        AirFriction;                                       // 0x21AC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        NavMeshProjectionTraceDistance;                    // 0x21B0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1996[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FNavAnimState                         NavAnimState;                                      // 0x21B8(0x50)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	struct FNavAnimServerData                    NavServerData;                                     // 0x2208(0xA0)(Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FNavAnimClientData                    NavClientData;                                     // 0x22A8(0x1C)(Net, Transient, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bPretendToBeWalking;                               // 0x22C4(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_19A5[0x143];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotationDeltaMatchingInfo            RotationDeltaMatchingInfo;                         // 0x2408(0xC0)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_19C1[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGbxInterpData                        InterpData;                                        // 0x24D0(0x140)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FIdleVelocityData                     IdleVelocity;                                      // 0x2610(0x18)(Transient, NoDestructor, NativeAccessSpecifierPublic)
	struct FRootMotionStateData                  RootMotionState;                                   // 0x2628(0x58)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        Pad_19C8[0xB0];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGbxCharacterMovementComponent* GetDefaultObj();

	void StopRotateTo();
	void StopMoveTo(bool bForce, bool bReplicateStop);
	void StopControlledMove(TSubclassOf<class UControlledMove> ControlledMove, bool bZeroVelocity, bool bInterrupted);
	void StartRotateTo(struct FCharacterRotateToCommand& RotateToCommand);
	void StartMoveTo(struct FCharacterMoveToCommand& MoveToCommand);
	bool StartControlledMove(TSubclassOf<class UControlledMove> ControlledMove, class AActor* Instigator, float SpeedOverride, float DurationOverride, float LaunchAngleOverride, class AActor* TargetActor, const struct FVector& TargetLocation);
	void SetNoneWithRootMotionMode(bool bAnimationWalking, class FName Reason);
	void SetFacingTarget(struct FFacingInfo& FacingTarget, enum class EFacingChannel Channel);
	void SetAnimationBasedTurning(bool bEnable);
	void ServerStopMoveTo();
	void ServerStartMoveTo(struct FCharacterMoveToCommand& MoveToCommand);
	void ServerAttemptMantle(struct FMantleAttemptInfo& ClientData, float Timestamp);
	void OnStanceChanged(const struct FStanceChangedEventArgs& Args);
	void OnRep_ControlledMove();
	void OnNotifyTurnExit();
	void OnNotifyTurnEnter();
	void OnCharacterMeshAnimInstanceChanged();
	void OnCapsuleEndOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnCapsuleBeginOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	struct FFacingInfo MakeFacingInfoRotation(const struct FRotator& Rotation);
	struct FFacingInfo MakeFacingInfoNone();
	struct FFacingInfo MakeFacingInfoLocation(const struct FVector& Location);
	struct FFacingInfo MakeFacingInfoDirection(const struct FVector& Direction);
	struct FFacingInfo MakeFacingInfoComponent(class USceneComponent* Component);
	struct FFacingInfo MakeFacingInfoActorEyes(class AActor* Actor);
	struct FFacingInfo MakeFacingInfoActor(class AActor* Actor);
	void LeaveNoneWithRootMotionMode(bool bApplyDefault);
	bool IsPerformingSpecificControlledMove(TSubclassOf<class UControlledMove> ControlledMove);
	bool IsPerformingControlledMove();
	bool IsMovingOnLadder();
	bool IsMantlingAllowed();
	bool IsMantling();
	bool IsInNoneWithRootMotionMode();
	bool IsHandIkEnabled();
	bool IsFootIkTracingEnabled();
	bool IsFootIkEnabled();
	bool IsFacingTargetBP(float ThresholdDegrees, enum class EFacingChannel Channel);
	float GetMaxAllowedAimOffset();
	class UMantleData* GetMantleData();
	struct FRotator GetDesiredFacingRotation(enum class EFacingChannel Channel);
	struct FVector GetDesiredFacingLocation(enum class EFacingChannel Channel);
	struct FRotator GetCurrentFacingRotation(enum class EFacingChannel Channel);
	struct FVector GetCurrentFacingOrigin(enum class EFacingChannel Channel);
	struct FVector GetCurrentFacingLocation(enum class EFacingChannel Channel);
	class UControlledMove* GetControlledMove();
	void GbxSetAnimInstanceClass(class USkeletalMeshComponent* SkelMeshComponent, class UClass* NewClass);
	void GbxCharacterMovementEvent__DelegateSignature();
	void ControlledServerMoveOld(float OldTimeStamp, const struct FVector_NetQuantize10& OldAccel, uint8 OldMoveFlags, uint32 CMDir);
	void ControlledServerMoveDual(float TimeStamp0, const struct FVector_NetQuantize10& InAccel0, uint8 PendingFlags, uint32 View0, uint32 CMDir0, float Timestamp, const struct FVector_NetQuantize10& InAccel, const struct FVector_NetQuantize100& ClientLoc, uint8 NewFlags, uint8 ClientRoll, uint32 View, class UPrimitiveComponent* ClientMovementBase, class FName ClientBaseBoneName, uint8 ClientMovementMode, uint32 CMDir, uint16 ClientBodyYaw);
	void ControlledServerMove(float Timestamp, const struct FVector_NetQuantize10& InAccel, const struct FVector_NetQuantize100& ClientLoc, uint8 CompressedMoveFlags, uint8 ClientRoll, uint32 View, class UPrimitiveComponent* ClientMovementBase, class FName ClientBaseBoneName, uint8 ClientMovementMode, uint32 CMDir, uint16 ClientBodyYaw);
	void ClientAdjustControlledMovePosition(float Timestamp, const struct FControlledMoveNetCorrection& ServerCMData, const struct FVector& NewLoc, const struct FVector& NewVel, class UPrimitiveComponent* NewBase, class FName NewBaseBoneName, bool bHasBase, bool bBaseRelativePosition, uint8 ServerMovementMode);
	bool CanStartPassiveMantle();
	bool CanStartMantle();
	void AddPendingRawInputVector(const struct FVector& NewInputVector);
};

// 0x10 (0x88 - 0x78)
// Class GbxGameSystemCore.GbxCheatManager
class UGbxCheatManager : public UCheatManager
{
public:
	uint8                                        BitPad_AD : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bHLQNoClipActive : 1;                              // Mask: 0x4, PropSize: 0x10x78(0x1)(Net, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1B4B[0xF];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGbxCheatManager* GetDefaultObj();

	void TestGameStage(int32 GameStageOverride);
	void StartPlayerInit();
	void ShowProjectileImpacts(float Size, float LifeTime);
	void SetDebugActorByName(const class FString& ActorName);
	void SetDebugActor(class AActor* Actor, int32 ControllerIndex);
	void Server_TogglePlayersOnly();
	void Server_DamageTarget(float DamageAmount);
	void PlayFeedbackRangedFromThere(const class FString& FeedbackData);
	void PlayFeedbackDirectional(const class FString& FeedbackData, float DirectionAngle);
	void PlayFeedback(const class FString& FeedbackData, float Scale);
	void LogQatalystInfo();
	void DebugNextAI();
	void DamageAreaDebug();
	void ClearPlayerInit();
};

// 0x10 (0x40 - 0x30)
// Class GbxGameSystemCore.CinematicModeData
class UCinematicModeData : public UGbxDataAsset
{
public:
	bool                                         bCinematicMode;                                    // 0x30(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHidePlayer;                                       // 0x31(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHidePlayerOwnedVehicles;                          // 0x32(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideNPC;                                          // 0x33(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAffectsHUD;                                       // 0x34(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAffectsMovement;                                  // 0x35(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAffectsPawnRotation;                              // 0x36(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAffectsTurning;                                   // 0x37(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCinematicSplitScreen;                             // 0x38(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnableGodMode;                                    // 0x39(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnableNoTarget;                                   // 0x3A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECinematicAudioMode               AudioMode;                                         // 0x3B(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1B6A[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCinematicModeData* GetDefaultObj();

};

// 0x878 (0x8A0 - 0x28)
// Class GbxGameSystemCore.ControlledMove
class UControlledMove : public UObject
{
public:
	uint8                                        bIsSpeedScaleNormalized : 1;                       // Mask: 0x1, PropSize: 0x10x28(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEaseInSpeedConstraints : 1;                       // Mask: 0x2, PropSize: 0x10x28(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRestoreCharacterMovementMode : 1;                 // Mask: 0x4, PropSize: 0x10x28(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bZeroVelocityAtEnd : 1;                            // Mask: 0x8, PropSize: 0x10x28(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUpdateCharacterRotationYaw : 1;                   // Mask: 0x10, PropSize: 0x10x28(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUpdateCharacterRotationPitch : 1;                 // Mask: 0x20, PropSize: 0x10x28(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bApplyLaunchVelocityOnStart : 1;                   // Mask: 0x40, PropSize: 0x10x28(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bSpeedAffectedByMaxGroundSpeedScale : 1;           // Mask: 0x80, PropSize: 0x10x28(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bBlockMomentumAdd : 1;                             // Mask: 0x1, PropSize: 0x10x29(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bInterruptWhenLaunched : 1;                        // Mask: 0x2, PropSize: 0x10x29(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsMotionNormalized : 1;                           // Mask: 0x4, PropSize: 0x10x29(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsInheritVelocityScaleNormalized : 1;             // Mask: 0x8, PropSize: 0x10x29(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bApplyMoveWhenFalling : 1;                         // Mask: 0x10, PropSize: 0x10x29(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bStopOnLanding : 1;                                // Mask: 0x20, PropSize: 0x10x29(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOverrideAirControl : 1;                           // Mask: 0x40, PropSize: 0x10x29(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseSlopeCurve : 1;                                // Mask: 0x80, PropSize: 0x10x29(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bStopWhenTargetReached : 1;                        // Mask: 0x1, PropSize: 0x10x2A(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableMoveControls : 1;                           // Mask: 0x2, PropSize: 0x10x2A(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bLimitedLookControl : 1;                           // Mask: 0x4, PropSize: 0x10x2A(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bInputVectorRelativeToMoveDirection : 1;           // Mask: 0x8, PropSize: 0x10x2A(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseMovingLaunchDirection : 1;                     // Mask: 0x10, PropSize: 0x10x2A(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDirectionRelativeToTarget : 1;                    // Mask: 0x20, PropSize: 0x10x2A(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOffsetLocationByCollisionRadius : 1;              // Mask: 0x40, PropSize: 0x10x2A(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOffsetLocationByTargetCollisionRadius : 1;        // Mask: 0x80, PropSize: 0x10x2A(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bLeap : 1;                                         // Mask: 0x1, PropSize: 0x10x2B(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAlwaysCollideWithTarget : 1;                      // Mask: 0x2, PropSize: 0x10x2B(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bStopOnHitWall : 1;                                // Mask: 0x4, PropSize: 0x10x2B(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bStopOnHitTargetable : 1;                          // Mask: 0x8, PropSize: 0x10x2B(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bTeleport : 1;                                     // Mask: 0x10, PropSize: 0x10x2B(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bRestrictTeleportToGround : 1;                     // Mask: 0x20, PropSize: 0x10x2B(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDisableLookInput : 1;                             // Mask: 0x40, PropSize: 0x10x2B(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDisableMoveInput : 1;                             // Mask: 0x80, PropSize: 0x10x2B(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEnableTargetControls : 1;                         // Mask: 0x1, PropSize: 0x10x2C(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bTargetControlGrounded : 1;                        // Mask: 0x2, PropSize: 0x10x2C(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bTrackTarget : 1;                                  // Mask: 0x4, PropSize: 0x10x2C(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bStopAI : 1;                                       // Mask: 0x8, PropSize: 0x10x2C(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAbortAI : 1;                                      // Mask: 0x10, PropSize: 0x10x2C(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bGodMode : 1;                                      // Mask: 0x20, PropSize: 0x10x2C(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDemigodMode : 1;                                  // Mask: 0x40, PropSize: 0x10x2C(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bEndCrouch : 1;                                    // Mask: 0x80, PropSize: 0x10x2C(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bForceCrouch : 1;                                  // Mask: 0x1, PropSize: 0x10x2D(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUpdateCameraRotationYaw : 1;                      // Mask: 0x2, PropSize: 0x10x2D(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUpdateCameraRotationPitch : 1;                    // Mask: 0x4, PropSize: 0x10x2D(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCancelActionSkillsIfPlayerNotInstigator : 1;      // Mask: 0x8, PropSize: 0x10x2D(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIsNetworkAutonomous : 1;                          // Mask: 0x10, PropSize: 0x10x2D(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bPlayStartStopActionsLocally : 1;                  // Mask: 0x20, PropSize: 0x10x2D(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAllowClientCollisionNotifications : 1;            // Mask: 0x40, PropSize: 0x10x2D(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_B3 : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1C76[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAttributeInitializationData          Duration;                                          // 0x30(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	enum class ECMMovementType                   MovementType;                                      // 0x68(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1C8B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAttributeInitializationData          Speed;                                             // 0x70(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                    SpeedScaleCurve;                                   // 0xA8(0x78)(Edit, NativeAccessSpecifierPublic)
	float                                        CharacterRotationYawOffset;                        // 0x120(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CharacterRotationPitchOffset;                      // 0x124(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCMMotionData                         MotionCurves;                                      // 0x128(0x168)(Edit, NativeAccessSpecifierPublic)
	int32                                        InheritVelocityType;                               // 0x290(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1C9A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRuntimeFloatCurve                    InheritVelocityScaleCurve;                         // 0x298(0x78)(Edit, NativeAccessSpecifierPublic)
	float                                        AdjustDurationBySlopeModifier;                     // 0x310(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxStepHeight;                                     // 0x314(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                    SpeedSlopeScaleCurve;                              // 0x318(0x78)(Edit, NativeAccessSpecifierPublic)
	enum class ECMLedgeBehavior                  LedgeBehavior;                                     // 0x390(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CA0[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LedgeHeight;                                       // 0x394(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAttributeInitializationData          AirControl;                                        // 0x398(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FAttributeInitializationData          GravityModifier;                                   // 0x3D0(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	enum class ECMGravityModificationType        GravityModificationType;                           // 0x408(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CAA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRuntimeFloatCurve                    GravityModifierEffectOverTime;                     // 0x410(0x78)(Edit, NativeAccessSpecifierPublic)
	struct FAttributeInitializationData          TerminalVelocityModifier;                          // 0x488(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	enum class ECMTerminalVelocityModificationType TerminalVelocityModificationType;                  // 0x4C0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CB3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TargetReached2DThreshold;                          // 0x4C4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TargetReachedUpThreshold;                          // 0x4C8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TargetReachedDownThreshold;                        // 0x4CC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECMMoveFBControlType              MoveFBControlType;                                 // 0x4D0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECMMoveLRControlType              MoveLRControlType;                                 // 0x4D1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CC9[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAttributeInitializationData          MoveForwardRate;                                   // 0x4D8(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FAttributeInitializationData          MoveBackwardRate;                                  // 0x510(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FAttributeInitializationData          MoveLRRate;                                        // 0x548(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FAttributeInitializationData          LookTurnScale;                                     // 0x580(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FAttributeInitializationData          LookUpScale;                                       // 0x5B8(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FAttributeInitializationData          LookDownScale;                                     // 0x5F0(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FAttributeInitializationData          DropRate;                                          // 0x628(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FAttributeInitializationData          MaxDiveAngle;                                      // 0x660(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FAttributeInitializationData          MaxClimbAngle;                                     // 0x698(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FRelativeDirectionData                LaunchDirection;                                   // 0x6D0(0x50)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FRelativeDirectionData                MovingLaunchDirection;                             // 0x720(0x50)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FAttributeInitializationData          LaunchAngle;                                       // 0x770(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                        LocationOffset;                                    // 0x7A8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LeapApexAngle;                                     // 0x7AC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LeapStartLandingOffsetTime;                        // 0x7B0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CE7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UGbxAction>                StartAction;                                       // 0x7B8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGbxAction>                StopAction;                                        // 0x7C0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGbxAction>                LeapApexAction;                                    // 0x7C8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGbxAction>                LeapLandingAction;                                 // 0x7D0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HitWallAngle;                                      // 0x7D8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TeleportOffset;                                    // 0x7DC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECMTeleportPreferenceType         TeleportLocationPreference;                        // 0x7E0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1CF1[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAttributeInitializationData          LimitedTargetControlDistance;                      // 0x7E8(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FAttributeInitializationData          TargetControlVelocity;                             // 0x820(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FAttributeInitializationData          TargetControlDelay;                                // 0x858(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                        MaxTrackingCorrectionAngle;                        // 0x890(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TrackingVelocity;                                  // 0x894(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGbxCharacter*                         ControlledCharacter;                               // 0x898(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UControlledMove* GetDefaultObj();

	void OnTeleported(float MoveDuration, struct FVector& PreTeleportLocation);
	void OnTargetLocationChanged(struct FVector& NewTargetLocation);
	void OnStop(bool bInterrupted);
	void OnStart(float MoveDuration, class AActor* TargetActor);
	void OnServerStop(bool bInterrupted);
	void OnServerStart(float MoveDuration, class AActor* TargetActor, class AActor* Instigator);
	void OnHitWorld(class AActor* HitActor, struct FVector& HitNormal);
	void OnHitTargetable(class AActor* HitActor, struct FVector& HitNormal);
};

// 0x350 (0x4C8 - 0x178)
// Class GbxGameSystemCore.GbxCustomizationComponent
class UGbxCustomizationComponent : public UActorComponent
{
public:
	uint8                                        Pad_1EDF[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCustomizationColorEntry>      ColorCustomizationParameters;                      // 0x180(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCustomizationLinkedParameterEntry> SharedLinkedParameters;                            // 0x190(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCustomizationLinkedParameterEntry> LinkedParameters;                                  // 0x1A0(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	enum class EGbxCustomizationComponentInitSourceType CustomizationSourceInitType;                       // 0x1B0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1EEB[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCustomizationTextureInheritanceSettings TextureInheritanceSettings;                        // 0x1B8(0x38)(Edit, NativeAccessSpecifierPublic)
	struct FGbxCustomizationContainer            CustomizationList;                                 // 0x1F0(0xD8)(Net, Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FCustomizationColorApplication> CustomColorSelections;                             // 0x2C8(0x10)(Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPublic)
	TMap<class UGbxCustomizationTargetData*, struct FCustomizationCustomTextureDataList> CustomTextures;                                    // 0x2D8(0x50)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class UGbxCustomizationMorphTargetSetData*> MorphTargetSets;                                   // 0x328(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCustomizationCustomFloatEntry> CustomFloats;                                      // 0x338(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bPreservePrimaryMeshTemplateScale;                 // 0x348(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1EFB[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                CustomFloatValues;                                 // 0x350(0x10)(Net, ZeroConstructor, Transient, RepNotify, NativeAccessSpecifierPublic)
	bool                                         bAllowCustomizationSuppression;                    // 0x360(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F00[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UGbxCustomizationTypeData*>     SuppressedCustomizationTypes;                      // 0x368(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	TArray<class FName>                          SuppressedCustomFloats;                            // 0x378(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F08[0x60];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnCustomizationApplied;                            // 0x3E8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnCustomizationRemoved;                            // 0x3F8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UGbxCustomizationComponent*            LinkedCustomizationSource;                         // 0x408(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TMap<class UMeshComponent*, struct FMaterialArray> CustomMaterials;                                   // 0x410(0x50)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	bool                                         bUseCustomMaterials;                               // 0x460(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1F16[0x67];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGbxCustomizationComponent* GetDefaultObj();

	void ServerSetCustomFloat(int32 Index, float Value);
	void ServerSetAllowCustomizationSuppression(bool bNewAllowCustomizationSuppression);
	void ServerApplyCustomizationData(class UGbxCustomizationData* CustomizationToApply, int32 OptionalCustomizationId);
	void ServerApplyCustomizationCollection(class UGbxCustomizationCollectionData* CollectionToApply);
	void ServerApplyCustomColor(int32 CustomColorIndex, const struct FLinearColor& InAppliedColor, const struct FLinearColor& InSplitColor, bool InUseDefaultColor, bool InUseDefaultSplitColor);
	bool RemoveCustomization(class UGbxCustomizationData* Customization);
	void RemoveAllCustomizations();
	void PostApplyCustomization();
	void OnRep_CustomFloats();
	void OnRep_CustomColorSelections();
	void OnRep_AllowCustomizationSuppression();
	void LinkToCustomization(class UGbxCustomizationComponent* SourceComponent);
	void LinkedCustomizationRemoved(class UGbxCustomizationData* Customization);
	void LinkedCustomizationApplied(class UGbxCustomizationData* Customization);
	bool IsCustomizationApplied(class UGbxCustomizationData* Customization);
	void Initialize();
	bool GetDefaultCustomSplitColor(int32 SelectionIndex, struct FLinearColor* DefaultSplitColor);
	bool GetDefaultCustomColor(int32 SelectionIndex, struct FLinearColor* DefaultColor);
	TArray<class UGbxCustomizationData*> GetAppliedCustomizations();
	void CopyFromCustomization(class UGbxCustomizationComponent* SourceComponent);
};

// 0x178 (0x1A8 - 0x30)
// Class GbxGameSystemCore.GbxCustomizationData
class UGbxCustomizationData : public UGbxDataAsset
{
public:
	class FText                                  CustomizationName;                                 // 0x30(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                  CustomizationDescription;                          // 0x48(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	int32                                        CustomizationSortPriority;                         // 0x60(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1FE7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UTexture2D>             IconTexture;                                       // 0x68(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FUIStatPriorityData>           UIStats;                                           // 0x90(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FString                                ItemCardTypeFrameName;                             // 0xA0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture>               PreviewImage;                                      // 0xB0(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAttributeInitializationData          PurchasePrice;                                     // 0xD8(0x38)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	class UGbxCustomizationTypeData*             CustomizationType;                                 // 0x110(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCustomizationAssetEntry>      CustomizationTargetAssets;                         // 0x118(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FCustomizationCustomFloatOverrideEntry> CustomFloatOverrides;                              // 0x128(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                         bUnlockedByDefault;                                // 0x138(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEquippedByDefault;                                // 0x139(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanSellItemIfNotOwned;                            // 0x13A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanDropItemIfNotOwned;                            // 0x13B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_201E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UGbxCustomizationData*                 DefaultSkin;                                       // 0x140(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxCustomizationData*                 DependentBody;                                     // 0x148(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UGbxCustomizationData*>         Dependencies;                                      // 0x150(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UGbxCustomizationData*>         AlternateIfDependenciesNotMet;                     // 0x160(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UGbxCustomizationTypeData*>     CustomizationTypesToSuppress;                      // 0x170(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class FName>                          CustomFloatsToSuppress;                            // 0x180(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                         bIsBigHat;                                         // 0x190(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_202F[0x17];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGbxCustomizationData* GetDefaultObj();

	bool RemoveCustomizationFromActor(class AActor* TargetActor);
	void OnCustomizationAssetLoaded();
	class UGbxAction* K2_PlayAction(class AActor* TargetActor, struct FActionState_Base& ActionData);
	bool IsLoading();
	bool IsLoaded(int32 OptionalCustomizationId);
	void AsyncLoadCustomizationAssets(UDelegateProperty_& LoadedDelegate);
	bool ApplyCustomizationToActor(class AActor* TargetActor, int32 OptionalCustomizationId);
};

// 0x18 (0x470 - 0x458)
// Class GbxGameSystemCore.GbxCustomizationManager
class AGbxCustomizationManager : public AActor
{
public:
	TArray<struct FCustomizationStreamingEntry>  CustomizationStreamingEntries;                     // 0x458(0x10)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_204D[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AGbxCustomizationManager* GetDefaultObj();

	void OnCustomizationAssetLoaded();
};

// 0x70 (0xA0 - 0x30)
// Class GbxGameSystemCore.GbxCustomizationTypeData
class UGbxCustomizationTypeData : public UGbxDataAsset
{
public:
	class FText                                  CustomizationTypeName;                             // 0x30(0x18)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                  CustomizationTypeDescription;                      // 0x48(0x18)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                         bUnique;                                           // 0x60(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2065[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UGbxCustomizationTypeData*             DependentCustomizationType;                        // 0x68(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxCustomizationTargetData*           DependentCustomizationTarget;                      // 0x70(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGameStatData>          AssociatedUnlockStat;                              // 0x78(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UGbxCustomizationTypeData* GetDefaultObj();

};

// 0x50 (0x1C8 - 0x178)
// Class GbxGameSystemCore.DamageBaseComponent
class UDamageBaseComponent : public UActorComponent
{
public:
	class UTeamComponent*                        CachedTeamComponent;                               // 0x178(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTargetableComponent*                  CachedTargetableComponent;                         // 0x180(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FRegisteredConditionalDamageValueModifier> ConditionalValueModifiers;                         // 0x188(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<struct FRegisteredConditionalDamageCriticalModifier> ConditionalCritModifiers;                          // 0x198(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<struct FRegisteredConditionalDamageTypeModifier> ConditionalTypeModifiers;                          // 0x1A8(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<struct FRegisteredConditionalHitRegionModifier> ConditionalHitRegionModifiers;                     // 0x1B8(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UDamageBaseComponent* GetDefaultObj();

};

// 0x1A0 (0x368 - 0x1C8)
// Class GbxGameSystemCore.DamageCauserComponent
class UDamageCauserComponent : public UDamageBaseComponent
{
public:
	uint8                                        Pad_2147[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnCausedAnyDamage;                                 // 0x1E8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnCausedBonusDamage;                               // 0x1F8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnCausedMeleeDamage;                               // 0x208(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnCausedMeleeFinisher;                             // 0x218(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnCausedDeath;                                     // 0x228(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnCausedMeleeDeath;                                // 0x238(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_2157[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnCausedHealing;                                   // 0x260(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnHitFriendly;                                     // 0x270(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	enum class EDamageCausedModificationStrategy DefaultModificationContextStrategy;                // 0x280(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAttitudeDamageRules                  AttitudeDamageRules;                               // 0x284(0x4)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bCanHurtSelf;                                      // 0x288(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2163[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGbxAttributeFloat                    StatusEffectChanceModifierScalar;                  // 0x28C(0xC)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                    StatusEffectDamageModifierScalar;                  // 0x298(0xC)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                    StatusEffectDurationModifierScalar;                // 0x2A4(0xC)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FStatusEffectModifiers>        StatusEffectModifiers;                             // 0x2B0(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bUseRootInstigatorForStatusEffects;                // 0x2C0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2176[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGbxAttributeFloat                    DamageDealtMultiplier;                             // 0x2C4(0xC)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                    RadiusDamage_RadiusMultiplier;                     // 0x2D0(0xC)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                    RadiusDamage_DamageMultiplier;                     // 0x2DC(0xC)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeInteger                  ShouldIgnoreEnemyElementalResistance;              // 0x2E8(0xC)(Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bApplyInstigatorSkillDamageModifier;               // 0x2F4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_217E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGbxAttributeFloat                    DefaultCriticalHitMultiplier;                      // 0x2F8(0xC)(Edit, Net, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2181[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCritSourceModifiers>          SourceCritDamageModifiers;                         // 0x308(0x10)(Edit, Net, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FGbxAttributeFloat                    DefaultCriticalHitChance;                          // 0x318(0xC)(Edit, Net, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2186[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCritSourceModifiers>          SourceCritChanceModifiers;                         // 0x328(0x10)(Edit, Net, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UConditionalDamageModifier*>    DefaultConditionalDamageModifiers;                 // 0x338(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                        EnemyReflectionChance;                             // 0x348(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2190[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FReflectedDamageParams                EnemyReflectionParams;                             // 0x350(0x18)(NoDestructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UDamageCauserComponent* GetDefaultObj();

	void UnregisterConditionalDamageModifier(class UConditionalDamageModifier* Modifier);
	void RegisterConditionalDamageModifier(class UConditionalDamageModifier* Modifier);
	struct FCritSourceModifiers GetCritModifierTotals(TSubclassOf<class UDamageSource> DamageSource, enum class ECritType CritType, float* ModifierTotal);
	struct FCritSourceModifiers GetCritModifiersForSource(TSubclassOf<class UDamageSource> DamageSource, enum class ECritType CritType, float* ModifierTotal);
	struct FCritSourceModifiers FindCritModifier(TSubclassOf<class UDamageSource> DamageSource, enum class ECritType CritType);
};

// 0x6B0 (0x878 - 0x1C8)
// Class GbxGameSystemCore.DamageComponent
class UDamageComponent : public UDamageBaseComponent
{
public:
	uint8                                        Pad_24E1[0x38];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnTakeAnyDamage;                                   // 0x200(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnPlayerMeleeHit;                                  // 0x210(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnTakeAnyHealing;                                  // 0x220(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnHealthDepleted;                                  // 0x230(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_24EA[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnDeath;                                           // 0x258(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_24ED[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnHitByFriendly;                                   // 0x280(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_24F2[0x130];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnHitReaction;                                     // 0x3C0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FHitReactionState                     HitReactions;                                      // 0x3D0(0x290)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        bShowDamageNumbers : 1;                            // Mask: 0x1, PropSize: 0x10x660(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShowImmuneFeedbackInGodMode : 1;                  // Mask: 0x2, PropSize: 0x10x660(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bAlwaysBlockWeapons : 1;                           // Mask: 0x4, PropSize: 0x10x660(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bIgnoreDamageAreaVisibilityChecks : 1;             // Mask: 0x8, PropSize: 0x10x660(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bDieWhenHealthDepleted : 1;                        // Mask: 0x10, PropSize: 0x10x660(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_C8 : 3;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_2511[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UDeathData*                            DeathData;                                         // 0x668(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EDamageComponentHealthMode        HealthMode;                                        // 0x670(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2512[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FHealthType>                   HealthInformation;                                 // 0x678(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnInstance, RepNotify, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FSimpleHealthInfo                     SimpleHealthInformation;                           // 0x688(0x58)(Edit, Net, DisableEditOnInstance, RepNotify, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                    DamageTakenMultiplier;                             // 0x6E0(0xC)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                    RadiusDamageTakenMultiplier;                       // 0x6EC(0xC)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                    StatusEffectChanceModifierScalar;                  // 0x6F8(0xC)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                    StatusEffectDamageModifierScalar;                  // 0x704(0xC)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                    StatusEffectDurationModifierScalar;                // 0x710(0xC)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2519[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FStatusEffectModifiers>        StatusEffectModifiers;                             // 0x720(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        MinimumDamageLaunchVelocity;                       // 0x730(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseBoundForCylinderTest : 1;                      // Mask: 0x1, PropSize: 0x10x734(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseComplexDamageAreaTargetTest : 1;               // Mask: 0x2, PropSize: 0x10x734(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_C9 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_2520[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LaunchVerticalDampening;                           // 0x738(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxSelfInflictedLaunchVelocity;                    // 0x73C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImpactData*                           SplatterEffect;                                    // 0x740(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseProtectionTimer;                               // 0x748(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_252A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSyncedHitReactionData                DeathHitReaction;                                  // 0x750(0x40)(Net, Transient, RepNotify, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_2530[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDamageGoreModifiers                  DeathGoreModifiers;                                // 0x794(0x8)(BlueprintVisible, BlueprintReadOnly, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_2534[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class APlayerController*                     LastHitByPlayer;                                   // 0x7A0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AvertDeathChance;                                  // 0x7A8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        IntrinsicArmor;                                    // 0x7AC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGbxAttributeFloat                    SelfReflectionChance;                              // 0x7B0(0xC)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGbxAttributeFloat                    SelfReflectionDamageTakenScale;                    // 0x7BC(0xC)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGbxAttributeFloat                    SelfReflectionDamageScale;                         // 0x7C8(0xC)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGbxAttributeInteger                  SelfReflectionTowardsAttacker;                     // 0x7D4(0xC)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UGbxDamageType>            SelfReflectionDamageType;                          // 0x7E0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bPassDamageToParent : 1;                           // Mask: 0x1, PropSize: 0x10x7E8(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bDamageOnlyAppliesToParent : 1;                    // Mask: 0x2, PropSize: 0x10x7E8(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bCanDamageCorpse : 1;                              // Mask: 0x4, PropSize: 0x10x7E8(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_CD : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_254F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UConditionalDamageModifier*>    DefaultConditionalDamageModifiers;                 // 0x7F0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	TArray<struct FDamageReactionEvent_DamageComponent> DamageEvents;                                      // 0x800(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class UHitRegionComponent*                   CachedHitRegionComponent;                          // 0x810(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDamageComponent*                      ParentDamageComponent;                             // 0x818(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AController*                           LastHitBy;                                         // 0x820(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2558[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        bGodMode : 1;                                      // Mask: 0x1, PropSize: 0x10x840(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bDemigodMode : 1;                                  // Mask: 0x2, PropSize: 0x10x840(0x1)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_CE : 1;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bCurrentlyDead : 1;                                // Mask: 0x8, PropSize: 0x10x840(0x1)(Net, Transient, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_CF : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_2561[0x27];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UPhysicalMaterial*                     ImpactPhysicalMaterialOverride;                    // 0x868(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bSuppressOnDeathCall;                              // 0x870(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2564[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UDamageComponent* GetDefaultObj();

	void UnregisterConditionalDamageModifier(class UConditionalDamageModifier* Modifier);
	void SetSelfReflectedDamageType(TSubclassOf<class UGbxDamageType>& DamageType);
	void SetGodMode(bool bInGodMode);
	void SetDemiGodMode(bool bInDemiGodMode);
	void SetCurrentShield(float NewCurrentShield);
	void SetCurrentHealth(float NewCurrentHealth);
	void RegisterConditionalDamageModifier(class UConditionalDamageModifier* Modifier);
	void ReceiveHealthDepleted(class UDamageCauserComponent* DamageCauser);
	void ReceiveAnyHealing(float Healing, class AActor* HealInstigator, class UDamageSource* DamageSource, class UDamageType* DamageType);
	void ReceiveAnyDamage(float Damage, class UGbxDamageType* DamageType, class UDamageSource* DamageSource, class AController* InstigatedBy, class UDamageCauserComponent* DamageCauser, struct FReceivedDamageDetails& Details);
	void OnRep_SimpleHealthInformation();
	void OnRep_HealthInformation();
	void OnRep_DeathHitReaction();
	void OnRep_bCurrentlyDead();
	void OnOwnerExperienceLevelChanged(int32 OldExperienceLevel, int32 NewExperienceLevel);
	void OnHealthResourceNowNotDepleted(const struct FGameResourcePoolReference& ResourcePool);
	void OnHealthResourceNowDepleted(const struct FGameResourcePoolReference& ResourcePool);
	bool IsInGodMode();
	bool IsInDemiGodMode();
	bool IsDamageOverkill(float DamageAmount, float OverkillThreshold);
	void GetValidDamageEventFunctionNames(TArray<class FName>* Names);
	float GetTotalMaxHealth();
	float GetMaxShield();
	float GetMaxHealth();
	float GetCurrentShield();
	float GetCurrentHealthPercent();
	float GetCurrentHealth();
	void BroadcastPlayImpactSplatterEffect(class UImpactData* ImpactData, const struct FVector_NetQuantize100& HitLocation, const struct FVector_NetQuantizeNormal& HitDirection, float DamageSeverity);
};

// 0x70 (0x98 - 0x28)
// Class GbxGameSystemCore.DamageFilter
class UDamageFilter : public UObject
{
public:
	bool                                         bExactDamageSourceClass;                           // 0x28(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_25A9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UDamageSource>             DamageSource;                                      // 0x30(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bExactDamageTypeClass;                             // 0x38(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_25B0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UGbxDamageType>            DamageType;                                        // 0x40(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGbxCondition*                         ConditionSelf;                                     // 0x48(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGbxCondition*                         ConditionAttacker;                                 // 0x50(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOnlyAoEDamage : 1;                                // Mask: 0x1, PropSize: 0x10x58(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bMustNotBeSelfDamage : 1;                          // Mask: 0x2, PropSize: 0x10x58(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bUseRandomChance : 1;                              // Mask: 0x4, PropSize: 0x10x58(0x1)(Edit, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_D4 : 5;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_25C1[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAttributeInitializationData          RandomChance;                                      // 0x60(0x38)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UDamageFilter* GetDefaultObj();

};

// 0x220 (0x250 - 0x30)
// Class GbxGameSystemCore.DamageGlobalsData
class UDamageGlobalsData : public UGbxDataAsset
{
public:
	struct FProtectionTimerSettings              ProtectionTimerSettings;                           // 0x30(0xC)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_25E0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAttributeInitializationData          DefaultInstigatorSelfDamageScale;                  // 0x40(0x38)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class UDamageSource>             SelfDamageSource;                                  // 0x78(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGbxDamageType>            DefaultHealingDamageType;                          // 0x80(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UImpactData*                           DefaultHealingImpact;                              // 0x88(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAttributeInitializationData          GlobalAIDamageScale;                               // 0x90(0x38)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FLevelBasedDamageScale>        PlayerDamageScaleByLevelDifference;                // 0xC8(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FLevelBasedDamageScale>        AIDamageScaleByLevelDifference;                    // 0xD8(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FRuntimeFloatCurve                    SplatterProbabilityCurve;                          // 0xE8(0x78)(Edit, Protected, NativeAccessSpecifierProtected)
