#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x31 (0x31 - 0x0)
// Function IDrone_KnightOfTheClaw_DragonPet.IDrone_KnightOfTheClaw_DragonPet_C.ExternalDragonCompanionCreateFireBoltSplat
struct IIDrone_KnightOfTheClaw_DragonPet_C_ExternalDragonCompanionCreateFireBoltSplat_Params
{
public:
	struct FTransform                            TransformData;                                     // 0x0(0x30)(BlueprintVisible, BlueprintReadOnly, Parm, IsPlainOldData, NoDestructor)
	bool                                         Res;                                               // 0x30(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function IDrone_KnightOfTheClaw_DragonPet.IDrone_KnightOfTheClaw_DragonPet_C.ExternalDragonCompanionStopShockBreath
struct IIDrone_KnightOfTheClaw_DragonPet_C_ExternalDragonCompanionStopShockBreath_Params
{
public:
	bool                                         Res;                                               // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function IDrone_KnightOfTheClaw_DragonPet.IDrone_KnightOfTheClaw_DragonPet_C.ExternalDragonCompanionStopFireBolt
struct IIDrone_KnightOfTheClaw_DragonPet_C_ExternalDragonCompanionStopFireBolt_Params
{
public:
	bool                                         Res;                                               // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function IDrone_KnightOfTheClaw_DragonPet.IDrone_KnightOfTheClaw_DragonPet_C.ExternalDragonCompanionStopFireBreath
struct IIDrone_KnightOfTheClaw_DragonPet_C_ExternalDragonCompanionStopFireBreath_Params
{
public:
	bool                                         Res;                                               // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function IDrone_KnightOfTheClaw_DragonPet.IDrone_KnightOfTheClaw_DragonPet_C.ExternalDragonCompanionCreateShockBreath
struct IIDrone_KnightOfTheClaw_DragonPet_C_ExternalDragonCompanionCreateShockBreath_Params
{
public:
	bool                                         Res;                                               // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function IDrone_KnightOfTheClaw_DragonPet.IDrone_KnightOfTheClaw_DragonPet_C.ExternalDragonCompanionCreateFireBolt
struct IIDrone_KnightOfTheClaw_DragonPet_C_ExternalDragonCompanionCreateFireBolt_Params
{
public:
	bool                                         Res;                                               // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function IDrone_KnightOfTheClaw_DragonPet.IDrone_KnightOfTheClaw_DragonPet_C.ExternalDragonCompanionCreateFireBreath
struct IIDrone_KnightOfTheClaw_DragonPet_C_ExternalDragonCompanionCreateFireBreath_Params
{
public:
	bool                                         Res;                                               // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x2 (0x2 - 0x0)
// Function IDrone_KnightOfTheClaw_DragonPet.IDrone_KnightOfTheClaw_DragonPet_C.DragonCompanionPauseAttacking
struct IIDrone_KnightOfTheClaw_DragonPet_C_DragonCompanionPauseAttacking_Params
{
public:
	bool                                         Pause;                                             // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         Res;                                               // 0x1(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x1 (0x1 - 0x0)
// Function IDrone_KnightOfTheClaw_DragonPet.IDrone_KnightOfTheClaw_DragonPet_C.FinishInteract
struct IIDrone_KnightOfTheClaw_DragonPet_C_FinishInteract_Params
{
public:
	bool                                         Res;                                               // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x8 (0x8 - 0x0)
// Function IDrone_KnightOfTheClaw_DragonPet.IDrone_KnightOfTheClaw_DragonPet_C.GetDragonCompanionTarget
struct IIDrone_KnightOfTheClaw_DragonPet_C_GetDragonCompanionTarget_Params
{
public:
	class AActor*                                Res;                                               // 0x0(0x8)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function IDrone_KnightOfTheClaw_DragonPet.IDrone_KnightOfTheClaw_DragonPet_C.RequestDragonCompanionShockBreathAttack
struct IIDrone_KnightOfTheClaw_DragonPet_C_RequestDragonCompanionShockBreathAttack_Params
{
public:
	bool                                         Res;                                               // 0x0(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

}
}


