#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------

enum class EOakElementalType : uint8
{
	None                           = 0,
	Cryo                           = 1,
	DarkMagic                      = 2,
	Fire                           = 3,
	Poison                         = 4,
	Shock                          = 5,
	MAX                            = 6,
};

enum class EExitDownStateReason : uint8
{
	ExitDownStateReason_None       = 0,
	ExitDownStateReason_Revived    = 1,
	ExitDownStateReason_SecondWind = 2,
	ExitDownStateReason_TimerExpired = 3,
	ExitDownStateReason_Interrupted = 4,
	ExitDownStateReason_Instant    = 5,
	ExitDownStateReason_Custom     = 6,
	ExitDownStateReason_Travel     = 7,
	ExitDownStateReason_MAX        = 8,
};

enum class EDownState : uint8
{
	DownState_Healthy              = 0,
	DownState_Down                 = 1,
	DownState_DownAndExerting      = 2,
	DownState_Resurrecting         = 3,
	DownState_GivingUp             = 4,
	DownState_MAX                  = 5,
};

enum class EReviveState : uint8
{
	ReviveState_None               = 0,
	ReviveState_BeingRevived       = 1,
	ReviveState_Reviving           = 2,
	ReviveState_MAX                = 3,
};

enum class EOakStatusEffectResourceEffectType : uint8
{
	Default                        = 0,
	Cryo                           = 1,
	DarkMagic                      = 2,
	EOakStatusEffectResourceEffectType_MAX = 3,
};

enum class EHealthAdded : uint8
{
	Success                        = 0,
	Falure                         = 1,
	EHealthAdded_MAX               = 2,
};

enum class EValidIndex : uint8
{
	Valid                          = 0,
	Invalid                        = 1,
	EValidIndex_MAX                = 2,
};

enum class EHealthState : uint8
{
	Healthy                        = 0,
	Low                            = 1,
	VeryLow                        = 2,
	Injured                        = 3,
	Dead                           = 4,
	EHealthState_MAX               = 5,
};

enum class EWeaponActionChannel : uint8
{
	Use                            = 0,
	Zoom                           = 1,
	Reload                         = 2,
	Other                          = 3,
	EWeaponActionChannel_MAX       = 4,
};

enum class EZoomEventType : uint8
{
	None                           = 0,
	ZoomingIn                      = 1,
	ZoomingOut                     = 2,
	EZoomEventType_MAX             = 3,
};

enum class EWeaponAbilityEffectType : uint8
{
	Amp                            = 0,
	SpellKill                      = 1,
	MAX                            = 2,
};

enum class EDeathType : uint8
{
	None                           = 0,
	HealthDepleted                 = 1,
	Suicide                        = 2,
	ScriptedInstantDeath           = 3,
	FellOutOfWorld                 = 4,
	Ragdoll                        = 5,
	EDeathType_MAX                 = 6,
};

enum class EOakGender : uint8
{
	Male                           = 0,
	Female                         = 1,
	Random                         = 2,
	EOakGender_MAX                 = 3,
};

enum class EWeaponHolsteredSizeType : uint8
{
	Small                          = 0,
	Medium                         = 1,
	Large                          = 2,
	ExtraLarge                     = 3,
	EWeaponHolsteredSizeType_MAX   = 4,
};

enum class ETargetedNameplateType : uint8
{
	Standard                       = 0,
	NPC                            = 1,
	Boss                           = 2,
	None                           = 3,
	ETargetedNameplateType_MAX     = 4,
};

enum class EKilledEnemyFriendEventType : uint8
{
	None                           = 0,
	Enemy                          = 1,
	NamedEnemy                     = 2,
	Boss                           = 3,
	EKilledEnemyFriendEventType_MAX = 4,
};

enum class EMatchmakingState : uint8
{
	Idle                           = 0,
	PreparingToSearch              = 1,
	Searching                      = 2,
	ConfirmingPlayers              = 3,
	StartingGameplay               = 4,
	Canceling                      = 5,
	EMatchmakingState_MAX          = 6,
};

enum class EBossbarEventType : uint8
{
	Intro_Event                    = 0,
	Enable_Invulnerable_Event      = 1,
	Disable_Invulnerable_Event     = 2,
	Shake_Event                    = 3,
	Destroy_Event                  = 4,
	NONE                           = 5,
	EBossbarEventType_MAX          = 6,
};

enum class EEffectivePlayerCountSetting : int32
{
	GameForced                     = 0,
	UserRequested                  = 1,
	Actual                         = 2,
	EEffectivePlayerCountSetting_MAX = 3,
};

enum class EOakGameStateUIGroupMode : uint8
{
	Cooperation                    = 0,
	Coopetition                    = 1,
	Unknown                        = 2,
	EOakGameStateUIGroupMode_MAX   = 3,
};

enum class EMultiplayerLootMode : uint8
{
	Standard                       = 0,
	Instanced                      = 1,
	EMultiplayerLootMode_MAX       = 2,
};

enum class ENewGameState : int32
{
	None                           = 0,
	IntroMovie                     = 1,
	CharacterSelect                = 2,
	WaitingForPlayerPawns          = 3,
	ENewGameState_MAX              = 4,
};

enum class EGrenadeThrowFailureReason : uint8
{
	UnknownError                   = 0,
	ActionsLocked                  = 1,
	NotHealthy                     = 2,
	InternalCooldown               = 3,
	NotEnoughAmmo                  = 4,
	EGrenadeThrowFailureReason_MAX = 5,
};

enum class EVaultRewardType : uint8
{
	None                           = 0,
	EridianAnalyser                = 1,
	EridianResonator               = 2,
	ArtifactSlot                   = 3,
	EridianFabricator              = 4,
	MayhemMode                     = 5,
	EVaultRewardType_MAX           = 6,
};

enum class EPlayerHeroPoint : uint8
{
	Strength                       = 0,
	Dexterity                      = 1,
	Intelligence                   = 2,
	Wisdom                         = 3,
	Constitution                   = 4,
	Luck                           = 5,
	EPlayerHeroPoint_MAX           = 6,
};

enum class ESpellSlot : uint8
{
	None                           = 0,
	Primary                        = 1,
	Secondary                      = 2,
	ESpellSlot_MAX                 = 3,
};

enum class EDuelClassification : uint8
{
	Standard1v1                    = 0,
	FreeForAll                     = 1,
	EDuelClassification_MAX        = 2,
};

enum class EDuelLoseReason : uint8
{
	None                           = 0,
	PlayerKilled                   = 1,
	PlayerQuit                     = 2,
	OutOfBounds                    = 3,
	EDuelLoseReason_MAX            = 4,
};

enum class EA9KSawState : uint8
{
	NotStarted                     = 0,
	Cooldown                       = 1,
	PickTarget                     = 2,
	TryToReachTarget               = 3,
	ReachedTarget                  = 4,
	EquipSaw                       = 5,
	WaitForQuipAnimDone            = 6,
	Anticipation                   = 7,
	PrepareToShootAndShoot         = 8,
	WaitForBPCallback              = 9,
	FollowingTarget                = 10,
	Resting                        = 11,
	EA9KSawState_MAX               = 12,
};

enum class EAnointedDeathState : uint8
{
	PreFreeze                      = 0,
	Freezing                       = 1,
	Frozen                         = 2,
	ShatterKilled                  = 3,
	TimedOut                       = 4,
	EAnointedDeathState_MAX        = 5,
};

enum class EJumpType : uint8
{
	None                           = 0,
	Default                        = 1,
	Sprint                         = 2,
	Slide                          = 3,
	UpwardLadderJump               = 4,
	EJumpType_MAX                  = 5,
};

enum class ECommandRingLocationType : uint8
{
	Default                        = 0,
	Ground                         = 1,
	Feet                           = 2,
	ECommandRingLocationType_MAX   = 3,
};

enum class ECommandRingAlignmentType : uint8
{
	Default                        = 0,
	SurfaceWorld                   = 1,
	SurfaceView                    = 2,
	View                           = 3,
	View2D                         = 4,
	Actor                          = 5,
	ECommandRingAlignmentType_MAX  = 6,
};

enum class ECommandRingReferenceActorType : uint8
{
	Target                         = 0,
	Owner                          = 1,
	Custom                         = 2,
	ECommandRingReferenceActorType_MAX = 3,
};

enum class EPuzzleState : uint8
{
	InProgress                     = 0,
	Completed                      = 1,
	Failed                         = 2,
	EPuzzleState_MAX               = 3,
};

enum class ETelemetryDungeonStatus : uint8
{
	Start                          = 0,
	Join                           = 1,
	Win                            = 2,
	Fail                           = 3,
	Newroom                        = 4,
	Endscreen                      = 5,
	ETelemetryDungeonStatus_MAX    = 6,
};

enum class EEncounterType : uint8
{
	Overworld                      = 0,
	MiniDungeon                    = 1,
	EndlessDungeon                 = 2,
	FeaturedRun                    = 3,
	EEncounterType_MAX             = 4,
};

enum class EGameModeType : uint8
{
	KillAllThreeWaves              = 0,
	KillMiniBoss                   = 1,
	KillBoss                       = 2,
	LootRoom                       = 3,
	EndlessDungeonBoss             = 4,
	Random                         = 5,
	KillAllTwoWaves                = 6,
	Tutorial_KillAllThreeWaves     = 7,
	Tutorial_LootRoom              = 8,
	Undefined                      = 9,
	EGameModeType_MAX              = 10,
};

enum class EDungeonRunType : uint8
{
	Overworld                      = 0,
	Normal                         = 1,
	Featured                       = 2,
	MayhemTrial                    = 3,
	Debug                          = 4,
	Boss                           = 5,
	Extended                       = 6,
	EDungeonRunType_MAX            = 7,
};

enum class ERunnerType : uint8
{
	RandomEncounter                = 0,
	OverworldDungeon               = 1,
	EndlessDungeon                 = 2,
	ERunnerType_MAX                = 3,
};

enum class ECrystalBonusType : uint8
{
	None                           = 0,
	CrystalAmount                  = 1,
	CrystalDropChance              = 2,
	EliteCrystalAmount             = 3,
	EliteCrystalDropChance         = 4,
	ECrystalBonusType_MAX          = 5,
};

enum class EDungeonBonusType : uint8
{
	Stat                           = 0,
	Reward                         = 1,
	EDungeonBonusType_MAX          = 2,
};

enum class EDungeonObjectiveType : uint8
{
	DOT_None                       = 0,
	DOT_Bonus                      = 1,
	DOT_TakePortal                 = 2,
	DOT_KillBoss                   = 3,
	DOT_ClearEncounter             = 4,
	DOT_TakeReward                 = 5,
	DOT_KillTarget                 = 6,
	DOT_ReachArena                 = 7,
	DOT_KillAll                    = 8,
	DOT_LootRoom                   = 9,
	DOT_LeaveRoom                  = 10,
	DOT_OfferCrystals              = 11,
	DOT_ChooseChallenge            = 12,
	DOT_BreakDie                   = 13,
	DOT_BuyAltar                   = 14,
	DOT_KillDryl                   = 15,
	DOT_KillDragonLord             = 16,
	DOT_MAX                        = 17,
};

enum class EPlayerExperienceType : uint8
{
	Generic                        = 0,
	Combat                         = 1,
	Mission                        = 2,
	EPlayerExperienceType_MAX      = 3,
};

enum class EPlayerExperienceSource : uint8
{
	XPUnknown                      = 0,
	XPCombat                       = 1,
	PlotMissionAward               = 2,
	Discovery                      = 3,
	SideMissionAward               = 4,
	SaveGame                       = 5,
	EPlayerExperienceSource_MAX    = 6,
};

enum class EOakReticleFeedbackGameEvent : uint8
{
	None                           = 0,
	DamageCaused                   = 1,
	DeathCaused                    = 2,
	EOakReticleFeedbackGameEvent_MAX = 3,
};

enum class EMatchmakingError : uint8
{
	None                           = 0,
	StartHostingFailed             = 1,
	StartMatchmakingRoundFailed    = 2,
	StartMatchmakingSearchFailed   = 3,
	CreateClientMatchmakingBeaconFailed = 4,
	SearchFailed                   = 5,
	JoinGameFailed                 = 6,
	RateLimit                      = 7,
	NetworkFailure                 = 8,
	ClientCriticalFailure          = 9,
	UpdateSessionFailed            = 10,
	StartGameplayFailed            = 11,
	SplitscreenJoinFailure         = 12,
	SplitscreenLeaveFailure        = 13,
	NoPlaylistContentAvailable     = 14,
	EMatchmakingError_MAX          = 15,
};

enum class ETradeRequestReceptionType : uint8
{
	All                            = 0,
	FriendsOnly                    = 1,
	Off                            = 2,
	MAX                            = 3,
};

enum class EPlayerDifficultySetting : uint8
{
	Easy                           = 0,
	Normal                         = 1,
	Hard                           = 2,
	MAX                            = 3,
};

enum class ECanReRollInventoryResult : uint8
{
	Yes                            = 0,
	CantAfford                     = 1,
	No                             = 2,
	ECanReRollInventoryResult_MAX  = 3,
};

enum class EPOIActivationResult : uint8
{
	Success                        = 0,
	Failure_Generic                = 1,
	Failure_PlayerInMenu           = 2,
	Failure_AllyDown               = 3,
	Failure_FastTravelDisabled     = 4,
	Failure_PlayerInVehicle        = 5,
	Failure_ClientJoining          = 6,
	Failure_PlayerDueling          = 7,
	Failure_PhotoModeActive        = 8,
	EPOIActivationResult_MAX       = 9,
};

enum class EKickReason : uint8
{
	None                           = 0,
	Kicked                         = 1,
	Invite                         = 2,
	QuitGame                       = 3,
	SessionEnd                     = 4,
	TitleScreen                    = 5,
	IncompatibleMission            = 6,
	MissingContent                 = 7,
	EKickReason_MAX                = 8,
};

enum class EInventoryListType : uint8
{
	IL_Primary                     = 0,
	IL_Bank                        = 1,
	IL_LostLoot                    = 2,
	IL_MAX                         = 3,
};

enum class ELateJoinState : uint8
{
	NotLateJoining                 = 0,
	SelectingCharacter             = 1,
	ApplyingSaveGame               = 2,
	ELateJoinState_MAX             = 3,
};

enum class EOakUIDialogBoxButtonType : uint8
{
	ListButtons                    = 0,
	HintBox                        = 1,
	EOakUIDialogBoxButtonType_MAX  = 2,
};

enum class EOakUIDialogBoxStyle : uint8
{
	Default                        = 0,
	Warning                        = 1,
	Error                          = 2,
	Keybinding                     = 3,
	EOakUIDialogBoxStyle_MAX       = 4,
};

enum class EHyperHoopState : uint8
{
	Invalid                        = 0,
	NotStarted                     = 1,
	AttachingPawn                  = 2,
	Accelerating                   = 3,
	Moving                         = 4,
	Deccelerating                  = 5,
	DetachingPawn                  = 6,
	EHyperHoopState_MAX            = 7,
};

enum class EVendingMachineBuyType : uint8
{
	Regular                        = 0,
	BuyBack                        = 1,
	GearSoldByFriend               = 2,
	ItemOfTheDay                   = 3,
	EVendingMachineBuyType_MAX     = 4,
};

enum class EVendingMachineScrollDirection : uint8
{
	Forward                        = 0,
	Backward                       = 1,
	EVendingMachineScrollDirection_MAX = 2,
};

enum class ECharacterCreationUIDisplayCategory : int32
{
	NotSet                         = 0,
	None                           = 1,
	Body                           = 2,
	Head                           = 3,
	Eyes                           = 4,
	Ears                           = 5,
	Nose                           = 6,
	Mouth                          = 7,
	Scar                           = 8,
	Tattoo                         = 9,
	Accessories                    = 10,
	Personality                    = 11,
	Emote                          = 12,
	Banner                         = 13,
	Statue                         = 14,
	ClassSelection                 = 15,
	AspectOfTheVault               = 16,
	HeroPoints                     = 17,
	Summary                        = 18,
	ECharacterCreationUIDisplayCategory_MAX = 19,
};

enum class EOakUICharacterCustomizationStandInType : uint8
{
	None                           = 0,
	Character                      = 1,
	Banner                         = 2,
	Statue                         = 3,
	EOakUICharacterCustomizationStandInType_MAX = 4,
};

enum class ECharacterCreationPreviewType : int32
{
	Default                        = 0,
	Body                           = 1,
	Head                           = 2,
	FaceDetail                     = 3,
	ECharacterCreationPreviewType_MAX = 4,
};

enum class ECcLayoutItemType : uint8
{
	Header                         = 0,
	CustomizationItem              = 1,
	Sublist                        = 2,
	ECcLayoutItemType_MAX          = 3,
};

enum class EZoneMapChallengeStatus : uint8
{
	ZMC_AvailableChallenge         = 0,
	ZMC_CompletedChallenge         = 1,
	ZMC_Unknown                    = 2,
	ZMC_MAX                        = 3,
};

enum class EZoneMapMissionStatus : uint8
{
	ZMM_AvailableMission           = 0,
	ZMM_TrackedObjective           = 1,
	ZMM_OptionalObjective          = 2,
	ZMM_NotTrackedObjective        = 3,
	ZMM_OutOfMap                   = 4,
	ZMM_Unknown                    = 5,
	ZMM_MAX                        = 6,
};

enum class EZoneMapViewerState : uint8
{
	Level                          = 0,
	Planet                         = 1,
	Galaxy                         = 2,
	Overworld                      = 3,
	Invalid                        = 4,
	EZoneMapViewerState_MAX        = 5,
};

enum class EZoneMapMovementMode : uint8
{
	Direct                         = 0,
	Interpolate                    = 1,
	Animate                        = 2,
	EZoneMapMovementMode_MAX       = 3,
};

enum class ERunnerCompletionStatus : uint8
{
	Cancelled                      = 0,
	Won                            = 1,
	Lost                           = 2,
	NotComplete                    = 3,
	ERunnerCompletionStatus_MAX    = 4,
};

enum class EPetReleaseReason : uint8
{
	SpawnCheckFailed               = 0,
	PetProfileChanged              = 1,
	PetDied                        = 2,
	PlayerDied                     = 3,
	ItemPreventsSpawning           = 4,
	EPetReleaseReason_MAX          = 5,
};

enum class EVehicleImpactForce : uint8
{
	Unknown                        = 0,
	Grinding                       = 1,
	VerySmall                      = 2,
	Small                          = 3,
	Medium                         = 4,
	Heavy                          = 5,
	Count                          = 6,
	EVehicleImpactForce_MAX        = 7,
};

enum class EEffectStateType : uint8
{
	Play                           = 0,
	Stop                           = 1,
	Count                          = 2,
	EEffectStateType_MAX           = 3,
};

enum class EVehicleEffectEvent : uint8
{
	None                           = 0,
	Boost                          = 1,
	BoostChargeCountChanged        = 2,
	BoostPoolEmpty                 = 3,
	BoostPoolFull                  = 4,
	StartEngine                    = 5,
	Braking                        = 6,
	Hover                          = 7,
	Horn                           = 8,
	Digithrust                     = 9,
	ShieldBreak                    = 10,
	ShieldHealthEvent_Normal       = 11,
	ShieldHealthEvent_Low          = 12,
	ShieldHealthEvent_VeryLow      = 13,
	ShieldFullHealth               = 14,
	Backfire                       = 15,
	MaxRPMBackfire                 = 16,
	HealthEvent_Healthy            = 17,
	HealthEvent_Low                = 18,
	HealthEvent_VeryLow            = 19,
	HealthEvent_Dead               = 20,
	StatusEffect_CryoFrozen        = 21,
	StatusEffect_CryoThawing       = 22,
	StatusEffect_Cryo              = 23,
	StatusEffect_DarkMagic         = 24,
	StatusEffect_Shock             = 25,
	StatusEffect_Fire              = 26,
	StatusEffect_Poison            = 27,
	EVehicleEffectEvent_MAX        = 28,
};

enum class EFreezeType : uint8
{
	Cryo                           = 0,
	Anointed                       = 1,
	MAX                            = 2,
};

enum class EShieldEffectState : uint8
{
	Full                           = 0,
	Damaged                        = 1,
	Depleted                       = 2,
	EShieldEffectState_MAX         = 3,
};

enum class EFreezeState : uint8
{
	None                           = 0,
	Freezing                       = 1,
	Frozen                         = 2,
	Thawing                        = 3,
	EFreezeState_MAX               = 4,
};

enum class EOakUIInventoryItemUseType : int32
{
	Unknown                        = 0,
	EquippableInternal             = 1,
	UsableInternal                 = 2,
	EOakUIInventoryItemUseType_MAX = 3,
};

enum class EManagedWidgetType : uint8
{
	Basic                          = 0,
	OnlineMessageAnimation         = 1,
	EManagedWidgetType_MAX         = 2,
};

enum class EMissionDeliveryMenuDisplayState : uint8
{
	Description                    = 0,
	Friends                        = 1,
	EMissionDeliveryMenuDisplayState_MAX = 2,
};

enum class EOakMessageType : uint8
{
	MessageType_PlayerJoined       = 1,
	MessageType_PlayerChangedName  = 2,
	MessageType_PlayerLeft         = 4,
	MessageType_PlayerUnableToJoin = 7,
	MessageType_SpectatorJoined    = 16,
	MessageType_MAX                = 17,
};

enum class EMessageSpecialType : uint8
{
	MST_None                       = 0,
	MST_TradeOffer                 = 1,
	MST_SeatSwapOffer              = 2,
	MST_DLCPrompt                  = 3,
	MST_MAX                        = 4,
};

enum class EMainMenuViewpointType : uint8
{
	TitleScreen                    = 0,
	OptionsMenu                    = 1,
	PlaythroughMode                = 2,
	NewGameSettings                = 3,
	MainMenuGroup                  = 4,
	CharacterSelect                = 5,
	MAX                            = 6,
};

enum class EVehicleDeathType : uint8
{
	None                           = 0,
	HealthDepleted                 = 1,
	FellOutOfWorld                 = 2,
	DigistuctOut                   = 3,
	InstantDeath                   = 4,
	EVehicleDeathType_MAX          = 5,
};

enum class EClearInputFilter : uint8
{
	ClearWeapons                   = 1,
	ClearInputComponent            = 2,
	DisableHover                   = 4,
	ClearAll                       = 255,
	EClearInputFilter_MAX          = 256,
};

enum class ENavPainterLayer : uint8
{
	Default                        = 0,
	Driver                         = 1,
	Scripted                       = 2,
	ENavPainterLayer_MAX           = 3,
};

enum class ENavCorrectionSetting : uint8
{
	Default                        = 0,
	Enabled                        = 1,
	Disabled                       = 2,
	ENavCorrectionSetting_MAX      = 3,
};

enum class EVehicleHealthState : uint8
{
	Healthy                        = 0,
	Low                            = 1,
	VeryLow                        = 2,
	Dead                           = 3,
	EVehicleHealthState_MAX        = 4,
};

enum class EActivityFeedImageAspectRatio : uint8
{
	FEED_IMAGE_ASPECT_RATIO_1_X_1  = 0,
	FEED_IMAGE_ASPECT_RATIO_1_51_X_1 = 1,
	FEED_IMAGE_ASPECT_RATIO_2_08_X_1 = 2,
	FEED_IMAGE_ASPECT_RATIO_16_X_9 = 3,
	FEED_IMAGE_ASPECT_RATIO_4_X_3  = 4,
	FEED_IMAGE_ASPECT_RATIO_MAX    = 5,
};

enum class EAIOOrientedParticleTargetType : uint8
{
	None                           = 0,
	DefaultPosition                = 1,
	UIObject                       = 2,
	EAIOOrientedParticleTargetType_MAX = 3,
};

enum class EA9KFightPhase : uint8
{
	NotStarted                     = 0,
	Phase1                         = 1,
	Phase2                         = 2,
	Phase3                         = 3,
	Phase4                         = 4,
	Dead                           = 5,
	EA9KFightPhase_MAX             = 6,
};

enum class EVehicleAchetypeNative : uint8
{
	Null                           = 0,
	Technical                      = 1,
	Outrunner                      = 2,
	Revolver                       = 3,
	Emperor                        = 4,
	Num                            = 5,
	EVehicleAchetypeNative_MAX     = 6,
};

enum class EHeldActorPreset : uint8
{
	Explosive                      = 0,
	Melee                          = 1,
	Shield                         = 2,
	EHeldActorPreset_MAX           = 3,
};

enum class ECarnivoraBones : uint8
{
	Root                           = 0,
	RW_Root                        = 1,
	RW_SuspensionR0                = 2,
	RW_SuspensionR1                = 3,
	RW_Wheel0                      = 4,
	RW_Tire0                       = 5,
	RW_Wheel1                      = 6,
	RW_Tire1                       = 7,
	RW_Wheel2                      = 8,
	RW_Tire2                       = 9,
	RW_SuspensionB0                = 10,
	RW_SuspensionB1                = 11,
	TrackShaft3                    = 12,
	TrackSuspension3               = 13,
	TrackTire3                     = 14,
	TrackShaft3_T                  = 15,
	SideAxle                       = 16,
	TrackShaft0                    = 17,
	TrackSuspension2               = 18,
	TrackTire2                     = 19,
	TrackShaft0_T                  = 20,
	SideAxle1                      = 21,
	TrackShaft1                    = 22,
	SideAxleSecondary              = 23,
	TrackSuspension1               = 24,
	TrackTire1                     = 25,
	TrackShaft1_T                  = 26,
	SideAxleSecondary1             = 27,
	SideAxle2                      = 28,
	TrackShaft2                    = 29,
	TrackSuspension0               = 30,
	TrackTire0                     = 31,
	TrackShaft2_T                  = 32,
	TunnelDoor                     = 33,
	MainAxle                       = 34,
	MainAxle_Part1                 = 35,
	MainAxle_Part2                 = 36,
	Count                          = 37,
	ECarnivoraBones_MAX            = 38,
};

enum class EEmperorBones : uint8
{
	Body                           = 0,
	Cannon_Yaw                     = 1,
	Cannon_Pitch                   = 2,
	Cannon_Recoil                  = 3,
	EntropyCore                    = 4,
	CannonTurret_Main              = 5,
	CannonTurret_Pitch             = 6,
	L_Turret_Yaw                   = 7,
	L_Turret_Pitch                 = 8,
	R_Turret_Yaw                   = 9,
	R_Turret_Pitch                 = 10,
	F_R_Wheel                      = 11,
	F_R_Wheel1                     = 12,
	F_R_Wheel2                     = 13,
	F_L_Wheel                      = 14,
	F_L_Wheel1                     = 15,
	F_L_Wheel2                     = 16,
	R_R_Wheel                      = 17,
	R_L_Wheel                      = 18,
	R_L_Wheel1                     = 19,
	R_R_Wheel1                     = 20,
	F_L_ThreadSuspension           = 21,
	F_R_ThreadSuspension           = 22,
	F_L_BigWheel_Suspension        = 23,
	F_R_BigWheel_Suspension        = 24,
	F_R_Hover01                    = 25,
	F_R_Hover02                    = 26,
	F_R_Hover03                    = 27,
	F_L_Hover01                    = 28,
	F_L_Hover02                    = 29,
	F_L_Hover03                    = 30,
	R_R_Hover01                    = 31,
	R_R_Hover02                    = 32,
	R_L_Hover01                    = 33,
	R_L_Hover02                    = 34,
	Count                          = 35,
	EEmperorBones_MAX              = 36,
};

enum class EOutrunnerBoosterBones : uint8
{
	Body                           = 0,
	L_Muffler                      = 1,
	R_Muffler                      = 2,
	M_Turbine                      = 3,
	L_Turbine                      = 4,
	R_Turbine                      = 5,
	L_Top_Muffler                  = 6,
	L_Bot_Muffler                  = 7,
	R_Top_Muffler                  = 8,
	R_Bot_Muffler                  = 9,
	L_Razor_Wing                   = 10,
	R_Razor_Wing                   = 11,
	Count                          = 12,
	EOutrunnerBoosterBones_MAX     = 13,
};

enum class EOutrunnerBones : uint8
{
	Body                           = 0,
	F_L_SuspensionArm              = 1,
	F_L_Steering                   = 2,
	F_L_Wheel                      = 3,
	F_R_SuspensionArm              = 4,
	F_R_Steering                   = 5,
	F_R_Wheel                      = 6,
	R_L_SuspensionArm              = 7,
	R_L_Steering                   = 8,
	R_L_Wheel                      = 9,
	R_R_SuspensionArm              = 10,
	R_R_Steering                   = 11,
	R_R_Wheel                      = 12,
	Turret_Yaw                     = 13,
	F_Cannon                       = 14,
	F_Cannon_Visual                = 15,
	Turret_Pitch                   = 16,
	SteeringWheel                  = 17,
	F_L_Spring01                   = 18,
	F_L_Spring02                   = 19,
	F_R_Spring01                   = 20,
	F_R_Spring02                   = 21,
	R_L_Spring01                   = 22,
	R_L_Spring02                   = 23,
	R_R_Spring01                   = 24,
	R_R_Spring02                   = 25,
	SeatMain                       = 26,
	Count                          = 27,
	EOutrunnerBones_MAX            = 28,
};

enum class ERevolverBoosterBones : uint8
{
	Root                           = 0,
	Main                           = 1,
	Muffler                        = 2,
	Helix                          = 3,
	Count                          = 4,
	ERevolverBoosterBones_MAX      = 5,
};

enum class ERevolverBones : uint8
{
	Body_Banking                   = 0,
	Body_Pitch                     = 1,
	Wheels                         = 2,
	SteeringWheel                  = 3,
	Count                          = 4,
	ERevolverBones_MAX             = 5,
};

enum class ETechnicalBones : uint8
{
	Body                           = 0,
	LeftMuffler                    = 1,
	RightMuffler                   = 2,
	Engine                         = 3,
	R_Axle                         = 4,
	R_R_Wheel                      = 5,
	R_L_Wheel                      = 6,
	F_R_Wheel                      = 7,
	F_L_Wheel                      = 8,
	F_L_Axle                       = 9,
	F_L_Steering                   = 10,
	F_L_Steering_T                 = 11,
	F_L_SteeringShaft              = 12,
	F_L_SuspensionUp               = 13,
	F_L_SuspensionBodyUp_T         = 14,
	F_L_SuspensionBodyDn           = 15,
	F_L_SuspensionDn_T             = 16,
	F_L_SuspensionSprings          = 17,
	F_L_SuspensionSpringsBody      = 18,
	F_R_Axle                       = 19,
	F_R_Steering                   = 20,
	F_R_Steering_T                 = 21,
	F_R_SteeringShaft              = 22,
	F_R_SuspensionUp               = 23,
	F_R_SuspensionBodyUp_T         = 24,
	F_R_SuspensionBodyDn           = 25,
	F_R_SuspensionDn_T             = 26,
	F_R_SuspensionSprings          = 27,
	F_R_SuspensionSpringsBody      = 28,
	F_Cannon                       = 29,
	F_Cannon_Visual                = 30,
	Turret                         = 31,
	Player2                        = 32,
	R_DriveShaftPole               = 33,
	R_DriveShaftBodyPole           = 34,
	R_DriveShaftAttach             = 35,
	R_DriveShaftBodyAttach         = 36,
	F_R_DriveShaft00               = 37,
	F_R_DriveShaft01               = 38,
	F_R_DriveShaft02               = 39,
	F_L_DriveShaft00               = 40,
	F_L_DriveShaft01               = 41,
	F_L_DriveShaft02               = 42,
	SteeringWheel                  = 43,
	F_R_Wheel_Hover                = 44,
	F_L_Wheel_Hover                = 45,
	R_R_Wheel_Hover                = 46,
	R_L_Wheel_Hover                = 47,
	F_DriveShaftAttach             = 48,
	F_DriveShaftPole               = 49,
	F_DriveShaftBodyAttach         = 50,
	R_L_Suspension_Body            = 51,
	R_L_Suspension_Axle            = 52,
	R_R_Suspension_Body            = 53,
	R_R_Suspension_Axle            = 54,
	EngineShaft                    = 55,
	EngineBelt                     = 56,
	Seat                           = 57,
	Count                          = 58,
	ETechnicalBones_MAX            = 59,
};

enum class ETrailerBones : uint8
{
	F_Axle                         = 0,
	F_R_Wheel                      = 1,
	F_L_Wheel                      = 2,
	R_Axle                         = 3,
	R_R_Wheel                      = 4,
	R_L_Wheel                      = 5,
	R_R_Spring_Axle                = 6,
	R_L_Spring_Axle                = 7,
	R_R_Spring_Body                = 8,
	R_L_Spring_Body                = 9,
	Count                          = 10,
	ETrailerBones_MAX              = 11,
};

enum class EDualWeaponBones : uint8
{
	Root                           = 0,
	Main                           = 1,
	Base                           = 2,
	L_Base                         = 3,
	L_Shoulder                     = 4,
	L_Elbow                        = 5,
	L_End                          = 6,
	L_Elbow_Piston                 = 7,
	L_Shoulder_Piston              = 8,
	L_Pitch                        = 9,
	L_Projectile                   = 10,
	R_Base                         = 11,
	R_Shoulder                     = 12,
	R_Elbow                        = 13,
	R_End                          = 14,
	R_Elbow_Piston                 = 15,
	R_Shoulder_Piston              = 16,
	R_Pitch                        = 17,
	R_Projectile                   = 18,
	L_BaseAttach                   = 19,
	R_BaseAttach                   = 20,
	Count                          = 21,
	EDualWeaponBones_MAX           = 22,
};

enum class EWeaponBones : uint8
{
	None                           = 0,
	Root                           = 1,
	Main                           = 2,
	Turret_Yaw                     = 3,
	Turret_Pitch                   = 4,
	Cannon_Yaw                     = 5,
	Cannon_Pitch                   = 6,
	Projectile                     = 7,
	Count                          = 8,
	EWeaponBones_MAX               = 9,
};

enum class EIntroType : uint8
{
	EnterFromGround                = 0,
	EnterFromSwapSeat              = 1,
	HijackFromGround               = 2,
	HijackFromSwapSeat             = 3,
	EIntroType_MAX                 = 4,
};

enum class ECARStatus : uint8
{
	Locked                         = 0,
	Unfolding                      = 1,
	Active                         = 2,
	Inactive                       = 3,
	ECARStatus_MAX                 = 4,
};

enum class ECarnivoraFakeTurretShootingStyle : uint8
{
	TARGET_AROUND_PLAYER           = 0,
	CONE_IN_DIRECTION              = 1,
	ECarnivoraFakeTurretShootingStyle_MAX = 2,
};

enum class ECarnivoraAverageLocation : uint8
{
	FRONT_RIGHT                    = 0,
	FRONT_LEFT                     = 1,
	BACK_RIGHT                     = 2,
	BACK_LEFT                      = 3,
	NUM                            = 4,
	ECarnivoraAverageLocation_MAX  = 5,
};

enum class ECarnivoraPartName : uint8
{
	FRONT_WHEEL_0                  = 0,
	FRONT_WHEEL_1                  = 1,
	FRONT_WHEEL_2                  = 2,
	TIRE_TRACK_0                   = 3,
	TIRE_TRACK_1                   = 4,
	TIRE_TRACK_2                   = 5,
	TIRE_TRACK_3                   = 6,
	NUM                            = 7,
	ECarnivoraPartName_MAX         = 8,
};

enum class ECARRestrictionType : uint8
{
	Default                        = 0,
	DLC3                           = 1,
	ECARRestrictionType_MAX        = 2,
};

enum class ECARPartType : uint8
{
	Wheel                          = 1,
	Armor                          = 2,
	CoreMod                        = 3,
	GunnerWeapon                   = 4,
	DriverWeapon                   = 5,
	Ornament                       = 6,
	MaterialDecal                  = 7,
	Material                       = 8,
	None                           = 9,
	ECARPartType_MAX               = 10,
};

enum class ECharacterEchoDataMediaPlaybackType : int32
{
	PlayAndClose                   = 0,
	LoopUntilAudioEnds             = 1,
	ECharacterEchoDataMediaPlaybackType_MAX = 2,
};

enum class ECrosshairColorsEnum : uint8
{
	NONE                           = 0,
	WHITE                          = 1,
	GREEN                          = 2,
	RED                            = 3,
	TEAL                           = 4,
	ORANGE                         = 5,
	PURPLE                         = 6,
	MAX                            = 7,
};

enum class EDaffodilChallengeBonusCategory : int32
{
	CrewChallenge                  = 0,
	Shrine                         = 1,
	EDaffodilChallengeBonusCategory_MAX = 2,
};

enum class EDamagePresentationLevel : uint8
{
	Negligible                     = 0,
	Low                            = 1,
	Medium                         = 2,
	High                           = 3,
	MAX                            = 4,
};

enum class ECullableIORequirement : uint8
{
	None                           = 0,
	Medium_DetailMode              = 1,
	Medium_SpawnCost               = 2,
	High_DetailMode                = 3,
	High_SpawnCost                 = 4,
	ECullableIORequirement_MAX     = 5,
};

enum class EDiscoveryAreaDrawStyle : uint8
{
	None                           = 0,
	Wire                           = 1,
	Solid                          = 2,
	SolidAndWire                   = 3,
	EDiscoveryAreaDrawStyle_MAX    = 4,
};

enum class EDuelTotemDestroyReason : uint8
{
	None                           = 0,
	TimedOut                       = 1,
	Canceled                       = 2,
	DuelFinished                   = 3,
	EDuelTotemDestroyReason_MAX    = 4,
};

enum class EPotentialDuelState : uint8
{
	None                           = 0,
	WaitingToBeAccepted            = 1,
	WaitingToStart                 = 2,
	Started                        = 3,
	EPotentialDuelState_MAX        = 4,
};

enum class EActiveDuelStatus : uint8
{
	WaitingToStart                 = 0,
	InProgress                     = 1,
	Finished                       = 2,
	EActiveDuelStatus_MAX          = 3,
};

enum class EDuelMode : uint8
{
	OnFoot                         = 0,
	Vehicle                        = 1,
	EDuelMode_MAX                  = 2,
};

enum class EBonusObjectiveState : uint8
{
	Active                         = 0,
	Succeded                       = 1,
	Failed                         = 2,
	EBonusObjectiveState_MAX       = 3,
};

enum class EBonusObjectiveType : uint8
{
	Activate                       = 0,
	Defend                         = 1,
	Destroy                        = 2,
	Entrapment                     = 3,
	KillConfirmed                  = 4,
	SacredGround                   = 5,
	TimeTrial                      = 6,
	Fusion                         = 7,
	EBonusObjectiveType_MAX        = 8,
};

enum class ECanSprintResult : uint8
{
	Yes                            = 0,
	No                             = 1,
	Cancel                         = 2,
	ECanSprintResult_MAX           = 3,
};

enum class EEchoLogBlockedStartMethod : uint8
{
	Cancel                         = 0,
	PlayInWorldOnly                = 1,
	Queue                          = 2,
	Interrupt                      = 3,
	EEchoLogBlockedStartMethod_MAX = 4,
};

enum class EEchoLogDisplayCategory : uint8
{
	EchoLog                        = 0,
	EEchoLogDisplayCategory_MAX    = 1,
};

enum class EDamagePresentationModifier : uint8
{
	Default                        = 0,
	Increase                       = 1,
	Decrease                       = 2,
	EDamagePresentationModifier_MAX = 3,
};

enum class EElementalEffectSizeComputationType : uint8
{
	BoundsSphereRadius             = 0,
	BoundsBoxExtentMaxAxis         = 1,
	EElementalEffectSizeComputationType_MAX = 2,
};

enum class EElementalInteractionMode : uint8
{
	Default                        = 0,
	OnlyTransmit                   = 1,
	OnlyReceive                    = 2,
	EElementalInteractionMode_MAX  = 3,
};

enum class EElementalInteractionSourceMode : uint8
{
	Default                        = 0,
	Always                         = 1,
	Never                          = 2,
	OnlyThroughBlueprint           = 3,
	EElementalInteractionSourceMode_MAX = 4,
};

enum class EPuddleState : uint8
{
	Spawning                       = 0,
	Idle                           = 1,
	CleaningUp                     = 2,
	CleanedUp                      = 3,
	EPuddleState_MAX               = 4,
};

enum class EEndlessDungeonSerialNumberState : uint8
{
	Empty                          = 0,
	Writing                        = 1,
	Full                           = 2,
	Reading                        = 3,
	Encrypted                      = 4,
	EEndlessDungeonSerialNumberState_MAX = 5,
};

enum class ENativeEnemyExperienceType : uint8
{
	Chump                          = 0,
	Normal                         = 1,
	NormalHigh                     = 2,
	Tough                          = 3,
	ToughHigh                      = 4,
	Badass                         = 5,
	SuperBadass                    = 6,
	UltimateBadass                 = 7,
	Boss                           = 8,
	Summoned                       = 9,
	Tutorial                       = 10,
	ENativeEnemyExperienceType_MAX = 11,
};

enum class EOakPlayerClass : uint8
{
	None                           = 0,
	Barbarian                      = 1,
	GunMage                        = 2,
	KnightOfTheClaw                = 3,
	Necromancer                    = 4,
	Ranger                         = 5,
	Rogue                          = 6,
	Shaman                         = 7,
	EOakPlayerClass_MAX            = 8,
};

enum class EWeaponInputChannel : uint8
{
	Channel1                       = 0,
	Channel2                       = 1,
	EWeaponInputChannel_MAX        = 255,
};

enum class EWeaponUseMode : uint8
{
	Mode1                          = 0,
	Mode2                          = 1,
	Mode3                          = 2,
	EWeaponUseMode_MAX             = 255,
};

enum class EFriendEventPriority : uint8
{
	Highest                        = 0,
	High                           = 1,
	Normal                         = 2,
	Low                            = 3,
	EFriendEventPriority_MAX       = 4,
};

enum class EFriendEventType : uint8
{
	None                           = 0,
	LevelUp                        = 1,
	GearSold                       = 2,
	GearReceived                   = 3,
	PlotMissionCompletion          = 4,
	SideMissionCompletion          = 5,
	PropagateRareSpawnMission      = 6,
	KilledEnemy                    = 7,
	KilledNamedEnemy               = 8,
	KilledBoss                     = 9,
	Unclaimed_00                   = 10,
	ChallengeUpdate                = 11,
	ChallengeCompletion            = 12,
	ProvingGroundCompletion        = 13,
	CircleOfSlaughterCompletion    = 14,
	RaidCompletion                 = 15,
	UnlockedTrueVaultHunterMode    = 16,
	SlotMachineJackpot             = 17,
	OpenedGoldenChest              = 18,
	SentMail                       = 19,
	FriendGearPurchased            = 20,
	LookingForHelp                 = 21,
	AchievementUnlocked            = 22,
	ChallengeUpdatesMerged         = 23,
	LikedEvent                     = 24,
	CustomizationAcquired          = 25,
	Max                            = 26,
};

enum class EFriendEventNotificationLifetime : uint8
{
	Normal                         = 0,
	Long                           = 1,
	VeryLong                       = 2,
	EFriendEventNotificationLifetime_MAX = 3,
};

enum class EFriendEventNotificationFrequency : uint8
{
	Off                            = 0,
	VeryLow                        = 1,
	Low                            = 2,
	Normal                         = 3,
	High                           = 4,
	VeryHigh                       = 5,
	EFriendEventNotificationFrequency_MAX = 6,
};

enum class EFrontendStandInAnimType : uint8
{
	Default                        = 0,
	CharacterSelect                = 1,
	CharacterCreate                = 2,
	RnRCharaterCreate              = 3,
	EFrontendStandInAnimType_MAX   = 4,
};

enum class EOakCharacterMovementConditionType : uint8
{
	IsGroundSlamming               = 0,
	IsLandingFromGroundSlam        = 1,
	EOakCharacterMovementConditionType_MAX = 2,
};

enum class EBoostChargeCountComparisonMode : uint8
{
	Equal                          = 0,
	NotEqual                       = 1,
	GreaterThan                    = 2,
	GreaterThanOrEqual             = 3,
	SmallerThan                    = 4,
	SmallerThanOrEqual             = 5,
	FullCharges                    = 6,
	EBoostChargeCountComparisonMode_MAX = 7,
};

enum class EBoostPoolValueComparisonMode : uint8
{
	Equal                          = 0,
	NotEqual                       = 1,
	GreaterThan                    = 2,
	GreaterThanOrEqual             = 3,
	SmallerThan                    = 4,
	SmallerThanOrEqual             = 5,
	EBoostPoolValueComparisonMode_MAX = 6,
};

enum class EGbxGFxDialogBoxButtonType : uint8
{
	ListButtons                    = 0,
	HintBox                        = 1,
	EGbxGFxDialogBoxButtonType_MAX = 2,
};

enum class EGbxGFxDialogBoxStyle : uint8
{
	Default                        = 0,
	Warning                        = 1,
	Error                          = 2,
	Keybinding                     = 3,
	EGbxGFxDialogBoxStyle_MAX      = 4,
};

enum class EShiftReportReason : int32
{
	Username                       = 0,
	Sportsmanship                  = 1,
	Abuse                          = 2,
	HateSpeech                     = 3,
	LeavingOrAfk                   = 4,
	Cheating                       = 5,
	UserGeneratedContent           = 6,
	IllicitBehavior                = 7,
	EShiftReportReason_MAX         = 8,
};

enum class EGbxInputEvent_OakUIAxis_Events : uint8
{
	Pressed                        = 0,
	Held                           = 1,
	Released                       = 2,
	EGbxInputEvent_OakUIAxis_MAX   = 3,
};

enum class EGeyserBehavior : uint8
{
	None                           = 0,
	Intermittent                   = 1,
	AlwaysOn                       = 2,
	EGeyserBehavior_MAX            = 3,
};

enum class EGeyserState : uint8
{
	None                           = 0,
	SteamOn                        = 1,
	SteamOff                       = 2,
	SteamAnticipationOn            = 3,
	SteamAnticipationOff           = 4,
	EGeyserState_MAX               = 5,
};

enum class EBuddyWidgetFanfareState : uint8
{
	None                           = 0,
	LevelUp                        = 1,
	SecondWind                     = 2,
	EBuddyWidgetFanfareState_MAX   = 3,
};

enum class EBuddyWidgetState : uint8
{
	Healthy                        = 0,
	Healthy_JustRespawned          = 1,
	Dying                          = 2,
	BeingRevived                   = 3,
	Respawning                     = 4,
	RespawnTimer                   = 5,
	Spectating                     = 6,
	EBuddyWidgetState_MAX          = 7,
};

enum class EBuddyWidgetContainerAnimState : uint8
{
	Inactive                       = 0,
	SlideIn                        = 1,
	SlideOut                       = 2,
	SlideDown                      = 3,
	EBuddyWidgetContainerAnimState_MAX = 4,
};

enum class EGFxChallegeProgressWidgetState : int32
{
	Off                            = 0,
	On                             = 1,
	Out                            = 2,
	EGFxChallegeProgressWidgetState_MAX = 3,
};

enum class ECheckpointWidgetState : uint8
{
	None                           = 0,
	Hidden                         = 1,
	Intro                          = 2,
	Idle                           = 3,
	Exit                           = 4,
	ECheckpointWidgetState_MAX     = 5,
};

enum class EColorPickerMode : uint8
{
	All                            = 0,
	PrimarySecondary               = 1,
	PrimaryOnly                    = 2,
	EColorPickerMode_MAX           = 3,
};

enum class EColorSelectionType : uint8
{
	TopColor                       = 0,
	BottomColor                    = 1,
	ResetBothToDefault             = 2,
	EColorSelectionType_MAX        = 3,
};

enum class ECrosshairType : uint8
{
	NORMAL                         = 0,
	ECrosshairType_MAX             = 1,
};

enum class ECrosshairState : uint8
{
	NORMAL                         = 0,
	ACTION_SKILL                   = 1,
	SPRINTING                      = 2,
	MELEE                          = 3,
	ECrosshairState_MAX            = 4,
};

enum class EGFxCurrencyCounterState : int32
{
	Off                            = 0,
	AnimatingToValue               = 1,
	HoldingOnValue                 = 2,
	EGFxCurrencyCounterState_MAX   = 3,
};

enum class EECHOLOGWidgetState : uint8
{
	Inactive                       = 0,
	Activating                     = 1,
	Displayed                      = 2,
	Deactivating                   = 3,
	EECHOLOGWidgetState_MAX        = 4,
};

enum class EECHOWidgetState : uint8
{
	Inactive                       = 0,
	Activating                     = 1,
	Displayed                      = 2,
	Deactivating                   = 3,
	EECHOWidgetState_MAX           = 4,
};

enum class EGFxFeedWidgetState : int32
{
	Off                            = 0,
	On                             = 1,
	Out                            = 2,
	EGFxFeedWidgetState_MAX        = 3,
};

enum class EFFYLBarState : uint8
{
	Dying                          = 0,
	BeingRevived                   = 1,
	Reviving                       = 2,
	EFFYLBarState_MAX              = 3,
};

enum class EGFxGrenadeIndicatorMode : int32
{
	Hidden                         = 0,
	Safe                           = 1,
	Danger                         = 2,
	EGFxGrenadeIndicatorMode_MAX   = 3,
};

enum class EPromptLinesLayouts : uint8
{
	INVALID                        = 0,
	PrimaryPress                   = 1,
	PrimaryHold                    = 2,
	PrimaryPress_PrimaryHold       = 3,
	PrimaryPress_SecondaryPress    = 4,
	PrimaryPress_SecondaryHold     = 5,
	PrimaryHold_SecondaryPress     = 6,
	PrimaryHold_SecondaryHold      = 7,
	EPromptLinesLayouts_MAX        = 8,
};

enum class EInteractionPromptGlyphMode : uint8
{
	InvalidForUseDef               = 0,
	Normal                         = 1,
	CantUse                        = 2,
	Locked                         = 3,
	EInteractionPromptGlyphMode_MAX = 4,
};

enum class EGFxInventoryMenuBackpackSize : uint8
{
	TwoColumns                     = 0,
	OneColumn                      = 1,
	EGFxInventoryMenuBackpackSize_MAX = 2,
};

enum class EGFxInventoryMenuFocusSide : uint8
{
	None                           = 0,
	PaperDoll                      = 1,
	Backpack                       = 2,
	EGFxInventoryMenuFocusSide_MAX = 3,
};

enum class EGFxInWorldIconClampUpdate : uint8
{
	Unknown                        = 0,
	NotClamped                     = 1,
	ClampedInFront                 = 2,
	ClampedBehind                  = 3,
	EGFxInWorldIconClampUpdate_MAX = 4,
};

enum class EInWorldIconRange : uint8
{
	None                           = 0,
	Near                           = 1,
	Far                            = 2,
	EInWorldIconRange_MAX          = 3,
};

enum class EBackButtonHint : uint8
{
	Back                           = 0,
	Cancel                         = 1,
	Exit                           = 2,
	EBackButtonHint_MAX            = 3,
};

enum class ETradingMenuState : uint8
{
	Offering                       = 0,
	Backpack                       = 1,
	Done                           = 2,
	ETradingMenuState_MAX          = 3,
};

enum class EGFxMapMenuProgressPanelState : uint8
{
	None                           = 0,
	Progress                       = 1,
	List                           = 2,
	EGFxMapMenuProgressPanelState_MAX = 3,
};

enum class EDetailsPanelMode : uint8
{
	Unknown                        = 0,
	NoTarget                       = 1,
	POIInfo                        = 2,
	Challenge                      = 3,
	Mission                        = 4,
	PlanetOverview                 = 5,
	LevelOverview                  = 6,
	POIInfoPlayer                  = 7,
	EDetailsPanelMode_MAX          = 8,
};

enum class EGFxMapMenuState : uint8
{
	None                           = 0,
	Tutorial_Stage1                = 1,
	Tutorial_Stage2                = 2,
	Tutorial_Stage3                = 3,
	Tutorial_Stage4                = 4,
	Tutorial_Stage5                = 5,
	Progress                       = 6,
	FastTravel                     = 7,
	Challenges                     = 8,
	Friends                        = 9,
	EGFxMapMenuState_MAX           = 10,
};

enum class EGFxMapMenuMapState : uint8
{
	None                           = 0,
	Level                          = 1,
	Planet                         = 2,
	Galaxy                         = 3,
	Overworld                      = 4,
	EGFxMapMenuMapState_MAX        = 5,
};

enum class EGFxMenuTutorialFocusDirection : int32
{
	Center                         = 0,
	Left                           = 1,
	Right                          = 2,
	SameAsStardard                 = 3,
	EGFxMenuTutorialFocusDirection_MAX = 4,
};

enum class EGFxMenuTutorialDialogSize : int32
{
	Large                          = 0,
	Medium                         = 1,
	Small                          = 2,
	EGFxMenuTutorialDialogSize_MAX = 3,
};

enum class EGFxMinimapWidgetIconTrackedType : uint8
{
	Unused                         = 0,
	Mission                        = 1,
	MinimapIconComponent           = 2,
	CustomWaypoint                 = 3,
	PlayerIcon                     = 4,
	EGFxMinimapWidgetIconTrackedType_MAX = 5,
};

enum class EGFxMissionLogMissionItemType : uint8
{
	Mission                        = 0,
	EchoLog                        = 1,
	Header                         = 2,
	EGFxMissionLogMissionItemType_MAX = 3,
};

enum class EGFxMissionLogFilterType : uint8
{
	None                           = 0,
	MissionLogMissionType          = 1,
	MissionLogByExpansion          = 2,
	MissionLogByRegion             = 3,
	EGFxMissionLogFilterType_MAX   = 4,
};

enum class EGFxMissionLogNavType : uint8
{
	None                           = 0,
	Missions                       = 1,
	EchoLog                        = 2,
	EGFxMissionLogNavType_MAX      = 3,
};

enum class EGFxMissionLogMissionIconType : uint8
{
	Normal                         = 0,
	Plot                           = 1,
	Side                           = 2,
	Contract                       = 3,
	EchoLog                        = 4,
	Complete                       = 5,
	Ignored                        = 6,
	Failed                         = 7,
	HardMission                    = 8,
	EGFxMissionLogMissionIconType_MAX = 9,
};

enum class ETargetedNameplateState : uint8
{
	NotShowingTarget_Linger        = 0,
	NotShowingTarget               = 1,
	ShowingValidTarget             = 2,
	ShowingDyingTarget             = 3,
	ETargetedNameplateState_MAX    = 4,
};

enum class ENameplateStyle : uint8
{
	Targeted                       = 0,
	BossBar                        = 1,
	Overhead                       = 2,
	ENameplateStyle_MAX            = 3,
};

enum class EOverheadNameplateDisplayState : uint8
{
	None                           = 0,
	CenteredName_Name              = 1,
	CenteredName_Arrow             = 2,
	State_Name                     = 3,
	State_Arrow                    = 4,
	EOverheadNameplateDisplayState_MAX = 5,
};

enum class EOverheadNameplateHealthState : uint8
{
	Healthy                        = 0,
	Dying                          = 1,
	BeingRevived                   = 2,
	Respawning                     = 3,
	EOverheadNameplateHealthState_MAX = 4,
};

enum class EGFxPlayerStorageMenuItemAction : uint8
{
	None                           = 0,
	MoveToBank                     = 1,
	MoveToInventory                = 2,
	Inspect                        = 3,
	EGFxPlayerStorageMenuItemAction_MAX = 4,
};

enum class EGFxPlayerStorageMenuState : uint8
{
	None                           = 0,
	BankRetrieve                   = 1,
	BackpackDeposit                = 2,
	CompareBankFocused             = 3,
	CompareBackpackFocused         = 4,
	EGFxPlayerStorageMenuState_MAX = 5,
};

enum class EQuickChangeMenuSortMode : uint8
{
	Rarity                         = 0,
	Alphabetic                     = 1,
	NewToOld                       = 2,
	EQuickChangeMenuSortMode_MAX   = 3,
};

enum class EBaseQuickChangeChoiceType : uint8
{
	Skin                           = 0,
	Head                           = 1,
	Body                           = 2,
	Emote                          = 3,
	Color                          = 4,
	Respec                         = 5,
	EBaseQuickChangeChoiceType_MAX = 6,
};

enum class EBaseQuickChangeMenuState : uint8
{
	CategorySelection              = 0,
	BodySelection                  = 1,
	HeadSelection                  = 2,
	SkinSelection                  = 3,
	ColorSelection                 = 4,
	EmoteSelection                 = 5,
	Respec                         = 6,
	None                           = 7,
	MAX                            = 8,
};

enum class EReloadWidgetDisplayState : uint8
{
	Default                        = 0,
	AmmoLow                        = 1,
	NoSpareAmmo                    = 2,
	NoAmmoAtAll                    = 3,
	EReloadWidgetDisplayState_MAX  = 4,
};

enum class ESkillItemActionState : uint8
{
	None                           = 0,
	CanEquipPrimary                = 1,
	CanEquipSecondary              = 2,
	CanEquipBoth                   = 3,
	BlockedByTutorial              = 4,
	NoPointsToSpend                = 5,
	Unlock                         = 6,
	AddPoint                       = 7,
	Maxed                          = 8,
	NotEnoughBranchPoints          = 9,
	RequiresTreeUnlock             = 10,
	RequiresOtherSkill             = 11,
	ESkillItemActionState_MAX      = 12,
};

enum class ESkillItemUnlockAnimState : uint8
{
	Uninitialized                  = 0,
	Unplayed                       = 1,
	Played                         = 2,
	ESkillItemUnlockAnimState_MAX  = 3,
};

enum class ESkillScreenItemPurchaseState : uint8
{
	CannotPurchase                 = 0,
	FirstPoint                     = 1,
	AddPoints                      = 2,
	MaxPoints                      = 3,
	ESkillScreenItemPurchaseState_MAX = 4,
};

enum class ESkillScreenReceiveHighlightState : uint8
{
	Off                            = 0,
	Available                      = 1,
	Active                         = 2,
	ESkillScreenReceiveHighlightState_MAX = 3,
};

enum class ESkillScreenLoadoutSlotClearability : uint8
{
	CannotClear_Error              = 0,
	CannotClear_SlotEmpty          = 1,
	CannotClear_SlotMustBeFilled   = 2,
	CannotClear_AbilityInUse       = 3,
	CanClear                       = 4,
	ESkillScreenLoadoutSlotClearability_MAX = 5,
};

enum class EGFxSkillScreenLoadoutChoiceEquipState : uint8
{
	Locked                         = 0,
	Available                      = 1,
	Equipped                       = 2,
	EGFxSkillScreenLoadoutChoiceEquipState_MAX = 3,
};

enum class EGFxSkillScreenState : uint8
{
	None                           = 0,
	BranchesFocused                = 1,
	LoadoutEdit                    = 2,
	PlayingUnlockAnim              = 3,
	TreeLocked_Info                = 4,
	TreeLocked_Branches            = 5,
	DraggingSkillItem              = 6,
	EGFxSkillScreenState_MAX       = 7,
};

enum class ESkillScreenSlotType : uint8
{
	None                           = 0,
	Compatible                     = 1,
	All                            = 2,
	ESkillScreenSlotType_MAX       = 3,
};

enum class EGFxStatusMenuTransitionReason : uint8
{
	None                           = 0,
	Pushed                         = 1,
	NextPage                       = 2,
	PrevPage                       = 3,
	Switched                       = 4,
	Popped                         = 5,
	EGFxStatusMenuTransitionReason_MAX = 6,
};

enum class ESubtitleLayoutType : uint8
{
	None                           = 0,
	SubtitlesOnly                  = 1,
	ClosedCaptionsOnly             = 2,
	Both                           = 3,
	ESubtitleLayoutType_MAX        = 4,
};

enum class EGbxGFxSpinnerWidgetGoToMethod : uint8
{
	FromCurrent                    = 0,
	Immediately                    = 1,
	EGbxGFxSpinnerWidgetGoToMethod_MAX = 2,
};

enum class EGFxVaultHunterProfileCardView : uint8
{
	Skill                          = 0,
	Inventory                      = 1,
	Stat                           = 2,
	EGFxVaultHunterProfileCardView_MAX = 3,
};

enum class EGFxVaultHunterProfileCardMode : uint8
{
	Unknown                        = 0,
	Friend                         = 1,
	Self                           = 2,
	EGFxVaultHunterProfileCardMode_MAX = 3,
};

enum class EGFxVendingMachineMenuBackpackState : int32
{
	Unknown                        = 0,
	Buy                            = 1,
	Sell                           = 2,
	Compare                        = 3,
	CompareToMachine               = 4,
	EGFxVendingMachineMenuBackpackState_MAX = 5,
};

enum class EVendingMachineSocketMapStates : uint8
{
	SOCKETMAP_BUY                  = 0,
	SOCKETMAP_SELL                 = 1,
	SOCKETMAP_COMPARE              = 2,
	SOCKETMAP_VENDINGCOMPARE       = 3,
	SOCKETMAP_MAX                  = 4,
};

enum class EGFxVendingMachineDisplayMode : uint8
{
	GFXVENDOR_Buy                  = 0,
	GFXVENDOR_Sell                 = 1,
	GFXVENDOR_Buyback              = 2,
	GFXVENDOR_END                  = 3,
	GFXVENDOR_MAX                  = 4,
};

enum class EGoreRegionType : uint8
{
	Head                           = 0,
	Arm                            = 1,
	Leg                            = 2,
	Torso                          = 3,
	EGoreRegionType_MAX            = 4,
};

enum class EChildPayloadType : uint8
{
	Payload_Divider                = 0,
	Payload_MiniMirv               = 1,
	Payload_Mirv                   = 2,
	Payload_Rain                   = 3,
	Payload_Spring                 = 4,
	Payload_Sticky                 = 5,
	Payload_MAX                    = 6,
};

enum class ESpellChargeType : uint8
{
	None                           = 0,
	Simple                         = 1,
	Advanced                       = 2,
	Repeated                       = 3,
	ESpellChargeType_MAX           = 4,
};

enum class ESpellType : uint8
{
	Projectile                     = 0,
	HitScan                        = 1,
	Beam                           = 2,
	Self                           = 3,
	Location                       = 4,
	ESpellType_MAX                 = 5,
};

enum class EInstanceDataOperator : uint8
{
	Add                            = 0,
	Multiply                       = 1,
	EInstanceDataOperator_MAX      = 2,
};

enum class ESpinDirection : uint8
{
	SD_NoSpin                      = 0,
	SD_Clockwise                   = 1,
	SD_Counterclockwise            = 2,
	SD_MAX                         = 3,
};

enum class EHeroStatueUsage : uint8
{
	PlayerOne                      = 0,
	PlayerTwo                      = 1,
	PlayerThree                    = 2,
	PlayerFour                     = 3,
	None                           = 4,
	EHeroStatueUsage_MAX           = 5,
};

enum class EHolsteredGearState : uint8
{
	None                           = 0,
	FadingIn                       = 1,
	FadingOut                      = 2,
	EHolsteredGearState_MAX        = 3,
};

enum class EInWorldIconFadeType : uint8
{
	None                           = 0,
	Distance                       = 1,
	TargetedRadius                 = 2,
	EInWorldIconFadeType_MAX       = 3,
};

enum class EInWorldIconClassType : uint8
{
	Icon                           = 0,
	Nameplate                      = 1,
	EInWorldIconClassType_MAX      = 2,
};

enum class EInWorldIconEdgeBehavior : uint8
{
	Clamp                          = 0,
	Hide                           = 1,
	EInWorldIconEdgeBehavior_MAX   = 2,
};

enum class EEncounterWinType : uint8
{
	Manual                         = 0,
	Immediate                      = 1,
	Delayed                        = 2,
	Volume                         = 3,
	Interact                       = 4,
	MissionObjective               = 5,
	EEncounterWinType_MAX          = 6,
};

enum class EInteractiveObjectTrapActivationType : uint8
{
	ActivateTrap                   = 0,
	DeactivateTrap                 = 1,
	EInteractiveObjectTrapActivationType_MAX = 2,
};

enum class EInteractiveObjectInteractiveState : uint8
{
	None                           = 0,
	Interactive                    = 1,
	NonInteractive                 = 2,
	Uninitialized                  = 3,
	EInteractiveObjectInteractiveState_MAX = 4,
};

enum class EInteractiveObjectLockState : uint8
{
	None                           = 0,
	Unlocked                       = 1,
	Locked                         = 2,
	Uninitialized                  = 3,
	EInteractiveObjectLockState_MAX = 4,
};

enum class EInteractiveObjectState : uint8
{
	None                           = 0,
	Enabling                       = 1,
	Enabled                        = 2,
	Disabling                      = 3,
	Disabled                       = 4,
	Locked                         = 5,
	Uninitialized                  = 6,
	EInteractiveObjectState_MAX    = 7,
};

enum class ELootSpawnTiming : uint8
{
	OnEnabled                      = 0,
	OnEnabling                     = 1,
	OnAnimNotify                   = 2,
	ELootSpawnTiming_MAX           = 3,
};

enum class EMissionDrivenLootableType : uint8
{
	None                           = 0,
	CopyPickupMissionObjective     = 1,
	UseSelfMissionObjective        = 2,
	EMissionDrivenLootableType_MAX = 3,
};

enum class ELootableOpenReason : uint8
{
	Use                            = 0,
	Damage                         = 1,
	ELootableOpenReason_MAX        = 2,
};

enum class EDebugMatchmakingFailure : int32
{
	None                           = 0,
	CreateMatchmakingSession       = 1,
	JoinMatchmakingSession         = 2,
	FindMatchmakingSession         = 3,
	FindGameplaySession            = 4,
	JoinGameplaySession            = 5,
	InitClientMatchmakingBeacon    = 6,
	CreateHostMatchmakingBeacon    = 7,
	EDebugMatchmakingFailure_MAX   = 8,
};

enum class EMatchmakingRequirementComparisonOp : uint8
{
	None                           = 0,
	Equal                          = 1,
	NotEqual                       = 2,
	LessThan                       = 3,
	GreaterThan                    = 4,
	EMatchmakingRequirementComparisonOp_MAX = 5,
};

enum class EMatchmakingRequirementType : uint8
{
	None                           = 0,
	PlayerLevel                    = 1,
	PlotMission                    = 2,
	DlcInstalled                   = 3,
	EMatchmakingRequirementType_MAX = 4,
};

enum class EMatchmakingSearchParameterOp : uint8
{
	Invalid                        = 0,
	Equals                         = 1,
	NotEquals                      = 2,
	GreaterThan                    = 3,
	GreaterThanEquals              = 4,
	LessThan                       = 5,
	LessThanEquals                 = 6,
	Max                            = 7,
};

enum class EMeleeWeaponAttackSpeedCategory : int32
{
	Default                        = 0,
	OneHandSword                   = 1,
	TwoHandSword                   = 2,
	Blunt                          = 3,
	Axe                            = 4,
	Dagger                         = 5,
	Throwing                       = 6,
	Extra1                         = 7,
	Extra2                         = 8,
	Extra3                         = 9,
	Extra4                         = 10,
	Extra5                         = 11,
	Extra6                         = 12,
	Extra7                         = 13,
	Extra8                         = 14,
	EMeleeWeaponAttackSpeedCategory_MAX = 15,
};

enum class EInitialPlayerStatus : uint8
{
	NotSelected                    = 0,
	Selected                       = 1,
	EInitialPlayerStatus_MAX       = 2,
};

enum class EMicropatchApplicationType : uint8
{
	AlwaysLoaded                   = 0,
	World                          = 1,
	Character                      = 2,
	EMicropatchApplicationType_MAX = 3,
};

enum class EOakAbilityTimerResult : uint8
{
	Pulsed                         = 0,
	Finished                       = 1,
	Stopped                        = 2,
	Replaced                       = 3,
	EOakAbilityTimerResult_MAX     = 4,
};

enum class EOakAbilityTimerTickPolicy : uint8
{
	AlwaysTick                     = 0,
	OnlyWhenActive                 = 1,
	EOakAbilityTimerTickPolicy_MAX = 2,
};

enum class EOakAbilityTimerReplacePolicy : uint8
{
	KeepExisting                   = 0,
	ReplaceExisting                = 1,
	EOakAbilityTimerReplacePolicy_MAX = 2,
};

enum class ESkillWidgetSlot : uint8
{
	None                           = 0,
	ActionSkillWidget              = 1,
	GrenadeActionSkillWidget       = 2,
	ESkillWidgetSlot_MAX           = 3,
};

enum class EOakAchievements : uint8
{
	Invalid                        = 0,
	ReachLevel10                   = 1,
	ReachLevel20                   = 2,
	ReachLevel30                   = 3,
	ReachLevel40                   = 4,
	CompletePlot00                 = 5,
	CompletePlot01                 = 6,
	CompletePlot02                 = 7,
	CompletePlot04                 = 8,
	CompletePlot05                 = 9,
	CompletePlot06                 = 10,
	CompletePlot07                 = 11,
	CompletePlot08                 = 12,
	CompletePlot09                 = 13,
	CompletePlot10                 = 14,
	CompleteGTFO                   = 15,
	CompleteSkybound               = 16,
	CompleteTrialOfPhil            = 17,
	CompleteDoomed                 = 18,
	CompleteSomeSideMissions       = 19,
	CompleteAllSideMissions        = 20,
	RevivePartner                  = 21,
	SecondWindFromBadassOrBoss     = 22,
	FindEnchantedLegendary         = 23,
	OneHundredThousandGold         = 24,
	OneMillionGold                 = 25,
	SDUFinalTier                   = 26,
	SDUAll                         = 27,
	Trade                          = 28,
	Cosmetic                       = 29,
	HaveSomeLuck                   = 30,
	LoreScroll                     = 31,
	ReRollEnchantment              = 32,
	OverworldDungeonDoor           = 33,
	OverworldStunEnemy             = 34,
	OverworldEncampments           = 35,
	EndlessDungeonRun              = 36,
	ChaosLevel10                   = 37,
	ChaosLevel20                   = 38,
	CompleteAllAchievements        = 39,
	KillChums                      = 40,
	KillChumsFinal                 = 41,
	KillPettyRocker                = 42,
	KillPettyRockerFinal           = 43,
	KillSmith                      = 44,
	KillSmithFinal                 = 45,
	KillWyvern                     = 46,
	KillWyvernFinal                = 47,
	EOakAchievements_MAX           = 48,
};

enum class EOakAnimActionAbilityEndAction : uint8
{
	None                           = 0,
	Stop                           = 1,
	Abort                          = 2,
	AbortReset                     = 3,
	EOakAnimActionAbilityEndAction_MAX = 4,
};

enum class EHostileAttachState : uint8
{
	Loop                           = 0,
	Attack                         = 1,
	GripFeedback                   = 2,
	GetDown                        = 3,
	Ejected                        = 4,
	Completed                      = 5,
	EHostileAttachState_MAX        = 6,
};

enum class ELeapOnVehicle_SeatType : uint8
{
	SpecifiedSlot                  = 0,
	Driver                         = 1,
	Gunner                         = 2,
	Passenger                      = 3,
	Hostile                        = 4,
	ELeapOnVehicle_MAX             = 5,
};

enum class EOakActionAbilitySecondaryUseActionType : uint8
{
	None                           = 0,
	Primary                        = 1,
	Secondary                      = 2,
	EOakActionAbilitySecondaryUseActionType_MAX = 3,
};

enum class EOakActionAbilityStopAction : uint8
{
	Normal                         = 0,
	Expidited                      = 1,
	Abort                          = 2,
	EOakActionAbilityStopAction_MAX = 3,
};

enum class EOakActionAbilityPetModType : uint8
{
	None                           = 0,
	Mod1                           = 1,
	Mod2                           = 2,
	Mod3                           = 3,
	Mod4                           = 4,
	Mod5                           = 5,
	EOakActionAbilityPetModType_MAX = 6,
};

enum class EOakActionAbilityPetEvolutionType : uint8
{
	None                           = 0,
	Evolution1                     = 1,
	Evolution2                     = 2,
	EOakActionAbilityPetEvolutionType_MAX = 3,
};

enum class EOakActionAbilityPetType : uint8
{
	None                           = 0,
	Spiderant                      = 1,
	Jabbermon                      = 2,
	Skag                           = 3,
	EOakActionAbilityPetType_MAX   = 4,
};

enum class EOakAISwarmRotation : uint8
{
	None                           = 0,
	Strafe                         = 1,
	Forward                        = 2,
	EOakAISwarmRotation_MAX        = 3,
};

enum class EOakAssetChunkRuleType : uint8
{
	Reserved                       = 0,
	Class                          = 1,
	Path                           = 2,
	Map                            = 3,
	MapPath                        = 4,
	EOakAssetChunkRuleType_MAX     = 5,
};

enum class EPopulatePackageNameChunkMapPhase : uint8
{
	Launch                         = 0,
	LaunchMaps                     = 1,
	InitialPlayable                = 2,
	Full                           = 3,
	Test                           = 4,
	EPopulatePackageNameChunkMapPhase_MAX = 5,
};

enum class EChallengRewardFormattingType : uint8
{
	Cash                           = 0,
	Eridium                        = 1,
	Other                          = 2,
	EChallengRewardFormattingType_MAX = 3,
};

enum class ECameraAttachState : uint8
{
	CAS_Dettached                  = 0,
	CAS_Attached                   = 1,
	CAS_MAX                        = 2,
};

enum class EVehicleArchetype : uint8
{
	Null                           = 0,
	Technical                      = 1,
	Outrunner                      = 2,
	Revolver                       = 3,
	Emperor                        = 4,
	EVehicleArchetype_MAX          = 5,
};

enum class ECinematicState : uint8
{
	Inactive                       = 0,
	PlayingIntro                   = 1,
	PlayingSequence                = 2,
	PlayingCredits                 = 3,
	ECinematicState_MAX            = 4,
};

enum class EOakMayhemModeConditionType : uint8
{
	IsMayhemModeActive             = 0,
	CompareMayhemLevel             = 1,
	EOakMayhemModeConditionType_MAX = 2,
};

enum class EHealthTypeState : uint8
{
	Normal                         = 0,
	Low                            = 1,
	VeryLow                        = 2,
	Depleted                       = 3,
	EHealthTypeState_MAX           = 4,
};

enum class EDamageInstigatorClassification : uint8
{
	Other                          = 0,
	PlayerVersusPlayer             = 1,
	PlayerVersusAI                 = 2,
	AIVersusPlayer                 = 3,
	EDamageInstigatorClassification_MAX = 4,
};

enum class EOakElementalDeathEffects : uint8
{
	Default                        = 0,
	Custom                         = 1,
	Disabled                       = 2,
	EOakElementalDeathEffects_MAX  = 3,
};

enum class EUIDialogCallout : uint8
{
	EquipAskillFailed              = 0,
	EquipItemFailed                = 1,
	RemoveItemFailed               = 2,
	InsufficientFunds              = 3,
	OutOfSpells                    = 4,
	SpellRecharged                 = 5,
	IdleInventory                  = 6,
	IdleMap                        = 7,
	IdleSkills                     = 8,
	TradeComplete                  = 9,
	EUIDialogCallout_MAX           = 10,
};

enum class EOakDroneFacingMode : uint8
{
	None                           = 0,
	FaceMoveDir                    = 1,
	FaceTarget                     = 2,
	FaceMovementTarget             = 3,
	EOakDroneFacingMode_MAX        = 4,
};

enum class EOakDroneMovementMode : uint8
{
	Projectile                     = 0,
	FlyToTarget                    = 1,
	HoverAtTarget                  = 2,
	HoverAtOwner                   = 3,
	EOakDroneMovementMode_MAX      = 4,
};

enum class EOakElementalStackBucketType : uint8
{
	Unknown                        = 0,
	Character                      = 1,
	Weapon                         = 2,
	Grenade                        = 3,
	InteractiveObject              = 4,
	ElementalInteraction           = 5,
	EOakElementalStackBucketType_MAX = 6,
};

enum class EInviteType : uint8
{
	Public                         = 0,
	InviteOnly                     = 1,
	FriendsOnly                    = 2,
	EInviteType_MAX                = 3,
};

enum class EFriendSyncState : uint8
{
	Disabled                       = 0,
	Enabled                        = 1,
	EFriendSyncState_MAX           = 2,
};

enum class ECrossplayState : uint8
{
	Disabled                       = 0,
	Enabled                        = 1,
	ECrossplayState_MAX            = 2,
};

enum class ENetworkType : uint8
{
	Offline                        = 0,
	Lan                            = 1,
	Online                         = 2,
	ENetworkType_MAX               = 3,
};

enum class EPlayerInputLockType : uint8
{
	None                           = 0,
	All                            = 1,
	Movement                       = 2,
	Looking                        = 3,
	Jumping                        = 4,
	Weapon                         = 5,
	EPlayerInputLockType_MAX       = 6,
};

enum class EActivityCompletionFriendEventType : uint8
{
	RaidCompletion                 = 0,
	CircleOfSlaughterCompletion    = 1,
	ProvingGroundsCompletion       = 2,
	EActivityCompletionFriendEventType_MAX = 3,
};

enum class EBenchmarkDataOutputMode : uint8
{
	None                           = 0,
	Summary                        = 1,
	DetailedCSV                    = 2,
	EBenchmarkDataOutputMode_MAX   = 3,
};

enum class EAMD_FSR2_Preset : uint8
{
	Off                            = 0,
	Quality                        = 1,
	Balanced                       = 2,
	Performance                    = 3,
	EAMD_FSR2_MAX                  = 4,
};

enum class EAmbientOcclusionQuality : uint8
{
	Off                            = 0,
	Low                            = 1,
	Medium                         = 2,
	High                           = 3,
	Ultra                          = 4,
	EAmbientOcclusionQuality_MAX   = 5,
};

enum class ECharacterDetail : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	ECharacterDetail_MAX           = 4,
};

enum class ECharacterTextureDetail : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	Deprecated                     = 4,
	ECharacterTextureDetail_MAX    = 5,
};

enum class EScreenSpaceReflections : uint8
{
	Off                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	EScreenSpaceReflections_MAX    = 4,
};

enum class EVolumetricFogType : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	EVolumetricFogType_MAX         = 4,
};

enum class EFoliageDensity : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	EFoliageDensity_MAX            = 4,
};

enum class ETerrainType : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	ETerrainType_MAX               = 4,
};

enum class EEnvironmentDetail : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	EEnvironmentDetail_MAX         = 4,
};

enum class EDrawDistance : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	EDrawDistance_MAX              = 4,
};

enum class EEnvironmentTextureDetail : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	Deprecated                     = 4,
	EEnvironmentTextureDetail_MAX  = 5,
};

enum class EShadowQuality : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	EShadowQuality_MAX             = 4,
};

enum class EAnisotropicFilteringType : uint8
{
	Trilinear                      = 0,
	TwoX                           = 1,
	FourX                          = 2,
	EightX                         = 3,
	SixteenX                       = 4,
	EAnisotropicFilteringType_MAX  = 5,
};

enum class EMaterialQuality : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	EMaterialQuality_MAX           = 4,
};

enum class ETextureStreamingQuality : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Ultra                          = 3,
	ETextureStreamingQuality_MAX   = 4,
};

enum class EGraphicsQuality : uint8
{
	VeryLow                        = 0,
	Low                            = 1,
	Medium                         = 2,
	High                           = 3,
	Ultra                          = 4,
	Badass                         = 5,
	Undefined                      = 6,
	EGraphicsQuality_MAX           = 7,
};

enum class EFrameRateLimit : uint8
{
	Smooth22_62FPS                 = 0,
	Capped30FPS                    = 1,
	Capped60FPS                    = 2,
	Capped120FPS                   = 3,
	Unlimited                      = 4,
	Custom                         = 5,
	EFrameRateLimit_MAX            = 6,
};

enum class EResolutionScale : uint8
{
	Scale_50                       = 0,
	Scale_75                       = 1,
	Scale_100                      = 2,
	Scale_125                      = 3,
	Scale_150                      = 4,
	Scale_175                      = 5,
	Scale_200                      = 6,
	Scale_MAX                      = 7,
};

enum class ESupportedAspectRatios : uint8
{
	AspectRatio_16_9               = 0,
	AspectRatio_16_10              = 1,
	AspectRatio_32_9               = 2,
	AspectRatio_21_9               = 3,
	AspectRatio_Unsupported        = 4,
	AspectRatio_MAX                = 5,
};

enum class ETrackedIconOwner : uint8
{
	Unknown                        = 0,
	Released                       = 1,
	Minimap_Clamped                = 2,
	Minimap_Interior3D             = 3,
	InWorldContainer               = 4,
	ETrackedIconOwner_MAX          = 5,
};

enum class EHUDType : uint8
{
	NoHUD                          = 0,
	StandardPlayerHUD              = 1,
	VehicleHUD                     = 2,
	EHUDType_MAX                   = 3,
};

enum class EPickupFlyToSettingsType : uint8
{
	Dropped                        = 0,
	Container                      = 1,
	AutoLootContainer              = 2,
	EPickupFlyToSettingsType_MAX   = 3,
};

enum class EOakInventoryItemFlags : uint8
{
	HasBeenSeenInInventoryMenu     = 0,
	MarkedAsFavorite               = 1,
	MarkedAsJunk                   = 2,
	EOakInventoryItemFlags_MAX     = 3,
};

enum class EOakInventoryMenuPaperDollSlotAdjacency : int32
{
	Mid                            = 0,
	Left                           = 1,
	Right                          = 2,
	EOakInventoryMenuPaperDollSlotAdjacency_MAX = 3,
};

enum class EOakInventoryMenuAmmoState : uint8
{
	Default                        = 0,
	Highlighted                    = 1,
	HighlightedEmpty               = 2,
	Low                            = 3,
	Empty                          = 4,
	Full                           = 5,
	EOakInventoryMenuAmmoState_MAX = 6,
};

enum class EOakInventoryMenuWhatChanged : uint8
{
	Initial                        = 0,
	RefreshAll                     = 1,
	SortChanged                    = 2,
	AddedItem                      = 3,
	RemovedItem                    = 4,
	UnequippedItem                 = 5,
	EquippedItem                   = 6,
	EOakInventoryMenuWhatChanged_MAX = 7,
};

enum class EOakInventoryMenuSortMode : uint8
{
	NewestFirst                    = 0,
	Type                           = 1,
	Level                          = 2,
	Manufacturer                   = 3,
	Rarity                         = 4,
	EOakInventoryMenuSortMode_MAX  = 5,
};

enum class EOakInventoryItemWidgetSelectType : uint8
{
	Normal                         = 0,
	HideWhenSelected               = 1,
	PopoutSelection                = 2,
	EOakInventoryItemWidgetSelectType_MAX = 3,
};

enum class EOakInventoryItemWidgetDisabledReason : uint8
{
	NotDisabled                    = 0,
	SlotLocked                     = 1,
	BrowsingAnotherPanel           = 2,
	CantEquipInSlot                = 3,
	EOakInventoryItemWidgetDisabledReason_MAX = 4,
};

enum class EOakStatusMenuInventoryEvent : uint8
{
	PaperDollItemHighlighted       = 0,
	BackpackItemHighlighted        = 1,
	BackpackHighlighted            = 2,
	PaperDollHighlighted           = 3,
	EOakStatusMenuInventoryEvent_MAX = 4,
};

enum class EOakInventoryRarityBalanceTableType : uint8
{
	Weapon                         = 0,
	EOakInventoryRarityBalanceTableType_MAX = 1,
};

enum class EMailItemType : uint8
{
	None                           = 0,
	GearboxMail                    = 1,
	PlayerMail                     = 2,
	StreamerMail                   = 3,
	NPCMail                        = 4,
	DownloadableEntitlement        = 5,
	EMailItemType_MAX              = 6,
};

enum class EReapOrder : uint8
{
	OldestFirst                    = 0,
	NewestFirst                    = 1,
	Random                         = 2,
	EReapOrder_MAX                 = 3,
};

enum class EOakManufacturerBalanceTableType : uint8
{
	Weapon                         = 0,
	EOakManufacturerBalanceTableType_MAX = 1,
};

enum class EOakMinimapIconComponentType : uint8
{
	Manual                         = 0,
	TargetingComponentDriven       = 1,
	WhileAlive                     = 2,
	EOakMinimapIconComponentType_MAX = 3,
};

enum class EOakMissionType : uint8
{
	Default                        = 0,
	Plot                           = 1,
	Side                           = 2,
	ProvingGrounds                 = 3,
	CircleOfSlaughter              = 4,
	Raid                           = 5,
	RareSpawn                      = 6,
	Count                          = 7,
	EOakMissionType_MAX            = 8,
};

enum class EOakMusicLayer : uint8
{
	Aux                            = 0,
	Bass                           = 1,
	Chord                          = 2,
	Melody                         = 3,
	Perc_Kick                      = 4,
	Perc_Large                     = 5,
	Perc_Small                     = 6,
	MAX                            = 7,
};

enum class EOakMusicPart : uint8
{
	Part_None                      = 0,
	Part_0                         = 1,
	Part_1                         = 2,
	Part_2                         = 3,
	Part_3                         = 4,
	Part_4                         = 5,
	Part_5                         = 6,
	Part_6                         = 7,
	Part_7                         = 8,
	Part_8                         = 9,
	Part_9                         = 10,
	Part_10                        = 11,
	Part_11                        = 12,
	Part_12                        = 13,
	Part_13                        = 14,
	Part_14                        = 15,
	Part_15                        = 16,
	Part_16                        = 17,
	Part_17                        = 18,
	Part_18                        = 19,
	Part_19                        = 20,
	Part_SparseAmbiance            = 21,
	Part_MAX                       = 22,
};

enum class EOakMusicSection : uint8
{
	Section_None                   = 0,
	Section_0                      = 1,
	Section_1                      = 2,
	Section_2                      = 3,
	Section_3                      = 4,
	Section_4                      = 5,
	Section_5                      = 6,
	Section_6                      = 7,
	Section_7                      = 8,
	Section_8                      = 9,
	Section_9                      = 10,
	Section_MAX                    = 11,
};

enum class EDrivingOverridePriority : uint8
{
	AINode                         = 0,
	Aspect                         = 1,
	Scripted                       = 2,
	Count                          = 3,
	Invalid                        = 4,
	EDrivingOverridePriority_MAX   = 5,
};

enum class ESpeedModifierOverridePriority : uint8
{
	AINode                         = 0,
	Aspect                         = 1,
	Scripted                       = 2,
	Escort                         = 3,
	UserEdge                       = 4,
	Count                          = 5,
	Invalid                        = 6,
	ESpeedModifierOverridePriority_MAX = 7,
};

enum class EOakOnlineLobbyTalkingState : uint8
{
	NotTalking                     = 0,
	Talking                        = 1,
	Muted                          = 2,
	EOakOnlineLobbyTalkingState_MAX = 3,
};

enum class EOakOnlineLobbyPlayerPlateState : uint8
{
	Offline                        = 0,
	WaitingForPlayers              = 1,
	Invite                         = 2,
	SplitPlayerToJoin              = 3,
	PlayerListed                   = 4,
	EOakOnlineLobbyPlayerPlateState_MAX = 5,
};

enum class EOakOnlineLobbyConnectivityState : uint8
{
	Unknown                        = 0,
	Low                            = 1,
	Medium                         = 2,
	High                           = 3,
	None                           = 4,
	EOakOnlineLobbyConnectivityState_MAX = 5,
};

enum class EOakPassiveAbilityHUDIconActivationType : uint8
{
	TriggeredEffect                = 0,
	StatusEffect                   = 1,
	AbilityTimer                   = 2,
	Manual                         = 3,
	ActiveState                    = 4,
	EOakPassiveAbilityHUDIconActivationType_MAX = 5,
};

enum class EAdditionalTriggeredEffectTargets : uint8
{
	None                           = 0,
	MyCompanions                   = 1,
	DemiLichPetOnly                = 2,
	DragonPetOnly                  = 3,
	MushroomPetOnly                = 4,
	MyAllies                       = 5,
	EAdditionalTriggeredEffectTargets_MAX = 6,
};

enum class EPlayerAbilityFeature : uint8
{
	ClassFeature                   = 0,
	InitialSecondaryClass          = 1,
	SecondaryClassSwapping         = 2,
	EPlayerAbilityFeature_MAX      = 3,
};

enum class EAbilityBranchStatus : uint8
{
	BranchLocked                   = 0,
	BranchUnlocked                 = 1,
	BranchPurchasable              = 2,
	PrimaryBranch                  = 3,
	EAbilityBranchStatus_MAX       = 4,
};

enum class ESkillItemRealType : uint8
{
	None                           = 0,
	PlayerAbility                  = 1,
	Augment                        = 2,
	AugmentSlot                    = 3,
	CharacterAugment               = 4,
	ESkillItemRealType_MAX         = 5,
};

enum class ESkillItemDisplayType : uint8
{
	None                           = 0,
	ActionSkill                    = 1,
	ModPrimary                     = 2,
	ModSecondary                   = 3,
	Passive                        = 4,
	ClassAbility                   = 5,
	ESkillItemDisplayType_MAX      = 6,
};

enum class ESkillItemLayoutInfo : uint8
{
	Left                           = 0,
	Center                         = 1,
	Right                          = 2,
	LeftWing                       = 3,
	RightWing                      = 4,
	ESkillItemLayoutInfo_MAX       = 5,
};

enum class EScreenCalibrationMode : uint8
{
	Off                            = 0,
	HDRBrightness                  = 1,
	StandardBrightnessAndBlackLevel = 2,
	EScreenCalibrationMode_MAX     = 3,
};

enum class EJoystickScheme : int32
{
	Classic                        = 0,
	SouthPaw                       = 1,
	OldSchool                      = 2,
	OldSchool_Southpaw             = 3,
	Count                          = 4,
	EJoystickScheme_MAX            = 5,
};

enum class EDrivingButtonScheme : int32
{
	Classic                        = 0,
	CameraRelative                 = 1,
	VehicleRelative                = 2,
	VehicleRelativeStick           = 3,
	Count                          = 4,
	EDrivingButtonScheme_MAX       = 5,
};

enum class EWalkingButtonScheme : int32
{
	Default                        = 0,
	Classic                        = 1,
	Custom                         = 2,
	Count                          = 3,
	EWalkingButtonScheme_MAX       = 4,
};

enum class EGameJoinNotificationState : uint8
{
	EGJNS_None                     = 0,
	EGJNS_PlayerStateReplicated    = 1,
	EGJNS_SyncLevelReplicated      = 2,
	EGJNS_PlayerNotified           = 3,
	EGJNS_MAX                      = 4,
};

enum class EPresentableStatusEffectValueStrategy : int32
{
	PercentOfMaxHealth             = 0,
	InstanceCount                  = 1,
	EPresentableStatusEffectValueStrategy_MAX = 2,
};

enum class ERadiateMovementType : uint8
{
	FollowInitialDirection         = 0,
	SimpleMoveOnGround             = 1,
	ERadiateMovementType_MAX       = 2,
};

enum class ERadiateMethod : uint8
{
	Velocity                       = 0,
	MinMaxDistance                 = 1,
	ERadiateMethod_MAX             = 2,
};

enum class EClassRepNodeMapping : uint8
{
	NotRouted                      = 0,
	RelevantForConnections         = 1,
	Spatialize_Static              = 2,
	Spatialize_Dynamic             = 3,
	Spatialize_Dormancy            = 4,
	EClassRepNodeMapping_MAX       = 5,
};

enum class EEventTriggerType : uint8
{
	StreamingEvent_DirectorTriggered = 0,
	StreamingEvent_WorldTriggered  = 1,
	StreamingEvent_ViewerTriggered = 2,
	StreamingEvent_MAX             = 3,
};

enum class EStreamingInteractionEventState : uint8
{
	StreamingEvent_Disabled        = 0,
	StreamingEvent_Preliminary     = 1,
	StreamingEvent_Standby         = 2,
	StreamingEvent_Active          = 3,
	StreamingEvent_MAX             = 4,
};

enum class ECharacterProfileUpdateStep : uint8
{
	Step_MainCharacterInfo         = 0,
	Step_Inventory                 = 1,
	Step_MAX                       = 2,
};

enum class EStreamingManagerState : uint8
{
	StreamingManager_Off           = 0,
	StreamingManager_Initialized   = 1,
	StreamingManager_Active        = 2,
	StreamingManager_Paused        = 3,
	StreamingManager_MAX           = 4,
};

enum class EEndEventReasons : int32
{
	Unknown                        = 0,
	Success                        = 1,
	NoParticipants                 = 2,
	Timeout                        = 3,
	Error                          = 4,
	Win                            = 5,
	Draw                           = 6,
	Lose                           = 7,
	MapExited                      = 8,
	EEndEventReasons_MAX           = 9,
};

enum class EOakTriggerComponentEventType : uint8
{
	Touch                          = 0,
	UnTouch                        = 1,
	EOakTriggerComponentEventType_MAX = 2,
};

enum class EOakUIBigMapListViewItemType : uint8
{
	Normal                         = 0,
	Header                         = 1,
	Spacer                         = 2,
	EOakUIBigMapListViewItemType_MAX = 3,
};

enum class EOakUIChallengeDataProviderPopulateType : int32
{
	UNKNOWN                        = 0,
	Galaxy                         = 1,
	World                          = 2,
	Planet                         = 3,
	Level                          = 4,
	EOakUIChallengeDataProviderPopulateType_MAX = 5,
};

enum class EOakUICharacterCustomizationManagerState : uint8
{
	None                           = 0,
	NewCharacter                   = 1,
	NewCharacterLateJoin           = 2,
	QuickChange                    = 3,
	EOakUICharacterCustomizationManagerState_MAX = 4,
};

enum class EOakUIKeys_EquippedWeaponAmmo : uint8
{
	IsEquipped                     = 0,
	IsEquipping                    = 1,
	IsShooting                     = 2,
	SpareCount                     = 3,
	MaxSpareCount                  = 4,
	LoadedCount                    = 5,
	MaxLoadedCount                 = 6,
	ReloadThreshold                = 7,
	HeatPercent                    = 8,
	IsOverheating                  = 9,
	IsOverheated                   = 10,
	AmmoState                      = 11,
	AmmoMaxState                   = 12,
	AmmoMode                       = 13,
	DamageType                     = 14,
	ModeSwitchText                 = 15,
	EOakUIKeys_MAX                 = 16,
};

enum class EAmmoBarMode : uint8
{
	None                           = 0,
	NoMode                         = 1,
	ModeSwitch                     = 2,
	COV                            = 3,
	COVModeSwitch                  = 4,
	EridianFabricator              = 5,
	MAX                            = 6,
};

enum class EOakUIKeys_Cc : uint8
{
	HeroPointsAvailable            = 0,
	Summary                        = 1,
	HighlightedAspect              = 2,
	HighlightedHeroAttribute       = 3,
	ViewedCustomizationList        = 4,
	ViewedCustomizationData        = 5,
	CustomizationListStack         = 6,
	EmoteState                     = 7,
	LutPickerData                  = 8,
	CurrentLuts                    = 9,
	EOakUIKeys_MAX                 = 10,
};

enum class EOakUIKeys_Challenges : uint8
{
	ChallengeCategoryHeaderText    = 0,
	ViewedChallenges               = 1,
	EOakUIKeys_MAX                 = 2,
};

enum class EOakUIKeys_CreditsMenu : uint8
{
	MenuStateData                  = 0,
	EOakUIKeys_MAX                 = 1,
};

enum class EOakUIKeys_CharacterCrosshairInfo : uint8
{
	HasWeapon                      = 0,
	IsSprinting                    = 1,
	HasTarget                      = 2,
	Team                           = 3,
	CanUseActiveWeapons            = 4,
	IsAttachedToTurret             = 5,
	IsCastingSpell                 = 6,
	EOakUIKeys_MAX                 = 7,
};

enum class EOakUIKeys_Crosshair : uint8
{
	WeaponVisible                  = 0,
	ChangingWeapons                = 1,
	AccuracyPercentage             = 2,
	AccuracySpread                 = 3,
	CurrentAccuracy                = 4,
	MinAccuracy                    = 5,
	MaxAccuracy                    = 6,
	ChargePercent                  = 7,
	DynamicCrosshairIdent          = 8,
	EOakUIKeys_MAX                 = 9,
};

enum class EOakUIKeys_CrossplayFirstBoot : uint8
{
	MenuState                      = 0,
	Buttons                        = 1,
	CrossplayName                  = 2,
	UserControllerId               = 3,
	EOakUIKeys_MAX                 = 4,
};

enum class EOakUICrossplayFirstBootViewState : int32
{
	None                           = 0,
	Welcome                        = 1,
	EnableCrossplay                = 2,
	CrossplayName                  = 3,
	Communicating                  = 4,
	ErrorCantEnableCrossplay       = 5,
	EOakUICrossplayFirstBootViewState_MAX = 6,
};

enum class EOakUIKeys_Currency : uint8
{
	Cash                           = 0,
	Eridium                        = 1,
	GoldenKey                      = 2,
	VaultCoin                      = 3,
	SoulCan                        = 4,
	DisplaySouls                   = 5,
	MAX                            = 6,
};

enum class EOakUIKeys_EnchantmentReRoller : uint8
{
	ReRoller                       = 0,
	NewEnchantment                 = 1,
	EOakUIKeys_MAX                 = 2,
};

enum class EOakUIGenericOptionWidgetType : uint8
{
	None                           = 0,
	Header                         = 1,
	Toggle                         = 2,
	Slider                         = 3,
	Button                         = 4,
	CheckboxButton                 = 5,
	LookUpToggle                   = 6,
	HeroPointToggle                = 7,
	EOakUIGenericOptionWidgetType_MAX = 8,
};

enum class EOakUIKeys_GraphicsCalibration : uint8
{
	StateData                      = 0,
	OptionsList                    = 1,
	EOakUIKeys_MAX                 = 2,
};

enum class EOakUIKeys_HintBar : uint8
{
	CanShowEntries                 = 0,
	CanShowHelper                  = 1,
	InputSchema                    = 2,
	InputActions                   = 3,
	ActionDisplayIdents            = 4,
	ActionDisplayStrings           = 5,
	EOakUIKeys_MAX                 = 6,
};

enum class EOakHUDIndicatorType : uint8
{
	Save                           = 0,
	Checkpoint                     = 1,
	Error                          = 2,
	ConnectionLost                 = 3,
	Mail                           = 4,
	OutOfBounds                    = 5,
	EOakHUDIndicatorType_MAX       = 6,
};

enum class EOakUIKeys_LegalScreen : uint8
{
	Description                    = 0,
	ImageList                      = 1,
	EOakUIKeys_MAX                 = 2,
};

enum class EOakUIKeys_LoadCharacter : uint8
{
	SavedList                      = 0,
	GameDetails                    = 1,
	CreateBtn                      = 2,
	MAX                            = 3,
};

enum class EOakUIKeys_LobbyWidget : uint8
{
	Party                          = 0,
	Recommended                    = 1,
	ModeSettings                   = 2,
	MatchmakingPending             = 3,
	MAX                            = 4,
};

enum class EOakUIKeys_MapView : uint8
{
	ViewState                      = 0,
	ViewHeader                     = 1,
	ViewProgressHeader             = 2,
	ViewProgress                   = 3,
	RightPaneData                  = 4,
	PointsOfInterest               = 5,
	SummaryData                    = 6,
	EOakUIKeys_MAX                 = 7,
};

enum class EOakUIKeys_MatchMaking : uint8
{
	Hint                           = 0,
	Panel                          = 1,
	MAX                            = 2,
};

enum class EOakUIMissionLogMissionItemType : uint8
{
	Mission                        = 0,
	ShrineChallenge                = 1,
	CrewChallenge                  = 2,
	EchoLog                        = 3,
	Header                         = 4,
	EOakUIMissionLogMissionItemType_MAX = 5,
};

enum class EOakUIMissionLogFilterType : uint8
{
	MissionLogMissionType          = 0,
	MissionLogByRegion             = 1,
	MissionLogByExpansion          = 2,
	EOakUIMissionLogFilterType_MAX = 3,
};

enum class EOakUIMissionLogNavType : uint8
{
	None                           = 0,
	Missions                       = 1,
	EchoLog                        = 2,
	EOakUIMissionLogNavType_MAX    = 3,
};

enum class EOakUIMissionLogMissionIconType : uint8
{
	New                            = 0,
	Normal                         = 1,
	Plot                           = 2,
	Side                           = 3,
	Contract                       = 4,
	EchoLog                        = 5,
	Complete                       = 6,
	Ignored                        = 7,
	Failed                         = 8,
	Blocked                        = 9,
	HardMission                    = 10,
	Track                          = 11,
	EOakUIMissionLogMissionIconType_MAX = 12,
};

enum class EOakUIMissionTracker_EventType : uint8
{
	None                           = 0,
	ShowWidget                     = 1,
	HideWidget                     = 2,
	UpdateTracker                  = 3,
	ClearTrackerData               = 4,
	ClearTrackerObjectiveInfo      = 5,
	SetMissionTitle                = 6,
	ShowMissionComplete            = 7,
	ShowMissionTitle               = 8,
	HideMissionTitle               = 9,
	SetMissionPlot                 = 10,
	SetMissionFailedVisibility     = 11,
	SetHasMultipleActiveMissions   = 12,
	QueueSlideOutForAllObjectivesNotPartOfSet = 13,
	ClearSlideOutLock              = 14,
	PlayQueuedAnimations           = 15,
	ObjectiveSlot                  = 16,
	EOakUIMissionTracker_MAX       = 17,
};

enum class EOakUIMissionTracker_AnimationType : uint8
{
	None                           = 0,
	Active                         = 1,
	SlideIn                        = 2,
	SlideInChecked                 = 3,
	SlideOut                       = 4,
	SlideInFromAbove               = 5,
	SlideInFromAboveChecked        = 6,
	SlideInFromBelow               = 7,
	SlideInFromBelowChecked        = 8,
	Checked                        = 9,
	CheckedFailed                  = 10,
	Failed                         = 11,
	SlideOutFailed                 = 12,
	EOakUIMissionTracker_MAX       = 13,
};

enum class EOakUINotificationTypes : uint8
{
	MissionDiscovered              = 0,
	MissionStarted                 = 1,
	MissionComplete                = 2,
	CrewChallengeComplete          = 3,
	LevelUp                        = 4,
	SecondWind                     = 5,
	MayhemActived                  = 6,
	MayhemDeactivated              = 7,
	MayhemLevelUp                  = 8,
	NewParts                       = 9,
	AreaDiscovered                 = 10,
	AreaEntered                    = 11,
	BattleEncountered              = 12,
	ShrineActivated                = 13,
	DungeonStart                   = 14,
	EliteRoom                      = 15,
	RoomStart                      = 16,
	RoomCleared                    = 17,
	DungeonComplete                = 18,
	DungeonFailed                  = 19,
	SideObjectiveComplete          = 20,
	SideObjectiveFailed            = 21,
	EOakUINotificationTypes_MAX    = 22,
};

enum class EOakUIKeys_OptionsMenu : uint8
{
	ScreenTitle                    = 0,
	CurrentTabs                    = 1,
	SelectedTab                    = 2,
	CurrentOptionsList             = 3,
	ViewedOptionInfo               = 4,
	ExtraInfo                      = 5,
	ViewedButtonBindsList          = 6,
	EOakUIKeys_MAX                 = 7,
};

enum class EPassiveSkillIconState : uint8
{
	Off                            = 0,
	Active                         = 1,
	Stack                          = 2,
	Cooldown                       = 3,
	MAX                            = 4,
};

enum class EOakUIKeys_PetHealth : uint8
{
	PetHealth                      = 0,
	PetDead                        = 1,
	DownState                      = 2,
	PetRespawn                     = 3,
	PetName                        = 4,
	PetData                        = 5,
	EOakUIKeys_MAX                 = 6,
};

enum class EOakUIKeys_PhotoMode : uint8
{
	CurrentOptionsInfo             = 0,
	IsSoloPlay                     = 1,
	CanShowScreenshots             = 2,
	EOakUIKeys_MAX                 = 3,
};

enum class EOakUIKeys_PlayerId : uint8
{
	PlayerInfo                     = 0,
	CharacterInfo                  = 1,
	PlayerStatus                   = 2,
	PlayerOptions                  = 3,
	Mute                           = 4,
	PlayerCard                     = 5,
	MAX                            = 6,
};

enum class EOakUIKeys_PlayerParty : uint8
{
	PartyData                      = 0,
	PlayerID                       = 1,
	PlayerName                     = 2,
	PlayerPlatform                 = 3,
	PlayerClass                    = 4,
	PlayerLevel                    = 5,
	EOakUIKeys_MAX                 = 6,
};

enum class EOakUIKeys_PlotMission : uint8
{
	MissionName                    = 0,
	ChapterNumber                  = 1,
	EOakUIKeys_MAX                 = 2,
};

enum class EOakUIKeys_RosterKeys : uint8
{
	Grid                           = 0,
	PlayerCard                     = 1,
	FriendCard                     = 2,
	StatusText                     = 3,
	MAX                            = 4,
};

enum class EOakUIKeys_TitleScreen : uint8
{
	HintText                       = 0,
	SplashImagePath                = 1,
	EOakUIKeys_MAX                 = 2,
};

enum class EOakUIKeys_Vitals : uint8
{
	Health                         = 0,
	MaxHealth                      = 1,
	Shield                         = 2,
	MaxShield                      = 3,
	Armor                          = 4,
	MaxArmor                       = 5,
	ShieldEquipped                 = 6,
	DeadState                      = 7,
	EOakUIKeys_MAX                 = 8,
};

enum class EOakUIKeys_VOIP : uint8
{
	PlayerIDs                      = 0,
	EOakUIKeys_MAX                 = 1,
};

enum class EOakUIKeys_WorldIcons : uint8
{
	IconData                       = 0,
	Position                       = 1,
	IconType                       = 2,
	UniqueId                       = 3,
	Payload                        = 4,
	Source                         = 5,
	EOakUIKeys_MAX                 = 6,
};

enum class EOakUIKeys_XP : uint8
{
	Level                          = 0,
	FillPercent                    = 1,
	AmountXPAdded                  = 2,
	PointsToSpend                  = 3,
	IsVisible                      = 4,
	EOakUIKeys_MAX                 = 5,
};

enum class EExperienceLevelType : uint8
{
	Standard                       = 0,
	Prestige                       = 1,
	MAX                            = 2,
};

enum class EOakSocialMenuType : uint8
{
	Roster                         = 0,
	MatchMaking                    = 1,
	Shift                          = 2,
	Mail                           = 3,
	Lan                            = 4,
	None                           = 5,
	EOakSocialMenuType_MAX         = 6,
};

enum class EECHOState : uint8
{
	Inactive                       = 0,
	Activating                     = 1,
	Displayed                      = 2,
	Deactivating                   = 3,
	EECHOState_MAX                 = 4,
};

enum class EReloadDisplayState : uint8
{
	Default                        = 0,
	AmmoLow                        = 1,
	NoSpareAmmo                    = 2,
	NoAmmoAtAll                    = 3,
	EReloadDisplayState_MAX        = 4,
};

enum class EMailboxMenuMailSort : uint8
{
	Date                           = 0,
	Unread                         = 1,
	EMailboxMenuMailSort_MAX       = 2,
};

enum class EOakPlayerOptionType : uint8
{
	Invite                         = 0,
	Join                           = 1,
	SendItem                       = 2,
	Favorite                       = 3,
	Unfavorite                     = 4,
	Mute                           = 5,
	Unmute                         = 6,
	Delete                         = 7,
	KickOut                        = 8,
	Inspect                        = 9,
	ViewProfile                    = 10,
	AddFriend                      = 11,
	RemoveFriend                   = 12,
	NetworkOption_Anyone           = 13,
	NetworkOption_FriendsOnly      = 14,
	NetworkOption_InviteOnly       = 15,
	LootMode_Classic               = 16,
	LootMode_Shared                = 17,
	Shift_AddFriend                = 18,
	Shift_RemoveFriend             = 19,
	Shift_Block                    = 20,
	Shift_Unblock                  = 21,
	Shift_Report                   = 22,
	None                           = 23,
	SwitchLookingForHelp           = 24,
	ChangeLookingForHelpType       = 25,
	DisplayShiftInfoOption         = 26,
	Count                          = 27,
	ActivateCollector              = 28,
	DeactivateCollector            = 29,
	EOakPlayerOptionType_MAX       = 30,
};

enum class EBuddyWidgetType : uint8
{
	HealthShield                   = 0,
	Dying                          = 1,
	Reviving                       = 2,
	SecondWind                     = 3,
	LevelUp                        = 4,
	Speaking                       = 5,
	Death                          = 6,
	NONE                           = 7,
	EBuddyWidgetType_MAX           = 8,
};

enum class EOakUIMissionLogPageType : uint8
{
	Mission                        = 0,
	Buff                           = 1,
	Echo                           = 2,
	MAX                            = 3,
};

enum class EXPPromptActionType : uint8
{
	SkillPoints                    = 0,
	HeroPoints                     = 1,
	PrestigePoints                 = 2,
	EXPPromptActionType_MAX        = 3,
};

enum class EVehicleInputMode : int32
{
	CameraRelative_Classic         = 0,
	CameraRelative_ThirdPerson     = 1,
	VehicleRelative_LeftSide       = 2,
	VehicleRelative_StickOnly      = 3,
	Count                          = 4,
	EVehicleInputMode_MAX          = 5,
};

enum class EVehiclePropertyValueType : uint8
{
	Speed_KPH                      = 0,
	PlanarSpeed_KPH                = 1,
	ForwardSpeed_KPH               = 2,
	Speed_MPH                      = 3,
	PlanarSpeed_MPH                = 4,
	ForwardSpeed_MPH               = 5,
	Mass                           = 6,
	IsPlayerDriven                 = 7,
	IsAIDriven                     = 8,
	EVehiclePropertyValueType_MAX  = 9,
};

enum class EOakWeaponPartType : uint8
{
	Grip                           = 0,
	Foregrip                       = 1,
	Mag                            = 2,
	Mode                           = 3,
	ModeSwitch                     = 4,
	Barrel                         = 5,
	Scope                          = 6,
	Reload                         = 7,
	Melee                          = 8,
	Bolt                           = 9,
	Trigger                        = 10,
	Hammer                         = 11,
	CustomA                        = 12,
	CustomB                        = 13,
	EOakWeaponPartType_MAX         = 14,
};

enum class EVehicleWeapons : uint8
{
	Technical_BarrelLauncher       = 0,
	Technical_StickyBombs          = 1,
	Technical_TireBombs            = 2,
	Outrunner_HeavyMissile         = 3,
	Outrunner_SwarmerMissile       = 4,
	Outrunner_ShotgunMissile       = 5,
	Emperor_Entropy                = 6,
	Emperor_Hellfire               = 7,
	Outrunner_FlameThrower         = 8,
	Outrunner_TeslaCoil            = 9,
	Technical_MachineGun           = 10,
	Technical_FlakCannon           = 11,
	Revolver_SpikeLauncher         = 12,
	Revolver_SawBladeLauncher      = 13,
	Revolver_GrenadeLauncher       = 14,
	Emperor_PulseRifle             = 15,
	Emperor_BouncingLaser          = 16,
	VehicleWeapons_MAX             = 17,
};

enum class EWeaponAudioBodyLoopState : uint8
{
	Active                         = 0,
	Equipping                      = 1,
	Reloading                      = 2,
	Invalid                        = 3,
	EWeaponAudioBodyLoopState_MAX  = 4,
};

enum class EWeaponAudioBodyLoopType : int32
{
	PlayerOnly                     = 0,
	BothPlayersAndNPCs             = 1,
	NPCOnly                        = 2,
	EWeaponAudioBodyLoopType_MAX   = 3,
};

enum class EGlobalNamingAttributionSelection : uint8
{
	Weapon                         = 0,
	MeleeWeapon                    = 1,
	EGlobalNamingAttributionSelection_MAX = 2,
};

enum class EOnlineMessageAnimationEnum : uint8
{
	NONE                           = 0,
	EXIT_ANIMATION                 = 1,
	INTRO_ANIMATION                = 2,
	EOnlineMessageAnimationEnum_MAX = 3,
};

enum class EOptionType : uint8
{
	Option_TODO                    = 0,
	Option_Title                   = 1,
	Option_Keybinding              = 2,
	Gameplay_InvertMapPitchControls = 3,
	Gameplay_InvertMapYawControls  = 4,
	Audio_MasterVolume             = 5,
	Audio_MusicVolume              = 6,
	Audio_SoundEffectVolume        = 7,
	Audio_VoiceVolume              = 8,
	Audio_SoundMode                = 9,
	Audio_PlayerCallouts           = 10,
	Audio_MuteAudioOnFocusLost     = 11,
	Audio_ControllerAudio          = 12,
	Audio_PushToTalk               = 13,
	Audio_VoiceChatVolume          = 14,
	Audio_EnableMicrosoftSpatial_Available = 15,
	Audio_EnableMicrosoftSpatial_Unavailable = 16,
	Audio_AudioLanguage            = 17,
	Gameplay_ResetTutorials        = 18,
	Gameplay_IndividualDifficulty  = 19,
	Gameplay_EnableTrainingMessages = 20,
	Gameplay_MPHOrKPH              = 21,
	Gameplay_CenterCrosshair       = 22,
	Gameplay_FixedMinimapRotation  = 23,
	Gameplay_CensorGore            = 24,
	Gameplay_MinimapLegendaries    = 25,
	Network_NetworkConnection      = 26,
	Network_CrossplayState         = 27,
	Network_FriendSync             = 28,
	Network_MatchmakingRegion      = 29,
	Network_HideTextChat           = 30,
	Network_TradeRequest           = 31,
	Network_PlayerToasts           = 32,
	Network_ToastsDuration         = 33,
	Network_StreamingService       = 34,
	Network_IncreasedSubscribersChance = 35,
	Network_RareChestEventEnabled  = 36,
	Network_BadassEventEnabled     = 37,
	Network_BadassEventCooldown    = 38,
	Network_PinataEventEnabled     = 39,
	Network_MoxxisDrinkEventEnabled = 40,
	Network_MoxxisDrinkEventBitsProductId = 41,
	Network_ExtractionEventEnabled = 42,
	Graphics_WindowMode            = 43,
	Graphics_Resolutions           = 44,
	Graphics_VSync                 = 45,
	Graphics_FieldOfView           = 46,
	Graphics_EnableMotionBlur      = 47,
	Graphics_TargetDisplay         = 48,
	Graphics_GraphicsMode          = 49,
	Graphics_CalibrateSafeArea     = 50,
	Graphics_CalibrateDisplay      = 51,
	Graphics_VehicleFieldOfView    = 52,
	Graphics_FramerateLimiter      = 53,
	Graphics_EnableCAS             = 54,
	Graphics_PreferredAPI          = 55,
	Graphics_AspectRatio           = 56,
	Graphics_RefreshRate           = 57,
	Graphics_FramerateLimitCustom  = 58,
	Graphics_ResolutionScale       = 59,
	Graphics_HUDScaleMultiplier    = 60,
	Graphics_SplitScreenConfig     = 61,
	Graphics_AMD_FSR2              = 62,
	Graphics_AMD_FSR2_Sharpness    = 63,
	AdvancedGraphics_GraphicsQuality = 64,
	AdvancedGraphics_AntialiasingMode = 65,
	AdvancedGraphics_AnisotropicFiltering = 66,
	AdvancedGraphics_DisplayPerformanceStats = 67,
	AdvancedGraphics_TextureDetail = 68,
	AdvancedGraphics_DrawDistance  = 69,
	AdvancedGraphics_Clutter       = 70,
	AdvancedGraphics_Tessellation  = 71,
	AdvancedGraphics_Foliage       = 72,
	AdvancedGraphics_VolumetricFog = 73,
	AdvancedGraphics_ScreenSpaceReflections = 74,
	AdvancedGraphics_CharacterTextureDetail = 75,
	AdvancedGraphics_CharacterDetail = 76,
	AdvancedGraphics_ShadowQuality = 77,
	AdvancedGraphics_AmbientOcclusionQuality = 78,
	AdvancedGraphics_CameraMotionBlur = 79,
	AdvancedGraphics_ObjectMotionBlur = 80,
	AdvancedGraphics_TextureStreaming = 81,
	AdvancedGraphics_MaterialQuality = 82,
	AdvancedGraphics_SystemInfo    = 83,
	Benchmark_Run                  = 84,
	Benchmark_Type                 = 85,
	Benchmark_DataOutput           = 86,
	Benchmark_Results              = 87,
	Benchmark_Uncapped             = 88,
	Benchmark_ResultPhase          = 89,
	Benchmark_ResultMeasurementType = 90,
	Benchmark_ResultDateTime       = 91,
	Benchmark_ResultFPS            = 92,
	Benchmark_ResultFrameTime      = 93,
	Benchmark_ResultLoadTime       = 94,
	Benchmark_ResultDataOutputPath = 95,
	Benchmark_ResultDetails0       = 96,
	Benchmark_ResultDetails1       = 97,
	Benchmark_ResultDetails2       = 98,
	Benchmark_ResultDetails3       = 99,
	Benchmark_ResultDetails4       = 100,
	Controls_MouseInvertLook       = 101,
	Controls_MouseSmoothing        = 102,
	Controls_LookSensitivity       = 103,
	Controls_MouseWeaponZoomSensitivity = 104,
	Controls_MouseVehicleSpensitivity = 105,
	Controls_GamepadInvertVerticalLook = 106,
	Controls_GamepadInvertHorizontalLook = 107,
	Controls_GamepadLookSensitivity = 108,
	Controls_GamepadWeaponZoomSensitivity = 109,
	Controls_GamepadVehicleSensitivity = 110,
	Controls_Vibration             = 111,
	Controls_TriggerFeedback       = 112,
	Controls_GamepadInvertMapVerticalLook = 113,
	Controls_GamepadInvertMapHorizontalLook = 114,
	Controls_MouseAcceleration     = 115,
	Controls_EnableGamepad         = 116,
	Controls_GamepadAimingInputStyle = 117,
	Controls_GlyphMode             = 118,
	Controls_AllowWindowsKey       = 119,
	ControlsAdvanced_InvertForwardMovement = 120,
	ControlsAdvanced_InvertStrafeMovement = 121,
	ControlsAdvanced_LeftDeadZoneCenter = 122,
	ControlsAdvanced_LeftDeadZoneOuter = 123,
	ControlsAdvanced_LeftAxialDeadZone = 124,
	ControlsAdvanced_RightDeadZoneCenter = 125,
	ControlsAdvanced_RightDeadZoneOuter = 126,
	ControlsAdvanced_RightAxialDeadZone = 127,
	Bindings_Move                  = 128,
	Bindings_Look                  = 129,
	Bindings_PCMoveForward         = 130,
	Bindings_PCMoveBackward        = 131,
	Bindings_PCStrafeLeft          = 132,
	Bindings_PCStrafeRight         = 133,
	Bindings_Jump                  = 134,
	Bindings_Crouch                = 135,
	Bindings_Sprint                = 136,
	Bindings_Fire                  = 137,
	Bindings_Reload                = 138,
	Bindings_Melee                 = 139,
	Bindings_ActionSkill           = 140,
	Bindings_GrenadeActionSkill2   = 141,
	Bindings_NextWeapon            = 142,
	Bindings_PrevWeapon            = 143,
	Bindings_NextWeaponCycleModeUseAlt = 144,
	Bindings_SelectWeapon1         = 145,
	Bindings_SelectWeapon2         = 146,
	Bindings_SelectWeapon3         = 147,
	Bindings_SelectWeapon4         = 148,
	Bindings_DropWeapon            = 149,
	Bindings_SecondaryUseQuickMenu = 150,
	Bindings_UseGiveUp             = 151,
	Bindings_UseGiveUpReload       = 152,
	Bindings_WeaponToggle          = 153,
	Bindings_Zoom                  = 154,
	Bindings_Emote1                = 155,
	Bindings_Emote2                = 156,
	Bindings_Emote3                = 157,
	Bindings_Emote4                = 158,
	Bindings_UnrebindableButton    = 159,
	Bindings_Vehicle_SteerForward  = 160,
	Bindings_Vehicle_SteerBackward = 161,
	Bindings_Vehicle_WeaponPrimary = 162,
	Bindings_Vehicle               = 163,
	ControlSchemes_Driving         = 164,
	ControlSchemes_DrivingJoystick = 165,
	ControlSchemes_Walking         = 166,
	ControlSchemes_WalkingJoystick = 167,
	Accessibility_CrosshairFriendlyColor = 168,
	Accessibility_CrosshairNeutralColor = 169,
	Accessibility_CrosshairHostileColor = 170,
	Accessibility_Subtitles        = 171,
	Accessibility_ClosedCaptioning = 172,
	Accessibility_CCTextSize       = 173,
	Accessibility_CCBackgroundOpacity = 174,
	Accessibility_AimAssist        = 175,
	Accessibility_GamepadAimAssist = 176,
	Accessibility_ZoomSnap         = 177,
	Accessibility_GamepadZoomSnap  = 178,
	Accessibility_MouseZoomSnap    = 179,
	Accessibility_WeaponZoom       = 180,
	Accessibility_AutoCenter       = 181,
	Accessibility_HeadBobScale     = 182,
	Accessibility_CameraShakeScale = 183,
	Accessibility_Sprint           = 184,
	Accessibility_Crouch           = 185,
	Accessibility_MantleStyle      = 186,
	Accessibility_MovementRecenters = 187,
	Accessibility_ShowDamageNumberElementalIcons = 188,
	EOptionType_MAX                = 189,
};

enum class EOptionItemType : uint8
{
	Title                          = 0,
	Slider                         = 1,
	Spinner                        = 2,
	BooleanSpinner                 = 3,
	Button                         = 4,
	Controls                       = 5,
	Keybinding_Button              = 6,
	KeyBinding_Axis                = 7,
	TodoItem                       = 8,
	DropDownList                   = 9,
	BenchmarkResults               = 10,
	EOptionItemType_MAX            = 11,
};

enum class EOakUIOptionBindType : int32
{
	None                           = 0,
	PlayerKeyboard                 = 1,
	PlayerControllerKeyboard       = 2,
	PlayerGamepad                  = 3,
	PlayerControllerGamepad        = 4,
	EOakUIOptionBindType_MAX       = 5,
};

enum class EOakUIOptionTabType : uint8
{
	None                           = 0,
	Audio                          = 1,
	Gameplay                       = 2,
	Graphics                       = 3,
	Graphics_Console               = 4,
	Graphics_Advanced              = 5,
	Network                        = 6,
	Controls_Basic                 = 7,
	Controls_Advanced              = 8,
	Controls_Keyboard              = 9,
	Controls_Controller_XBox       = 10,
	Controls_Controller_XBSX       = 11,
	Controls_Controller_Ps4        = 12,
	Controls_Controller_Ps5        = 13,
	Controls_Controller_SwitchPro  = 14,
	Controls_Controller_Stadia     = 15,
	Accessibility                  = 16,
	Graphics_Benchmark             = 17,
	EOakUIOptionTabType_MAX        = 18,
};

enum class EOakUIOptionScreenType : uint8
{
	None                           = 0,
	Audio                          = 1,
	Gameplay                       = 2,
	Graphics                       = 3,
	Network                        = 4,
	Controls                       = 5,
	Accessibility                  = 6,
	EOakUIOptionScreenType_MAX     = 7,
};

enum class EEchoPerformanceMode : uint8
{
	EchoCommunication              = 0,
	EchoLog                        = 1,
	EEchoPerformanceMode_MAX       = 2,
};

enum class EPhotoModeOptionEffect : uint8
{
	None                           = 0,
	FieldOfView                    = 1,
	CameraRoll                     = 2,
	Target                         = 3,
	FocusDistance                  = 4,
	FocusRegion                    = 5,
	DOFIntensity                   = 6,
	Contrast                       = 7,
	Saturation                     = 8,
	Gamma                          = 9,
	Gain                           = 10,
	TimeOfDay                      = 11,
	HideCharacters                 = 12,
	FilmGrain                      = 13,
	Filter                         = 14,
	FilterIntensity                = 15,
	VignetteIntensity              = 16,
	VignetteFeathering             = 17,
	HideDamageNumbers              = 18,
	OverrideDOF                    = 19,
	Border                         = 20,
	Tag                            = 21,
	EPhotoModeOptionEffect_MAX     = 22,
};

enum class EPlayerAlertType : uint8
{
	Location                       = 0,
	Neutral                        = 1,
	Friendly                       = 2,
	Hostile                        = 3,
	Loot                           = 4,
	Chest                          = 5,
	Max                            = 6,
};

enum class EPlayerBannerUsage : uint8
{
	PlayerOne                      = 0,
	PlayerTwo                      = 1,
	PlayerThree                    = 2,
	PlayerFour                     = 3,
	None                           = 4,
	EPlayerBannerUsage_MAX         = 5,
};

enum class EMeleeChainSpecialIdx : uint8
{
	StartWithOpener                = -2,
	ProceedToChain                 = -1,
	EMeleeChainSpecialIdx_MAX      = 0,
};

enum class ETransactionType : uint8
{
	Buy                            = 0,
	Sell                           = 1,
	BuyBack                        = 2,
	SellAllJunk                    = 3,
	PurchaseCustomization          = 4,
	ETransactionType_MAX           = 5,
};

enum class EPlayerStandInType : uint8
{
	Unspecified                    = 0,
	FrontendLobby                  = 1,
	CharacterSelect                = 2,
	CharacterCreate                = 3,
	StatusMenu                     = 4,
	SkillScreen                    = 5,
	RnRCharacterSelect             = 6,
	HeroStatue                     = 7,
	EPlayerStandInType_MAX         = 8,
};

enum class EFrontendStandInSpecialAnimType : uint8
{
	PlayerArrival                  = 0,
	PrimaryPlayerFlourish          = 1,
	CharacterSelectSelection       = 2,
	CharacterSelectSelection_NoActionSkill = 3,
	CharacterCreationSelection     = 4,
	MAX                            = 5,
};

enum class EPlayerTradingStance : uint8
{
	Deciding                       = 0,
	TradeReady                     = 1,
	DuelReady                      = 2,
	Disconnected                   = 3,
	EPlayerTradingStance_MAX       = 4,
};

enum class EPlayerTradeManagerStatus : uint8
{
	Uninitialized                  = 0,
	Trading                        = 1,
	Dueling                        = 2,
	ResolvingTrade                 = 3,
	ResolvingDuel                  = 4,
	EPlayerTradeManagerStatus_MAX  = 5,
};

enum class EPlayThroughType : uint8
{
	CurrentPlayThrough             = 0,
	EffectivePlayThrough           = 1,
	EPlayThroughType_MAX           = 2,
};

enum class EProjectedMeshShape : uint8
{
	Circle                         = 0,
	Square                         = 1,
	EProjectedMeshShape_MAX        = 2,
};

enum class ERandomEncounterManagerState : uint8
{
	Idle                           = 0,
	InDanger                       = 1,
	Encounter                      = 2,
	ERandomEncounterManagerState_MAX = 3,
};

enum class EShieldState : uint8
{
	Uninitialized                  = 0,
	Empty                          = 1,
	PartiallyFilled                = 2,
	Filled                         = 3,
	EShieldState_MAX               = 4,
};

enum class EShieldAttributeModificationSource : uint8
{
	Other                          = 0,
	Equipped                       = 1,
	Filled                         = 2,
	Depleted                       = 3,
	NotDepleted                    = 4,
	EShieldAttributeModificationSource_MAX = 5,
};

enum class EStackOperator : uint8
{
	Add                            = 0,
	Multiply                       = 1,
	EStackOperator_MAX             = 2,
};

enum class EShieldDamageModifierApplicationTarget : uint8
{
	InstigatorCausedDamage         = 0,
	InstigatorReceivedDamage       = 1,
	EShieldDamageModifierApplicationTarget_MAX = 2,
};

enum class EAugmentTriggerOn : uint8
{
	TriggerOn_Filled               = 0,
	TriggerOn_NotFilled            = 1,
	TriggerOn_Depleted             = 2,
	TriggerOn_NotDepleted          = 3,
	TriggerOn_MAX                  = 4,
};

enum class EItemDropOnDeathType : uint8
{
	DropOnDeath_All                = 0,
	DropOnDeath_FirstDeath         = 1,
	DropOnDeath_LastDeath          = 2,
	DropOnDeath_RandomDeath        = 3,
	DropOnDeath_MAX                = 4,
};

enum class ELootInstancingPolicy : uint8
{
	Instance                       = 0,
	DontInstance                   = 1,
	InstanceForPlayer              = 2,
	ELootInstancingPolicy_MAX      = 3,
};

enum class ESpawnDroppedPickupLootRequestType : uint8
{
	Drop                           = 0,
	Attach                         = 1,
	ESpawnDroppedPickupLootRequestType_MAX = 2,
};

enum class ESpellContext : uint8
{
	Context                        = 0,
	Primary                        = 1,
	Secondary                      = 2,
	ESpellContext_MAX              = 3,
};

enum class ESpellAttributeContext : uint8
{
	Spell                          = 0,
	Player                         = 1,
	Owner                          = 2,
	ESpellAttributeContext_MAX     = 3,
};

enum class EStandInAutoScaleMode : uint8
{
	None                           = 0,
	ScaleDown                      = 1,
	ScaleUpOrDown                  = 2,
	EStandInAutoScaleMode_MAX      = 3,
};

enum class EStandInActorType : uint8
{
	None                           = 0,
	Player                         = 1,
	PlayerCreate                   = 2,
	PlayerStatusMenu               = 3,
	PlayerSkillScreen              = 4,
	PlayerBanner                   = 5,
	PlayerStatue                   = 6,
	ScrollsAuraMenu                = 7,
	WorldBuffsMenu                 = 8,
	CustomActor                    = 9,
	EStandInActorType_MAX          = 10,
};

enum class EEncounterInstanceState : uint8
{
	Inactive                       = 0,
	Active                         = 1,
	Playing                        = 2,
	Unloading                      = 3,
	EEncounterInstanceState_MAX    = 4,
};

enum class EOverworldRepresentationType : uint8
{
	Default                        = 0,
	Bone                           = 1,
	Cyclops                        = 2,
	Goblin                         = 3,
	Humans                         = 4,
	Mimic                          = 5,
	Mushrooms                      = 6,
	Naga                           = 7,
	Humans_Pirates                 = 8,
	Custom_Boss_Baldornok          = 61,
	Custom_SolarCream              = 62,
	Tutorial                       = 63,
	EOverworldRepresentationType_MAX = 64,
};

enum class EEncounterArmy : uint8
{
	None                           = 0,
	BoneArmy                       = 1,
	Crab                           = 2,
	Cyclops                        = 3,
	Goblin                         = 4,
	Mimic                          = 5,
	Mushroom                       = 6,
	Shark                          = 7,
	Splotch                        = 8,
	Troll                          = 9,
	Wyvern                         = 10,
	Human                          = 11,
	Zombie                         = 12,
	NagaAqua                       = 13,
	NagaSand                       = 14,
	Eyeclop                        = 15,
	ExtraArmy1                     = 16,
	ExtraArmy2                     = 17,
	ExtraArmy3                     = 18,
	EEncounterArmy_MAX             = 19,
};

enum class EEncounterTrapBehaviorType : uint8
{
	Overlap                        = 0,
	Damage                         = 1,
	AlwaysAlternating              = 2,
	NUM_USED_TYPES                 = 3,
	ExtraTrapType1                 = 4,
	ExtraTrapType2                 = 5,
	ExtraTrapType3                 = 6,
	EEncounterTrapBehaviorType_MAX = 7,
};

enum class ETedioreHomingApplicationType : uint8
{
	Default                        = 0,
	MIRV                           = 1,
	ETedioreHomingApplicationType_MAX = 2,
};

enum class EBehaviorOutput : uint8
{
	Found                          = 0,
	NotFound                       = 1,
	EBehaviorOutput_MAX            = 2,
};

enum class ETinkPileUseState : uint8
{
	None                           = 0,
	NotUsed                        = 1,
	InUse                          = 2,
	WasUsed                        = 3,
	Resetting                      = 4,
	ETinkPileUseState_MAX          = 5,
};

enum class ETinkPileBuildOption : uint8
{
	None                           = 0,
	TurretBasic                    = 1,
	RocketPodBasic                 = 2,
	TurretPlaceholder1             = 3,
	TurretPlaceholder2             = 4,
	TurretPlaceholder3             = 5,
	TurretPlaceholder4             = 6,
	ETinkPileBuildOption_MAX       = 7,
};

enum class ETransporterCraneState : uint8
{
	Deactivated                    = 0,
	Stopped                        = 1,
	MoveForward                    = 2,
	MoveBackward                   = 3,
	ETransporterCraneState_MAX     = 4,
};

enum class EGroundTurretType : uint8
{
	Seated                         = 0,
	Standing                       = 1,
	EGroundTurretType_MAX          = 2,
};

enum class EDLCCurrencyType : uint8
{
	Souls                          = 0,
	EDLCCurrencyType_MAX           = 1,
};

enum class EBackgroundEffects : uint8
{
	StatusBackground               = 0,
	StatusPurple                   = 1,
	PauseBackground                = 2,
	EBackgroundEffects_MAX         = 3,
};

enum class EUIAudioCues : uint8
{
	StatusMenuOpen                 = 0,
	SellAllJunk                    = 1,
	TravelCountdownTone            = 2,
	EUIAudioCues_MAX               = 3,
};

enum class EUIManagerState : uint8
{
	None                           = 0,
	Active                         = 1,
	Hiding                         = 2,
	EUIManagerState_MAX            = 3,
};

enum class EOakUI : uint8
{
	Lowest                         = 0,
	BelowNormal                    = 1,
	Normal                         = 2,
	AboveNormal                    = 3,
	Critical                       = 4,
	OakUI_MAX                      = 5,
};

enum class EChallengeCategoryID : uint8
{
	GameCompletion                 = 0,
	Enemy                          = 1,
	Weapon                         = 2,
	Crew                           = 3,
	Exploration                    = 4,
	Slaughter                      = 5,
	Raid                           = 6,
	ProvingGround                  = 7,
	Max                            = 8,
};

enum class ERevolverOffsetMode : uint8
{
	None                           = 0,
	Left                           = 1,
	Right                          = 2,
	ERevolverOffsetMode_MAX        = 3,
};

enum class EWheelAudioType : uint8
{
	Standard                       = 0,
	MultiPosition2Wheels           = 1,
	MultiPosition1Wheel            = 2,
	SingleWheel                    = 3,
	EWheelAudioType_MAX            = 4,
};

enum class EVehiclePlaySingleAnimMode : int32
{
	PlayOnStart                    = 0,
	PlayOnStop                     = 1,
	EVehiclePlaySingleAnimMode_MAX = 2,
};

enum class EEmitterEnableMode : uint8
{
	EnableOnStart                  = 0,
	EnableOnStartDisableOnStop     = 1,
	EnableOnStop                   = 2,
	DisableOnStart                 = 3,
	DisableOnStartEnableOnStop     = 4,
	DisableOnStop                  = 5,
	EEmitterEnableMode_MAX         = 6,
};

enum class EFollowVehicleRotation : uint8
{
	None                           = 0,
	Yaw                            = 1,
	YawAndPitch                    = 2,
	EFollowVehicleRotation_MAX     = 3,
};

enum class EVendingMachineType : uint8
{
	Guns                           = 0,
	Ammo                           = 1,
	Health                         = 2,
	CrazyEarl                      = 3,
	EVendingMachineType_MAX        = 4,
};

enum class EVendingMachineTilesMode : uint8
{
	Purchase                       = 0,
	BuyBack                        = 1,
	Sell                           = 2,
	MAX                            = 3,
};

enum class EVendingMachineInteractionMode : uint8
{
	Purchase                       = 0,
	BuyBack                        = 1,
	Sell                           = 2,
	EVendingMachineInteractionMode_MAX = 3,
};

enum class EVendingMachineAnimType : uint8
{
	Idle                           = 0,
	Back                           = 1,
	BackTwice                      = 2,
	BackThrice                     = 3,
	BackJiggle                     = 4,
	Forward                        = 5,
	ForwardTwice                   = 6,
	ForwardThrice                  = 7,
	ForwardJiggle                  = 8,
	Purchase                       = 9,
	PurchaseInPlace                = 10,
	TurnOn                         = 11,
	TurnOff                        = 12,
	ErrorJiggle                    = 13,
	SlideInFromTop                 = 14,
	SlideInFromBottom              = 15,
	MAX                            = 16,
};

enum class EVendingMachineTrayTileType : uint8
{
	Regular                        = 0,
	Featured                       = 1,
	GearSoldByFriend               = 2,
	VisibleDummy                   = 3,
	EndOfListDummy                 = 4,
	EVendingMachineTrayTileType_MAX = 5,
};

enum class EWeaponShieldActivationTrigger : uint8
{
	Zoom                           = 0,
	Attach                         = 1,
	Custom                         = 2,
	EWeaponShieldActivationTrigger_MAX = 3,
};

enum class EWeaponShieldState : uint8
{
	Normal                         = 0,
	Depleted                       = 1,
	EWeaponShieldState_MAX         = 2,
};

enum class EWeaponWearValueType : uint8
{
	Wear                           = 0,
	Rust                           = 1,
	Dirt                           = 2,
	EWeaponWearValueType_MAX       = 3,
};

enum class EZoneMapTargetType : uint8
{
	None                           = 0,
	POI                            = 1,
	Player                         = 2,
	CrewChallenge                  = 3,
	MissionWaypoint                = 4,
	DeployedVehicle                = 5,
	EZoneMapTargetType_MAX         = 6,
};


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x38 (0x38 - 0x0)
// ScriptStruct OakGame.SecondaryHealthDamageEventDetails
struct FSecondaryHealthDamageEventDetails
{
public:
	class UDamageSource*                         DamageSource;                                      // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxDamageType*                        DamageType;                                        // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class APawn*                                 InstigatorPawn;                                    // 0x10(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWasCrit;                                          // 0x18(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6EF5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               HitLocation;                                       // 0x1C(0xC)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               HitDirection;                                      // 0x28(0xC)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6EF6[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct OakGame.HealthTypeDepletedDetails
struct FHealthTypeDepletedDetails
{
public:
	class UHealthTypeData*                       HealthType;                                        // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxDamageType*                        DamageType;                                        // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Index;                                             // 0x10(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6EF7[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct OakGame.DamageBlockEventDetails
struct FDamageBlockEventDetails
{
public:
	class UGbxDamageType*                        DamageType;                                        // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDamageSource*                         DamageSource;                                      // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct OakGame.ExitDownStateInformation
struct FExitDownStateInformation
{
public:
	enum class EExitDownStateReason              ExitReason;                                        // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6EF8[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UHUDNotificationAsset*                 CustomExitNotification;                            // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  CustomExitMessageText;                             // 0x10(0x18)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// ScriptStruct OakGame.HUDInWorldIconTargetInfo
struct FHUDInWorldIconTargetInfo
{
public:
	class UInWorldIconData*                      IconData;                                          // 0x0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                Actor;                                             // 0x8(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                       LocationComponent;                                 // 0x10(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  SocketName;                                        // 0x18(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               LocationOffset;                                    // 0x20(0xC)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Radius;                                            // 0x2C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 Guid;                                              // 0x30(0x10)(BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6EF9[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x58 (0x58 - 0x0)
// ScriptStruct OakGame.OakResourceEffectData
struct FOakResourceEffectData
{
public:
	enum class EOakStatusEffectResourceEffectType ResourceEffectType;                                // 0x0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6EFA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UGameResourcePoolData*                 ResourcePool;                                      // 0x8(0x8)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxAttributeData*                     PostDepleteImmuneTime;                             // 0x10(0x8)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGbxDamageType>            DamageTypeClass;                                   // 0x18(0x8)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxAttributeData*                     DamageModifier;                                    // 0x20(0x8)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxAttributeData*                     DamagedActorModifier;                              // 0x28(0x8)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefaultPercentBaseDamage;                          // 0x30(0x4)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6EFB[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UOakStatusEffectPresentationData*      FXData;                                            // 0x38(0x8)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOakPresentableStatusEffectData*       StatusEffectData;                                  // 0x40(0x8)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bTrackContributors;                                // 0x48(0x1)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6EFC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ContributorExpirationTime;                         // 0x4C(0x4)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ContributorNotificationTime;                       // 0x50(0x4)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6EFD[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct OakGame.OakCoordinatedEffectSwitchState
struct FOakCoordinatedEffectSwitchState
{
public:
	class FString                                DisplayName;                                       // 0x0(0x10)(Edit, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  Name;                                              // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UOakAction_CoordinatedEffect> Effect;                                            // 0x18(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// ScriptStruct OakGame.OakCoordinatedEffectSwitch
struct FOakCoordinatedEffectSwitch
{
public:
	class UEnum*                                 Enum;                                              // 0x0(0x8)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  NativeEnumName;                                    // 0x8(0x8)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bNativeEnum;                                       // 0x10(0x1)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        InitialState;                                      // 0x11(0x1)(Edit, ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6EFE[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FOakCoordinatedEffectSwitchState> States;                                            // 0x18(0x10)(Edit, EditFixedSize, ZeroConstructor, RepSkip, NativeAccessSpecifierPrivate)
	uint8                                        CurrentState;                                      // 0x28(0x1)(ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6EFF[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                Owner;                                             // 0x30(0x8)(ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGbxActionComponent*                   ActionComp;                                        // 0x38(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6F00[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	uint8                                        ReplicatedState;                                   // 0x50(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6F01[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct OakGame.ColorRandomizer
struct FColorRandomizer
{
public:
	float                                        Hue;                                               // 0x0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        Saturation;                                        // 0x4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FNumericRange                         Scale;                                             // 0x8(0x8)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
};

// 0x14 (0x14 - 0x0)
// ScriptStruct OakGame.OakCharacterCustomization
struct FOakCharacterCustomization
{
public:
	bool                                         bRandomizeColor;                                   // 0x0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F02[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FColorRandomizer                      ColorRandomizer;                                   // 0x4(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x78 (0x8C - 0x14)
// ScriptStruct OakGame.OakCharacterColorization
struct FOakCharacterColorization : public FOakCharacterCustomization
{
public:
	struct FLinearColor                          Primary1;                                          // 0x14(0x10)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverridePrimary1;                                 // 0x24(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F03[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          Primary2;                                          // 0x28(0x10)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverridePrimary2;                                 // 0x38(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F04[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          Secondary1;                                        // 0x3C(0x10)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideSecondary1;                               // 0x4C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F05[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          Secondary2;                                        // 0x50(0x10)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideSecondary2;                               // 0x60(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F06[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          Tertiary1;                                         // 0x64(0x10)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideTertiary1;                                // 0x74(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F07[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          Tertiary2;                                         // 0x78(0x10)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideTertiary2;                                // 0x88(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F08[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x14 (0x28 - 0x14)
// ScriptStruct OakGame.OakCharacterSkinTone
struct FOakCharacterSkinTone : public FOakCharacterCustomization
{
public:
	struct FLinearColor                          SkinTone;                                          // 0x14(0x10)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideSkinTone;                                 // 0x24(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F09[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x3C (0x50 - 0x14)
// ScriptStruct OakGame.OakCharacterHair
struct FOakCharacterHair : public FOakCharacterCustomization
{
public:
	struct FLinearColor                          InnerColor;                                        // 0x14(0x10)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideInnerColor;                               // 0x24(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F0A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          OuterColor;                                        // 0x28(0x10)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideOuterColor;                               // 0x38(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F0B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          SSSColor;                                          // 0x3C(0x10)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideSSSColor;                                 // 0x4C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F0C[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct OakGame.OakCharacterTexturePair
struct FOakCharacterTexturePair
{
public:
	class UTexture*                              Comp;                                              // 0x0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                              Normal;                                            // 0x8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x5C (0x70 - 0x14)
// ScriptStruct OakGame.OakCharacterDecal
struct FOakCharacterDecal : public FOakCharacterCustomization
{
public:
	float                                        DecalStrength;                                     // 0x14(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideDecalStrength;                            // 0x18(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F0D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          DecalColor;                                        // 0x1C(0x10)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideDecalColor;                               // 0x2C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F0E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FLinearColor                          DecalColorHighlight;                               // 0x30(0x10)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideDecalColorHighlight;                      // 0x40(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F0F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture*                              Texture_Comp;                                      // 0x48(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                              Texture_Normal;                                    // 0x50(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture*                              Texture_BaseColor;                                 // 0x58(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FOakCharacterTexturePair>      Textures;                                          // 0x60(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct OakGame.OakCharacterPattern
struct FOakCharacterPattern
{
public:
	float                                        Primary;                                           // 0x0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverridePrimary;                                  // 0x4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F10[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Secondary;                                         // 0x8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideSecondary;                                // 0xC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F11[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Tertiary;                                          // 0x10(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideTertiary;                                 // 0x14(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F12[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Skin;                                              // 0x18(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideSkin;                                     // 0x1C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRandomizeUse;                                     // 0x1D(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F13[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Chance;                                            // 0x20(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRandomizeTexture;                                 // 0x24(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F14[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FOakCharacterTexturePair>      Textures;                                          // 0x28(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x14 (0x28 - 0x14)
// ScriptStruct OakGame.OakCharacterTattoos
struct FOakCharacterTattoos : public FOakCharacterCustomization
{
public:
	struct FLinearColor                          TattooColor;                                       // 0x14(0x10)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideTattooColor;                              // 0x24(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F15[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct OakGame.OakCharacterEyes
struct FOakCharacterEyes
{
public:
	TArray<struct FColor>                        RandomEyeColors;                                   // 0x0(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bOverrideEyeColor;                                 // 0x10(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F16[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x248 (0x248 - 0x0)
// ScriptStruct OakGame.OakCharacterCustomizationData
struct FOakCharacterCustomizationData
{
public:
	TArray<struct FOakCharacterColorization>     Customization_Colorizations;                       // 0x0(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bApplyCustomization_Colorization;                  // 0x10(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F17[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FOakCharacterPattern                  Customization_Pattern;                             // 0x18(0x38)(Edit, NativeAccessSpecifierPublic)
	bool                                         bApplyCustomization_Pattern;                       // 0x50(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F18[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FOakCharacterSkinTone                 Customization_SkinTone;                            // 0x54(0x28)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bApplyCustomization_SkinTone;                      // 0x7C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F19[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FOakCharacterTattoos                  Customization_Tattoos;                             // 0x80(0x28)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bApplyCustomization_Tattoos;                       // 0xA8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F1A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FOakCharacterHair>             Customization_Hairs;                               // 0xB0(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bApplyCustomization_Hair;                          // 0xC0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F1B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FOakCharacterEyes                     Customization_Eyes;                                // 0xC8(0x18)(Edit, NativeAccessSpecifierPublic)
	bool                                         bApplyCustomization_Eyes;                          // 0xE0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F1C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FOakCharacterDecal>            Customization_Decals;                              // 0xE8(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bApplyCustomization_Decal;                         // 0xF8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F1D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FOakCharacterColorization             Customization_Colorization;                        // 0xFC(0x8C)(NoDestructor, NativeAccessSpecifierPublic)
	struct FOakCharacterHair                     Customization_Hair;                                // 0x188(0x50)(NoDestructor, NativeAccessSpecifierPublic)
	struct FOakCharacterDecal                    Customization_Decal;                               // 0x1D8(0x70)(NativeAccessSpecifierPublic)
};

// 0x98 (0x98 - 0x0)
// ScriptStruct OakGame.OakGenderData
struct FOakGenderData
{
public:
	class USkeletalMesh*                         Mesh;                                              // 0x0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               MeshOffset;                                        // 0x8(0xC)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F1E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UGestaltPartListData*                  GestaltPartList;                                   // 0x18(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UAnimInstance>             AnimBlueprint;                                     // 0x20(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                          AnimSetGenericNames_Enable;                        // 0x28(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                          AnimSetGenericNames_Disable;                       // 0x38(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UGbxAnimSet*>                   AnimSets_Enable;                                   // 0x48(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UGbxAnimSet*>                   AnimSets_Disable;                                  // 0x58(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UMaterialInstance*>             Materials;                                         // 0x68(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UDialogNameTag*>                DialogNameTags;                                    // 0x78(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class UDestructibleMesh*                     CryoMesh;                                          // 0x88(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        GoreSourceMaterialIndex;                           // 0x90(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F1F[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xF8 (0xF8 - 0x0)
// ScriptStruct OakGame.WeaponSlotEntry
struct FWeaponSlotEntry
{
public:
	class UWeaponSlotData*                       SlotData;                                          // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AWeapon*                               AttachedWeapon;                                    // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AWeapon*                               PendingAttachedWeapon;                             // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AWeapon*                               ClientPredictedPendingAttachedWeapon;              // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               RestoreSlotData;                                   // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F20[0xB8];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameResourcePoolReference            AccuracyPool;                                      // 0xE0(0x18)(NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
};

// 0x650 (0x650 - 0x0)
// ScriptStruct OakGame.WeaponSlotContainer
struct FWeaponSlotContainer
{
public:
	TArray<struct FWeaponSlotEntry>              WeaponSlots;                                       // 0x0(0x10)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F21[0x640];                                   // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x24 (0x30 - 0xC)
// ScriptStruct OakGame.InventorySlotEntry
struct FInventorySlotEntry : public FFastArraySerializerItem
{
public:
	uint8                                        Pad_6F22[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                EquippedInventory;                                 // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Enabled;                                           // 0x18(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         Selected;                                          // 0x19(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F23[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UInventorySlotData*                    SlotData;                                          // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                ClientCachedEquippedInventory;                     // 0x28(0x8)(ZeroConstructor, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// 0x38 (0xE8 - 0xB0)
// ScriptStruct OakGame.InventorySlotContainer
struct FInventorySlotContainer : public FFastArraySerializer
{
public:
	TArray<struct FInventorySlotEntry>           InventorySlots;                                    // 0xB0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F24[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct OakGame.HolsteredWeaponData
struct FHolsteredWeaponData
{
public:
	enum class EWeaponHolsteredSizeType          WeaponSizeType;                                    // 0x0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPickupLootAttachmentMode         AttachMode;                                        // 0x1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F25[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  SocketName;                                        // 0x8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bVisibleInFirstPerson;                             // 0x10(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F26[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xE8 (0xE8 - 0x0)
// ScriptStruct OakGame.CharacterCorpseState
struct FCharacterCorpseState
{
public:
	uint8                                        bEnableCorpseCleanup : 1;                          // Mask: 0x1, PropSize: 0x10x0(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bShouldTearOff : 1;                                // Mask: 0x2, PropSize: 0x10x0(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bOverrideVisibleCorpseRemovalTime : 1;             // Mask: 0x4, PropSize: 0x10x0(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_26F : 5;                                    // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_6F27[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        OverrideVisibleCorpseRemovalTime;                  // 0x4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ContactWithVehiclesTime;                           // 0x8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F28[0xDC];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x2 (0x2 - 0x0)
// ScriptStruct OakGame.MapIDData
struct FMapIDData
{
public:
	uint8                                        ZoneNameID;                                        // 0x0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        MapNameID;                                         // 0x1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct OakGame.BossbarEventData
struct FBossbarEventData
{
public:
	enum class EBossbarEventType                 Type;                                              // 0x0(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F29[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AOakCharacter*                         Boss;                                              // 0x8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct OakGame.GlobalScreenParticleData
struct FGlobalScreenParticleData
{
public:
	class UParticleSystem*                       StartAndLoopParticle;                              // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                       EndParticle;                                       // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                             ContentDims;                                       // 0x10(0x8)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ParticleDepth;                                     // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F2A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  Tag;                                               // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct OakGame.LuckAssociation
struct FLuckAssociation
{
public:
	class ULuckCategoryData*                     Category;                                          // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                    LuckModification;                                  // 0x8(0xC)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F2B[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct OakGame.EffectivePlayerCountData
struct FEffectivePlayerCountData
{
public:
	int32                                        EffectiveNumPlayers;                               // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EEffectivePlayerCountSetting      Setting;                                           // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct OakGame.MayhemDebugOverrides
struct FMayhemDebugOverrides
{
public:
	TArray<int32>                                ModifierIndexOverrides;                            // 0x0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// ScriptStruct OakGame.MayhemReplicableSetsData
struct FMayhemReplicableSetsData
{
public:
	int32                                        ActiveSetsBits;                                    // 0x0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct OakGame.MayhemModeState
struct FMayhemModeState
{
public:
	bool                                         bIsActive;                                         // 0x0(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bIsLocked;                                         // 0x1(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6F2C[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MayhemLevel;                                       // 0x4(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        HighestHostUnlockedMayhemLevel;                    // 0x8(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        MayhemTier;                                        // 0xC(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        PendingMayhemLevel;                                // 0x10(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        PendingRandomSeed;                                 // 0x14(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FMayhemDebugOverrides                 CachedOptionalOverrides;                           // 0x18(0x10)(Transient, NativeAccessSpecifierPrivate)
	struct FMayhemReplicableSetsData             ReplicableSets;                                    // 0x28(0x4)(Transient, NoDestructor, NativeAccessSpecifierPrivate)
	int32                                        RandomSeed;                                        // 0x2C(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<float>                                InventoryOverpowerLevelWeights;                    // 0x30(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct OakGame.AdditionalProcessedReward
struct FAdditionalProcessedReward
{
public:
	class UInventoryCategoryData*                CurrencyType;                                      // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Currency;                                          // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F2D[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// ScriptStruct OakGame.ProcessedReward
struct FProcessedReward
{
public:
	int32                                        Currency;                                          // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Experience;                                        // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInventoryCategoryData*                CurrencyType;                                      // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAdditionalProcessedReward>    AdditionalRewards;                                 // 0x10(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        SpawnedInventoryItems;                             // 0x20(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct OakGame.PlayerPainSoundData
struct FPlayerPainSoundData
{
public:
	float                                        HealthPercentThreshold;                            // 0x0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F2E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCharacterSoundTag*                    SoundTag;                                          // 0x8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// ScriptStruct OakGame.TownHubTravelInfo
struct FTownHubTravelInfo
{
public:
	uint8                                        Pad_6F2F[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ReturnMapName;                                     // 0x20(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ReturnStationName;                                 // 0x30(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class UTravelStationData>     ReturnTravelStation;                               // 0x40(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct OakGame.HeroPointsScheduleEntry
struct FHeroPointsScheduleEntry
{
public:
	int32                                        Level;                                             // 0x0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ExtraPoints;                                       // 0x4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x80 (0x80 - 0x0)
// ScriptStruct OakGame.PlayerHeroPointsData
struct FPlayerHeroPointsData
{
public:
	struct FGbxAttributeFloat                    Strength;                                          // 0x0(0xC)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Strength_Base;                                     // 0xC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                    Dexterity;                                         // 0x10(0xC)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Dexterity_Base;                                    // 0x1C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                    Intelligence;                                      // 0x20(0xC)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Intelligence_Base;                                 // 0x2C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                    Wisdom;                                            // 0x30(0xC)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Wisdom_Base;                                       // 0x3C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                    Constitution;                                      // 0x40(0xC)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Constitution_Base;                                 // 0x4C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxAttributeFloat                    Luck;                                              // 0x50(0xC)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Luck_Base;                                         // 0x5C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                       RespecCount;                                       // 0x60(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F30[0x1C];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x14 (0x20 - 0xC)
// ScriptStruct OakGame.OakSDUEntry
struct FOakSDUEntry : public FFastArraySerializerItem
{
public:
	uint8                                        Pad_6F31[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UOakSDUData*                           SDUData;                                           // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SDULevel;                                          // 0x18(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F32[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x48 (0xF8 - 0xB0)
// ScriptStruct OakGame.OakSDUContainer
struct FOakSDUContainer : public FFastArraySerializer
{
public:
	TArray<struct FOakSDUEntry>                  SDUList;                                           // 0xB0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F33[0x28];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FGbxAttributeModifierHandle>   SDUAttributeModifiers;                             // 0xE8(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct OakGame.ReplicatedInteractionInfo
struct FReplicatedInteractionInfo
{
public:
	TArray<class UMaterialInterface*>            OriginalMaterials;                                 // 0x0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	class FName                                  HandSocketName;                                    // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bGhostedMaterialOn;                                // 0x18(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAttractEmitterOn;                                 // 0x19(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F34[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct OakGame.GroundSlamEndedDetails
struct FGroundSlamEndedDetails
{
public:
	bool                                         bInterrupted;                                      // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F35[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ImpactVelocity;                                    // 0x4(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct OakGame.SlideEndedDetails
struct FSlideEndedDetails
{
public:
	class AActor*                                HitActor;                                          // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               StopVelocity;                                      // 0x8(0xC)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F36[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// ScriptStruct OakGame.TrackedSlidingImpactEffect
struct FTrackedSlidingImpactEffect
{
public:
	class USceneComponent*                       Component;                                         // 0x0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicalMaterial*                     PhysicalMaterial;                                  // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F37[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xE8 (0xE8 - 0x0)
// ScriptStruct OakGame.SlidingImpactState
struct FSlidingImpactState
{
public:
	class UOakCharacterMovementComponent*        OwnerMovementComponent;                            // 0x0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           StartAudioEvent;                                   // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           StopAudioEvent;                                    // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIgnoreSlidingState;                               // 0x18(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F38[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FHitResult                            LastImpact;                                        // 0x20(0x90)(IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                        LastImpactTraceTime;                               // 0xB0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F39[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FTrackedSlidingImpactEffect>   Effects;                                           // 0xB8(0x10)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	class FName                                  SpeedParticleParameterName;                        // 0xC8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F3A[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// ScriptStruct OakGame.CharacterJumpGoalSetting
struct FCharacterJumpGoalSetting
{
public:
	float                                        InitialZVelocity;                                  // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GoalHeight;                                        // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseInitialZVelocity : 1;                          // Mask: 0x1, PropSize: 0x10x8(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bUseGoalHeight : 1;                                // Mask: 0x2, PropSize: 0x10x8(0x1)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F3B[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x28 - 0x0)
// ScriptStruct OakGame.CommandRingTarget
struct FCommandRingTarget
{
public:
	class AActor*                                Actor;                                             // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                       BaseComponent;                                     // 0x8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               Location;                                          // 0x10(0xC)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              Rotation;                                          // 0x1C(0xC)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct OakGame.RegisteredWeaponShotModifier
struct FRegisteredWeaponShotModifier
{
public:
	class UWeaponShotModifier*                   Modifier;                                          // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               Owner;                                             // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               ContextOverride;                                   // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F3C[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct OakGame.ReplicatedMeleeActionData
struct FReplicatedMeleeActionData
{
public:
	int32                                        Counter;                                           // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F3D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UGbxAction>                Action;                                            // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayerMeleeData*                      MeleeData;                                         // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct OakGame.MeleeWeaponAttachmentData
struct FMeleeWeaponAttachmentData
{
public:
	class UStaticMesh*                           Mesh;                                              // 0x0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  Socket;                                            // 0x8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               RelativeLocation;                                  // 0x10(0xC)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              RelativeRotation;                                  // 0x1C(0xC)(Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class UGbxCustomizationTargetData*>   CustomizationTargets;                              // 0x28(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class UGbxStaticMeshComponent*               Component;                                         // 0x38(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x88 (0x88 - 0x0)
// ScriptStruct OakGame.DungeonRunDef
struct FDungeonRunDef
{
public:
	enum class EDungeonRunType                   RunType;                                           // 0x0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F3E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Title;                                             // 0x8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x20(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FText                                  ChallengeDescription;                              // 0x38(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	class FName                                  FeaturedRunName;                                   // 0x50(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEncounterPlaylistDataCreator*         DataCreator;                                       // 0x58(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UEncounterPlaylist*                    Playlist;                                          // 0x60(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 ID;                                                // 0x68(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsTutorial;                                       // 0x78(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F3F[0xF];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct OakGame.PlaylistAssociatedData
struct FPlaylistAssociatedData
{
public:
	TSubclassOf<class AActor>                    RewardClassToSpawn;                                // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct OakGame.RoomDataInfo
struct FRoomDataInfo
{
public:
	enum class EGameModeType                     GameModeType;                                      // 0x0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F40[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FString>                        EnvironmentFilterTags;                             // 0x8(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bUseSpecificGameModeOptions;                       // 0x18(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F41[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UEncounterCombatModeOptions*           GameModeOptions;                                   // 0x20(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct OakGame.DungeonAttributeModifier
struct FDungeonAttributeModifier
{
public:
	uint8                                        Pad_6F42[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UGbxAttributeData*                     Attribute;                                         // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F43[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct OakGame.EndlessDungeonWaypoint
struct FEndlessDungeonWaypoint
{
public:
	int32                                        EndlessId;                                         // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F44[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                Target;                                            // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               TargetLocation;                                    // 0x10(0xC)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                       Radius;                                            // 0x1C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct OakGame.DungeonObjective
struct FDungeonObjective
{
public:
	uint8                                        Pad_6F45[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UDungeonBonusObjective>    ObjectiveClass;                                    // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                ObjectiveActor;                                    // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EDungeonObjectiveType             ObjectiveType;                                     // 0x20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsBonus;                                          // 0x21(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsVisible;                                        // 0x22(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bNeedProgressBar;                                  // 0x23(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ProgressBarProgress;                               // 0x24(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bNeedTimer;                                        // 0x28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bReadyToPlayOut;                                   // 0x29(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F46[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TimeLeft;                                          // 0x2C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                Status;                                            // 0x30(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct OakGame.EDReplicatedBlessingData
struct FEDReplicatedBlessingData
{
public:
	class UTutorialMessageDataAsset*             TutorialMessage;                                   // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Quantity;                                          // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F47[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture2D*                            Icon;                                              // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct OakGame.EDReplicatedBonusData
struct FEDReplicatedBonusData
{
public:
	enum class EDungeonBonusType                 BonusType;                                         // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECrystalBonusType                 CrystalBonusType;                                  // 0x1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F48[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                BonusValue;                                        // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  RowName;                                           // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct OakGame.DungeonRunRoomInfo
struct FDungeonRunRoomInfo
{
public:
	bool                                         bIsElite;                                          // 0x0(0x1)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBonusObjectiveSuccessful;                         // 0x1(0x1)(BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F49[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CompletedRoomIconPath;                             // 0x8(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                RoomIconPath;                                      // 0x18(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct OakGame.EDReplicatedCurseData
struct FEDReplicatedCurseData
{
public:
	int32                                        Quantity;                                          // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F4A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  RowName;                                           // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1C8 (0x1C8 - 0x0)
// ScriptStruct OakGame.DungeonRunInfo
struct FDungeonRunInfo
{
public:
	bool                                         DoCleanUp;                                         // 0x0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDungeonWidgetVisible;                             // 0x1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsRunActive;                                      // 0x2(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F4B[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        NbOfLifeLeft;                                      // 0x4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DeathCount;                                        // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                       TimePlayedStartTime;                               // 0xC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint32                                       TimePlayedEndTime;                                 // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TimerTimeTotal;                                    // 0x14(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 RunGuid;                                           // 0x18(0x10)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                RunSerialString;                                   // 0x28(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrentEncounterRoomIndex;                         // 0x38(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F4C[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UEncounterGameMode>        CurrentGameModeClass;                              // 0x40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EDungeonRunType                   RunType;                                           // 0x48(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F4D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CrystalsGained;                                    // 0x4C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CrystalsSpent;                                     // 0x50(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LastCrystalsValue;                                 // 0x54(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxNbOfPlayer;                                     // 0x58(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MainObjectiveProgress;                             // 0x5C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MainObjectiveTotal;                                // 0x60(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ShowKillCountProgress;                             // 0x64(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F4E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                BonusObjectiveTitle;                               // 0x68(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BonusObjectiveProgress;                            // 0x78(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BonusObjectiveTotal;                               // 0x7C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsMainPanelVisible;                                // 0x80(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         TimerActive;                                       // 0x81(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsRoomElite;                                       // 0x82(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F4F[0xD];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FDungeonObjective>             DungeonObjectives;                                 // 0x90(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDungeonRunRoomInfo>           RoomInfo;                                          // 0xA0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	class UClass*                                DungeonRunProviderClass;                           // 0xB0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 RunId;                                             // 0xB8(0x10)(IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  FeaturedRunName;                                   // 0xC8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F50[0x98];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FEDReplicatedBlessingData>     ReplicatedBlessingsList;                           // 0x168(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F51[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FEDReplicatedCurseData>        ReplicatedCursesList;                              // 0x188(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FEDReplicatedBonusData>        ReplicatedBonusesList;                             // 0x198(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F52[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0x50 - 0x0)
// ScriptStruct OakGame.FeaturedRunData
struct FFeaturedRunData
{
public:
	uint8                                        Pad_6F53[0x38];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UEncounterPlaylist*                    Playlist;                                          // 0x38(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F54[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0x58 - 0x8)
// ScriptStruct OakGame.OakNPCMailDataEntry
struct FOakNPCMailDataEntry : public FTableRowBase
{
public:
	class FText                                  SenderDisplayName;                                 // 0x8(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  Subject;                                           // 0x20(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  Body;                                              // 0x38(0x18)(Edit, NativeAccessSpecifierPublic)
	class UItemPoolData*                         ItemPoolReward;                                    // 0x50(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// ScriptStruct OakGame.PlayerCombatEncounterData
struct FPlayerCombatEncounterData
{
public:
	int32                                        Experience;                                        // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        CriticalHits;                                      // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        Kills;                                             // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        BadassKills;                                       // 0xC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        RaidBossKills;                                     // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct OakGame.MessageHandle
struct FMessageHandle
{
public:
	uint64                                       ID;                                                // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct OakGame.GearSoldByFriendData
struct FGearSoldByFriendData
{
public:
	class FString                                GearSerialNumber;                                  // 0x0(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PlayerClassIdentifierHash;                         // 0x10(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F55[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FUniqueNetIdRepl                      FriendNetId;                                       // 0x18(0x28)(HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x188 (0x188 - 0x0)
// ScriptStruct OakGame.OakCARMenuVehicleConfig
struct FOakCARMenuVehicleConfig
{
public:
	class FString                                LoadoutSaveName;                                   // 0x0(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UOakCARVehicleData>     Body;                                              // 0x10(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UOakCARVehiclePartData> Wheel;                                             // 0x38(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UOakCARVehiclePartData> Armor;                                             // 0x60(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UOakCARVehiclePartData> CoreMod;                                           // 0x88(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UOakCARVehiclePartData> GunnerWeapon;                                      // 0xB0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UOakCARVehiclePartData> DriverWeapon;                                      // 0xD8(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UOakCARVehiclePartData> Ornament;                                          // 0x100(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UOakCARVehiclePartData> MaterialDecal;                                     // 0x128(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UOakCARVehiclePartData> Material;                                          // 0x150(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ColorIndex1;                                       // 0x178(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ColorIndex2;                                       // 0x17C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ColorIndex3;                                       // 0x180(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F56[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0x50 - 0x0)
// ScriptStruct OakGame.GFxMissionTrackerInventoryItemData
struct FGFxMissionTrackerInventoryItemData
{
public:
	class FString                                ItemTypeFrameName;                                 // 0x0(0x10)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ItemRarityFrameName;                               // 0x10(0x10)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  ItemRarityFrameText;                               // 0x20(0x18)(Transient, NativeAccessSpecifierPublic)
	class FString                                ItemRarityIdentifier;                              // 0x38(0x10)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemScore;                                         // 0x48(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F57[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct OakGame.GFxMissionTrackerRewardDisplayData
struct FGFxMissionTrackerRewardDisplayData
{
public:
	int32                                        Currency;                                          // 0x0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F58[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UInventoryCategoryData*                CurrencyType;                                      // 0x8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGFxMissionTrackerInventoryItemData> Items;                                             // 0x10(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct OakGame.MissionDeliveryData
struct FMissionDeliveryData
{
public:
	TArray<TSubclassOf<class UMission>>          Missions;                                          // 0x0(0x10)(ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	class AActor*                                MissionGiver;                                      // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct OakGame.OakUIDialogBoxChoiceInfo
struct FOakUIDialogBoxChoiceInfo
{
public:
	class FText                                  LabelText;                                         // 0x0(0x18)(Transient, NativeAccessSpecifierPublic)
	class FName                                  ActionName;                                        // 0x18(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  InputAction;                                       // 0x20(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCloseDialogOnSelection;                           // 0x28(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPressToHoldChoice;                                // 0x29(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F59[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x170 (0x170 - 0x0)
// ScriptStruct OakGame.OakUIDialogBoxInfo
struct FOakUIDialogBoxInfo
{
public:
	class FText                                  HeaderText;                                        // 0x0(0x18)(Transient, NativeAccessSpecifierPublic)
	class FText                                  BodyText;                                          // 0x18(0x18)(Transient, NativeAccessSpecifierPublic)
	TArray<struct FOakUIDialogBoxChoiceInfo>     Choices;                                           // 0x30(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F5A[0x70];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bKeybindingAllowGamepadInputs;                     // 0xB0(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bKeybindingAllowMouseKeyboardInputs;               // 0xB1(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EOakUIDialogBoxStyle              DialogBoxStyle;                                    // 0xB2(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F5B[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                InputText;                                         // 0xB8(0x10)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InputTextMaxLen;                                   // 0xC8(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanCloseWhenChoicesArrayIsEmpty;                  // 0xCC(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInputTextField;                                   // 0xCD(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPasswordTextField;                                // 0xCE(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAnyUserCanInteract;                               // 0xCF(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanCancel;                                        // 0xD0(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSuppressSpawnSound;                               // 0xD1(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F5C[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Amount;                                            // 0xD8(0x18)(Transient, NativeAccessSpecifierPublic)
	class FString                                AmountType;                                        // 0xF0(0x10)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  InitialChoice;                                     // 0x100(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InitialChoiceIndex;                                // 0x108(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F5D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                DialogIndexIdent;                                  // 0x110(0x10)(ZeroConstructor, Transient, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EOakUIDialogBoxButtonType         ButtonType;                                        // 0x120(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F5E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AGbxPlayerController*                  TargetPC;                                          // 0x128(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowCloseWhenAnotherLocalPlayerLeaves;           // 0x130(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisplayEULA;                                      // 0x131(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDeleteConfirmation;                             // 0x132(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F5F[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CostLine;                                          // 0x138(0x18)(Transient, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F60[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct OakGame.TrackedInteractionSaveData
struct FTrackedInteractionSaveData
{
public:
	TSoftObjectPtr<class UTrackedInteractionData> TrackedInteractionData;                            // 0x0(0x28)(UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FGuid>                         CompletedInstances;                                // 0x28(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// ScriptStruct OakGame.OakUIStatusMenuManager
struct FOakUIStatusMenuManager
{
public:
	uint8                                        Pad_6F61[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UParticleSystemComponent*              PSC_IntroEffect;                                   // 0x8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystemComponent*              PSC_BackgroundElement;                             // 0x10(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystemComponent*              PSC_SocialPurple;                                  // 0x18(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F62[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class AOakPlayerController*                  Owner;                                             // 0x38(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOakUIPlayerStandIn*                   PlayerStandIn;                                     // 0x40(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct OakGame.PremiumCurrencyData
struct FPremiumCurrencyData
{
public:
	class UGbxInventoryCategoryData*             CategoryData;                                      // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6F63[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// ScriptStruct OakGame.PremiumCurrencyManager
struct FPremiumCurrencyManager
{
public:
	uint8                                        Pad_6F64[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FPremiumCurrencyData>          Currencies;                                        // 0x10(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class AOakPlayerController*                  Owner;                                             // 0x20(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6F65[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct OakGame.UnlockedPlayerEchoLogData
struct FUnlockedPlayerEchoLogData
{
public:
	class UEchoLogData*                          EchoLogData;                                       // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F66[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct OakGame.OakInventoryCustomizationPartInfo
struct FOakInventoryCustomizationPartInfo
{
public:
	class UOakInventoryCustomizationPartData*    CustomizationPart;                                 // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsNew;                                            // 0x8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F67[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct OakGame.OakCustomizationInfo
struct FOakCustomizationInfo
{
public:
	class UOakCustomizationData*                 Customization;                                     // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsNew;                                             // 0x8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F68[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct OakGame.OakPlayerPath
struct FOakPlayerPath
{
public:
	uint8                                        Pad_6F69[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0x50 - 0x0)
// ScriptStruct OakGame.TriggerFeedbackState
struct FTriggerFeedbackState
{
public:
	uint8                                        Pad_6F6A[0x48];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UWeaponTriggerFeedbackAsset*           WeaponTriggerFeedback;                             // 0x48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct OakGame.OrphanedUIStandIn
struct FOrphanedUIStandIn
{
public:
	class AActor*                                StandInActor;                                      // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AOakUIActorContainer*                  Container;                                         // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct OakGame.OutstandingActivityFeedData
struct FOutstandingActivityFeedData
{
public:
	class UActivityFeedReward*                   FeedData;                                          // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ChallengeLevelTargetValue;                         // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ChallengeLevelCompleted;                           // 0xC(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct OakGame.ResourcePoolSavegameData
struct FResourcePoolSavegameData
{
public:
	float                                        Amount;                                            // 0x0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F6B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UGameResourceData>      ResourcePath;                                      // 0x8(0x28)(Edit, EditConst, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6F6C[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct OakGame.OakAbilityTreeItemSaveGameData
struct FOakAbilityTreeItemSaveGameData
{
public:
	TSoftObjectPtr<class UOakPlayerAbilityTreeItemData> ItemAssetPath;                                     // 0x0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        Points;                                            // 0x28(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        MaxPoints;                                         // 0x2C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        TreeIdentifier;                                    // 0x30(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6F6D[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0x50 - 0x0)
// ScriptStruct OakGame.OakAbilitySlotSaveGameData
struct FOakAbilitySlotSaveGameData
{
public:
	TSoftClassPtr<class UOakPlayerAbility>       AbilityClassPath;                                  // 0x0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UOakPlayerAbilitySlotData> SlotAssetPath;                                     // 0x28(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// 0x78 (0x78 - 0x0)
// ScriptStruct OakGame.OakActionAbilityAugmentSaveGameData
struct FOakActionAbilityAugmentSaveGameData
{
public:
	TSoftClassPtr<class UOakActionAbility>       ActionAbilityClassPath;                            // 0x0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UOakActionAbilityAugmentSlotData> SlotAssetPath;                                     // 0x28(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UOakActionAbilityAugmentData> AugmentAssetPath;                                  // 0x50(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// 0xA0 (0xA0 - 0x0)
// ScriptStruct OakGame.OakActionAbilityAugmentConfigurationSaveGameData
struct FOakActionAbilityAugmentConfigurationSaveGameData
{
public:
	TSoftClassPtr<class UOakActionAbility>       AbilityClassPath;                                  // 0x0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UOakActionAbilityAugmentData> AugmentAssetPath;                                  // 0x28(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UOakActionAbilityAugmentSlotData> ModSlotAssetPath;                                  // 0x50(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UOakActionAbilityAugmentData> ModAssetPath;                                      // 0x78(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// 0x58 (0x58 - 0x0)
// ScriptStruct OakGame.OakDualClassSaveGameData
struct FOakDualClassSaveGameData
{
public:
	TSoftObjectPtr<class UOakPlayerAbilityTreeBranchData> PrimaryClassBranchPath;                            // 0x0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftObjectPtr<class UOakPlayerAbilityTreeBranchData> SlottedSecondaryBranchPath;                        // 0x28(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bUnlockedClassFeatures;                            // 0x50(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bUnlockedInitialSecondaryClass;                    // 0x51(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bUnlockedSecondaryClassSwapping;                   // 0x52(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6F6E[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xA8 (0xA8 - 0x0)
// ScriptStruct OakGame.OakPlayerAbilitySaveGameData
struct FOakPlayerAbilitySaveGameData
{
public:
	int32                                        TreeGrade;                                         // 0x0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AbilityPoints;                                     // 0x4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FOakAbilityTreeItemSaveGameData> TreeItemList;                                      // 0x8(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FOakAbilitySlotSaveGameData>   AbilitySlotList;                                   // 0x18(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FOakActionAbilityAugmentSaveGameData> AugmentSlotList;                                   // 0x28(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FOakActionAbilityAugmentConfigurationSaveGameData> AugmentConfigurationList;                          // 0x38(0x10)(Edit, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FOakDualClassSaveGameData             DualClassSave;                                     // 0x48(0x58)(Edit, EditConst, NativeAccessSpecifierPublic)
	uint32                                       RespecCount;                                       // 0xA0(0x4)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F6F[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct OakGame.OakSDUSaveGameData
struct FOakSDUSaveGameData
{
public:
	int32                                        SDULevel;                                          // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F70[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                SDUDataPath;                                       // 0x8(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
};

// 0xE0 (0xE0 - 0x0)
// ScriptStruct OakGame.ClientExpectedSaveGameValues
struct FClientExpectedSaveGameValues
{
public:
	bool                                         bWaitingForServer;                                 // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F71[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ExperiencePoints;                                  // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FResourcePoolSavegameData>     ResourcePools;                                     // 0x8(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	struct FOakPlayerAbilitySaveGameData         Abilities;                                         // 0x18(0xA8)(NativeAccessSpecifierPublic)
	TArray<struct FInventorySaveGameData>        InventoryList;                                     // 0xC0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FOakSDUSaveGameData>           SDUList;                                           // 0xD0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct OakGame.IndigoRunDebugStats
struct FIndigoRunDebugStats
{
public:
	int32                                        PreRunSoulsCount;                                  // 0x0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PreCurrentEncounterSoulsCount;                     // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<uint8>                                MapDeaths;                                         // 0x8(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                MapSouls;                                          // 0x18(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<uint8>                                MapKills;                                          // 0x28(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x48 (0x48 - 0x0)
// ScriptStruct OakGame.OakUICCThumbnailData
struct FOakUICCThumbnailData
{
public:
	uint8                                        Pad_6F72[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UGbxCustomizationData*                 Customization;                                     // 0x8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                    ThumbnailTemplateClass;                            // 0x10(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                ThumbnailTemplate;                                 // 0x18(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F73[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UTextureStreaming*>             StreamingTextures;                                 // 0x28(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F74[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTexture*                              ThumbnailTexture;                                  // 0x40(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct OakGame.OakThumbnailManagerConfig
struct FOakThumbnailManagerConfig
{
public:
	float                                        ThumbnailLoadFrequency;                            // 0x0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxThumbnails;                                     // 0x4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FIntPoint                             ThumbnailSize;                                     // 0x8(0x8)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInterface*                    ThumbnailMaterial;                                 // 0x10(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// ScriptStruct OakGame.OakUICcManagerRespecText
struct FOakUICcManagerRespecText
{
public:
	class FText                                  HeaderText;                                        // 0x0(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  TextForBoth;                                       // 0x18(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  TextForSkills;                                     // 0x30(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  TextForHeroPoints;                                 // 0x48(0x18)(Edit, NativeAccessSpecifierPublic)
};

// 0x240 (0x240 - 0x0)
// ScriptStruct OakGame.OakUICcManagerText
struct FOakUICcManagerText
{
public:
	class FText                                  AskRespecHeaderText;                               // 0x0(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  AskRespecBodyText;                                 // 0x18(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  RespecChoiceSkills;                                // 0x30(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  RespecChoiceHeroPoints;                            // 0x48(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  RespecChoiceBoth;                                  // 0x60(0x18)(Edit, NativeAccessSpecifierPublic)
	struct FOakUICcManagerRespecText             ConfirmRespecTexts;                                // 0x78(0x60)(Edit, NativeAccessSpecifierPublic)
	struct FOakUICcManagerRespecText             CannotRespecTexts;                                 // 0xD8(0x60)(Edit, NativeAccessSpecifierPublic)
	class FText                                  ChoiceYes;                                         // 0x138(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  ChoiceNo;                                          // 0x150(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  ChoiceOkay;                                        // 0x168(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  LateJoinPopupHeader;                               // 0x180(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  LateJoinPopupBody;                                 // 0x198(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  LateJoinPopupConfirm;                              // 0x1B0(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  LateJoinPopupCancel;                               // 0x1C8(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  InvalidPlayerNameHeaderText;                       // 0x1E0(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  InvalidPlayerNameBodyText;                         // 0x1F8(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  WaitingOnYouText;                                  // 0x210(0x18)(Edit, NativeAccessSpecifierPublic)
	class FText                                  WaitingForOthersText;                              // 0x228(0x18)(Edit, NativeAccessSpecifierPublic)
};

// 0x28 (0x28 - 0x0)
// ScriptStruct OakGame.StandInLightComponentInstance
struct FStandInLightComponentInstance
{
public:
	class ULightComponent*                       Component;                                         // 0x0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F75[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0x50 - 0x0)
// ScriptStruct OakGame.DesiredStandInActorData
struct FDesiredStandInActorData
{
public:
	uint8                                        Pad_6F76[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AActor>                    CustomStandInClass;                                // 0x8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F77[0x30];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UGbxDataAsset*                         DataAsset;                                         // 0x40(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F78[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x430 (0x430 - 0x0)
// ScriptStruct OakGame.StandInUIController
struct FStandInUIController
{
public:
	uint8                                        Pad_6F79[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class AOakUIActorContainer>    ContainerClass;                                    // 0x8(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6F7A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        VerticalSplitInVehicleAdjustment;                  // 0x34(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UObject*                               OuterObject;                                       // 0x38(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AOakPlayerController*                  PlayerController;                                  // 0x40(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UPlayerClassIdentifier*                FallbackPlayerClass;                               // 0x48(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AOakUIActorContainer*                  StandInContainer;                                  // 0x50(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FStandInLightComponentInstance> LightComponents;                                   // 0x58(0x10)(ZeroConstructor, Transient, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	class USceneComponent*                       StandInTransformRoot;                              // 0x68(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class USceneComponent*                       StandInRotationRoot;                               // 0x70(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                CurrentStandInActor;                               // 0x78(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                        SecondaryActors;                                   // 0x80(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class AActor*                                TempInventoryActor;                                // 0x90(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UInventoryBalanceStateComponent*       StandInTemplateInventoryBalanceState;              // 0x98(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6F7B[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDesiredStandInActorData              LastDesiredActorData;                              // 0xB8(0x50)(Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6F7C[0x138];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDesiredStandInActorData              DesiredActorData;                                  // 0x240(0x50)(Transient, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                       StreamedObjects;                                   // 0x290(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6F7D[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	uint32                                       WantedStreamRequest;                               // 0x2B0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6F7E[0x17C];                                   // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct OakGame.CharacterCreationStandInPreviewInfo
struct FCharacterCreationStandInPreviewInfo
{
public:
	class FName                                  BodyStandInConfiguration;                          // 0x0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  HeadStandInConfiguration;                          // 0x8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  FaceDetailStandInConfiguration;                    // 0x10(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x80 (0x80 - 0x0)
// ScriptStruct OakGame.CharacterCreationStandInPreviewMap
struct FCharacterCreationStandInPreviewMap
{
public:
	struct FCharacterCreationStandInPreviewInfo  CharacterInfo;                                     // 0x0(0x18)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCharacterCreationStandInPreviewInfo  EmoteInfo;                                         // 0x18(0x18)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCharacterCreationStandInPreviewInfo  BannerInfo;                                        // 0x30(0x18)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCharacterCreationStandInPreviewInfo  StatueInfo;                                        // 0x48(0x18)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                  ClassSelectionConfiguration;                       // 0x60(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  AspectOfTheVaultConfiguration;                     // 0x68(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  HeroPointsConfiguration;                           // 0x70(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  CharacterConfirmConfiguration;                     // 0x78(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// ScriptStruct OakGame.CharacterCreationBaseTypeInterface
struct FCharacterCreationBaseTypeInterface
{
public:
	uint8                                        Pad_6F7F[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  Name;                                              // 0x18(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FText                                  DisplayLabel;                                      // 0x20(0x18)(Edit, NativeAccessSpecifierPrivate)
	class FName                                  ListIconName;                                      // 0x38(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class ECharacterCreationUIDisplayCategory DisplayCategory;                                   // 0x40(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bCanToggleStandInPreviewType;                      // 0x44(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6F80[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class ECharacterCreationPreviewType     DefaultStandInPreviewType;                         // 0x48(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowedCharacterCreate;                           // 0x4C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowedInCharacterCreateLateJoin;                 // 0x4D(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowedInQuickChange;                             // 0x4E(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAllowedToRandomize;                               // 0x4F(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  RandomizeLink;                                     // 0x50(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bInvertRandomizeLink;                              // 0x58(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bOnlyRandomizeWhenVisible;                         // 0x59(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6F81[0x16];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xA0 (0x110 - 0x70)
// ScriptStruct OakGame.CharacterCreationCustomFloatData
struct FCharacterCreationCustomFloatData : public FCharacterCreationBaseTypeInterface
{
public:
	float                                        DeltaMoveNormalizedAmount;                         // 0x70(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FNumericRange                         AdvancedRange;                                     // 0x74(0x8)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	struct FNumericRange                         LimitedRange;                                      // 0x7C(0x8)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	float                                        DefaultValue;                                      // 0x84(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bInvertValue;                                      // 0x88(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6F82[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRuntimeFloatCurve                    RandomizeCurve;                                    // 0x90(0x78)(Edit, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6F83[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x40 (0x40 - 0x0)
// ScriptStruct OakGame.CharacterCreationAspectOfTheVaultData
struct FCharacterCreationAspectOfTheVaultData
{
public:
	class FName                                  Name;                                              // 0x0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSoftObjectPtr<class UOakPlayerAspectData>   AspectDataAsset;                                   // 0x8(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDownloadableContentData*              AssociatedExpansionData;                           // 0x30(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F84[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct OakGame.CharacterCreationClassData
struct FCharacterCreationClassData
{
public:
	TSoftObjectPtr<class UOakPlayerAbilityTreeBranchData> Class;                                             // 0x0(0x28)(Edit, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ClassArmorSerialNumberString;                      // 0x28(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct OakGame.CharacterCreationFloatLinkSet
struct FCharacterCreationFloatLinkSet
{
public:
	class FName                                  ControlSlider;                                     // 0x0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInvertLinkedSliders;                              // 0x8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F85[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class FName>                          LinkedSliders;                                     // 0x10(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x88 - 0x70)
// ScriptStruct OakGame.CharacterCreationFloatLinkType
struct FCharacterCreationFloatLinkType : public FCharacterCreationBaseTypeInterface
{
public:
	TArray<struct FCharacterCreationFloatLinkSet> LinkSets;                                          // 0x70(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bDefaultLinkActive;                                // 0x80(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6F86[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x58 (0x58 - 0x0)
// ScriptStruct OakGame.CcLayoutItem
struct FCcLayoutItem
{
public:
	enum class ECcLayoutItemType                 Type;                                              // 0x0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F87[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ItemId;                                            // 0x8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  DisplayName;                                       // 0x10(0x18)(Edit, NativeAccessSpecifierPublic)
	class FString                                IconFrameName;                                     // 0x28(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECharacterCreationUIDisplayCategory StandInType;                                       // 0x38(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECharacterCreationPreviewType     StandInPreviewType;                                // 0x3C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F88[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct OakGame.CcLayoutGroup
struct FCcLayoutGroup
{
public:
	class FName                                  GroupId;                                           // 0x0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCcLayoutItem>                 Items;                                             // 0x8(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x28 (0x98 - 0x70)
// ScriptStruct OakGame.CharacterCreationAssetType
struct FCharacterCreationAssetType : public FCharacterCreationBaseTypeInterface
{
public:
	bool                                         bAllowSelectingNone;                               // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6F89[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                AssetClass;                                        // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UObject*>                       Assets;                                            // 0x80(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_6F8A[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0xB8 - 0x98)
// ScriptStruct OakGame.CharacterCreationCustomizationType
struct FCharacterCreationCustomizationType : public FCharacterCreationAssetType
{
public:
	class UGbxCustomizationTypeData*             CustomizationType;                                 // 0x98(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseLUTPicker;                                     // 0xA0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6F8B[0x17];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct OakGame.CharacterCreationAttributeData
struct FCharacterCreationAttributeData
{
public:
	class FName                                  Name;                                              // 0x0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6F8C[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0xA8 - 0x70)
// ScriptStruct OakGame.CharacterCreationAdvancedCustomizationType
struct FCharacterCreationAdvancedCustomizationType : public FCharacterCreationBaseTypeInterface
{
public:
	class FText                                  ActiveText;                                        // 0x70(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  InactiveText;                                      // 0x88(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	bool                                         bDefaultValue;                                     // 0xA0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6F8D[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x98 - 0x98)
// ScriptStruct OakGame.CharacterCreationPresetAssetType
struct FCharacterCreationPresetAssetType : public FCharacterCreationAssetType
{
public:
};

// 0xA8 (0xA8 - 0x0)
// ScriptStruct OakGame.CharacterCreationDataPresetData
struct FCharacterCreationDataPresetData
{
public:
	TArray<class UGbxCustomizationCollectionData*> Presets;                                           // 0x0(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FCharacterCreationPresetAssetType     Selection;                                         // 0x10(0x98)(Edit, NativeAccessSpecifierPublic)
};

// 0x530 (0x530 - 0x0)
// ScriptStruct OakGame.CharacterCreationData
struct FCharacterCreationData
{
public:
	class UPlayerClassIdentifier*                PlayerClassId;                                     // 0x0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  DefaultCharacterName;                              // 0x8(0x18)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                  InvalidText;                                       // 0x20(0x18)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                  CustomText;                                        // 0x38(0x18)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                  NoneText;                                          // 0x50(0x18)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FString                                EmoteIdPrefix;                                     // 0x68(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCharacterCreationStandInPreviewMap   StandInPreviewMap_NewCharacter;                    // 0x78(0x80)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FCharacterCreationStandInPreviewMap   StandInPreviewMap_QuickChange;                     // 0xF8(0x80)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                        StandInMaxRotationSpeed;                           // 0x178(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StandInMaxSecondsToReachTargetSpeed;               // 0x17C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCharacterCreationClassData>   Classes;                                           // 0x180(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FString                                NewCharacterArmorSerialNumberString;               // 0x190(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UGbxCustomizationData*>         NewCharacterOverrideCustomizations;                // 0x1A0(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FCcLayoutGroup>                Layouts;                                           // 0x1B0(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCharacterCreationCustomizationType> CustomizationTypes;                                // 0x1C0(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCharacterCreationCustomFloatData> FloatTypes;                                        // 0x1D0(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<class FName, TSoftObjectPtr<class UTexture2D>> ListItemTypeIcons;                                 // 0x1E0(0x50)(Edit, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FCharacterCreationFloatLinkType> LinkedFloats;                                      // 0x230(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FCharacterCreationAdvancedCustomizationType AdvancedCustomizationToggle;                       // 0x240(0xA8)(Edit, NativeAccessSpecifierPublic)
	TArray<struct FCharacterCreationAttributeData> HeroAttributes;                                    // 0x2E8(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        StartingHeroPointPool;                             // 0x2F8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F8E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCharacterCreationAspectOfTheVaultData> AspectOfTheVaultOptions;                           // 0x300(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FCharacterCreationAssetType           PronounSelection;                                  // 0x310(0x98)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<class UDialogNameTag*>                Voices;                                            // 0x3A8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FDialogTimeSlotReference              VoicePreview;                                      // 0x3B8(0x40)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FCharacterCreationAssetType           VoicesSelection;                                   // 0x3F8(0x98)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FCharacterCreationDataPresetData> Presets;                                           // 0x490(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F8F[0x40];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UOakCustomizationData*>         UnlockedCustomizationsDataArray;                   // 0x4E0(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UOakCustomizationData*>         LockedCustomizationsDataArray;                     // 0x4F0(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UGbxCustomizationData*>         ViewedCustomizationsDataArray;                     // 0x500(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class UGbxCustomizationTypeData*>     SuppressedCustomizationTypes;                      // 0x510(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_6F90[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xF0 (0xF0 - 0x0)
// ScriptStruct OakGame.ZoneMapMissionWaypointEntry
struct FZoneMapMissionWaypointEntry
{
public:
	class UZoneMapPOITypeData*                   PointOfInterestType;                               // 0x0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                MissionWaypointObjectName;                         // 0x8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F91[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            MissionWaypointTransform;                          // 0x20(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        MissionWaypointRadius;                             // 0x50(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F92[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FMissionObjectiveReferenceWeak> MissionObjectives;                                 // 0x58(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NativeAccessSpecifierPublic)
	struct FGbxUIFormattedText                   MissionDirectorName;                               // 0x68(0x68)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	TArray<TSoftClassPtr<class UMission>>        DirectorMissions;                                  // 0xD0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
	int32                                        BlacklistIndex;                                    // 0xE0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOutOfMap;                                         // 0xE4(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideMissionAreaWaypoint;                          // 0xE5(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F93[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UPrimitiveComponent>       AreaComponentClassOverride;                        // 0xE8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// ScriptStruct OakGame.ZoneMapChallengeEntry
struct FZoneMapChallengeEntry
{
public:
	class FString                                ChallengeActorName;                                // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTransform                            ChallengeWaypointTransform;                        // 0x10(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FIntPoint                             ChallengeWaypointFODTexelCoords;                   // 0x40(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MapSection;                                        // 0x48(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F94[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UChallenge>                ChallengeClass;                                    // 0x50(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGuid                                 ChallengeGUID;                                     // 0x58(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F95[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x70 (0x70 - 0x0)
// ScriptStruct OakGame.ZoneMapPOIEntry
struct FZoneMapPOIEntry
{
public:
	class UZoneMapPOITypeData*                   PointOfInterestType;                               // 0x0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PointOfInterestObjectName;                         // 0x8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F96[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            PointOfInterestTransform;                          // 0x20(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FIntPoint                             PointOfInterestFODTexelCoords;                     // 0x50(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               CustomPOIData;                                     // 0x58(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MapSection;                                        // 0x60(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F97[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x290 (0x290 - 0x0)
// ScriptStruct OakGame.ZoneMapIconInfo
struct FZoneMapIconInfo
{
public:
