#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1E0 (0x638 - 0x458)
// Class OakGame.Agonizer9kFloor
class AAgonizer9kFloor : public AActor
{
public:
	class UTeam*                                 PlayersTeam;                                       // 0x458(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                     HeatingElementMaterial;                            // 0x460(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UDamageData>               DamageData;                                        // 0x468(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UDamageData>               DamageData_SmallDamage;                            // 0x470(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           BurstFlameAudio1;                                  // 0x478(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           BurstFlameAudio2;                                  // 0x480(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           BurstFlameAudio3;                                  // 0x488(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           BurstFlameAudio4;                                  // 0x490(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           PreheatAudioSmall1;                                // 0x498(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           PreheatAudioSmall2;                                // 0x4A0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           PreheatAudioSmall3;                                // 0x4A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           PreheatAudioSmall4;                                // 0x4B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           PreheatAudioBig1;                                  // 0x4B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           PreheatAudioBig2;                                  // 0x4C0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           PreheatAudioBig3;                                  // 0x4C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           PreheatAudioBig4;                                  // 0x4D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BurstFlameAudioGain;                               // 0x4D8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BurstFlamesAudioRadius;                            // 0x4DC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BurstFlamesAudioRadiusRingMultiplier;              // 0x4E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B0B[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class USceneComponent*                       SceneRootComp;                                     // 0x4E8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WarmupTime;                                        // 0x4F0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WarmUpDelayWhenAllWarmUpDone;                      // 0x4F4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RotationFloorDoneTime;                             // 0x4F8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FloorRotationTimeBetweenSector;                    // 0x4FC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AnticipationTimeOneRing;                           // 0x500(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AnticipationTime;                                  // 0x504(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AnticipationTimeRotationPattern;                   // 0x508(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BurstinitialOffset;                                // 0x50C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BurstOffsetPerRing;                                // 0x510(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RingPatternInterval;                               // 0x514(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HeatingPipeEmissiveInterval;                       // 0x518(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B22[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           EmissiveStrengthOverTime;                          // 0x520(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                           EmissiveStrengthOverTimeFadeOut;                   // 0x528(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnFloorFirstFlame;                                 // 0x530(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FSectorFromBP>                 SectorsBP;                                         // 0x540(0x10)(Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        Pad_B28[0x50];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AAgonizer9k*                           AgonizerRef;                                       // 0x5A0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_B2B[0x18];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UWwiseAudioComponent*                  AudioComponent1;                                   // 0x5C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWwiseAudioComponent*                  AudioComponent2;                                   // 0x5C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWwiseAudioComponent*                  AudioComponent3;                                   // 0x5D0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UWwiseAudioComponent*                  AudioComponent4;                                   // 0x5D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_B30[0x58];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAgonizer9kFloor* GetDefaultObj();

	void StopHeatingPipeEmissive(struct FRing* SectorRing);
	void StartSafeSpotPattern(float DelayBeforeStart);
	void StartRotationPattern(float DelayBeforeStart);
	void StartRingPattern(float DelayBeforeStart);
	void StartHeatingPipeEmissive(struct FRing* SectorRing);
	void StartAnticipationSafeSpot(TArray<int32>& SafeSpotSectorIds);
	void SetFloorRotationParameters(int32 Direction, int32 StartingSectorId);
	void SetAgonizerRef(class AAgonizer9k* AgonizerRef);
	void PlayBurstFlameAudio();
	void OnWarmUpDone(struct FSector* FloorSector);
	void OnRotationAnticipationDone(struct FSector* FloorSector, bool IsLast);
	void OnFloorPatternDone();
	void OnAnticipationOneRingDone(struct FSector* FloorSector, struct FRing* SectorRing);
	void OnAnticipationDone();
	void CreateSectorsDataFromBP();
};

// 0x718 (0x890 - 0x178)
// Class OakGame.ActiveWeaponsComponent
class UActiveWeaponsComponent : public UActorComponent
{
public:
	uint8                                        Pad_C71[0x40];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnZoomChange;                                      // 0x1B8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnWeaponChanged;                                   // 0x1C8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnWeaponReloadStarted;                             // 0x1D8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnWeaponReloadEnded;                               // 0x1E8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class UWeaponSlotData*>               WeaponSlots;                                       // 0x1F8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                        WeaponsScale;                                      // 0x208(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C7A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AWeapon>                   DefaultWeaponClass;                                // 0x210(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInventoryBalanceData*                 DefaultBalanceWeaponData;                          // 0x218(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAutoSpawnDefaultWeapon;                           // 0x220(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C80[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FWeaponSlotContainer                  Weapons;                                           // 0x228(0x650)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	class APawn*                                 OwnerPawn;                                         // 0x878(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInventoryCategoryData*                WeaponItemType;                                    // 0x880(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_C87[0x8];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UActiveWeaponsComponent* GetDefaultObj();

	void ZoomEvent__DelegateSignature(enum class EZoomEventType IsZooming);
	void WeaponReloadStarted(class AWeapon* Weapon, bool bAuto);
	void WeaponReloadEnded(class AWeapon* Weapon, bool bCompleted, bool bAmmoGiven);
	void WeaponPutDown(class AWeapon* PutDownWeapon);
	void WeaponChangedEvent__DelegateSignature(class AWeapon* NewWeapon, class AWeapon* LastWeapon);
	class AWeapon* SpawnWeaponFromClass(TSubclassOf<class AWeapon> WeaponClass, class UWeaponSlotData* Slot);
	class AWeapon* SpawnWeaponFromBalanceData(class UInventoryBalanceData* WeaponBalanceData, class UWeaponSlotData* Slot);
	class AWeapon* SpawnVehicleWeaponFromAspectData(class UVehicleAttachWeaponAspectData* VehicleWeaponAspectData, class UWeaponSlotData* Slot);
	void SpawnDefaultWeapon();
	void ServerUnlockWeaponActions(class FName Reason, int32 ChannelsMask);
	void ServerStopWeaponActions(uint8 Slot, int32 ChannelsMask, bool bClearInput);
	void ServerSetCurrentWeapon(class AWeapon* NewWeapon, uint8 NewWeaponSlot, enum class EWeaponPutDownType PutDownType, enum class EWeaponEquipType EquipType);
	void ServerLockWeaponActions(class FName Reason, int32 ChannelsMask, bool bStopActions, bool bClearInput);
	void OnWeaponResumeUse(class UWeaponSlotData* AttachedSlot);
	class AWeapon* GetWeapon(uint8 Slot);
	void ClientUnlockWeaponActions(class FName Reason, int32 ChannelsMask);
	void ClientStopWeaponActions(uint8 Slot, int32 ChannelsMask, bool bClearInput);
	void ClientLockWeaponActions(class FName Reason, int32 ChannelsMask, bool bStopActions, bool bClearInput);
};

// 0x20 (0x50 - 0x30)
// Class OakGame.ActivityFeedActionData
class UActivityFeedActionData : public UGbxDataAsset
{
public:
	class FString                                CaptionString;                                     // 0x30(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ButtonImageURL;                                    // 0x40(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UActivityFeedActionData* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class OakGame.UActivityFeedData
class UUActivityFeedData : public UGbxDataAsset
{
public:

	static class UClass* StaticClass();
	static class UUActivityFeedData* GetDefaultObj();

};

// 0x0 (0x50 - 0x50)
// Class OakGame.ActivityFeedOpenStoreActionData
class UActivityFeedOpenStoreActionData : public UActivityFeedActionData
{
public:

	static class UClass* StaticClass();
	static class UActivityFeedOpenStoreActionData* GetDefaultObj();

};

// 0x70 (0xA0 - 0x30)
// Class OakGame.ActivityFeedReward
class UActivityFeedReward : public UGbxDataAsset
{
public:
	class FText                                  CaptionString;                                     // 0x30(0x18)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                  CondensedCaptionString;                            // 0x48(0x18)(Edit, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FString                                SmallImageUrl;                                     // 0x60(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EActivityFeedImageAspectRatio     SmallImageAspectRatio;                             // 0x70(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_CFF[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                LargeImageUrl;                                     // 0x78(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActivityFeedURLActionData*            URLBrowserActionData;                              // 0x88(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActivityFeedOpenStoreActionData*      URLStoreActionData;                                // 0x90(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActivityFeedStartGameActionData*      StartGameActionData;                               // 0x98(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UActivityFeedReward* GetDefaultObj();

};

// 0x10 (0x60 - 0x50)
// Class OakGame.ActivityFeedStartGameActionData
class UActivityFeedStartGameActionData : public UActivityFeedActionData
{
public:
	class FString                                CommandLineArgumentsString;                        // 0x50(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UActivityFeedStartGameActionData* GetDefaultObj();

};

// 0x10 (0x60 - 0x50)
// Class OakGame.ActivityFeedURLActionData
class UActivityFeedURLActionData : public UActivityFeedActionData
{
public:
	class FString                                URLString;                                         // 0x50(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UActivityFeedURLActionData* GetDefaultObj();

};

// 0x40 (0x70 - 0x30)
// Class OakGame.AdditionalZoneMapData
class UAdditionalZoneMapData : public UGbxDataAsset
{
public:
	class UZoneMapData*                          ParentZoneMap;                                     // 0x30(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       ZoneMapMeshAssetReference;                         // 0x38(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FZoneMapPOIEntry>              AdditionalZoneMapPOIList;                          // 0x50(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class UPatchExpansionData*                   AssociatedPatch;                                   // 0x60(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDownloadableContentData*              AssociatedDLC;                                     // 0x68(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAdditionalZoneMapData* GetDefaultObj();

};

// 0x130 (0x588 - 0x458)
// Class OakGame.InteractiveObject
class AInteractiveObject : public AActor
{
public:
	uint8                                        Pad_EC7[0x60];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCompiledUserStatesData               CompiledUserStatesData;                            // 0x4B8(0x10)(Edit, DisableEditOnInstance, EditConst, DuplicateTransient, Protected, NativeAccessSpecifierProtected)
	bool                                         bUserStatesWaitForSaveGame;                        // 0x4C8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSimulateUserStates;                               // 0x4C9(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_ECC[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FUserStatesRuntimeData                RuntimeUserStatesData;                             // 0x4D0(0x10)(Transient, Protected, NativeAccessSpecifierProtected)
	struct FUserStatesReplicationData            ReplicatedUserStatesData;                          // 0x4E0(0x8)(Net, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bRegisterAsTargetable;                             // 0x4E8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShouldDisplayNameplate;                           // 0x4E9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_ED7[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UOakDamageComponent*                   CachedDamageComponent;                             // 0x4F0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTargetableComponent*                  CachedTargetableComponent;                         // 0x4F8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EInteractiveObjectState           RepCurrentState;                                   // 0x500(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EInteractiveObjectLockState       RepCurrentLockState;                               // 0x501(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EInteractiveObjectInteractiveState RepCurrentInteractiveState;                        // 0x502(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EInteractiveObjectState           CurrentState;                                      // 0x503(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EInteractiveObjectLockState       CurrentLockState;                                  // 0x504(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EInteractiveObjectInteractiveState CurrentInteractiveState;                           // 0x505(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_EEB[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCullableIO                           CullSettings;                                      // 0x508(0x8)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        bShouldShowLevelSyncedNameplate : 1;               // Mask: 0x1, PropSize: 0x10x510(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        ShouldColorCrosshairRed : 1;                       // Mask: 0x2, PropSize: 0x10x510(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bHideWhenAttachedToHiddenCharacter : 1;            // Mask: 0x4, PropSize: 0x10x510(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanNotifyKillersOfDeath : 1;                      // Mask: 0x8, PropSize: 0x10x510(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bCanTriggerAttackerCausedDamageEvents : 1;         // Mask: 0x10, PropSize: 0x10x510(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bNoEnvironmentalLevelSync : 1;                     // Mask: 0x20, PropSize: 0x10x510(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_8F : 2;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        bIsTrapTrigger : 1;                                // Mask: 0x1, PropSize: 0x10x511(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bTrapBreaker : 1;                                  // Mask: 0x2, PropSize: 0x10x511(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bReverseTriggerInstructionWhenTriggerDeactivates : 1; // Mask: 0x4, PropSize: 0x10x511(0x1)(Edit, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        bTrapIsBroken : 1;                                 // Mask: 0x8, PropSize: 0x10x511(0x1)(BlueprintVisible, BlueprintReadOnly, Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        BitPad_90 : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_F02[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FInteractiveObjectTrapEntry>   TrapsList;                                         // 0x518(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	uint8                                        Pad_F0F[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class USkeletalMeshComponent*                PrimarySkeletalMeshComponent;                      // 0x530(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimationAsset*                       OnEnablingAnimation;                               // 0x538(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimationAsset*                       OnEnabledAnimation;                                // 0x540(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimationAsset*                       OnDisablingAnimation;                              // 0x548(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimationAsset*                       OnDisabledAnimation;                               // 0x550(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimationAsset*                       OnLockedAnimation;                                 // 0x558(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F27[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EPlayerAlertType                  PlayerAlertType;                                   // 0x568(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F2D[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UTrackedInteractionData*               TrackedInteractionData;                            // 0x570(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGuid                                 TrackedInteractionGuid;                            // 0x578(0x10)(Edit, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, Protected, NonPIEDuplicateTransient, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AInteractiveObject* GetDefaultObj();

	void SetGbxUserState(class FName VariableName, uint8 Value);
	void ResetTrapBrokenState();
	void OnTrapTriggerStateChanged(bool bTriggerActivated);
	void OnTrapDeactivated();
	void OnTrapActivated();
	void OnSaveGameLoaded(class AOakPlayerController* OakPlayerController);
	void OnRep_ReplicatedUserStatesData();
	void OnRep_RepCurrentState();
	void OnRep_RepCurrentLockState();
	void OnRep_RepCurrentInteractiveState();
	void OnLStateUnlocked();
	void OnLStateLocked();
	void OnLocked();
	void OnIStateNonInteractive();
	void OnIStateInteractive();
	void OnEnabling();
	void OnEnabled();
	void OnDisabling();
	void OnDisabled();
	void OnAnimationEnded(class UAnimationAsset* Asset);
	bool IsTrackedInteractionComplete();
	void CompleteTrackedInteraction();
	void ChangeState(enum class EInteractiveObjectState NewState);
	void ChangeLockState(enum class EInteractiveObjectLockState NewState);
	void ChangeInteractiveState(enum class EInteractiveObjectInteractiveState NewState);
	void ChangeBalanceTableRow(struct FDataTableRowHandle& NewBalanceTableRow);
};

// 0xF8 (0x680 - 0x588)
// Class OakGame.AdvancedInteractiveObject
class AAdvancedInteractiveObject : public AInteractiveObject
{
public:
	class UAIO_CameraData*                       CameraData;                                        // 0x588(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  CameraMode;                                        // 0x590(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraBlendInTime;                                 // 0x598(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraBlendOutTime;                                // 0x59C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraExitTransitionDuration;                      // 0x5A0(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DelayBeforeCameraExitTransitionStarts;             // 0x5A4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLockPlayerMovement;                               // 0x5A8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLockPlayerWeaponUsage;                            // 0x5A9(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRestrictPlayerWeapons;                            // 0x5AA(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bTrackNearbyPlayers;                               // 0x5AB(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideHUDInstantly;                                 // 0x5AC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1060[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  PlayerBeginInteraction;                            // 0x5B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  PlayerStopInteraction;                             // 0x5C0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TSubclassOf<class AAdvancedInteractiveObjectProxy> ProxyActorClass;                                   // 0x5D0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bEnableActorCulling;                               // 0x5D8(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIgnoreAssociatedNPCForCulling;                    // 0x5D9(0x1)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1069[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSoftObjectPtr<class ASpawner>>       AssociatedNPCSpawners;                             // 0x5E0(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	TArray<TSoftClassPtr<class AActor>>          IgnoreCullingForActorClass;                        // 0x5F0(0x10)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	class UUsableComponent*                      UsableComponent;                                   // 0x600(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGbxMenuData*                          AIOMenuData;                                       // 0x608(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseCoherentMenu;                                  // 0x610(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1071[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  CoherentMenuState;                                 // 0x618(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsAnyoneInInteractRange;                          // 0x620(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1075[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AOakPlayerController*>          PlayersInInteractRange;                            // 0x628(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	bool                                         bIsAnyoneInteracting;                              // 0x638(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1079[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AOakPlayerController*>          InteractingPlayers;                                // 0x640(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class AAdvancedInteractiveObjectProxy*> LocalProxies;                                      // 0x650(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class AOakPlayerController*                  LookedAtByController;                              // 0x660(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TWeakObjectPtr<class UObject>                AssociatedPushedMenu;                              // 0x668(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bUseProxyForPlayerAlert;                           // 0x670(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1086[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  HardwareLightingState;                             // 0x678(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class AAdvancedInteractiveObject* GetDefaultObj();

	void OnRep_bIsAnyoneInteracting();
	void OnPlayerStopInteraction(class AOakPlayerController* Player);
	void OnPlayerExitedInteractRange(class AOakPlayerController* Player);
	void OnPlayerEnteredInteractRange(class AOakPlayerController* Player);
	void OnPlayerBeginInteraction(class AOakPlayerController* Player);
	void OnNoPlayersNowInInteractRange();
	void OnLookedAwayFromByPlayer();
	void OnLookedAtByPlayer(class APlayerController* InstigatingPlayer, bool bCanInteractWith, const struct FVector& NewUsableComponentImpactPoint, float NewUsableDistanceAway);
	void OnAnyPlayersNowInInteractRange();
	void NotifyUsed(struct FUseEvent& UseEvent);
	void HandleActorDestroyed(class AActor* Actor);
};

// 0x0 (0x668 - 0x668)
// Class OakGame.AdvancedInteractiveObjectOwnedGFxMenu
class UAdvancedInteractiveObjectOwnedGFxMenu : public UGbxGFxMenu
{
public:

	static class UClass* StaticClass();
	static class UAdvancedInteractiveObjectOwnedGFxMenu* GetDefaultObj();

};

// 0xB0 (0x508 - 0x458)
// Class OakGame.AdvancedInteractiveObjectProxy
class AAdvancedInteractiveObjectProxy : public AActor
{
public:
	uint8                                        Pad_112C[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSoftClassPath                        GbxInputComponentClass;                            // 0x460(0x18)(Config, GlobalConfig, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                          DefaultSchemas;                                    // 0x478(0x10)(ZeroConstructor, Config, GlobalConfig, Protected, NativeAccessSpecifierProtected)
	struct FAIOOrientedParticleData              ProjectionFXData;                                  // 0x488(0x40)(Edit, DisableEditOnInstance, NoDestructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	bool                                         bAllowInput;                                       // 0x4C8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_112E[0x17];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  DefaultCameraState;                                // 0x4E0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FName                                  CurrentCameraState;                                // 0x4E8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        CameraEntryTransitionIndex;                        // 0x4F0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bCurrentlyInteracting;                             // 0x4F4(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bPlayerWithinInteractRange;                        // 0x4F5(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bCameraTransitionInProgress;                       // 0x4F6(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_113E[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AOakPlayerController*                  OwningPlayer;                                      // 0x4F8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AAdvancedInteractiveObject*            OwningAIO;                                         // 0x500(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class AAdvancedInteractiveObjectProxy* GetDefaultObj();

	void OnOwningPlayerStoppedInteraction();
	void OnOwningPlayerStartedInteraction();
	void OnOwningPlayerExitedInteractRange();
	void OnOwningPlayerEnteredInteractRange();
	void OnFinalizeStopInteraction();
};

// 0x16A8 (0x2458 - 0xDB0)
// Class OakGame.OakCharacter
class AOakCharacter : public AGbxCharacter
{
public:
	uint8                                        Pad_1DAC[0xF0];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class AGbxAIController*                      OwnerGbxAIController;                              // 0xEA0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOakAIActionComponent*                 AIActionComponent;                                 // 0xEA8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOakCharacterMovementComponent*        OakCharacterMovement;                              // 0xEB0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UGameResourcePoolManagerComponent*     ResourcePoolComponent;                             // 0xEB8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOakDamageComponent*                   OakDamageComponent;                                // 0xEC0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOakDamageCauserComponent*             OakDamageCauserComponent;                          // 0xEC8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOakCharacterAbilityManagerComponent*  AbilityManagerComponent;                           // 0xED0(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UOakStatusEffectManagerComponent*      StatusEffectManagerComponent;                      // 0xED8(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInventoryListComponent*               OakCharacterInventory;                             // 0xEE0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInventoryListComponent*               OakCharacterBankInventory;                         // 0xEE8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWadingEffectsComponent*               WadingEffectsComponent;                            // 0xEF0(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBodyWeaponHoldManagerComponent*       CachedBodyWeaponHoldManager;                       // 0xEF8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAIWeaponUserComponent*                AIWeaponUser;                                      // 0xF00(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EHealthState                      HealthState;                                       // 0xF08(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EDeathType                        DeathType;                                         // 0xF09(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRunNormalCharacterPhysicsOnDeath;                 // 0xF0A(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         IsDeadAttached;                                    // 0xF0B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsDeadInSeatedTurret;                             // 0xF0C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1DDF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnHealthStateChanged;                              // 0xF10(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnHealthy;                                         // 0xF20(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnHealthLow;                                       // 0xF30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnHealthVeryLow;                                   // 0xF40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnInjured;                                         // 0xF50(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnDead;                                            // 0xF60(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1DEE[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         CanGoToInjuredState;                               // 0xF88(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1DEF[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCharacterCorpseState                 CorpseState;                                       // 0xF90(0xE8)(Edit, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnZoomChange;                                      // 0x1078(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1DF2[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnWeaponChanged;                                   // 0x1098(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnWeaponReloadStarted;                             // 0x10A8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnWeaponReloadEnded;                               // 0x10B8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnWeaponUsed;                                      // 0x10C8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnCompareToEquippedItem;                           // 0x10D8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnEndCompareToEquippedItem;                        // 0x10E8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnTransported;                                     // 0x10F8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnEquippedArmorChanged;                            // 0x1108(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UCameraModeSetData*                    CameraModesSet;                                    // 0x1118(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UCameraModeSetData*>            CameraModeSetList;                                 // 0x1120(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UBalanceStateComponent*                BalanceComponent;                                  // 0x1130(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFightForYourLifeComponent*            FFYLComponent;                                     // 0x1138(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USprintData*                           SprintInfo;                                        // 0x1140(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnPostLoadGame;                                    // 0x1148(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         bForcePenetrateOnSelf;                             // 0x1158(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ETargetedNameplateType            DesiredNameplateType;                              // 0x1159(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E0D[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UGbxHUDData*                           HUDInfo;                                           // 0x1160(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  PlayerGivenNicknameKey;                            // 0x1168(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayerStandInData*                    StandInData;                                       // 0x1170(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEligibleForIgnoreCollisionWithPlayers;            // 0x1178(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPushOverlappingPlayersAway;                       // 0x1179(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanUseWeaponWhileSprinting;                       // 0x117A(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAutoEquipWeapons;                                 // 0x117B(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIkOverride;                                       // 0x117C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanBeRooted;                                      // 0x117D(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E32[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TScriptInterface<class ITravelStationSpawnPointInterface> LastSpawnPoint;                                    // 0x1180(0x10)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E35[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MusicThreatValue;                                  // 0x1194(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCopyPlayerCustomizationsFromInstigator;           // 0x1198(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseCustomSlidingEyeHeight;                        // 0x1199(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1E39[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SlidingEyeHeight;                                  // 0x119C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FGbxAttributeModifierHandle>   SprintingAttributeModifiers;                       // 0x11A0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1E43[0x98];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FStaticRagdollReplicationData         DeadRagdollReplicationData;                        // 0x1248(0x10)(Net, Transient, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1E4A[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  ShieldEquipped;                                    // 0x1260(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  ShieldUnequipped;                                  // 0x1270(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E50[0x98];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bBlockVehicle;                                     // 0x1318(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1E52[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        VehicleCollisionResistanceFactor;                  // 0x131C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DamageToVehicleFactor;                             // 0x1320(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1E5B[0x44];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnInventoryEquippedEvent;                          // 0x1368(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnInventoryUnequippedEvent;                        // 0x1378(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnInventoryItemPickedUp;                           // 0x1388(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnInventorySlotEnableEvent;                        // 0x1398(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E67[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnCausedElementalEffect;                           // 0x13C0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnCausedMaxResourceEffect;                         // 0x13D0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E6C[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnPlayerAlert;                                     // 0x1400(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1E6D[0x98];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AInteractiveObject*>            AttachedHidableIOs;                                // 0x14A8(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1E71[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AWeapon>                   DefaultWeaponClass;                                // 0x14C0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInventoryBalanceData*                 DefaultBalanceWeaponData;                          // 0x14C8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UInventorySlotData*>            EquipmentSlots;                                    // 0x14D0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<class UWeaponSlotData*>               ActiveWeaponSlots;                                 // 0x14E0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                        ActiveWeaponScale;                                 // 0x14F0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bOverrideBalanceInventory : 1;                     // Mask: 0x1, PropSize: 0x10x14F4(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bDiscardInventoryOnDeath : 1;                      // Mask: 0x2, PropSize: 0x10x14F4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bRebuildInventoryOnLevelChange : 1;                // Mask: 0x4, PropSize: 0x10x14F4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bCanShowHolsterableItemsOnBody : 1;                // Mask: 0x8, PropSize: 0x10x14F4(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_B7 : 4;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1E8B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABodyArmor*                            EquippedBodyArmor;                                 // 0x14F8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1E8D[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  HideWeaponOnSpawnReason;                           // 0x1508(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bHideWeaponOnSpawn : 1;                            // Mask: 0x1, PropSize: 0x10x1510(0x1)(Edit, BlueprintVisible, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_B8 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_1E9E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FHolsteredWeaponData>          WeaponHolsterData;                                 // 0x1518(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UInventoryCategoryData*                WeaponItemType;                                    // 0x1528(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInventoryCategoryData*                CreditsItemType;                                   // 0x1530(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInventoryCategoryData*                BodyArmorItemType;                                 // 0x1538(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInventoryCategoryData*                ShieldItemType;                                    // 0x1540(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInventoryCategoryData*                SpellItemType;                                     // 0x1548(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInventoryCategoryData*                MeleeWeaponItemType;                               // 0x1550(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FInventorySlotContainer               EquippedInventory;                                 // 0x1558(0xE8)(Net, Transient, Protected, NativeAccessSpecifierProtected)
	struct FWeaponSlotContainer                  ActiveWeapons;                                     // 0x1640(0x650)(Transient, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class AHolsteredGearSlot*>            HolsteredGear;                                     // 0x1C90(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1EB9[0x1D0];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	class AWeapon*                               HolsteredWeapon;                                   // 0x1E70(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UInventorySlotData*                    PreferredHolsterWeaponSlot;                        // 0x1E78(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGbxAttributeFloat                    WeaponSwapTimeScale;                               // 0x1E80(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, Net, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseAccuracyPattern;                               // 0x1E8C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bWeaponsRestricted;                                // 0x1E8D(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1EC6[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AOakCharacter*                         InventoryProxy;                                    // 0x1E90(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USlideModifierAspectData*              CurrentSlideModifier;                              // 0x1E98(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1ECB[0x1C];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RecentlyEquippedWeaponInSprintTime;                // 0x1EBC(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1ECE[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  CameraSocket;                                      // 0x1ED0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAnimSequence*                         BaseTransformsAnimation;                           // 0x1ED8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        OverrideVisibleCorpseRemovalTime;                  // 0x1EE0(0x4)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1ED5[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UGbxAction_CoordinatedEffect> CorpseRemovalActionOverride;                       // 0x1EE8(0x8)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        AudioRandomVariationValue;                         // 0x1EF0(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1ED9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UWwiseAudioComponent*                  CachedDefaultAudioComponent;                       // 0x1EF8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  AddInWorldIconEvent;                               // 0x1F00(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  RemoveInWorldIconEvent;                            // 0x1F10(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_1EE1[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UDamageSource>             LastDamageSourceClass;                             // 0x1F28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                KillerActor;                                       // 0x1F30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorComponent*                       CachedFaceFXComponent;                             // 0x1F38(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanStomp;                                         // 0x1F40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1EE8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        StompDivideModifier;                               // 0x1F44(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnEnterVehicleStarted;                             // 0x1F48(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnEnterVehicleFinished;                            // 0x1F58(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnExitVehicleStarted;                              // 0x1F68(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnExitVehicleFinished;                             // 0x1F78(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnChangeVehicleSeat;                               // 0x1F88(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnChangeVehicleSeatFinished;                       // 0x1F98(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnEnterTurretStarted;                              // 0x1FA8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnEnterTurretFinished;                             // 0x1FB8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnExitTurretStarted;                               // 0x1FC8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnExitTurretFinished;                              // 0x1FD8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UVehicleClassIdentifier*               VehicleClassIDBeforeDeath;                         // 0x1FE8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        VehicleSeatSlotBeforeDeath;                        // 0x1FF0(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1EFC[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UVehicleSeatComponent*                 LastVehicleSeat;                                   // 0x1FF8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UVehicleSeatComponent*                 CurrentVehicleSeat;                                // 0x2000(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1F01[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AOakVehicle*                           OwnedVehicle;                                      // 0x2010(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AOakVehicle*                           CARVehicle;                                        // 0x2018(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1F07[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UOakPawnAttachSlotComponent*           LastTurretSeat;                                    // 0x2028(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOakPawnAttachSlotComponent*           CurrentTurretSeat;                                 // 0x2030(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1F0D[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EOakGender                        Gender;                                            // 0x2039(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseGender;                                        // 0x203A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F2E[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FOakGenderData                        MaleGenderData;                                    // 0x2040(0x98)(Edit, NativeAccessSpecifierPrivate)
	struct FOakGenderData                        FemaleGenderData;                                  // 0x20D8(0x98)(Edit, NativeAccessSpecifierPrivate)
	struct FOakCharacterCustomizationData        CustomizationSettings;                             // 0x2170(0x248)(Edit, NativeAccessSpecifierPrivate)
	int32                                        CustomizationSeed;                                 // 0x23B8(0x4)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1F3B[0x1D];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bUseSocketsForIconPlacement;                       // 0x23D9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsPolymorphed;                                    // 0x23DA(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1F3E[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UAIAction>                 MainAIAction;                                      // 0x23E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FOakCoordinatedEffectSwitch           CoordinatedEffectSwitch;                           // 0x23E8(0x58)(Edit, BlueprintVisible, BlueprintReadOnly, Net, RepNotify, ContainsInstancedReference, ExposeOnSpawn, NativeAccessSpecifierPublic)
	class UEnum*                                 AnimStyleEnum;                                     // 0x2440(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        AnimStyleInitial;                                  // 0x2448(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        AnimStyleCurrent;                                  // 0x2449(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1F43[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAICloakComponent*                     CloakComp;                                         // 0x2450(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AOakCharacter* GetDefaultObj();

	void ZoomEvent__DelegateSignature(enum class EZoomEventType IsZooming);
	void WeaponReloadStarted(class AWeapon* Weapon, bool bAuto);
	void WeaponReloadEnded(class AWeapon* Weapon, bool bCompleted, bool bAmmoGiven);
	void WeaponPutDown(class AWeapon* PutDownWeapon);
	void WeaponPrev();
	void WeaponNext();
	void WeaponEquipped();
	void WeaponChangedEvent__DelegateSignature(class AWeapon* NewWeapon, class AWeapon* LastWeapon);
	bool WantsToZoom();
	bool WantsToUseWeapon(class UWeaponSlotData* Slot);
	void UpdatePreToggleWeaponMode();
	void UnlockActiveWeaponActions(class FName Reason, int32 ChannelsMask, bool bReplicate);
	void TryDetachFromAttachSlot(bool bInstant);
	void TriggerResurrectEvent(int32 CashLost);
	void ToggleWeaponMode();
	void ToggleFirstPersonClothSimulation(bool TurnOn);
	void ToggleCrouch();
	void TeleportPawnAndAssociatedVehicle(const struct FVector& StartLoc, const struct FRotator& StartRot, bool bDisableClientCameraUpdates, bool bIsFastTravel);
	void StopZooming(bool bForcedStop, bool bSkipTransitions);
	void StopWantingToStartSprinting();
	void StopUsingWeapon(class UWeaponSlotData* SlotToUse);
	void StopReload(class UWeaponSlotData* SlotToUse);
	void StartZooming();
	void StartUsingWeapon(class UWeaponSlotData* SlotToUse);
	class AWeapon* SpawnDefaultWeapon();
	void SetWantsToSprint(bool bNewWantsToSprint);
	void SetWantsToSlide(bool bNewWantsToSlide);
	void SetIsPolymorphed(bool bNewIsPolymorphed);
	void SetInventoryProxy(class AOakCharacter* Proxy);
	void SetDead(enum class EDeathType InDeathType);
	void SetCurrentWeapon(class AWeapon* NewWeapon, class UWeaponSlotData* NewWeaponSlot, enum class EWeaponPutDownType PutDownType, enum class EWeaponEquipType EquipType);
	void SetCurrentEquippedWeapon(class UInventorySlotData* EquippedInventorySlot, class UWeaponSlotData* NewWeaponSlot, enum class EWeaponPutDownType PutDownType, enum class EWeaponEquipType EquipType);
	void SetCorpseRemovalOverride(float RemovelTime, TSubclassOf<class UGbxAction_CoordinatedEffect> DissolveAction);
	void SetCharacterRooted(bool bRooted, class FName Reason);
	void SetCARVehicle(class AOakVehicle* Vehicle);
	void SetAbilityWeaponEffectState(enum class EWeaponAbilityEffectType EffectType, bool bEnabled);
	void ServerUnlockActiveWeaponActions(class FName Reason, int32 ChannelsMask);
	void ServerUnequipInventorySlot(class UInventorySlotData* SlotToEquip);
	void ServerStopWeaponActions(uint8 Slot, int32 ChannelsMask, bool bClearInput);
	void ServerSpawnDroppedPickup(struct FSelectedInventoryInfo& SelectedInventoryInfo, class UWorld* World, struct FVector& Location, struct FVector& LinearVelocity, struct FVector& AngularVelocity);
	void ServerSetCurrentWeapon(class AWeapon* NewWeapon, uint8 Slot, enum class EWeaponPutDownType PutDownType, enum class EWeaponEquipType EquipType);
	void ServerSelectInventoryItem(class UInventoryCategoryData* SelectedCategory, struct FInventoryListEntryHandle& SelectedHandle);
	void ServerOnMissionDeliveryChoice(bool bMissionAccepted, bool bEmergencyExit, int32 MissionChoiceIndex, class AActor* MissionGiver);
	void ServerLockActiveWeaponActions(class FName Reason, int32 ChannelsMask, bool bStopActions, bool bClearInput);
	void ServerInterruptEmote();
	void ServerEquipInventorySlot(class UInventorySlotData* SlotToEquip, struct FInventoryListEntryHandle& SelectedHandle, bool bSwapSlots);
	void SafeRemoveCorpse();
	void ResetCharacterInventory();
	void ReplaceInventoryItemWithPickup(class AActor* OldInventoryItem, class AInventoryItemPickup* Pickup);
	void ReplaceInventoryItem(class AActor* OldInventoryItem, class AActor* NewInventoryItem);
	void RemovingFromInventory(class UInventoryCategoryData* RemovedCategory, class AActor* RemovedActor, struct FInventoryListEntryHandle& RemovedHandle);
	void RemoveInWorldIcon(struct FHUDInWorldIconTargetInfo& TargetInfo);
	void RemoveInventoryItem(struct FInventoryListEntryHandle& SelectedHandle);
	void RemoveHealthTypeAtIndex(int32 Index, struct FHealthType* ReturnType);
	void Reload(class UWeaponSlotData* SlotToUse, bool bAutoReload);
	void RebuildInventory();
	bool PreInventoryItemPickupCheck(class AActor* PickupActor, int32 Quantity, bool UsedByInstigator, class AInventoryItemPickup* WorldPickupActor);
	void PreDropInventoryActor(class AActor* RemovedActor);
	void PreAddToFullInventory(class UInventoryCategoryData* Category, class AActor* NewActor, int32 Flags, int32 DesiredSlot);
	void PostLoadGameEvent__DelegateSignature(bool SaveGameFound);
	void PerformMeleeImpact(float MeleeRange, class UImpactData* ImpactData);
	void OnZoomedNotifyActions(enum class EZoomEventType IsZooming);
	void OnWeaponResumeUse(class UWeaponSlotData* AttachedSlot);
	void OnStartSprinting();
	void OnRep_OverrideVisibleCorpseRemovalTime();
	void OnRep_HolsteredWeapon();
	void OnRep_HealthState();
	void OnRep_DeadRagdollReplicationData();
	void OnRep_Customization();
	void OnRep_CoordinatedEffectSwitch();
	void OnRep_bIsPolymorphed();
	void OnRecentlyEquippedWeaponInSprintTimerEnd();
	void OnPlayerAlert__DelegateSignature(class AActor* TargetActor, const struct FVector& TargetLocation, class AOakPlayerController* AlertInstigator);
	void OnMissionDeliveryChoice(bool bMissionAccepted, bool bEmergencyExit, int32 MissionChoiceIndex, class AActor* MissionGiver);
	void OnInventoryUnequippedFromSlot(class AActor* InUnequippedInventory, class UInventorySlotData* SlotData);
	void OnInventorySlotEnabled(class UInventorySlotData* SlotData, bool SlotEnabled);
	void OnInventoryItemReplaced(struct FInventoryListEntryHandle& UpdatedItemHandle, class AActor* OldInventoryActor);
	void OnInventoryEquippedOnSlot(class AActor* InEquippedInventory, class UInventorySlotData* SlotData);
	void OnFirstPersonCreated(bool bCreatedArms);
	void OnEndSprinting();
	void OnDodged(enum class EAIDodgeType DodgeType);
	void OnCryoThawing();
	void OnCryoFreezing();
	void OnCharacterTransported(bool bTransportStarted);
	void OnCharacterMeshAnimReinit();
	void OnAIUncloaked();
	void OnAICloaked();
	void NetMulticast_DeactivateEmitter(class FName& ComponentTagName);
	void NetMulticast_BroadcastPickedUpShieldBoost(class UWwiseEvent* PickupAudioEvent, class UParticleSystem* ScreenEffect, float ModifierDuration);
	void NetMulticast_BroadcastCharacterSoundTag(class UCharacterSoundTag* Tag);
	void NetMulticast_ActivateEmitter(class UParticleSystem* EmitterTemplate, class FName& EmitterAttachPointName, class FName& ComponentTagName);
	void Multicast_StopPlayerAlert();
	void LockActiveWeaponActions(class FName Reason, int32 ChannelsMask, bool bStopActions, bool bClearInput, bool bReplicate);
	void K2_StopPlayerAlert();
	void K2_OnIsPolymorphedChanged(bool bNewIsPolymorphed);
	bool K2_CanWeaponZoom();
	bool K2_CanPerformWeaponAction(enum class EWeaponActionChannel Channel);
	bool IsUsingWeapon(class UWeaponSlotData* Slot);
	bool IsSprinting();
	bool IsSlotOpenInventoryCategory(class UInventoryCategoryData* PickupCategory);
	bool IsSlotEnabledForInventoryCategory(class UInventoryCategoryData* PickupCategory);
	bool IsShowingCrosshair(uint8 Slot);
	bool IsPolyMorphed();
	bool IsPlayingEmote();
	bool IsPerformingGroundSlam();
	bool IsLeaping();
	bool IsInventoryItemEquipped(class AActor* InventoryItem);
	bool IsFrozenToDeath();
	bool IsEquippingWeapon(class UWeaponSlotData* SlotToUse);
	bool IsCharacterSliding();
	bool IsCharacterRooted();
	bool IsAttachedToSlot();
	bool IsAttachedToSeat();
	bool IsAttached();
	void InterruptEmote();
	void HealthStateChangeEvent__DelegateSignature(enum class EHealthState HealthState);
	bool HasShieldEquipped();
	bool HasRecentlyEquippedWeaponInSprint();
	bool HasInfiniteAmmo();
	bool HasHealthOfType(class UHealthTypeData* HealthTypeToFind);
	void GoFromInjuredToHealed(class AOakPlayerController* HealedByPlayer);
	void GoFromInjuredToDead();
	void GoFromDeadToHealed();
	bool GetZoomToggle();
	struct FRotator GetWeaponOffsetRotation();
	struct FVector GetWeaponOffsetLocation();
	class AWeapon* GetWeapon(class UWeaponSlotData* SlotToGet);
	bool GetWantsToSprint();
	bool GetWantsToCrouch();
	struct FRotator GetViewModelOffsetRotation(int32 Index);
	struct FVector GetViewModelOffsetLocation(int32 Index);
	class AOakVehicle* GetVehicle();
	class AOakVehicle* GetOwnedVehicle();
	class AOakAIController* GetOakAIController();
	struct FVector GetMovementDirection(enum class EAxis AXIS);
	class UInventoryListComponent* GetInventoryComponent();
	struct FHealthType GetHealthInformationAtIndex(int32 Index, enum class EValidIndex* Branch);
	bool GetFirstHealthInformationByType(class UHealthTypeData* HealthTypeToFind, struct FHealthType* OutHealthType);
	float GetFaceFXBlendWeight(float DeltaTime, float BlendTime, class USkeletalMeshComponent* InSkelMeshComp);
	class AActor* GetEquippedInventoryForSlot(class UInventorySlotData* InventorySlot);
	class AOakVehicle* GetCARVehicle();
	class UInventoryListComponent* GetBankInventoryComponent();
	class UOakAIActionComponent* GetAIActionComponent();
	class AWeapon* GetActiveWeapon(uint8 Slot);
	void GenericEvent__DelegateSignature();
	void FillAllHealth();
	void ExitVehicle(bool bInstant);
	void ExitTurret(bool bInstant);
	void EquipInventorySlotDirect(class UInventorySlotData* SlotToEquip, class AActor* SelectedActor, bool bSwapSlots);
	void EquipInventorySlot(class UInventorySlotData* SlotToEquip, struct FInventoryListEntryHandle& SelectedHandle, bool bSwapSlots);
	void EquipArmorEvent__DelegateSignature(class ABodyArmor* NewBodyArmor);
	void EndCompareToEquippedItemEvent__DelegateSignature();
	void EnableInventorySlot(class UInventorySlotData* InventorySlot, bool bEnabled);
	void DropCurrentWeapon();
	void DelayWeaponsUse(float DelayTime, bool bForceUseAfterDelay);
	void CompareToEquippedItemEvent__DelegateSignature(class UOakInventoryBalanceStateComponent* EquippedItem, class UOakInventoryBalanceStateComponent* OtherItem);
	void ClientUnlockActiveWeaponActions(class FName Reason, int32 ChannelsMask);
	void ClientStopWeaponActions(uint8 Slot, int32 ChannelsMask, bool bClearInput);
	void ClientQuickResetResurrectionFX();
	void ClientLockActiveWeaponActions(class FName Reason, int32 ChannelsMask, bool bStopActions, bool bClearInput);
	void ChangeSeat__DelegateSignature(class UPawnAttachSlotComponent* FromSeat, class UPawnAttachSlotComponent* ToSeat);
	bool CanMelee();
	bool CanEquipInventoryItem(class AActor* InInventoryToEquip);
	bool AttemptGroundSlam();
	void AttachedItemPickedUp(class AInventoryItemPickup* InventoryItemPickedUp, class AActor* PickedUpBy);
	void AttachDetachSeat__DelegateSignature(class UPawnAttachSlotComponent* PawnAttachSlotComponent);
	void AnimNotify_BossClosedCaption(class UAnimNotify* IncomingNotify);
	void AddInWorldIcon(struct FHUDInWorldIconTargetInfo& TargetInfo);
	void AddHealthTypeAtIndex(class UHealthTypeData* HealthTypeData, class UGameResourcePoolData* HealthPoolData, int32 Index, enum class EHealthAdded* Branch);
	void AddHealthType(class UHealthTypeData* HealthTypeData, class UGameResourcePoolData* HealthPoolData, enum class EHealthAdded* Branch);
	void AddedToInventory(class UInventoryListComponent* InventoryList, class UInventoryCategoryData* AddedCategory, class AActor* AddedActor, struct FInventoryListEntryHandle& AddedHandle, int32 Flags, int32 DesiredSlot);
	void AddDefaultItemPoolsToInventory(TArray<struct FItemPoolInfo>* ItemPools, bool SingleEquippedItem, bool ClearInventory, bool EquipIfNoInventory);
	void AddDefaultItemPoolListInventory(class UItemPoolListData* DefaultItemPoolList, bool ClearInventory, bool EquipIfNoInventory);
	void AddDefaultItemPoolInventory(class UItemPoolData* DefaultItemPoolData, bool ClearInventory, bool EquipIfNoInventory);
};

// 0x80 (0x24D8 - 0x2458)
// Class OakGame.OakCharacter_Default
class AOakCharacter_Default : public AOakCharacter
{
public:
	uint8                                        Pad_2064[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UStanceComponent*                      Stance;                                            // 0x2460(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGbxDialogComponent*                   GbxDialog;                                         // 0x2468(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UDialogEvent*                          DeathDialogEvent;                                  // 0x2470(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TMap<class UDialogParameter*, struct FDialogParameterValue> DeathDialogEventParameterValues;                   // 0x2478(0x50)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class UCharacterSoundTag*                    DeathVocalizationTag;                              // 0x24C8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_206B[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AOakCharacter_Default* GetDefaultObj();

	void OnStartInjured_Common();
	void OnReaped();
};

// 0xD8 (0x25B0 - 0x24D8)
// Class OakGame.Agonizer9k
class AAgonizer9k : public AOakCharacter_Default
{
public:
	enum class EA9KFightPhase                    FightPhase;                                        // 0x24D8(0x1)(BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_209F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              SawTargetRotation;                                 // 0x24DC(0xC)(BlueprintVisible, BlueprintReadOnly, Net, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	class APawn*                                 SawTarget;                                         // 0x24E8(0x8)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EA9KSawState                      SawState;                                          // 0x24F0(0x1)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_20AA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SawAngleReached;                                   // 0x24F4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnSawStateChanged;                                 // 0x24F8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	float                                        TimeSinceBeginingOfPhase;                          // 0x2508(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeSinceBeginingOfFight;                          // 0x250C(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeSinceLastSponsorBegan;                         // 0x2510(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_20B8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  EquiptProjectileSaw;                               // 0x2518(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  CancelSaw;                                         // 0x2528(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  ShootProjectile;                                   // 0x2538(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  ShootProjectileSaw;                                // 0x2548(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class FName                                  SawTargetBlackboardKeyName;                        // 0x2558(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnFloorDoneEvent;                                  // 0x2560(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UBlackboardComponent*                  Blackboard;                                        // 0x2570(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        SawTimeCooldown;                                   // 0x2578(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        SawRotateSpeedTryToReachTarget;                    // 0x257C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        SawTimeBetweenReachAndEquip;                       // 0x2580(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        SawTimeAnticipation;                               // 0x2584(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        SawPercentageStopFollowAnticipation;               // 0x2588(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        WaitForEquipAnimDoneFailSafe;                      // 0x258C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_20D5[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAgonizer9k* GetDefaultObj();

	void StopSaw();
	void StartSponsorsTimer();
	void StartSaw();
	void StartBossFight();
	void ResetBossTimers();
	void EquipSawAnimDone();
};

// 0x20 (0x478 - 0x458)
// Class OakGame.Agonizer9kCore
class AAgonizer9kCore : public AActor
{
public:
	uint8                                        Pad_20F0[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTargetableComponent*                  TargetableComponent;                               // 0x460(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UOakDamageComponent*                   DamageComponent;                                   // 0x468(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USphereComponent*                      RootSphereComponent;                               // 0x470(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AAgonizer9kCore* GetDefaultObj();

};

// 0x38 (0x490 - 0x458)
// Class OakGame.Agonizer9kFollowSpot
class AAgonizer9kFollowSpot : public AActor
{
public:
	class USceneComponent*                       SceneRootComp;                                     // 0x458(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                  LightConeComp;                                     // 0x460(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USpotLightComponent*                   SpotLightComp;                                     // 0x468(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2150[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAgonizer9kFollowSpot* GetDefaultObj();

	void TurnOn();
	void TurnOff();
	void StartRotating(float RotationTime, const struct FRotator& RotationDelta);
	void LookAtTarget(float RotationTime, class AActor* Target);
};

// 0x270 (0x6C8 - 0x458)
// Class OakGame.AgonizerFloor
class AAgonizerFloor : public AActor
{
public:
	class UParticleSystem*                       FireHeat;                                          // 0x458(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                       WarmUp;                                            // 0x460(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                       BurstFlameRing1;                                   // 0x468(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                       BurstFlameRing2;                                   // 0x470(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                       BurstFlameRing3;                                   // 0x478(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UParticleSystem*                       BurstFlameRing4;                                   // 0x480(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           MeshCollisionRing02;                               // 0x488(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           MeshCollisionRing03;                               // 0x490(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           MeshCollisionRing04;                               // 0x498(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           MeshCollisionRing05;                               // 0x4A0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           FakeEmmisiveRing02;                                // 0x4A8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           FakeEmmisiveRing03;                                // 0x4B0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           FakeEmmisiveRing04;                                // 0x4B8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           FakeEmmisiveRing05;                                // 0x4C0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           HeatingElementmeshRing02;                          // 0x4C8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           HeatingElementmeshRing03;                          // 0x4D0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           HeatingElementmeshRing04;                          // 0x4D8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           HeatingElementmeshRing05;                          // 0x4E0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMaterialInstance*                     HeatingElementMaterial;                            // 0x4E8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           FakeEmmisiveAllRings;                              // 0x4F0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UDamageData>               DamageData;                                        // 0x4F8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UDamageType>               DamageTypeFire;                                    // 0x500(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           BurstFlameAudio1;                                  // 0x508(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           BurstFlameAudio2;                                  // 0x510(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           BurstFlameAudio3;                                  // 0x518(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           BurstFlameAudio4;                                  // 0x520(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           PreheatAudioSmall1;                                // 0x528(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           PreheatAudioSmall2;                                // 0x530(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           PreheatAudioSmall3;                                // 0x538(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           PreheatAudioSmall4;                                // 0x540(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           PreheatAudioBig1;                                  // 0x548(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           PreheatAudioBig2;                                  // 0x550(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           PreheatAudioBig3;                                  // 0x558(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWwiseEvent*                           PreheatAudioBig4;                                  // 0x560(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BurstFlameAudioGain;                               // 0x568(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BurstFlamesAudioRadius;                            // 0x56C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BurstFlamesAudioRadiusRingMultiplier;              // 0x570(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2297[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USceneComponent*                       SceneRootComp;                                     // 0x578(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WarmupTime;                                        // 0x580(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WarmUpDelayWhenAllWarmUpDone;                      // 0x584(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RotationFloorDoneTime;                             // 0x588(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FloorRotationTimeBetweenSector;                    // 0x58C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AnticipationTimeOneRing;                           // 0x590(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AnticipationTime;                                  // 0x594(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AnticipationTimeRotationPattern;                   // 0x598(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DamageOverlapTime;                                 // 0x59C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BurstinitialOffset;                                // 0x5A0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BurstOffsetPerRing;                                // 0x5A4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FloorFireDamage;                                   // 0x5A8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RingPatternInterval;                               // 0x5AC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HeatingPipeEmissiveInterval;                       // 0x5B0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22BE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           EmissiveStrengthOverTime;                          // 0x5B8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                           EmissiveStrengthOverTimeFadeOut;                   // 0x5C0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnFloorFirstFlame;                                 // 0x5C8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         bDisplayDebugCollisionZones;                       // 0x5D8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_22CB[0xEF];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAgonizerFloor* GetDefaultObj();

	void StopHeatingPipeEmissive(struct FFloorSectorRing* SectorRing);
	void StopDamageFeedbackRing(struct FFloorSector* FloorSector, struct FFloorSectorRing* SectorRing);
	void StartSafeSpotPattern(float DelayBeforeStart);
	void StartRotationPattern(float DelayBeforeStart);
	void StartRingPattern(float DelayBeforeStart);
	void StartHeatingPipeEmissive(struct FFloorSectorRing* SectorRing);
	void StartAnticipationSafeSpot(int32 SafeSpotSectorId);
	void SetFloorRotationParameters(int32 Direction, int32 StartingSectorId);
	void SetAgonizerRef(class AAgonizer9k* AgonizerRef);
	void PlayBurstFlameAudio();
	void OnWarmUpDone(struct FFloorSector* FloorSector);
	void OnRotationAnticipationDone(struct FFloorSector* FloorSector, bool IsLast);
	void OnDamageFeedbackDone();
	void OnAnticipationOneRingDone(struct FFloorSector* FloorSector, struct FFloorSectorRing* SectorRing);
	void OnAnticipationDone();
};

// 0x2B8 (0x418 - 0x160)
// Class OakGame.AIAction_AngryPatrolTaunt
class UAIAction_AngryPatrolTaunt : public UAIAction_Selector
{
public:
	struct FGbxParam                             ProbabilityOfPlayingTauntAction;                   // 0x160(0x80)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIAspectSettings_GbxAction           TauntAction;                                       // 0x1E0(0x238)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAIAction_AngryPatrolTaunt* GetDefaultObj();

};

// 0x8 (0x150 - 0x148)
// Class OakGame.AIAction_GetOutVehicle
class UAIAction_GetOutVehicle : public UAIAction
{
public:
	bool                                         bInstantDetach;                                    // 0x148(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23C1[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIAction_GetOutVehicle* GetDefaultObj();

};

// 0x30 (0x178 - 0x148)
// Class OakGame.AIAction_LeapOnVehicle
class UAIAction_LeapOnVehicle : public UAIAction
{
public:
	struct FGbxBlackboardKeySelector             Target;                                            // 0x148(0x10)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	TSubclassOf<class UOakAction_LeapOnVehicle>  LeapAction;                                        // 0x158(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxLeapDistance;                                   // 0x160(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLeapOnHostile;                                    // 0x164(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23D2[0x13];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIAction_LeapOnVehicle* GetDefaultObj();

};

// 0x180 (0x2F0 - 0x170)
// Class OakGame.AIAction_PatrolPath
class UAIAction_PatrolPath : public UAIAction_Priority
{
public:
	struct FAIAspectSettings_Navigation          NavSettings;                                       // 0x170(0x140)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIAspectSettings_MovePath            MovePathSetting;                                   // 0x2B0(0x40)(Edit, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAIAction_PatrolPath* GetDefaultObj();

};

// 0xA48 (0xB90 - 0x148)
// Class OakGame.AIAction_ReviveActor
class UAIAction_ReviveActor : public UAIAction
{
public:
	struct FAIAspectSettings_Revive              ReviveSettings;                                    // 0x148(0x90)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIAspectSettings_Ticket              TicketSettings;                                    // 0x1D8(0x128)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIAspectSettings_EnvQuery            QuerySettings;                                     // 0x300(0x3A0)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                         bUseQuerySettings;                                 // 0x6A0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23EE[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAIAspectSettings_Navigation          NavSettings;                                       // 0x6A8(0x140)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FAIAspectSettings_EnvQuery            NavigationQuerySettings;                           // 0x7E8(0x3A0)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                         bUseNavigationQuery;                               // 0xB88(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_23F4[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIAction_ReviveActor* GetDefaultObj();

};

// 0x208 (0x3F0 - 0x1E8)
// Class OakGame.AIAction_VehicleEscort
class UAIAction_VehicleEscort : public UAIAction_Sequence
{
public:
	struct FAIAspectSettings_VehicleEscortSpeed  EscortSettings;                                    // 0x1E8(0x1A0)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGbxBlackboardKeySelector             TargetKey;                                         // 0x388(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGbxBlackboardKeySelector             EscortFindComponentKey;                            // 0x398(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGbxBlackboardKeySelector             EscortLocationComponentKey;                        // 0x3A8(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGbxBlackboardKeySelector             EscortLocationReferenceKey;                        // 0x3B8(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGbxBlackboardKeySelector             EscortLocationOffsetKey;                           // 0x3C8(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGbxBlackboardKeySelector             IsEscortingTargetActorInfoKey;                     // 0x3D8(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bMoveEvenIfUnreachable;                            // 0x3E8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2447[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIAction_VehicleEscort* GetDefaultObj();

	void InitEscortTarget(class AActor* Target, struct FVector& OffsetVector, class AActor* OrientationReference);
	void InitCustomEscort(class AActor* Target, class AActor* ActorToEscort, struct FVector& OffsetVector, class AActor* OrientationReference);
};

// 0x20 (0x410 - 0x3F0)
// Class OakGame.AIAction_VehicleEscortTarget
class UAIAction_VehicleEscortTarget : public UAIAction_VehicleEscort
{
public:
	struct FVector                               OffsetVector;                                      // 0x3F0(0xC)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_245D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGbxBlackboardKeySelector             OrientationReferenceKey;                           // 0x400(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAIAction_VehicleEscortTarget* GetDefaultObj();

};

// 0x140 (0x240 - 0x100)
// Class OakGame.AIAspect_Dialog
class UAIAspect_Dialog : public UAIAspect
{
public:
	struct FAIAspectSettings_Dialog              Settings;                                          // 0x100(0x140)(Edit, ContainsInstancedReference, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAIAspect_Dialog* GetDefaultObj();

	class FString GetDialogSettingsDescription(struct FAIAspectSettings_Dialog& DialogSettings, class UProperty* Property);
	class FString GetDialogConditionSettingsDescription(struct FAIAspectSettings_DialogCondition& DialogSettings, class UProperty* Property);
};

// 0x40 (0x280 - 0x240)
// Class OakGame.AIAspect_MovePath
class UAIAspect_MovePath : public UAIAspect_Navigation
{
public:
	struct FAIAspectSettings_MovePath            MovePathSettings;                                  // 0x240(0x40)(Edit, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAIAspect_MovePath* GetDefaultObj();

};

// 0x0 (0x100 - 0x100)
// Class OakGame.AIAspect_NpcGreeting
class UAIAspect_NpcGreeting : public UAIAspect
{
public:

	static class UClass* StaticClass();
	static class UAIAspect_NpcGreeting* GetDefaultObj();

};

// 0x90 (0x190 - 0x100)
// Class OakGame.AIAspect_Revive
class UAIAspect_Revive : public UAIAspect
{
public:
	struct FAIAspectSettings_Revive              Settings;                                          // 0x100(0x90)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAIAspect_Revive* GetDefaultObj();

	class FString GetReviveSettingsDescription(struct FAIAspectSettings_Revive& ReviveSettings, class UProperty* Property);
};

// 0x8 (0x108 - 0x100)
// Class OakGame.AIAspect_VehicleArchetype
class UAIAspect_VehicleArchetype : public UAIAspect
{
public:
	struct FAIAspectSettings_VehicleArchetype    Settings;                                          // 0x100(0x2)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_24DC[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIAspect_VehicleArchetype* GetDefaultObj();

};

// 0x8 (0x108 - 0x100)
// Class OakGame.AIAspect_VehicleAttitude
class UAIAspect_VehicleAttitude : public UAIAspect
{
public:
	struct FAIAspectSettings_VehicleAttitude     Settings;                                          // 0x100(0x2)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_24E7[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIAspect_VehicleAttitude* GetDefaultObj();

};

// 0x8 (0x108 - 0x100)
// Class OakGame.AIAspect_VehicleDriverLeaves
class UAIAspect_VehicleDriverLeaves : public UAIAspect
{
public:
	struct FAIAspectSettings_VehicleDriverLeaves Settings;                                          // 0x100(0x1)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_24F4[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIAspect_VehicleDriverLeaves* GetDefaultObj();

};

// 0x80 (0x180 - 0x100)
// Class OakGame.AIAspect_VehicleDriving
class UAIAspect_VehicleDriving : public UAIAspect
{
public:
	struct FAIAspectSettings_VehicleDriving      Settings;                                          // 0x100(0x80)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAIAspect_VehicleDriving* GetDefaultObj();

};

// 0x208 (0x448 - 0x240)
// Class OakGame.AIAspect_VehicleEscortSpeed
class UAIAspect_VehicleEscortSpeed : public UAIAspect_Navigation
{
public:
	struct FAIAspectSettings_VehicleEscortSpeed  EscortSettings;                                    // 0x240(0x1A0)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FGbxBlackboardKeySelector             TargetKey;                                         // 0x3E0(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGbxBlackboardKeySelector             FindComponentKey;                                  // 0x3F0(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGbxBlackboardKeySelector             LocationKey;                                       // 0x400(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGbxBlackboardKeySelector             EscortLocationReferenceKey;                        // 0x410(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGbxBlackboardKeySelector             EscortLocationOffsetKey;                           // 0x420(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FGbxBlackboardKeySelector             IsEscortingTargetActorInfoKey;                     // 0x430(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bDebugTestDirectPath;                              // 0x440(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_250A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIAspect_VehicleEscortSpeed* GetDefaultObj();

};

// 0x18 (0x118 - 0x100)
// Class OakGame.AIAspect_VehicleHorn
class UAIAspect_VehicleHorn : public UAIAspect
{
public:
	struct FAIAspectSettings_VehicleHorn         Settings;                                          // 0x100(0x18)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAIAspect_VehicleHorn* GetDefaultObj();

};

// 0x8 (0x108 - 0x100)
// Class OakGame.AIAspect_VehicleHover
class UAIAspect_VehicleHover : public UAIAspect
{
public:
	bool                                         bTrackTarget;                                      // 0x100(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_251D[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIAspect_VehicleHover* GetDefaultObj();

};

// 0x18 (0x118 - 0x100)
// Class OakGame.AIAspect_VehicleParts
class UAIAspect_VehicleParts : public UAIAspect
{
public:
	struct FAIAspectSettings_VehicleParts        Settings;                                          // 0x100(0x18)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAIAspect_VehicleParts* GetDefaultObj();

};

// 0x6B8 (0x7B8 - 0x100)
// Class OakGame.AIAspect_VehicleSpeed
class UAIAspect_VehicleSpeed : public UAIAspect
{
public:
	struct FAIAspectSettings_VehicleSpeed        Settings;                                          // 0x100(0x6B8)(Edit, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAIAspect_VehicleSpeed* GetDefaultObj();

};

// 0x160 (0x338 - 0x1D8)
// Class OakGame.AIBalanceStateComponent
class UAIBalanceStateComponent : public UBalanceStateComponent
{
public:
	UMulticastDelegateProperty_                  OnAnointedDeathStateChanged;                       // 0x1D8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FAIPlayThroughData>            PlayThroughs;                                      // 0x1E8(0x10)(Edit, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAttributeInitializationData          ExperienceLevelFormula;                            // 0x1F8(0x38)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                         bUseExperienceLevelFormula;                        // 0x230(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EBalanceValueType                 BaseItemGameStageSource;                           // 0x231(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_258C[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAttributeInitializationData          ItemGameStageOffset;                               // 0x238(0x38)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FItemPoolCollection                   DropOnDeathItemPools;                              // 0x270(0x20)(Edit, NativeAccessSpecifierPrivate)
	struct FItemPoolCollection                   CharacterExpansionDropOnDeathItemPools;            // 0x290(0x20)(Transient, NativeAccessSpecifierPrivate)
	class FName                                  DropLootSocketName;                                // 0x2B0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class ULootSpawnPatternData*                 DropLootPattern;                                   // 0x2B8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FAILootDropOverride>           ExtraDropLootSockets;                              // 0x2C0(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        bWaitForNotifyToSpawnLoot : 1;                     // Mask: 0x1, PropSize: 0x10x2D0(0x1)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_D1 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_259B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DelayedSpawnLootFailSafeTimer;                     // 0x2D4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        TimeToSpawnLootOver;                               // 0x2D8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_259E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FAttributeEffectData>          DropLootAttributeEffects;                          // 0x2E0(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	bool                                         bIsAnointed;                                       // 0x2F0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25A3[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnointedEnemyData                    AnointedData;                                      // 0x2F8(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	class UItemPoolListInterface*                ExtraItemPoolToDropOnDeath;                        // 0x308(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EItemDropOnDeathType              ExtraItemPoolDropRule;                             // 0x310(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        bSuppressDropOnDeathItemPools : 1;                 // Mask: 0x1, PropSize: 0x10x311(0x1)(Transient, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        BitPad_D2 : 7;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_25AC[0xE];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UUsableComponent*                      AnointedUsableComponent;                           // 0x320(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EAnointedDeathState               AnointedDeathState;                                // 0x328(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_25B1[0xF];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIBalanceStateComponent* GetDefaultObj();

	void SuppressDropOnDeathItemPools(bool bSuppress);
	void ShatterFrozenAnointed();
	void SetCustomDropsOnDeath(class UItemPoolListInterface* ExtraPoolToDropOnDeath, bool AddedToBalanceDropItems, enum class EItemDropOnDeathType ItemPoolDropRule);
	void ManuallyTriggerAnointedDeath();
	void ForceDropLoot();
	void FinalizeAnointedFreeze();
	void EnableDropLootSocket(class FName SocketName);
	void ApplyNameForCurrentPlayThrough();
};

// 0x108 (0x138 - 0x30)
// Class OakGame.AIDialogEventData
class UAIDialogEventData : public UGbxDataAsset
{
public:
	class UDialogEvent*                          TargetAcquiredEvent;                               // 0x30(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDialogEvent*                          TargetLostEvent;                                   // 0x38(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDialogEvent*                          TargetKilledOneEnemyTargetEvent;                   // 0x40(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDialogEvent*                          TargetDownEvent;                                   // 0x48(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDialogEvent*                          TargetDeadEvent;                                   // 0x50(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDialogEvent*                          ShootingEvent;                                     // 0x58(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDialogEvent*                          ReloadEvent;                                       // 0x60(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDialogEvent*                          ReinforcementsEvent;                               // 0x68(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDialogEvent*                          ReinforcementsArriveEvent;                         // 0x70(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReinforcementsArriveEventDelay;                    // 0x78(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_25D7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class EAIDodgeType, struct FDodgeVOInfo> DodgeVO;                                           // 0x80(0x50)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	class UDialogParameter*                      TargetParam;                                       // 0xD0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDialogParameter*                      InstigatorParam;                                   // 0xD8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDialogParameter*                      MethodOfDeathParam;                                // 0xE0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDialogParameter*                      ActionSkillParam;                                  // 0xE8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UDamageSource>             ActionSkillDamageSourceClass;                      // 0xF0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDialogEnumValue*                      MethodOfDeath_Normal;                              // 0xF8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDialogEnumValue*                      MethodOfDeath_Gibbed;                              // 0x100(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDialogEnumValue*                      MethodOfDeath_ActionSkill;                         // 0x108(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDialogEvent*                          NpcGreetingHelloEvent;                             // 0x110(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDialogEvent*                          NpcGreetingHelloMissionEvent;                      // 0x118(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDialogEvent*                          NpcGreetingIdleEvent;                              // 0x120(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDialogEvent*                          NpcGreetingGoodbyeEvent;                           // 0x128(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDialogParameter*                      NpcGreetingTargetParam;                            // 0x130(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAIDialogEventData* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class OakGame.AIHeldActorInterface
class IAIHeldActorInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAIHeldActorInterface* GetDefaultObj();

	void AIHeldActor_OnThrow();
	void AIHeldActor_OnPrime();
	void AIHeldActor_OnDrop();
	enum class EOakElementalType AIHeldActor_GetElementalType();
};

// 0x90 (0x3B0 - 0x320)
// Class OakGame.AIHeldActorComponent
class UAIHeldActorComponent : public UGbxChildActorComponent
{
public:
	struct FGbxBlackboardKeySelector             BlackboardKeyEquipped;                             // 0x320(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FGbxBlackboardKeySelector             BlackboardKeyRequesting;                           // 0x330(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FSoftObjectPath                       DefaultDeathTagName;                               // 0x340(0x18)(Config, GlobalConfig, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UHitReactionTag*                       DeathTag;                                          // 0x358(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAutofillDeathTag;                                 // 0x360(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bDisableCollisionWhileHeld;                        // 0x361(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2762[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  DroppedCollisionProfile;                           // 0x368(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bChangeCollisionProfileOnDrop;                     // 0x370(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGbxTriggerProperty                   PresetTrigger;                                     // 0x371(0x1)(Edit, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                         bInitialized;                                      // 0x372(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2770[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                HeldActor;                                         // 0x378(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTargetingComponent*                   TargetingComponent;                                // 0x380(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBlackboardComponent*                  BlackboardComponent;                               // 0x388(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TScriptInterface<class IAIHeldActorInterface> HeldActorInterface;                                // 0x390(0x10)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, UObjectWrapper, NativeAccessSpecifierPrivate)
	class AActor*                                ClientDisabledCollisionActor;                      // 0x3A0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_277E[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIHeldActorComponent* GetDefaultObj();

	void ThrowHeldActorAtTarget(float ThrowSpeed, float ThrowAnglePercent, class FName TargetSocket, const struct FVector& TargetOffset, const struct FRotator& AngleOffset, float MaxPrediction, bool bRequestNewHeldActor, bool bSpawnIfDoesNotExist);
	void ThrowHeldActorAtLocation(const struct FVector& ThrowAtLocation, float ThrowSpeed, float ThrowAnglePercent, bool bRequestNewHeldActor, bool bSpawnIfDoesNotExist);
	void ThrowHeldActorAtActor(class AActor* ThrowAtActor, float ThrowSpeed, float ThrowAnglePercent, class FName ActorSocket, const struct FVector& ActorOffset, const struct FRotator& AngleOffset, float MaxPrediction, bool bRequestNewHeldActor, bool bSpawnIfDoesNotExist);
	void SpawnHeldActor();
	void SetNewHeldActorClass(TSubclassOf<class AActor> NewHeldActorClass);
	void PrimeHeldActor();
	void OnTriggerPreset(enum class EHeldActorPreset Preset);
	void OnHeldActorSpawned(class AActor* NewHeldActor);
	void OnHeldActorNativeDrop(class AActor* Actor);
	enum class EOakElementalType GetHeldActorElementalType();
	class AActor* GetHeldActor();
	void DropHeldActor(bool bRequestNewHeldActor, class AActor* InstigatorOverride);
	void DetonateHeldActor(bool bKillSelf, bool bRequestNewHeldActor, class AActor* InstigatorOverride);
};

// 0x660 (0x690 - 0x30)
// Class OakGame.AIO_CameraData
class UAIO_CameraData : public UGbxDataAsset
{
public:
	TArray<struct FAIOCameraStateInfo>           CameraStates;                                      // 0x30(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FAIOCameraEntryTransition>     CameraEntryTransitions;                            // 0x40(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	struct FGbxEasingFunc                        CameraEntryEasing;                                 // 0x50(0xC)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	float                                        CameraEntryLocationDuration;                       // 0x5C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraEntryRotationDuration;                       // 0x60(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TargetFOV;                                         // 0x64(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TargetFOVSplitscreen;                              // 0x68(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TargetFOVVerticalSplitscreen;                      // 0x6C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TargetFOVQuadSplitscreen;                          // 0x70(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRestoreCameraRotation;                            // 0x74(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27C2[0xB];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPostProcessSettings                  PostProcessSettings;                               // 0x80(0x600)(Edit, NativeAccessSpecifierPublic)
	float                                        DOFMagnitudeInterpTime;                            // 0x680(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        VignetteInterpTime;                                // 0x684(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_27C7[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIO_CameraData* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class OakGame.AIProjectileInterface
class IAIProjectileInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAIProjectileInterface* GetDefaultObj();

	void AIProjectile_Disarm();
	void AIProjectile_Detonate();
	bool AIProjectile_CanBeStolen();
	void AIProjectile_Arm();
};

// 0x100 (0x820 - 0x720)
// Class OakGame.AIStolenProjectileComponent
class UAIStolenProjectileComponent : public UBoxComponent
{
public:
	UMulticastDelegateProperty_                  OnStolenProjectileUpdated;                         // 0x720(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnStolenProjectileReturned;                        // 0x730(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnStolenProjectileDestroyed;                       // 0x740(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FGbxBlackboardKeySelector             BlackboardKeyProjectile;                           // 0x750(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	struct FGbxBlackboardKeySelector             BlackboardKeyHasProjectile;                        // 0x760(0x10)(Edit, NoDestructor, NativeAccessSpecifierPrivate)
	float                                        DirectionConeHalfAngle;                            // 0x770(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bLimitedByDirection;                               // 0x774(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_295E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ChanceToSucceed;                                   // 0x778(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2961[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           LerpToSocketCurve;                                 // 0x780(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bCanStealWhenLeftComponent;                        // 0x788(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2966[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TimeToForget;                                      // 0x78C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_296A[0x28];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                StolenProjectile;                                  // 0x7B8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                        IgnoreProjectiles;                                 // 0x7C0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	class USkeletalMeshComponent*                SkelMeshComp;                                      // 0x7D0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UTargetingComponent*                   TargetingComponent;                                // 0x7D8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBlackboardComponent*                  BlackboardComponent;                               // 0x7E0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FReplicatedStolenProjectileData       ClientData;                                        // 0x7E8(0x10)(Net, Transient, RepNotify, NoDestructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_296F[0x28];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIStolenProjectileComponent* GetDefaultObj();

	void StolenProjectileReleased();
	void SetChanceToSucceed(float NewChanceToSucceed);
	bool ReturnProjectileToTarget(float Speed, float AnglePercent, class FName Socket, const struct FVector& TargetOffset, const struct FRotator& AngleOffset, float MaxPrediction);
	bool ReturnProjectileToOwner(float Speed, float AnglePercent, class FName Socket, const struct FVector& TargetOffset, const struct FRotator& AngleOffset, float MaxPrediction);
	bool ReturnProjectileToLocation(const struct FVector& Location, float Speed, float AnglePercent);
	bool ReturnProjectileToActor(class AActor* Actor, float Speed, float AnglePercent, class FName Socket, const struct FVector& TargetOffset, const struct FRotator& AngleOffset, float MaxPrediction);
	void ReleaseOnStolenProjectileDestroyed(class AActor* Unused);
	void OnRep_ClientData();
	void OnOverlapEnd(class UPrimitiveComponent* OverlappedComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void OnOverlapBegin(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	bool LerpToSocket(class FName Socket, float Duration);
	enum class EOakElementalType GetElementalType();
	bool DisarmProjectile();
	bool DidInteractionSucceed();
	bool DetonateProjectile();
	bool DestroyProjectile();
	bool AttachProjectile(class FName SocketName);
	bool ArmProjectile();
};

// 0x38 (0x4C8 - 0x490)
// Class OakGame.OakTriggerVolume
class AOakTriggerVolume : public ATriggerVolume
{
public:
	class UOakTriggerComponent*                  TriggerComponent;                                  // 0x490(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  TouchedTrigger;                                    // 0x498(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  UnTouchedTrigger;                                  // 0x4A8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  AllPlayersTouchingTrigger;                         // 0x4B8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AOakTriggerVolume* GetDefaultObj();

	void NotifyTriggerUntouched(class AActor* OtherActor, bool bIsPlayer);
	void NotifyTriggerTouched(class AActor* OtherActor, bool bIsPlayer);
	void NotifyAllPlayersTouchingTrigger();
};

// 0x10 (0x4D8 - 0x4C8)
// Class OakGame.AllPlayersRequiredVolume
class AAllPlayersRequiredVolume : public AOakTriggerVolume
{
public:
	UMulticastDelegateProperty_                  OnPlayerTouchedButNotAllPlayersTouching;           // 0x4C8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AAllPlayersRequiredVolume* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class OakGame.AlwaysLoadedData
class UAlwaysLoadedData : public UPrimaryDataAsset
{
public:
	TArray<TSoftObjectPtr<class UObject>>        AlwaysLoadedAssets;                                // 0x30(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAlwaysLoadedData* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class OakGame.AmmoAspectData
class UAmmoAspectData : public UInventoryAspectData
{
public:
	class UGbxAmmoTypeData*                      AmmoType;                                          // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAmmoAspectData* GetDefaultObj();

};

// 0x10 (0x48 - 0x38)
// Class OakGame.AnimNotify_EnableDropLootSocket
class UAnimNotify_EnableDropLootSocket : public UAnimNotify
{
public:
	TArray<class FName>                          SocketNames;                                       // 0x38(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotify_EnableDropLootSocket* GetDefaultObj();

};

// 0x8 (0x48 - 0x40)
// Class OakGame.AnimNotify_OakPawnAttachSlotTransition
class UAnimNotify_OakPawnAttachSlotTransition : public UAnimNotify_PawnAttachSlotTransition
{
public:
	bool                                         bAdvanceCameraState;                               // 0x40(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_29FD[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_OakPawnAttachSlotTransition* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class OakGame.AnimNotify_PlayerMelee
class UAnimNotify_PlayerMelee : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_PlayerMelee* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class OakGame.AnimNotify_PlayerMeleeChainBufferStart
class UAnimNotify_PlayerMeleeChainBufferStart : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_PlayerMeleeChainBufferStart* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class OakGame.AnimNotify_PlayerMeleeEnd
class UAnimNotify_PlayerMeleeEnd : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_PlayerMeleeEnd* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class OakGame.AnimNotify_PlayerMeleeFOVToggle
class UAnimNotify_PlayerMeleeFOVToggle : public UAnimNotify
{
public:
	bool                                         bActivate;                                         // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A2E[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotify_PlayerMeleeFOVToggle* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class OakGame.AnimNotify_PlayerMeleePullBegin
class UAnimNotify_PlayerMeleePullBegin : public UAnimNotify
{
public:

	static class UClass* StaticClass();
	static class UAnimNotify_PlayerMeleePullBegin* GetDefaultObj();

};

// 0x8 (0x40 - 0x38)
// Class OakGame.AnimNotify_SpellTrigger
class UAnimNotify_SpellTrigger : public UAnimNotify
{
public:
	class FName                                  TriggerName;                                       // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotify_SpellTrigger* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class OakGame.AnimNotify_CatchPickup
class UAnimNotify_CatchPickup : public UAnimNotifyState
{
public:
	class FName                                  HideWeaponLock;                                    // 0x30(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  HideWeaponBone;                                    // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotify_CatchPickup* GetDefaultObj();

};

// 0x8 (0x38 - 0x30)
// Class OakGame.AnimNotifyState_CryoFreeze
class UAnimNotifyState_CryoFreeze : public UAnimNotifyState
{
public:
	bool                                         bDisableAnimFreeze;                                // 0x30(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2A47[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotifyState_CryoFreeze* GetDefaultObj();

};

// 0x30 (0x4C0 - 0x490)
// Class OakGame.AreaResetVolume
class AAreaResetVolume : public AVolume
{
public:
	uint8                                        Pad_2A5B[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bIsEnabled;                                        // 0x4A8(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisableOnReset;                                   // 0x4A9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2A60[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  ResetAreaEvent;                                    // 0x4B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AAreaResetVolume* GetDefaultObj();

	void SetEnabled(bool bEnabled);
	void ResetAreaIfEmpty();
};

// 0x50 (0x660 - 0x610)
// Class OakGame.AsyncSpinner
class UAsyncSpinner : public UGbxGFxHUDWidget
{
public:
	TSoftObjectPtr<class UTexture2D>             TextureToLoad;                                     // 0x610(0x28)(Edit, BlueprintReadOnly, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSoftObjectPath                       TextureToLoadStringReference;                      // 0x638(0x18)(BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2A84[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAsyncSpinner* GetDefaultObj();

	void StartLoadingTexture(struct FSoftObjectPath& AssetPathToLoad);
	void CompleteLoadingTexture();
};

// 0x40 (0x70 - 0x30)
// Class OakGame.AttributeEffectMutatorData_AlliesInRange
class UAttributeEffectMutatorData_AlliesInRange : public UAttributeEffectMutatorData
{
public:
	bool                                         bInfiniteRange;                                    // 0x30(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2A8F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAttributeInitializationData          RangeData;                                         // 0x38(0x38)(Edit, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAttributeEffectMutatorData_AlliesInRange* GetDefaultObj();

};

// 0x48 (0x4A0 - 0x458)
// Class OakGame.BasicSpellActor
class ABasicSpellActor : public AActor
{
public:
	uint8                                        Pad_2A99[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSpawnableSpellBasicData              SpellData;                                         // 0x460(0x40)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ABasicSpellActor* GetDefaultObj();

};

// 0x48 (0x4A0 - 0x458)
// Class OakGame.BeamTargetEmptyActor
class ABeamTargetEmptyActor : public AActor
{
public:
	class USceneComponent*                       SceneRootComp;                                     // 0x458(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                BeamTarget;                                        // 0x460(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FollowLerpSpeed;                                   // 0x468(0x4)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2AD1[0x34];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABeamTargetEmptyActor* GetDefaultObj();

	void SetBeamTarget(class AActor* NewBeamTarget, float NewFollowLerpSpeed);
};

// 0x58 (0x1D0 - 0x178)
// Class OakGame.BlackJackComponent
class UBlackJackComponent : public UActorComponent
{
public:
	UMulticastDelegateProperty_                  OnCardUpdated;                                     // 0x178(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FBlackJackCardDefinition>      CardDefinitions;                                   // 0x188(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2BC5[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                IndicesOfCurrentCards;                             // 0x1B0(0x10)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2BC7[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBlackJackComponent* GetDefaultObj();

	bool ShouldOpenChest();
	void Reset();
	void OpenChest();
	void OnRep_CurrentCards();
	int32 GetNbOfCard();
	int32 GetCurrentHandValue();
	int32 GetCardValueIndexAtIndex(int32 Index);
	int32 GetCardSuitIndexAtIndex(int32 Index);
	class FString GetCardAtIndex(int32 Index);
	bool CanUseOpenChest();
	bool CanUseAddCard();
	void AddCard();
};

// 0x48 (0x4A0 - 0x458)
// Class OakGame.OakInventoryItem
class AOakInventoryItem : public AActor
{
public:
	UMulticastDelegateProperty_                  OnItemPickedUp;                                    // 0x458(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnItemUsedInInventory;                             // 0x468(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	bool                                         CanBeUsedInInventory;                              // 0x478(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ConsumeWhenUsed;                                   // 0x479(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2C44[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  OverrideErrorText;                                 // 0x480(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class UInventoryBalanceStateComponent*       InventoryBalanceState;                             // 0x498(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AOakInventoryItem* GetDefaultObj();

	void OnPickedUp(class AOakCharacter* PickupInstigator);
	void InventoryUsedDelegate__DelegateSignature(class AOakCharacter* PickupInstigator);
	void InventoryPickedUpDelegate__DelegateSignature(class AOakCharacter* PickupInstigator);
	bool HasValidInventoryBalanceState();
	class FText GetOverrideErrorText();
	bool CanBeUsedFromInventory(class AOakCharacter* InventoryOwner);
	bool CanBePickedUp(class AOakCharacter* PickupInstigator, int32 Quantity, bool UsedByInstigator, class AInventoryItemPickup* WorldPickupActor);
};

// 0x28 (0x4C8 - 0x4A0)
// Class OakGame.OakInventoryEquippableItem
class AOakInventoryEquippableItem : public AOakInventoryItem
{
public:
	UMulticastDelegateProperty_                  OnEquippedDelegate;                                // 0x4A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnUnequippedDelegate;                              // 0x4B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class AOakCharacter*                         ClientPendingEquipInstigator;                      // 0x4C0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AOakInventoryEquippableItem* GetDefaultObj();

	void OnUnequipped(class AOakCharacter* EquipInstigator);
	void OnEquipped(class AOakCharacter* EquipInstigator);
	void InventoryEquipDelegate__DelegateSignature(class AOakCharacter* EquipInstigator);
};

// 0x48 (0x510 - 0x4C8)
// Class OakGame.BodyArmor
class ABodyArmor : public AOakInventoryEquippableItem
{
public:
	class UBodyArmorInventoryBalanceStateComponent* BalanceStateComponent;                             // 0x4C8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGbxSkeletalMeshComponent*             BodyArmorMesh;                                     // 0x4D0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AOakCharacter*                         EquippedCharacter;                                 // 0x4D8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGbxSkeletalMeshComponent*             BodyArmorMesh1P;                                   // 0x4E0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGbxSkeletalMeshComponent*             ArmsArmorMesh;                                     // 0x4E8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UOakCustomizationComponent*            CustomizationComponent;                            // 0x4F0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  PickupMeshTemplate;                                // 0x4F8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<class UFoleyAccessoryComponent*>      FoleyAccessories;                                  // 0x500(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class ABodyArmor* GetDefaultObj();

	void ShowPlayerUnderarmor(class AActor* EquippedPlayer);
	void OnUnequippedBy(class AOakCharacter* EquipInstigator);
	void OnEquippedBy(class AOakCharacter* EquipInstigator);
	void HidePlayerUnderarmor(class AActor* EquippedPlayer);
	void HandleEquippedCharacterDestroyed(class AActor* DestroyedActor);
};

// 0x10 (0x48 - 0x38)
// Class OakGame.BodyArmorFoleyAccessoryAspectData
class UBodyArmorFoleyAccessoryAspectData : public UInventoryAspectData
{
public:
	class UFoleyAccessoryComponent*              FoleyAccessory;                                    // 0x38(0x8)(Edit, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, InstancedReference, IsPlainOldData, NoDestructor, PersistentInstance, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  AttachmentSocket;                                  // 0x40(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBodyArmorFoleyAccessoryAspectData* GetDefaultObj();

};

// 0x90 (0x3F0 - 0x360)
// Class OakGame.OakInventoryBalanceStateComponent
class UOakInventoryBalanceStateComponent : public UInventoryBalanceStateComponent
{
public:
	uint8                                        Pad_2CC7[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  GeneratedStatsSection;                             // 0x368(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GeneratedStatPriority;                             // 0x370(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2CCB[0x14];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UUIStatData_Ability*>           CachedUIAbilityStats;                              // 0x388(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	bool                                         bIsInstanced;                                      // 0x398(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2CCC[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UInventoryAbilityAspectData*>   AbilityAspects;                                    // 0x3A0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	TArray<class UWeaponBonusAspectData*>        BonusAspectList;                                   // 0x3B0(0x10)(Edit, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPrivate)
	TArray<class UInventoryMeshAttachmentAspectData*> AttachmentAspects;                                 // 0x3C0(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2CD3[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UInventoryStaticMeshAttachmentAspectData*> StaticMeshAttachmentAspects;                       // 0x3D8(0x10)(ZeroConstructor, Transient, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2CD5[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UOakInventoryBalanceStateComponent* GetDefaultObj();

	void HandleActorDestroyed(class AActor* Actor);
};

// 0x38 (0x428 - 0x3F0)
// Class OakGame.BodyArmorInventoryBalanceStateComponent
class UBodyArmorInventoryBalanceStateComponent : public UOakInventoryBalanceStateComponent
{
public:
	class UBodyArmorPickupMeshAspectData*        PickupMeshAspectData;                              // 0x3F0(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBodyArmorMaterialModAspectData*       MaterialModAspectData;                             // 0x3F8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UBodyArmorFoleyAccessoryAspectData*> FoleyAspectList;                                   // 0x400(0x10)(Edit, ZeroConstructor, Transient, EditConst, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_2CDB[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBodyArmorInventoryBalanceStateComponent* GetDefaultObj();

};

// 0x28 (0x60 - 0x38)
// Class OakGame.BodyArmorMaterialModAspectData
class UBodyArmorMaterialModAspectData : public UInventoryAspectData
{
public:
	TArray<struct FWeightedFloatRange>           QualityRanges;                                     // 0x38(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class UDataTable*                            ParameterSetDataTable;                             // 0x48(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class FName>                          ParameterSetRowNames;                              // 0x50(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBodyArmorMaterialModAspectData* GetDefaultObj();

	void EnumerateDataTableRowNames(class UDataTable* DataTable, TArray<class FName>* OutRowNames);
};

// 0x38 (0x70 - 0x38)
// Class OakGame.BodyArmorNamingStrategyData
class UBodyArmorNamingStrategyData : public UInventoryNamingStrategyData
{
public:
	class UDataTable*                            SuffixCombinationDataTable;                        // 0x38(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FBodyArmorNamingData>          PrefixNames;                                       // 0x40(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FBodyArmorNamingData>          TitleNames;                                        // 0x50(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<struct FBodyArmorNamingData>          SuffixNames;                                       // 0x60(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBodyArmorNamingStrategyData* GetDefaultObj();

	void ForceExtractCombinationNamingData();
};

// 0x8 (0x40 - 0x38)
// Class OakGame.BodyArmorPickupMeshAspectData
class UBodyArmorPickupMeshAspectData : public UInventoryAspectData
{
public:
	class UStaticMesh*                           PickupMesh;                                        // 0x38(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBodyArmorPickupMeshAspectData* GetDefaultObj();

};

// 0x10 (0x48 - 0x38)
// Class OakGame.BodyArmorUnderarmorAspectData
class UBodyArmorUnderarmorAspectData : public UInventoryAspectData
{
public:
	TArray<class FName>                          GestaltPartsToHide;                                // 0x38(0x10)(Edit, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBodyArmorUnderarmorAspectData* GetDefaultObj();

	void EnumerateGestaltMeshPartNames(TArray<class FName>* OutPartNameList);
};

// 0xC0 (0xE8 - 0x28)
// Class OakGame.DungeonBonusObjective
class UDungeonBonusObjective : public UObject
{
public:
	UMulticastDelegateProperty_                  OnBonusObjectiveCompleted;                         // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnBonusObjectiveCompletedSuccess;                  // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	UMulticastDelegateProperty_                  OnBonusObjectiveCompletedFail;                     // 0x48(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	enum class EBonusObjectiveType               BonusObjectiveType;                                // 0x58(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2D81[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AOakGameMode*                          OakGameMode;                                       // 0x60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PointsPercentageToGiveToMainObjective;             // 0x68(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBonusObjectiveState              BonusObjectiveState;                               // 0x6C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2D8A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          ObjectiveTimerHandle;                              // 0x70(0x8)(NoDestructor, NativeAccessSpecifierPublic)
	class AEndlessdungeon*                       Endlessdungeon;                                    // 0x78(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCombatEncounter*                      CurrentEncounter;                                  // 0x80(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UEndlessDungeonGlobalsData*            EndlessDungeonGlobals;                             // 0x88(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_2D93[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ObjectiveTitle;                                    // 0xA0(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  ObjectiveCompletedTitle;                           // 0xB8(0x18)(Edit, Protected, NativeAccessSpecifierProtected)
	class FText                                  ObjectiveFailedTitle;                              // 0xD0(0x18)(Edit, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UDungeonBonusObjective* GetDefaultObj();

	void OnRoomCompleted();
	void OnBonusObjectiveStarted();
	void AddTimeToMission(float SecondsToAdd);
};

// 0x8 (0xF0 - 0xE8)
// Class OakGame.BonusObjective_Activate
class UBonusObjective_Activate : public UDungeonBonusObjective
{
public:
	uint8                                        Pad_2DD4[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBonusObjective_Activate* GetDefaultObj();

	void OnSwitchStateChanged(enum class EPuzzleState SwitchPuzzleState);
};

// 0x18 (0x100 - 0xE8)
// Class OakGame.BonusObjective_Defend
class UBonusObjective_Defend : public UDungeonBonusObjective
{
public:
	TArray<class AActor*>                        DefendSpawners;                                    // 0xE8(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	int32                                        NbDefendObjectiveSpawners;                         // 0xF8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2DFF[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBonusObjective_Defend* GetDefaultObj();

	void OnDefendObjectiveDied(class ASpawner* Spawner);
};

// 0x18 (0x100 - 0xE8)
// Class OakGame.BonusObjective_Destroy
class UBonusObjective_Destroy : public UDungeonBonusObjective
{
public:
	TArray<class AActor*>                        SpawnersDestroy;                                   // 0xE8(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	int32                                        NbSpawnersDestroy;                                 // 0xF8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2E2E[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBonusObjective_Destroy* GetDefaultObj();

	void OnAllDied(class ASpawner* Spawner);
};

// 0x38 (0x120 - 0xE8)
// Class OakGame.BonusObjective_Fusion
class UBonusObjective_Fusion : public UDungeonBonusObjective
{
public:
	float                                        ObjectiveTime;                                     // 0xE8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SpawnOrbEveryXEnemiesKilled;                       // 0xEC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                    OrbToSpawn;                                        // 0xF0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PercentageOfEnemyToDropAnOrb;                      // 0xF8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2EB7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AActor*>                        EnemySpawners;                                     // 0x100(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	int32                                        EnemyDeadCount;                                    // 0x110(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2EC7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AIO_CollectMasterOrb*                  CollectMasterOrb;                                  // 0x118(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBonusObjective_Fusion* GetDefaultObj();

	void OnTimeExpired();
	void OnOrbDepleted();
	void OnEnemyKilled(class AOakCharacter* EnemyKilled);
	void OnCollectMasterOrbSpawned(class ASpawner* Spawner, class AActor* Actor);
};

// 0x88 (0x170 - 0xE8)
// Class OakGame.BonusObjective_KillConfirmed
class UBonusObjective_KillConfirmed : public UDungeonBonusObjective
{
public:
	float                                        KillPercentageNeeded;                              // 0xE8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeAllowedAfterMelee;                             // 0xEC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        EnemySpawners;                                     // 0xF0(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class AOakCharacter_Player*>          OakCharacters;                                     // 0x100(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2F3C[0x60];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBonusObjective_KillConfirmed* GetDefaultObj();

	void OnPlayerCausedMeleeDamage(class AActor* DamageInstigator, float Damage, class UGbxDamageType* DamageType, class UDamageSource* DamageSource, class AActor* DamagedActor, const struct FCausedDamageDetails& Details);
	void OnPlayerCausedDeath(class UDamageComponent* Damaged, struct FCausedDeathDetails& Details);
};

// 0x70 (0x158 - 0xE8)
// Class OakGame.BonusObjective_SacredGround
class UBonusObjective_SacredGround : public UDungeonBonusObjective
{
public:
	float                                        KillPercentageNeeded;                              // 0xE8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FA5[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USpawnerStyle_Den*                     SpawnerStyleDen;                                   // 0xF0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        EnemySpawners;                                     // 0xF8(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class AActor*>                        SacredGroundSpawners;                              // 0x108(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class AIO_SacredGround*>              SacredGrounds;                                     // 0x118(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class AOakCharacter_Player*>          OakCharacters;                                     // 0x128(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	int32                                        NbSpawners;                                        // 0x138(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        TotalActorsKilled;                                 // 0x13C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        NbActorsToKill;                                    // 0x140(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        NbActorsKilled;                                    // 0x144(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2FB7[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBonusObjective_SacredGround* GetDefaultObj();

	void OnSacredGroundSpawned(class ASpawner* Spawner, class AActor* Actor);
	void OnPlayerCausedDeath(class UDamageComponent* Damaged, struct FCausedDeathDetails& Details);
};

// 0x20 (0x108 - 0xE8)
// Class OakGame.BonusObjective_TimeTrial
class UBonusObjective_TimeTrial : public UDungeonBonusObjective
{
public:
	float                                        ObjectiveTime;                                     // 0xE8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2FFC[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AActor*>                        Spawners;                                          // 0xF0(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	int32                                        NbSpawners;                                        // 0x100(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_2FFF[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBonusObjective_TimeTrial* GetDefaultObj();

	void ValidateEverythingIsDead();
	void OnTimeTrialTimeExpired();
	void OnAllDied(class ASpawner* Spawner);
};

// 0xB8 (0x640 - 0x588)
// Class OakGame.BoundaryTurret
class ABoundaryTurret : public AInteractiveObject
{
public:
	int32                                        StartingDistance;                                  // 0x588(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        WarningZoneDistance;                               // 0x58C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        WarningZoneWidth;                                  // 0x590(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ZoneHeight;                                        // 0x594(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        KillExtent;                                        // 0x598(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ZoneVerticalOffset;                                // 0x59C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShowDebugZones;                                   // 0x5A0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3115[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFeedbackData*                         WarningFeedback;                                   // 0x5A8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWwiseEvent*                           WarningStartAudioEvent;                            // 0x5B0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWwiseEvent*                           WarningStopAudioEvent;                             // 0x5B8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UWwiseEvent*                           KillAudioEvent;                                    // 0x5C0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                         WarningTriggerComponent;                           // 0x5C8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBoxComponent*                         KillTriggerComponent;                              // 0x5D0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USkeletalMeshComponent*                TurretMeshComponent;                               // 0x5D8(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AOakCharacter_Player*>          AllTrackedTargets;                                 // 0x5E0(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	TArray<class AOakVehicle*>                   OverlappedVehicles;                                // 0x5F0(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	class AOakCharacter_Player*                  PriorityTrackedTarget;                             // 0x600(0x8)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  WarningTriggerName;                                // 0x608(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  KillTriggerName;                                   // 0x610(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  TurretMeshName;                                    // 0x618(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  FXSwitchName;                                      // 0x620(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  LaserSwitchName;                                   // 0x628(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  FXStateName;                                       // 0x630(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  LaserStateName;                                    // 0x638(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class ABoundaryTurret* GetDefaultObj();

	void WarningTrigger_OnEndOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void WarningTrigger_OnBeginOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	void PlayKillEffects(struct FVector& TargetLocation);
	void NetMulticast_PlayKillEffects(struct FVector& TargetLocation);
	void KillTrigger_OnEndOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex);
	void KillTrigger_OnBeginOverlap(class UPrimitiveComponent* OverlappedComp, class AActor* Other, class UPrimitiveComponent* OtherComp, int32 OtherBodyIndex, bool bFromSweep, struct FHitResult& SweepResult);
	float GetWarningIntensity(class AActor* WarningActor);
	class AOakCharacter_Player* GetTrackedTarget();
};

// 0x28 (0x560 - 0x538)
// Class OakGame.BoundaryTurretAnimInstance
class UBoundaryTurretAnimInstance : public UGbxAnimInstance
{
public:
	class ABoundaryTurret*                       OwnerTurret;                                       // 0x538(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  PivotSocketName;                                   // 0x540(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRotator                              BarrelRotation;                                    // 0x548(0xC)(BlueprintVisible, BlueprintReadOnly, Transient, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                        RotationSpeed;                                     // 0x554(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bInvertTurret;                                     // 0x558(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3157[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBoundaryTurretAnimInstance* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class OakGame.BTService_FireWeapon
class UBTService_FireWeapon : public UBTService
{
public:

	static class UClass* StaticClass();
	static class UBTService_FireWeapon* GetDefaultObj();

};

// 0x60 (0xD0 - 0x70)
// Class OakGame.BTService_TriggerDialog
class UBTService_TriggerDialog : public UBTService
{
public:
	class UDialogEvent*                          DialogEvent;                                       // 0x70(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGbxTriggerProperty                   RefreshParamsProperty;                             // 0x78(0x1)(Edit, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_317A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class UDialogParameter*, struct FGbxParam> ParameterValues;                                   // 0x80(0x50)(Edit, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTService_TriggerDialog* GetDefaultObj();

	void RefreshParams();
};

// 0x18 (0x4A8 - 0x490)
// Class OakGame.BulletNotificationVolume
class ABulletNotificationVolume : public AVolume
{
public:
	uint8                                        Pad_3188[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	UMulticastDelegateProperty_                  OnBulletThrough;                                   // 0x498(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ABulletNotificationVolume* GetDefaultObj();

};

// 0x38 (0x68 - 0x30)
// Class OakGame.CameraBehavior_AdjustForFocusObject
class UCameraBehavior_AdjustForFocusObject : public UCameraBehavior
{
public:
	float                                        CamReturnTime;                                     // 0x30(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CamMovementThreshold;                              // 0x34(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CamMovementSpeed_Fast;                             // 0x38(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CamMovementSpeed_Slow;                             // 0x3C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UFocusableComponent*                   LastFocusObject;                                   // 0x40(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_319C[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraBehavior_AdjustForFocusObject* GetDefaultObj();

};

// 0x1E8 (0x218 - 0x30)
// Class OakGame.CameraBehavior_AIO
class UCameraBehavior_AIO : public UCameraBehavior
{
public:
	struct FVector                               FirstPersonComponentTranslationOffset;             // 0x30(0xC)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_31A5[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AAdvancedInteractiveObject*            CurrentAIO;                                        // 0x40(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AAdvancedInteractiveObjectProxy*       CurrentProxy;                                      // 0x48(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAIO_CameraData*                       CameraData;                                        // 0x50(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_31A9[0x1C0];                                   // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraBehavior_AIO* GetDefaultObj();

};

// 0x28 (0x58 - 0x30)
// Class OakGame.CameraBehavior_AutoFollow2DMovement
class UCameraBehavior_AutoFollow2DMovement : public UCameraBehavior
{
public:
	float                                        RotationRate;                                      // 0x30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FavorCameraForwardFraction;                        // 0x34(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bFollowPitch;                                      // 0x38(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bFollowYaw;                                        // 0x39(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bFollowRoll;                                       // 0x3A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_31B8[0x1D];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraBehavior_AutoFollow2DMovement* GetDefaultObj();

};

// 0x18 (0x48 - 0x30)
// Class OakGame.CameraBehavior_AutoFollowVehicleRotation
class UCameraBehavior_AutoFollowVehicleRotation : public UCameraBehavior
{
public:
	float                                        RotationRate;                                      // 0x30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        EaseInSpeed;                                       // 0x34(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bFollowInAir : 1;                                  // Mask: 0x1, PropSize: 0x10x38(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        bFollowWhileBoosting : 1;                          // Mask: 0x2, PropSize: 0x10x38(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        BitPad_E6 : 6;                                     // Fixing Bit-Field Size  [ Dumper-7 ]
	uint8                                        Pad_31C7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinVehicleSpeed;                                   // 0x3C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        InputDelay;                                        // 0x40(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_31CB[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraBehavior_AutoFollowVehicleRotation* GetDefaultObj();

};

// 0x148 (0x1F0 - 0xA8)
// Class OakGame.CameraBehavior_ExitLadder
class UCameraBehavior_ExitLadder : public UCameraBehavior_InitialRotation
{
public:
	struct FLadderBehaviorGoalParams             ExitTopParams;                                     // 0xA8(0x68)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FLadderBehaviorGoalParams             ExitBottomParams;                                  // 0x110(0x68)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FLadderBehaviorGoalParams             ExitJumpParams;                                    // 0x178(0x68)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_31DD[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraBehavior_ExitLadder* GetDefaultObj();

};

// 0x1280 (0x12B0 - 0x30)
// Class OakGame.CameraBehavior_FocusDOF
class UCameraBehavior_FocusDOF : public UCameraBehavior
{
public:
	struct FPostProcessSettings                  PostProcessSettings;                               // 0x30(0x600)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                        BlendInTime;                                       // 0x630(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BlendOutTime;                                      // 0x634(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWorldFocus;                                       // 0x638(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDynamicFocus;                                     // 0x639(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31F6[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        TraceDistance;                                     // 0x63C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FocusSpeed;                                        // 0x640(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DistanceBasedNearTransitionRegionScale;            // 0x644(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DistanceBasedFarTransitionRegionScale;             // 0x648(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bForegroundFocus;                                  // 0x64C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_31FC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ForegroundFocusDistance;                           // 0x650(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ForegroundFocusNearRegionPct;                      // 0x654(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ZoomedForegroundNearRegion;                        // 0x658(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BlurVignetteSharpness;                             // 0x65C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StartBlurVignetteSize;                             // 0x660(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ColorVignetteSharpness;                            // 0x664(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StartColorVignetteSize;                            // 0x668(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LongitudinalMotionScale;                           // 0x66C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LateralMotionScale;                                // 0x670(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnableZoomTransition;                             // 0x674(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_320F[0xB];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPostProcessSettings                  BlendOutPPSettings;                                // 0x680(0x600)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_3212[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPostProcessSettings                  AppliedPPSettings;                                 // 0xCA0(0x600)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_3214[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInstanceDynamic*              ZoomMaterialInst;                                  // 0x12A8(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UCameraBehavior_FocusDOF* GetDefaultObj();

	void ApplyPostProcess(class UCameraState* State, float DeltaTime, float BlendWeight, struct FPostProcessSettings& PPSettings);
};

// 0x140 (0x1E8 - 0xA8)
// Class OakGame.CameraBehavior_Ladder
class UCameraBehavior_Ladder : public UCameraBehavior_InitialRotation
{
public:
	struct FLadderBehaviorGoalParams             EnterBottomParams;                                 // 0xA8(0x68)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FLadderBehaviorGoalParams             EnterTopParams;                                    // 0x110(0x68)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FLadderBehaviorGoalParams             SlidingParams;                                     // 0x178(0x68)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_3239[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraBehavior_Ladder* GetDefaultObj();

};

// 0x100 (0x1A8 - 0xA8)
// Class OakGame.CameraBehavior_LimitPitchBySlope
class UCameraBehavior_LimitPitchBySlope : public UCameraBehavior_InitialRotation
{
public:
	struct FRuntimeFloatCurve                    SlopeToMaxPitchCurve;                              // 0xA8(0x78)(Edit, NativeAccessSpecifierPublic)
	struct FRuntimeFloatCurve                    SlopeToMinPitchCurve;                              // 0x120(0x78)(Edit, NativeAccessSpecifierPublic)
	float                                        PitchLimitEasingSpeed;                             // 0x198(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3246[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraBehavior_LimitPitchBySlope* GetDefaultObj();

};

// 0xD00 (0xD30 - 0x30)
// Class OakGame.CameraBehavior_MainMenu
class UCameraBehavior_MainMenu : public UCameraBehavior
{
public:
	class UMenuMapCameraData*                    CameraData;                                        // 0x30(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AMenuMapMenuFlow*                      MenuFlow;                                          // 0x38(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_324B[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ACameraActor*                          CurrentViewTarget;                                 // 0x48(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_324C[0xCE0];                                   // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraBehavior_MainMenu* GetDefaultObj();

};

// 0x0 (0x78 - 0x78)
// Class OakGame.CameraBehavior_MeleeFOV
class UCameraBehavior_MeleeFOV : public UCameraBehavior_BlendToFOV
{
public:

	static class UClass* StaticClass();
	static class UCameraBehavior_MeleeFOV* GetDefaultObj();

};

// 0x20 (0xC0 - 0xA0)
// Class OakGame.CameraBehavior_MeleeLock
class UCameraBehavior_MeleeLock : public UCameraBehavior_Look
{
public:
	class AActor*                                LockedTarget;                                      // 0xA0(0x8)(Edit, ZeroConstructor, DisableEditOnTemplate, Transient, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        MaxLockDistance;                                   // 0xA8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxHorizontalLockAngle;                            // 0xAC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxVerticalLockAngle;                              // 0xB0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LockBreakDistance;                                 // 0xB4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LockSpeed;                                         // 0xB8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_325A[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraBehavior_MeleeLock* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class OakGame.CameraBehavior_OverworldAudioListener
class UCameraBehavior_OverworldAudioListener : public UCameraBehavior
{
public:

	static class UClass* StaticClass();
	static class UCameraBehavior_OverworldAudioListener* GetDefaultObj();

};

// 0x18 (0x48 - 0x30)
// Class OakGame.CameraBehavior_PitchFOV
class UCameraBehavior_PitchFOV : public UCameraBehavior
{
public:
	class UCurveFloat*                           PitchFOVCurve;                                     // 0x30(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                           PitchFOVScaleCurve;                                // 0x38(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinPitch;                                          // 0x40(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxPitch;                                          // 0x44(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCameraBehavior_PitchFOV* GetDefaultObj();

};

// 0x28 (0x58 - 0x30)
// Class OakGame.CameraBehavior_RaidSpectator
class UCameraBehavior_RaidSpectator : public UCameraBehavior
{
public:
	float                                        HorizontalOffset;                                  // 0x30(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        VerticalOffset;                                    // 0x34(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxRotateSpeed;                                    // 0x38(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxZoom;                                           // 0x3C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MaxZoomSpeed;                                      // 0x40(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CameraPitchMin;                                    // 0x44(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CameraPitchMax;                                    // 0x48(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3271[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraBehavior_RaidSpectator* GetDefaultObj();

};

// 0xC40 (0xC70 - 0x30)
// Class OakGame.CameraBehavior_ScriptedDOF
class UCameraBehavior_ScriptedDOF : public UCameraBehavior
{
public:
	float                                        BlendOutTime;                                      // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3278[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPostProcessSettings                  BlendOutPPSettings;                                // 0x40(0x600)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_327B[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPostProcessSettings                  AppliedPPSettings;                                 // 0x650(0x600)(Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_327C[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraBehavior_ScriptedDOF* GetDefaultObj();

};

// 0x8 (0x38 - 0x30)
// Class OakGame.CameraBehavior_SnapLookToTarget
class UCameraBehavior_SnapLookToTarget : public UCameraBehavior
{
public:
	uint8                                        Pad_3283[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraBehavior_SnapLookToTarget* GetDefaultObj();

};

// 0x10 (0x40 - 0x30)
// Class OakGame.CameraBehavior_SprintFOV
class UCameraBehavior_SprintFOV : public UCameraBehavior
{
public:
	float                                        CurrentDelay;                                      // 0x30(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        BlendPct;                                          // 0x34(0x4)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bTransitioningToSprintFoV;                         // 0x38(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_328A[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraBehavior_SprintFOV* GetDefaultObj();

};

// 0x48 (0x78 - 0x30)
// Class OakGame.CameraBehavior_Sway
class UCameraBehavior_Sway : public UCameraBehavior
{
public:
	struct FVector                               LocationWaveformScale;                             // 0x30(0xC)(Edit, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3293[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVectorWaveform>               LocationWaveforms;                                 // 0x40(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                               RotationWaveformScale;                             // 0x50(0xC)(Edit, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3296[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVectorWaveform>               RotationWaveforms;                                 // 0x60(0x10)(Edit, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_3297[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraBehavior_Sway* GetDefaultObj();

};

// 0x280 (0x2B0 - 0x30)
// Class OakGame.CameraBehavior_VehicleBoost
class UCameraBehavior_VehicleBoost : public UCameraBehavior
{
public:
	float                                        FOVScale;                                          // 0x30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               RelativeLocationOffset;                            // 0x34(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bBlendWithSpeed;                                   // 0x40(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_329E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BlendInSpeed;                                      // 0x44(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        BlendOutSpeed;                                     // 0x48(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseBoostFOVAnimation;                             // 0x4C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32A1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BoostAnimationDuration;                            // 0x50(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32A2[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRuntimeFloatCurve                    BoostFOVAnimation;                                 // 0x58(0x78)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	float                                        BoostAnimationFOV;                                 // 0xD0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32A5[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRuntimeFloatCurve                    BoostTranslationAnimation;                         // 0xD8(0x78)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                         bAllowBoostFOVAnimationToStop;                     // 0x150(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bSeparatePowerSlideAndNormalBoost;                 // 0x151(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32A8[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PowerSlideBoostAnimationDuration;                  // 0x154(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRuntimeFloatCurve                    PowerSlideBoostFOVAnimation;                       // 0x158(0x78)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FRuntimeFloatCurve                    PowerSlideBoostTranslationAnimation;               // 0x1D0(0x78)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	bool                                         bAllowPowerSlideBoostFOVAnimationToStop;           // 0x248(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32AA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVehicleOverrideData>          OverrideByParts;                                   // 0x250(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_32AB[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraBehavior_VehicleBoost* GetDefaultObj();

};

// 0x20 (0x50 - 0x30)
// Class OakGame.CameraBehavior_VehicleCollision
class UCameraBehavior_VehicleCollision : public UCameraBehavior
{
public:
	struct FVector                               LocalOriginRayCast;                                // 0x30(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DodgeRadius;                                       // 0x3C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinimalRadius;                                     // 0x40(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MovementDampingSpeed;                              // 0x44(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_32B2[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraBehavior_VehicleCollision* GetDefaultObj();

};

// 0x0 (0x38 - 0x38)
// Class OakGame.CameraBehavior_VehicleFOV
class UCameraBehavior_VehicleFOV : public UCameraBehavior_FOV
{
public:

	static class UClass* StaticClass();
	static class UCameraBehavior_VehicleFOV* GetDefaultObj();

};

// 0xA00 (0xA30 - 0x30)
// Class OakGame.CameraBehavior_VehicleLook
class UCameraBehavior_VehicleLook : public UCameraBehavior
{
public:
	bool                                         bFollowGroundNormal;                               // 0x30(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32B9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               GroundDetectionOrigin;                             // 0x34(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               GroundDetectionPoint0;                             // 0x40(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               GroundDetectionPoint1;                             // 0x4C(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               GroundDetectionPoint2;                             // 0x58(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        BankingTolerance;                                  // 0x64(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRuntimeFloatCurve                    BankingDampingBySpeed;                             // 0x68(0x78)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FVector                               BaseLookAtPosition;                                // 0xE0(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               LookAtOffsetInTheAir;                              // 0xEC(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LookAtOffsetInTheAirDamping;                       // 0xF8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LookAtOffsetInTheGroundDamping;                    // 0xFC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bUseCameraFollowVehicleBody;                       // 0x100(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32C0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRuntimeFloatCurve                    CameraFollowBodyPitchRotationBySpeed;              // 0x108(0x78)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FRuntimeFloatCurve                    CameraFollowBodyRollRotationBySpeed;               // 0x180(0x78)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	float                                        CameraBodyFollowDelay;                             // 0x1F8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        BaseForwardOffset;                                 // 0x1FC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        BaseFOV;                                           // 0x200(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DefaultPitch;                                      // 0x204(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PitchMin;                                          // 0x208(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PitchMax;                                          // 0x20C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CameraOffsetDamping;                               // 0x210(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        FreeAimMinTime;                                    // 0x214(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCameraKeyOffset                      FreeLookOffset;                                    // 0x218(0x2C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bKeepCameraOffsetsInFreeLook;                      // 0x244(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32C4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRuntimeFloatCurve                    ForwardOffsetByPitchAngle;                         // 0x248(0x78)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FRuntimeFloatCurve                    UpOffsetByPitchAngle;                              // 0x2C0(0x78)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TArray<struct FCameraPitchOffset>            PitchKeysByYawAngle;                               // 0x338(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	float                                        ClampToRotateOnly;                                 // 0x348(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bEnableAutoLookInDrivingCamera;                    // 0x34C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32C8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRuntimeFloatCurve                    MinVelocityByTurnRateForAutoLook;                  // 0x350(0x78)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	float                                        AutoLookPitchDamping;                              // 0x3C8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        AutoResetDamping;                                  // 0x3CC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRuntimeFloatCurve                    AutoLookYawFixBySpeed;                             // 0x3D0(0x78)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	float                                        LatteralOffsetDampingFactor;                       // 0x448(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ForwardOffsetDampingFactor;                        // 0x44C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowAutoLookInReverse;                           // 0x450(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32CF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        KeepLookAtRatio;                                   // 0x454(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        KeepLookAtSpeedTreshold;                           // 0x458(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32D2[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  BodySocketToFollow;                                // 0x460(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCameraKeyOffset                      StationaryOffset;                                  // 0x468(0x2C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_32D3[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRuntimeFloatCurve                    ForwardInterpolationRatio;                         // 0x498(0x78)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	float                                        ForwardMaxSpeed;                                   // 0x510(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCameraKeyOffset                      ForwardOffset;                                     // 0x514(0x2C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FRuntimeFloatCurve                    ReverseInterpolationRatio;                         // 0x540(0x78)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	float                                        ReverseMaxSpeed;                                   // 0x5B8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCameraKeyOffset                      ReverseOffset;                                     // 0x5BC(0x2C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bApplyTurnSettingsInReverse;                       // 0x5E8(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32D9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRuntimeFloatCurve                    TurnInterpolationRatio;                            // 0x5F0(0x78)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	float                                        TurnMaxSpeed;                                      // 0x668(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCameraKeyOffset                      TurnOffset;                                        // 0x66C(0x2C)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FVector                               LocalOriginRayCast;                                // 0x698(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DodgeRadius;                                       // 0x6A4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MinimalRadius;                                     // 0x6A8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        MovementDampingSpeed;                              // 0x6AC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCameraIntroBlend                     DefaultIntro;                                      // 0x6B0(0x98)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<enum class EIntroType, struct FCameraIntroBlend> IntroByType;                                       // 0x748(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FVehicleOverrideData>          OverrideByParts;                                   // 0x798(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_32DE[0x288];                                   // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraBehavior_VehicleLook* GetDefaultObj();

};

// 0x1B0 (0x1E0 - 0x30)
// Class OakGame.CameraBehavior_VehicleTransitionOut
class UCameraBehavior_VehicleTransitionOut : public UCameraBehavior
{
public:
	float                                        RotateSpeed;                                       // 0x30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        LookAtFactor;                                      // 0x34(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PitchMin;                                          // 0x38(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PitchMax;                                          // 0x3C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FRuntimeFloatCurve                    RotationCurve;                                     // 0x40(0x78)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	struct FRuntimeFloatCurve                    LocationCurve;                                     // 0xB8(0x78)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FName                                  LookAtSocket;                                      // 0x130(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FVehicleOverrideData>          OverrideByParts;                                   // 0x138(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	float                                        NoAnimationDuration;                               // 0x148(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32E6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UGbxActionComponent*                   ActionComp;                                        // 0x150(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_32E7[0x88];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraBehavior_VehicleTransitionOut* GetDefaultObj();

};

// 0x8 (0x38 - 0x30)
// Class OakGame.CameraBehavior_ViewWeaponFOV
class UCameraBehavior_ViewWeaponFOV : public UCameraBehavior
{
public:
	float                                        SplitScreenScale;                                  // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_32EC[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCameraBehavior_ViewWeaponFOV* GetDefaultObj();

};

// 0x10 (0x80 - 0x70)
// Class OakGame.CameraBehavior_ViewWeaponOffset
class UCameraBehavior_ViewWeaponOffset : public UCameraBehavior_OffsetViewModel
{
public:
	bool                                         bSetFOV;                                           // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_32F3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SplitScreenFOVScale;                               // 0x74(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        VerticalSplitScreenFOVScale;                       // 0x78(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        QuadSplitScreenFOVScale;                           // 0x7C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCameraBehavior_ViewWeaponOffset* GetDefaultObj();

};

// 0x0 (0xA0 - 0xA0)
// Class OakGame.CameraBehavior_WeaponLook
class UCameraBehavior_WeaponLook : public UCameraBehavior_Look
{
public:

	static class UClass* StaticClass();
	static class UCameraBehavior_WeaponLook* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class OakGame.CameraBehavior_WeaponRecoil
class UCameraBehavior_WeaponRecoil : public UCameraBehavior
{
public:

	static class UClass* StaticClass();
	static class UCameraBehavior_WeaponRecoil* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class OakGame.CameraBehavior_WeaponSway
class UCameraBehavior_WeaponSway : public UCameraBehavior
{
public:

	static class UClass* StaticClass();
	static class UCameraBehavior_WeaponSway* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class OakGame.CameraBehavior_WeaponZoomFOV
class UCameraBehavior_WeaponZoomFOV : public UCameraBehavior
{
public:

	static class UClass* StaticClass();
	static class UCameraBehavior_WeaponZoomFOV* GetDefaultObj();

};

// 0x10 (0x450 - 0x440)
// Class OakGame.CARConsoleAnimInstance
class UCARConsoleAnimInstance : public UAnimInstance
{
public:
	float                                        NearRadiusOfPlayer;                                // 0x440(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECARStatus                        LastStatus;                                        // 0x444(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECARStatus                        Status;                                            // 0x445(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsLocked;                                         // 0x446(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsUnfolding;                                      // 0x447(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsActive;                                         // 0x448(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsInactive;                                       // 0x449(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_330D[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCARConsoleAnimInstance* GetDefaultObj();

};

// 0x1E0 (0x6A0 - 0x4C0)
// Class OakGame.Carnivora
class ACarnivora : public APawn
{
public:
	class ACarnivoraTrackBuilder*                TrackBuilder;                                      // 0x4C0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LineTracesToExecutePerFrame;                       // 0x4C8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LookAheadDirectionPrediction;                      // 0x4CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WheelMaxAngle;                                     // 0x4D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AngleMultiplierWheel;                              // 0x4D4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DirectionPredictionWheelAngle;                     // 0x4D8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DesiredHeightAboveGround;                          // 0x4DC(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DesiredAdditionalRoll;                             // 0x4E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DesiredAdditionalPitch;                            // 0x4E4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDrawDebugPlaneTilt;                               // 0x4E8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3340[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                PartLocation;                                      // 0x4F0(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        DefaultSocketToGroundDistanceTireTrack;            // 0x500(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefaultSocketToGroundDistanceFrontWheel;           // 0x504(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                  SMFrame;                                           // 0x508(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGbxSkeletalMeshComponent*             SKTireTrack;                                       // 0x510(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACarnivoraTread*                       LeftTread;                                         // 0x518(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACarnivoraTread*                       RightTread;                                        // 0x520(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  FrontRight_SocketNameDistToGround;                 // 0x528(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  FrontLeft_SocketNameDistToGround;                  // 0x530(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  BackRight_SocketNameDistToGround;                  // 0x538(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  BackLeft_SocketNameDistToGround;                   // 0x540(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LeftWheelDotRatioCollision;                        // 0x548(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RightWheelDotRatioCollision;                       // 0x54C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FrontWheelDotRatioCollision;                       // 0x550(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bMustMoveToDoDamage;                               // 0x554(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDrawDebugCollisionTreadsAndWheels;                // 0x555(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDoDamageOnTreadAndWheelCollision;                 // 0x556(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_334E[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FCarnivoraFakeTurrets>         FakeCarnivoraTurrets;                              // 0x558(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                         bShootLightProjectileAtPlayers;                    // 0x568(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3355[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SquaredDistanceReplicationCorrectionTreshold;      // 0x56C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldUpdateCarnivoraTiltBasedOnGround;           // 0x570(0x1)(Net, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3357[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               InitialCarnivoraLocation;                          // 0x574(0xC)(Net, Transient, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3358[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FSplineTriggers>               SplineTriggers;                                    // 0x588(0x10)(Edit, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPrivate)
	int32                                        CurrentCarnivoraSplineId;                          // 0x598(0x4)(Edit, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_335D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USplineFollowerComponent*              SplineFollower;                                    // 0x5A0(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_335E[0xF8];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ACarnivora* GetDefaultObj();

	void StartCarnivoraMovement(int32 SplineTriggersId);
	void SetTrackBuilder(class ACarnivoraTrackBuilder* NewTrack, bool bReverse);
	void SetShouldUpdateTitlBasedOnGround(bool bShouldUpdate);
	void SetShouldUpdateTiltBasedOnGround(bool bShouldUpdate);
	void SetShouldShootAtPlayers(bool bShootAtPlayers);
	void SetCarnivoraTickEnabled(bool bEnabled);
	void OnRep_InitialcarnivoraLocation();
	void OnComponentHitCallback(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit);
	void NotifyTriggerTouched(class AActor* OtherActor, bool bIsPlayer);
};

// 0x6F0 (0xB30 - 0x440)
// Class OakGame.CarnivoraAnimInstance
class UCarnivoraAnimInstance : public UAnimInstance
{
public:
	uint8                                        Pad_336A[0x6E0];                                   // Fixing Size After Last Property  [ Dumper-7 ]
	class ACarnivora*                            CarnivoraOwner;                                    // 0xB20(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_336B[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCarnivoraAnimInstance* GetDefaultObj();

};

// 0x80 (0x4D8 - 0x458)
// Class OakGame.CarnivoraCannon
class ACarnivoraCannon : public AActor
{
public:
	class USkeletalMeshComponent*                CannonMeshComponent;                               // 0x458(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  ShellBoneName;                                     // 0x460(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMesh*                           Shell;                                             // 0x468(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UStaticMeshComponent*                  ShellComponent;                                    // 0x470(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                Cannon;                                            // 0x478(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class ACarnivora*                            Carnivora;                                         // 0x480(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineFollowerComponent*              SplineFollower;                                    // 0x488(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AimingAngle;                                       // 0x490(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_337F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AActor>                    ProjectileClass;                                   // 0x498(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class AActor>                    ShellClass;                                        // 0x4A0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumberOfProjectile;                                // 0x4A8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FrontStartingDistance;                             // 0x4AC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HorizontalDispersionAngle;                         // 0x4B0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        VerticalToHorizontalDispersionRatio;               // 0x4B4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ProjectileSpreadAngle;                             // 0x4B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ProjectileSpeed;                                   // 0x4BC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               ShellAngularVelocity;                              // 0x4C0(0xC)(Edit, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ShellLinearVelocity;                               // 0x4CC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TargetDistanceAheadOnSpline;                       // 0x4D0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_3389[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ACarnivoraCannon* GetDefaultObj();

	class AActor* GetCannon();
	void FireCannon();
};

// 0xC0 (0x7E0 - 0x720)
// Class OakGame.CarnivoraDamageZoneComponent
class UCarnivoraDamageZoneComponent : public UBoxComponent
{
public:
	class USceneComponent*                       OrgAttachParent;                                   // 0x720(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_33AD[0x38];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAttributeInitializationData          DamageFormula;                                     // 0x760(0x38)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	float                                        VehicleImpulseFactor;                              // 0x798(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        CharacterImpulseFactor;                            // 0x79C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DamageCooldownTime;                                // 0x7A0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FCarnivoraDamageZoneInfo              PlayerDamageInfo;                                  // 0x7A4(0xC)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FCarnivoraDamageZoneInfo              OtherDamageInfo;                                   // 0x7B0(0xC)(Edit, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_33B6[0x24];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCarnivoraDamageZoneComponent* GetDefaultObj();

	void OnActorComponentHit(class UPrimitiveComponent* HitComp, class AActor* Other, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& SweepResult);
};

// 0x70 (0x4C8 - 0x458)
// Class OakGame.CarnivoraTrackBuilder
class ACarnivoraTrackBuilder : public AActor
{
public:
	class USplineComponent*                      BuilderSpline;                                     // 0x458(0x8)(Edit, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineComponent*                      BodySpline;                                        // 0x460(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TreadHeightOffset;                                 // 0x468(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_33C4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USplineComponent*                      LeftTreadSpline;                                   // 0x470(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineComponent*                      RightTreadSpline;                                  // 0x478(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TreadSideOffset;                                   // 0x480(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TreadTraceRadius;                                  // 0x484(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BodyTraceRadius;                                   // 0x488(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TraceHeightOffset;                                 // 0x48C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TraceSpacing;                                      // 0x490(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_33C8[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class AActor>                 LandscapeToSnapTo;                                 // 0x498(0x28)(Edit, DisableEditOnTemplate, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_33CA[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ACarnivoraTrackBuilder* GetDefaultObj();

};

// 0x120 (0x578 - 0x458)
// Class OakGame.CarnivoraTread
class ACarnivoraTread : public AActor
{
public:
	float                                        MinAngle;                                          // 0x458(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxAngle;                                          // 0x45C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USplineComponent*                      TreadSpline;                                       // 0x460(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumberOfPlate;                                     // 0x468(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWheelState                           TreadState;                                        // 0x46C(0xC)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	class UStaticMesh*                           PlateMesh;                                         // 0x478(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMeshComponent*                TreadSKComponent;                                  // 0x480(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WheelRotationForward;                              // 0x488(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        WheelRotationBackward;                             // 0x48C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UInstancedStaticMeshComponent*         InstancedPlates;                                   // 0x490(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DotRatioCollision;                                 // 0x498(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        WheelSplineIndexKey[0x4];                          // 0x49C(0x10)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SuspensionWheelRadius;                             // 0x4AC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_33E2[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<float>                                SuspensionAngles;                                  // 0x4B8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_33E3[0xB0];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ACarnivoraTread* GetDefaultObj();

	void OnComponentHitCallback(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComp, const struct FVector& NormalImpulse, struct FHitResult& Hit);
};

// 0x0 (0x88 - 0x88)
// Class OakGame.GbxCondition_CanSecondaryUseDeployVehicle
class UGbxCondition_CanSecondaryUseDeployVehicle : public UGbxCondition
{
public:

	static class UClass* StaticClass();
	static class UGbxCondition_CanSecondaryUseDeployVehicle* GetDefaultObj();

};

// 0xD0 (0x750 - 0x680)
// Class OakGame.CatchARide
class ACatchARide : public AAdvancedInteractiveObject
{
public:
	UMulticastDelegateProperty_                  OnVehicleSpawned;                                  // 0x680(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<struct FColor>                        AllColors;                                         // 0x690(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	enum class ECARRestrictionType               RestrictionType;                                   // 0x6A0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_341C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ACatchARidePlatform*                   CatchARide_Platform1;                              // 0x6A8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class ACatchARidePlatform*                   CatchARide_Platform2;                              // 0x6B0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsDeploymentAllowed;                              // 0x6B8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsTeleportToDeployedAllowed;                      // 0x6B9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_3422[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               DeploymentLocationOffset;                          // 0x6BC(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FText                                  StationName;                                       // 0x6C8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                  CannotSpawnText;                                   // 0x6E0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                  CatchARideLockedText;                              // 0x6F8(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class FText                                  CatchARideDisabledText;                            // 0x710(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	class UGbxGFxMenu*                           AssociatedMenu;                                    // 0x728(0x8)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class AOakCharacter_Player*>          OverlappingPlayers;                                // 0x730(0x10)(ZeroConstructor, Transient, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_3429[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ACatchARide* GetDefaultObj();

	void SetDeployedNonInteractiveState(bool bForceDeployed);
	void OnVehicleDeployedFromMenu();
