#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x8 (0x8 - 0x0)
// Function PlayerAbility_Use.PlayerAbility_Use_C.StopGiveUpInner
struct UPlayerAbility_Use_C_StopGiveUpInner_Params
{
public:
	class UFightForYourLifeComponent*            CallFunc_GetFFYLComponent_Res;                     // 0x0(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function PlayerAbility_Use.PlayerAbility_Use_C.StartGiveUpInner
struct UPlayerAbility_Use_C_StartGiveUpInner_Params
{
public:
	class UFightForYourLifeComponent*            CallFunc_GetFFYLComponent_Res;                     // 0x0(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function PlayerAbility_Use.PlayerAbility_Use_C.GetFFYLComponent
struct UPlayerAbility_Use_C_GetFFYLComponent_Params
{
public:
	class UFightForYourLifeComponent*            Res;                                               // 0x0(0x8)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x11 (0x11 - 0x0)
// Function PlayerAbility_Use.PlayerAbility_Use_C.GetUseComponent
struct UPlayerAbility_Use_C_GetUseComponent_Params
{
public:
	class UUseComponent*                         Res;                                               // 0x0(0x8)(Parm, OutParm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUseComponent*                         CallFunc_GetComponentByClass_ReturnValue;          // 0x8(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue;                      // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x11 (0x11 - 0x0)
// Function PlayerAbility_Use.PlayerAbility_Use_C.StopUseInner
struct UPlayerAbility_Use_C_StopUseInner_Params
{
public:
	enum class EUsabilityType                    Type;                                              // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_20BB[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UUseComponent*                         CallFunc_GetUseComponent_Res;                      // 0x8(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue;                      // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x11 (0x11 - 0x0)
// Function PlayerAbility_Use.PlayerAbility_Use_C.StartUseInner
struct UPlayerAbility_Use_C_StartUseInner_Params
{
public:
	enum class EUsabilityType                    Type;                                              // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_20DB[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UUseComponent*                         CallFunc_GetUseComponent_Res;                      // 0x8(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue;                      // 0x10(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x8 (0x8 - 0x0)
// Function PlayerAbility_Use.PlayerAbility_Use_C.GbxInpActEvt_use_alt_K2Node_GbxInputActionEvent_Discrete_13
struct UPlayerAbility_Use_C_GbxInpActEvt_use_alt_K2Node_GbxInputActionEvent_Discrete_13_Params
{
public:
	class FName                                  Action;                                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function PlayerAbility_Use.PlayerAbility_Use_C.GbxInpActEvt_use_alt_K2Node_GbxInputActionEvent_Discrete_12
struct UPlayerAbility_Use_C_GbxInpActEvt_use_alt_K2Node_GbxInputActionEvent_Discrete_12_Params
{
public:
	class FName                                  Action;                                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function PlayerAbility_Use.PlayerAbility_Use_C.GbxInpActEvt_give_up_K2Node_GbxInputActionEvent_Discrete_11
struct UPlayerAbility_Use_C_GbxInpActEvt_give_up_K2Node_GbxInputActionEvent_Discrete_11_Params
{
public:
	class FName                                  Action;                                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function PlayerAbility_Use.PlayerAbility_Use_C.GbxInpActEvt_give_up_K2Node_GbxInputActionEvent_Discrete_10
struct UPlayerAbility_Use_C_GbxInpActEvt_give_up_K2Node_GbxInputActionEvent_Discrete_10_Params
{
public:
	class FName                                  Action;                                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function PlayerAbility_Use.PlayerAbility_Use_C.GbxInpActEvt_use_K2Node_GbxInputActionEvent_Discrete_9
struct UPlayerAbility_Use_C_GbxInpActEvt_use_K2Node_GbxInputActionEvent_Discrete_9_Params
{
public:
	class FName                                  Action;                                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function PlayerAbility_Use.PlayerAbility_Use_C.GbxInpActEvt_use_K2Node_GbxInputActionEvent_Discrete_8
struct UPlayerAbility_Use_C_GbxInpActEvt_use_K2Node_GbxInputActionEvent_Discrete_8_Params
{
public:
	class FName                                  Action;                                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function PlayerAbility_Use.PlayerAbility_Use_C.GbxInpActEvt_exit_seat_K2Node_GbxInputActionEvent_Discrete_7
struct UPlayerAbility_Use_C_GbxInpActEvt_exit_seat_K2Node_GbxInputActionEvent_Discrete_7_Params
{
public:
	class FName                                  Action;                                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x68 (0x68 - 0x0)
// Function PlayerAbility_Use.PlayerAbility_Use_C.ExecuteUbergraph_PlayerAbility_Use
struct UPlayerAbility_Use_C_ExecuteUbergraph_PlayerAbility_Use_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_21B0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  K2Node_GbxInputActionEvent_Discrete_Action4;       // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UPawnAttachSlotComponent*              CallFunc_FindPawnAttachSlotComponent_ReturnValue;  // 0x10(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  K2Node_GbxInputActionEvent_Discrete_Action3;       // 0x18(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_IsValid_ReturnValue;                      // 0x20(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_21B3[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  Temp_name_Variable;                                // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  K2Node_GbxInputActionEvent_Discrete_Action2;       // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  K2Node_GbxInputActionEvent_Discrete_Action1;       // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  Temp_name_Variable1;                               // 0x40(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  K2Node_GbxInputActionEvent_Discrete_Action;        // 0x48(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  Temp_name_Variable2;                               // 0x50(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  K2Node_GbxInputActionEvent_Discrete_Action5;       // 0x58(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  K2Node_GbxInputActionEvent_Discrete_Action6;       // 0x60(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


