#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x380 (0x820 - 0x4A0)
// BlueprintGeneratedClass SpellActor_Hydra_Base.SpellActor_Hydra_Base_C
class ASpellActor_Hydra_Base_C : public ABasicSpellActor
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x4A0(0x8)(Transient, DuplicateTransient)
	class UTargetableComponent*                  Targetable;                                        // 0x4A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxActionComponent*                   GbxAction;                                         // 0x4B0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGbxSkeletalMeshComponent*             MainHead;                                          // 0x4B8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UParticleSystemComponent*              AmbientFX;                                         // 0x4C0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UWwiseAudioComponent*                  WwiseAudio;                                        // 0x4C8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                        Timeline_0_Rotation_87A055544DD65597ADE6ECAF5CB85885; // 0x4D0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ETimelineDirection                Timeline_0__Direction_87A055544DD65597ADE6ECAF5CB85885; // 0x4D4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1752[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UTimelineComponent*                    Timeline_0;                                        // 0x4D8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        BurstCount;                                        // 0x4E0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1754[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                AttackAction;                                      // 0x4E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UOakManagedActorDefinition*            ManagedActor;                                      // 0x4F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                        HydraDamage;                                       // 0x4F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        HydraDamageRadius;                                 // 0x4FC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        HydraForce;                                        // 0x500(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        HydraStatusEffectDamage;                           // 0x504(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        HydraStatusEffectChance;                           // 0x508(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_175D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                HydraDamageType;                                   // 0x510(0x8)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AOakCharacter_Player*                  HydraOwningPlayer;                                 // 0x518(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AGrenadeMod*                           HydraOwningMod;                                    // 0x520(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                           Audio_SpitVox;                                     // 0x528(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                           Audio_HeadSlamWoosh;                               // 0x530(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                           Audio_HeadSlamImpact;                              // 0x538(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<enum class EOakElementalType, class UWwiseEvent*> Audio_HydraDespawn;                                // 0x540(0x50)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	TMap<enum class EOakElementalType, class UWwiseEvent*> Audio_HydraSpawn;                                  // 0x590(0x50)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	class UWwiseEvent*                           Audio_SpawnVox;                                    // 0x5E0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                           Audio_SpawnAnim;                                   // 0x5E8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                           Audio_DespawnVox;                                  // 0x5F0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                           Audio_DespawnAnim;                                 // 0x5F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                CurrentAttackTarget;                               // 0x600(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FEnvQueryParams                       FindAttackTargetEQS;                               // 0x608(0xB8)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	float                                        AttackSpeed;                                       // 0x6C0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1769[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                HydraProjectileData;                               // 0x6C8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        AccuracyBase;                                      // 0x6D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_176E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                HydraGBXDamageType;                                // 0x6D8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSpawnableSpellBasicData              HydraSpellData;                                    // 0x6E0(0x40)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	bool                                         PlayingDespawn;                                    // 0x720(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1773[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                HydraSpawnAction;                                  // 0x728(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                HydraDespawnAction;                                // 0x730(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                FidgetClass;                                       // 0x738(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FTimerHandle                          HydraLifetimeTimer;                                // 0x740(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)
	bool                                         ActivateNecromancerBuff;                           // 0x748(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                        Pad_1779[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UParticleSystemComponent*              NecromancerParticleSystem;                         // 0x750(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UWwiseEvent*                           Audio_SpitAmmo;                                    // 0x758(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        NoSpellOverride_Damage;                            // 0x760(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                        NoSpellOverride_Radius;                            // 0x764(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                        NoSpellOverride_Force;                             // 0x768(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                        NoSpellOverride_StatusDmg;                         // 0x76C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                        NoSpellOverride_StatusChance;                      // 0x770(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	float                                        NoSpellOverride_Duration;                          // 0x774(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                NoSpellOverride_DmgSource;                         // 0x778(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class UClass*                                NoSpellOverride_DmgType;                           // 0x780(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AOakCharacter_Player*                  NoSpellOverride_Instigator;                        // 0x788(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AActor*                                NoSpellOverride_Owner;                             // 0x790(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         bSpawnedFromSpell;                                 // 0x798(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1784[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ProjectilesPerShot;                                // 0x79C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        HydraDuration;                                     // 0x7A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_1789[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UBPEventHub_PlayerCharacter_C*         BPEventHub;                                        // 0x7A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<enum class EOakElementalType, class UWwiseEvent*> Audio_AmbientFX;                                   // 0x7B0(0x50)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance)
	struct FRotator                              FinalRotation;                                     // 0x800(0xC)(Edit, BlueprintVisible, Net, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                              NewOrigRotation;                                   // 0x80C(0xC)(Edit, BlueprintVisible, Net, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTimerHandle                          HydraSearchTimer;                                  // 0x818(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor)

	static class UClass* StaticClass();
	static class ASpellActor_Hydra_Base_C* GetDefaultObj();

	void DoHeadOftheSnakeBehavior(float DurationIncrease, float NewLifetime, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_K2_GetTimerRemainingTimeHandle_ReturnValue, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, float CallFunc_Add_FloatFloat_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, float CallFunc_FClamp_ReturnValue);
	void CacheHydraDamage();
	void OnRep_ActivateNecromancerBuff(bool CallFunc_IsValid_ReturnValue, bool CallFunc_IsValid_ReturnValue1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, class UParticleSystemComponent* CallFunc_SpawnEmitterAttached_ReturnValue);
	void GetHydraFireLocation(enum class EHydraHeads Head, struct FVector* Loc, struct FRotator* Rot, const struct FTransform& CallFunc_GetSocketTransform_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale);
	void CheckElementOverride(class AOakCharacter_Player* K2Node_DynamicCast_AsOak_Character_Player, bool K2Node_DynamicCast_bSuccess, class AActor* CallFunc_GetEquippedInventoryForSlot_ReturnValue, class UGbxAbilityManagerComponent* CallFunc_GetComponentByClass_ReturnValue, class UGbxAbility* CallFunc_FindAbility_ReturnValue, bool CallFunc_IsValid_ReturnValue, TScriptInterface<class IBPI_ClawArmor_C> K2Node_DynamicCast_AsBPI_Claw_Armor, bool K2Node_DynamicCast_bSuccess1, class UClass* CallFunc_GetClawArmorElement_Res);
	void HasValidTarget(bool* Res, bool CallFunc_IsValid_ReturnValue);
	void SetHydraLifetime(float CallFunc_GetSpellDuration_ReturnValue, bool CallFunc_IsValid_ReturnValue, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool CallFunc_IsValid_ReturnValue1);
	void SetHydraNameplate();
	void CacheHydraInfo(bool* Res, class AGrenadeMod* Temp_object_Variable, bool Temp_bool_Variable, bool Temp_bool_Variable1, bool Temp_bool_Variable2, bool Temp_bool_Variable3, bool Temp_bool_Variable4, bool Temp_bool_Variable5, bool Temp_bool_Variable6, bool Temp_bool_Variable7, class AGrenadeMod* K2Node_DynamicCast_AsGrenade_Mod, bool K2Node_DynamicCast_bSuccess, float CallFunc_Conv_IntToFloat_ReturnValue, bool Temp_bool_Variable8, class AGrenadeMod* K2Node_Select_Default, bool CallFunc_HasAuthority_ReturnValue, float CallFunc_GetValueOfAttribute_ReturnValue, class UClass* K2Node_ClassDynamicCast_AsGbx_Damage_Type, bool K2Node_ClassDynamicCast_bSuccess, float CallFunc_Add_FloatFloat_ReturnValue, int32 CallFunc_FTrunc_ReturnValue, class AGrenadeMod* K2Node_Select1_Default, class AOakCharacter_Player* K2Node_Select2_Default, bool CallFunc_NotEqual_ObjectObject_ReturnValue, class UClass* K2Node_Select3_Default, float K2Node_Select4_Default, float K2Node_Select5_Default, float K2Node_Select6_Default, float K2Node_Select7_Default, float K2Node_Select8_Default);
	void TrackActor(bool Enable, class APawn* CallFunc_GetInstigator_ReturnValue, class UGameInstance* CallFunc_GetGameInstance_ReturnValue, class UOakGameInstance* K2Node_DynamicCast_AsOak_Game_Instance, bool K2Node_DynamicCast_bSuccess);
	void UserConstructionScript();
	void Timeline_0__FinishedFunc();
	void Timeline_0__UpdateFunc();
	void HydraSpellActor_FireProjectile(enum class EHydraHeads Head);
	void HydraSpellActor_BeginAttacking();
	void HydraAttack();
	void TryFidget();
	void LookForHydraTarget();
	void CurrentTargetDied_HydraActor(class AActor* DamageReceiver, class AActor* DamageCauser);
	void StartHydraSearchTimer();
	void PlayerSkillsGraphBeginPlay();
	void PlayerSkillsGraphCleanup();
	void CE_Enchantment_CompDamage_Activate();
	void CE_Enchantment_CompDamage_Deactivate();
	void Necromancer_15_Buff_Activated();
	void Necromancer_15_Buff_Deactivated();
	void HydraExtendDuration(float DurationExtendPercentage);
	void ReceiveBeginPlay();
	void Audio_Play_Despawn();
	void Audio_Play_Spit(const struct FVector& HeadLocation);
	void Audio_Play_Spawn();
	void CustomEvent();
	void CustomEvent_1();
	void BeginCleanup();
	void PlayHydraDepsawn();
	void HydraSpellActor_FinishDespawn();
	void BeginDepsawnAction();
	void HydraSpellActor_Audio_SpawnAmmo();
	void ExecuteUbergraph_SpellActor_Hydra_Base(int32 EntryPoint, class UParticleSystem* Temp_object_Variable, class UParticleSystem* Temp_object_Variable1, TArray<struct FGbxActionRegister>& Temp_struct_Variable, bool Temp_bool_Variable, float Temp_float_Variable, bool Temp_bool_Variable1, class UClass* Temp_class_Variable, bool Temp_bool_Variable2, class UClass* Temp_class_Variable1, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, bool CallFunc_IsValid_ReturnValue, enum class EOakElementalType Temp_byte_Variable, class UParticleSystem* Temp_object_Variable2, class UParticleSystem* Temp_object_Variable3, class UParticleSystem* Temp_object_Variable4, class UParticleSystem* Temp_object_Variable5, class UParticleSystem* Temp_object_Variable6, class UParticleSystem* Temp_object_Variable7, TArray<struct FGbxActionRegister>& Temp_struct_Variable1, enum class EOakElementalType Temp_byte_Variable1, class UClass* Temp_class_Variable2, class UClass* Temp_class_Variable3, class UClass* Temp_class_Variable4, class UClass* Temp_class_Variable5, class UClass* Temp_class_Variable6, class UClass* Temp_class_Variable7, enum class EOakElementalType Temp_byte_Variable2, class UParticleSystem* Temp_object_Variable8, class UParticleSystem* Temp_object_Variable9, class UParticleSystem* Temp_object_Variable10, class UParticleSystem* Temp_object_Variable11, class UParticleSystem* Temp_object_Variable12, class UParticleSystem* Temp_object_Variable13, enum class EOakElementalType Temp_byte_Variable3, class UParticleSystem* Temp_object_Variable14, class UParticleSystem* Temp_object_Variable15, class UParticleSystem* Temp_object_Variable16, class UParticleSystem* Temp_object_Variable17, class UParticleSystem* Temp_object_Variable18, class UParticleSystem* Temp_object_Variable19, TArray<struct FGbxActionRegister>& Temp_struct_Variable2, TArray<struct FGbxActionRegister>& Temp_struct_Variable3, bool CallFunc_HasValidTarget_Res, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate1, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate2, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, enum class EHydraHeads K2Node_Event_Head, float CallFunc_Multiply_FloatFloat_ReturnValue, const struct FVector& CallFunc_GetHydraFireLocation_Loc, const struct FRotator& CallFunc_GetHydraFireLocation_Rot, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue1, bool CallFunc_HasValidTarget_Res1, TScriptInterface<class IBPI_PlayerEnemyInteractions_C> K2Node_DynamicCast_AsBPI_Player_Enemy_Interactions, bool K2Node_DynamicCast_bSuccess, TArray<struct FGbxActionRegister>& Temp_struct_Variable4, class FName CallFunc_GetCompanionTargetingSocket_Socket, class UGbxAction* CallFunc_K2Play_ReturnValue, class UParticleSystem* Temp_object_Variable20, class UParticleSystem* Temp_object_Variable21, const struct FVector& CallFunc_RandomUnitVector_ReturnValue, const struct FTransform& CallFunc_GetActorSocket_ReturnValue, const struct FVector& CallFunc_BreakTransform_Location, const struct FRotator& CallFunc_BreakTransform_Rotation, const struct FVector& CallFunc_BreakTransform_Scale, const struct FForceSelection& CallFunc_Conv_FloatToForceSelection_ReturnValue, enum class EOakElementalType CallFunc_GetClassElementalType_ReturnValue, bool CallFunc_RandomBoolWithWeight_ReturnValue, class UGbxAction* CallFunc_K2Play_ReturnValue1, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue1, const struct FVector& CallFunc_GetDirectionUnitVector_ReturnValue, class AActor* CallFunc_RunEnvQueryForBestActor_ResultActor, bool CallFunc_RunEnvQueryForBestActor_ReturnValue, const struct FRotator& CallFunc_MakeRotFromX_ReturnValue, float CallFunc_BreakRotator_Roll, float CallFunc_BreakRotator_Pitch, float CallFunc_BreakRotator_Yaw, const struct FRotator& CallFunc_MakeRotator_ReturnValue, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, float K2Node_Select_Default, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, bool CallFunc_IsValidClass_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, class UClass* K2Node_Select1_Default, class UClass* K2Node_Select2_Default, const struct FOakLightProjectileInitializationData& K2Node_MakeStruct_OakLightProjectileInitializationData, const struct FRotator& CallFunc_K2_GetActorRotation_ReturnValue, class AActor* K2Node_CustomEvent_DamageReceiver, class AActor* K2Node_CustomEvent_DamageCauser, const struct FRotator& CallFunc_RLerp_ReturnValue, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate3, const struct FHitResult& CallFunc_K2_SetActorRelativeRotation_SweepHitResult, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate4, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue2, class UOakDamageComponent* CallFunc_GetComponentByClass_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, bool Temp_bool_Has_Been_Initd_Variable, class AActor* CallFunc_GetOwner_ReturnValue1, class UOakPlayerAbilityManagerComponent* CallFunc_GetComponentByClass_ReturnValue1, class UParticleSystem* Temp_object_Variable22, class UBPEventHub_PlayerCharacter_C* K2Node_DynamicCast_AsBPEvent_Hub_Player_Character, bool K2Node_DynamicCast_bSuccess1, class UParticleSystem* Temp_object_Variable23, enum class EOakElementalType Temp_byte_Variable4, bool Temp_bool_Has_Been_Initd_Variable1, class UParticleSystem* K2Node_Select3_Default, class UParticleSystemComponent* CallFunc_SpawnEmitterAtLocation_ReturnValue, bool Temp_bool_IsClosed_Variable, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate5, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate6, float K2Node_CustomEvent_DurationExtendPercentage, UDelegateProperty_ K2Node_CreateDelegate_OutputDelegate7, class AActor* CallFunc_GetOwner_ReturnValue2, class AActor* CallFunc_GetOwner_ReturnValue3, class UOakPlayerAbilityManagerComponent* CallFunc_GetComponentByClass_ReturnValue2, class AActor* CallFunc_GetOwner_ReturnValue4, class UOakPlayerAbilityManagerComponent* CallFunc_GetComponentByClass_ReturnValue3, class UBPEventHub_PlayerCharacter_C* K2Node_DynamicCast_AsBPEvent_Hub_Player_Character1, bool K2Node_DynamicCast_bSuccess2, class UBPEventHub_PlayerCharacter_C* K2Node_DynamicCast_AsBPEvent_Hub_Player_Character2, bool K2Node_DynamicCast_bSuccess3, bool CallFunc_CacheHydraInfo_Res, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue2, enum class EOakElementalType CallFunc_GetClassElementalType_ReturnValue1, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, bool CallFunc_NotEqual_ByteByte_ReturnValue, const struct FVector& K2Node_CustomEvent_HeadLocation, const struct FWwisePlaybackInstance& CallFunc_PostEventAtLocation_ReturnValue, const struct FWwisePlaybackInstance& CallFunc_PostWwiseEvent_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, const struct FWwisePlaybackInstance& CallFunc_PostEventAtLocation_ReturnValue1, enum class EOakElementalType CallFunc_GetClassElementalType_ReturnValue2, class UWwiseEvent* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue1, const struct FWwisePlaybackInstance& CallFunc_PostEventAtLocation_ReturnValue2, enum class EOakElementalType CallFunc_GetClassElementalType_ReturnValue3, const struct FWwisePlaybackInstance& CallFunc_PostEventAtLocation_ReturnValue3, class UWwiseEvent* CallFunc_Map_Find_Value1, bool CallFunc_Map_Find_ReturnValue1, const struct FWwisePlaybackInstance& CallFunc_PostEventAtLocation_ReturnValue4, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue2, const struct FWwisePlaybackInstance& CallFunc_PostWwiseEvent_ReturnValue1, const struct FWwisePlaybackInstance& CallFunc_PostEventAtLocation_ReturnValue5, const struct FWwisePlaybackInstance& CallFunc_PostWwiseEvent_ReturnValue2, enum class EOakElementalType CallFunc_GetClassElementalType_ReturnValue4, class UClass* K2Node_Select4_Default, int32 Temp_int_Variable, class UGbxAction* CallFunc_K2Play_ReturnValue2, bool CallFunc_LessEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue3, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue1, enum class EOakElementalType CallFunc_GetClassElementalType_ReturnValue5, class UParticleSystem* K2Node_Select5_Default, enum class EOakElementalType CallFunc_GetClassElementalType_ReturnValue6, enum class EOakElementalType CallFunc_GetClassElementalType_ReturnValue7, class UParticleSystem* K2Node_Select6_Default, class UParticleSystem* K2Node_Select7_Default, class UGbxAction* CallFunc_K2Play_ReturnValue3, class UGbxAction* CallFunc_K2Play_ReturnValue4, bool Temp_bool_IsClosed_Variable1, const struct FWwisePlaybackInstance& CallFunc_PostAttachedEvent_ReturnValue, enum class EOakElementalType CallFunc_GetClassElementalType_ReturnValue8, class UWwiseEvent* CallFunc_Map_Find_Value2, bool CallFunc_Map_Find_ReturnValue2);
};

}


