#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x1F8 (0x1F8 - 0x0)
// UserDefinedStruct Struct_PauldronNamingStrategy_BonusStats.Struct_PauldronNamingStrategy_BonusStats
struct FStruct_PauldronNamingStrategy_BonusStats
{
public:
	class FText                                  Single_100_A8A6F06F4CFD8874143366BE4F96A360;       // 0x0(0x18)(Edit, BlueprintVisible)
	class FText                                  Damage_All_129_BBA24CE641F409D4044EE497C97E2EFD;   // 0x18(0x18)(Edit, BlueprintVisible)
	class FText                                  Companion_CritChance_76_BC00C9FD49DEC7D5A896CEB3A2E51B79; // 0x30(0x18)(Edit, BlueprintVisible)
	class FText                                  Companion_Damage_101_3A38B40D47A4C765979897BEAC94135E; // 0x48(0x18)(Edit, BlueprintVisible)
	class FText                                  Gun_ExtraProjectile_104_F7B776744C2934E3327585848202E8DA; // 0x60(0x18)(Edit, BlueprintVisible)
	class FText                                  Gun_FireRate_105_D46818AD4D17A8DFA23B25980C8A4079; // 0x78(0x18)(Edit, BlueprintVisible)
	class FText                                  Gun_CritChance_131_EB8D2C7642341970D5C917A22AACE5BB; // 0x90(0x18)(Edit, BlueprintVisible)
	class FText                                  Gun_Damage_107_8D519AC341D289D3B32D82A5166277BC;   // 0xA8(0x18)(Edit, BlueprintVisible)
	class FText                                  Health_Max_108_021393144A0B9DF6D8A414B47AF0D22F;   // 0xC0(0x18)(Edit, BlueprintVisible)
	class FText                                  Health_Regen_109_E8EC048446E0E83F2A6609B75409D897; // 0xD8(0x18)(Edit, BlueprintVisible)
	class FText                                  Melee_CritChance_110_99AC075640426E1E1749E29BAB3732AF; // 0xF0(0x18)(Edit, BlueprintVisible)
	class FText                                  Melee_Damage_111_610694CB4F3E775F0BEE6A8582ECE987; // 0x108(0x18)(Edit, BlueprintVisible)
	class FText                                  MoveSpeed_112_D0B6DA9F40B203182DEB038E755F0EB8;    // 0x120(0x18)(Edit, BlueprintVisible)
	class FText                                  Skill_Damage_113_68779DCE4062B02A8C5EB49D6460732C; // 0x138(0x18)(Edit, BlueprintVisible)
	class FText                                  Skill_CritChance_134_A4A73999499A153E0F2B2AB6E3A6D260; // 0x150(0x18)(Edit, BlueprintVisible)
	class FText                                  Spell_CritChance_96_5272033F4661C58BB1DF329DD4A382AD; // 0x168(0x18)(Edit, BlueprintVisible)
	class FText                                  Spell_Damage_114_8463E33D4C387C157BEACCAF09D21C77; // 0x180(0x18)(Edit, BlueprintVisible)
	class FText                                  SplashDamage_115_546C4384435BEB76A67D01A5FCBD1D51; // 0x198(0x18)(Edit, BlueprintVisible)
	class FText                                  Ward_Delay_122_34F0EDCA4AC147DBCB02FCBB2ACBF5C3;   // 0x1B0(0x18)(Edit, BlueprintVisible)
	class FText                                  Ward_Capacity_123_CBFABBDF4DDE1B4516EF87ADAB6C44D3; // 0x1C8(0x18)(Edit, BlueprintVisible)
	class FText                                  Ward_Regen_130_DA74CF4344245F68EA6C97A47F8EF67B;   // 0x1E0(0x18)(Edit, BlueprintVisible)
};

}


