#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x620 (0x620 - 0x0)
// UserDefinedStruct Struct_Amulet_Stats.Struct_Amulet_Stats
struct FStruct_Amulet_Stats
{
public:
	struct FAttributeInitializationData          ClassStat_69_0F19DB134F759C9090585E9963DB5249;     // 0x0(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Elemental_Damage_70_26AA7FE743E8E56475E38F882A2048B3; // 0x38(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_Gun_Handling_SwayDiscWidth_91_C4CF8727441A627D9A8F3DB3D570146F; // 0x70(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_Gun_Handling_SwayDiscHeight_92_3932712040C6D8A2E4D9D2B56C46FDC8; // 0xA8(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_Gun_Handling_SwayZoomAcc_93_F148CE884EB1C4852A314EBC6897D2A1; // 0xE0(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_Gun_Handling_SwayAcc_94_9D4DD9294949BDBAA0D027BF0289CB81; // 0x118(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_Gun_Handling_RecoilWidth_95_AF4184454A6CDB0594F3A1984EA1A4F3; // 0x150(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_Gun_Handling_RecoilHeight_96_4B791C7B459EA4524A086E8125610A45; // 0x188(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_Gun_MagazineSize_33_9D7F81424355DA79732281BEC06CEFA1; // 0x1C0(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_Gun_Reload_35_1EBC3A92406B5069E0EBE1B157C1B5E3; // 0x1F8(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_Gun_FireRate_53_BEC899694D332F0093D7A5A388D2C1FF; // 0x230(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_Luck_40_FB3A7A8048676FEE599FCC84CEB07B30;    // 0x268(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_SkillCooldown_44_6C976E82429864957DEAB99ABBC37386; // 0x2A0(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_AllDamage_54_FF42A71A47F8054B2A248982B2AA6EFA; // 0x2D8(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_ExtraProj_55_3120AE0242F00E5318B34C87E1E87552; // 0x310(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_StatusChance_Dark_102_9C2E54AC4191823976832FBE382928A8; // 0x348(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_StatusChance_Fire_104_AEBCC02C419A6FEE158923951E06E098; // 0x380(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_StatusChance_Lightning_105_3693AC5042F828D9FB4DBC98910DCCD6; // 0x3B8(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_StatusChance_Poison_116_3C30457D46E9FE1E3EC81D9BD61360D9; // 0x3F0(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_StatusDamage_Cryo_107_509E94AF41F3626156CC908A6F768FC0; // 0x428(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_StatusDamage_Dark_108_F753800F4C263D758F55A8A8471B3332; // 0x460(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_StatusDamage_Fire_111_5C79E5644B5738C0A71EE0B4C717BF35; // 0x498(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_StatusDamage_Lightning_114_A7BAF93244237D94E7E5FF93C340B8BF; // 0x4D0(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_StatusDamage_Poison_117_C775321B44460345258272A37146EAE0; // 0x508(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Minor_DarkMagicMaxLeech_62_9E24141046DDD7CF6BCBC89A604B40CA; // 0x540(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Unique_WardMax_65_D715A7D4422B3AB7A15B05BCBED7AF95; // 0x578(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Unique_GunDamage_68_BBC92DF445138E24C8AF13AC71747612; // 0x5B0(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          Unique_Bradluck_Elemental_73_7CB8FA32472FE0DEC0D471BF1F1107A1; // 0x5E8(0x38)(Edit, BlueprintVisible, NoDestructor)
};

}


