#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xF0 (0xF0 - 0x0)
// UserDefinedStruct Struct_SpellNamingStrategy.Struct_SpellNamingStrategy
struct FStruct_SpellNamingStrategy
{
public:
	class FText                                  Damage_34_BC00C9FD49DEC7D5A896CEB3A2E51B79;        // 0x0(0x18)(Edit, BlueprintVisible)
	class FText                                  Duration_75_3A38B40D47A4C765979897BEAC94135E;      // 0x18(0x18)(Edit, BlueprintVisible)
	class FText                                  Cooldown_55_F7B776744C2934E3327585848202E8DA;      // 0x30(0x18)(Edit, BlueprintVisible)
	class FText                                  CritChance_71_D46818AD4D17A8DFA23B25980C8A4079;    // 0x48(0x18)(Edit, BlueprintVisible)
	class FText                                  CritDamage_72_EB8D2C7642341970D5C917A22AACE5BB;    // 0x60(0x18)(Edit, BlueprintVisible)
	class FText                                  ExtraProjectiles_67_8D519AC341D289D3B32D82A5166277BC; // 0x78(0x18)(Edit, BlueprintVisible)
	class FText                                  ExtraSpellCharges_70_021393144A0B9DF6D8A414B47AF0D22F; // 0x90(0x18)(Edit, BlueprintVisible)
	class FText                                  Radius_62_E8EC048446E0E83F2A6609B75409D897;        // 0xA8(0x18)(Edit, BlueprintVisible)
	class FText                                  StatusChance_73_99AC075640426E1E1749E29BAB3732AF;  // 0xC0(0x18)(Edit, BlueprintVisible)
	class FText                                  StatusDamage_74_610694CB4F3E775F0BEE6A8582ECE987;  // 0xD8(0x18)(Edit, BlueprintVisible)
};

}


