#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x168 (0x168 - 0x0)
// UserDefinedStruct Struct_RingNamingStrategy.Struct_RingNamingStrategy
struct FStruct_RingNamingStrategy
{
public:
	class FText                                  Companion_CritChance_76_BC00C9FD49DEC7D5A896CEB3A2E51B79; // 0x0(0x18)(Edit, BlueprintVisible)
	class FText                                  Companion_Health_78_F7B776744C2934E3327585848202E8DA; // 0x18(0x18)(Edit, BlueprintVisible)
	class FText                                  Melee_CritChance_80_EB8D2C7642341970D5C917A22AACE5BB; // 0x30(0x18)(Edit, BlueprintVisible)
	class FText                                  Melee_CritDamage_81_8D519AC341D289D3B32D82A5166277BC; // 0x48(0x18)(Edit, BlueprintVisible)
	class FText                                  Skill_Cooldown_84_99AC075640426E1E1749E29BAB3732AF; // 0x60(0x18)(Edit, BlueprintVisible)
	class FText                                  Skill_Duration_85_610694CB4F3E775F0BEE6A8582ECE987; // 0x78(0x18)(Edit, BlueprintVisible)
	class FText                                  Spell_CritChance_96_5272033F4661C58BB1DF329DD4A382AD; // 0x90(0x18)(Edit, BlueprintVisible)
	class FText                                  Spell_CritDamage_97_8463E33D4C387C157BEACCAF09D21C77; // 0xA8(0x18)(Edit, BlueprintVisible)
	class FText                                  Spell_Radius_98_546C4384435BEB76A67D01A5FCBD1D51;  // 0xC0(0x18)(Edit, BlueprintVisible)
	class FText                                  GunType_CritDamage_133_374BDC644E7B0E9BEB8D33B936A62536; // 0xD8(0x18)(Edit, BlueprintVisible)
	class FText                                  GunType_MagSize_134_150FC0D549EF24E58247FD9EDFF9D432; // 0xF0(0x18)(Edit, BlueprintVisible)
	class FText                                  GunType_ReloadSpeed_135_B699E1F34CAACF49AFE659AB91277F11; // 0x108(0x18)(Edit, BlueprintVisible)
	class FText                                  DarkMagicLeech_142_51203E4D42FA7C158EC23EAC1167645B; // 0x120(0x18)(Edit, BlueprintVisible)
	class FText                                  Companion_CritDmg_143_639042CD43D3292A4CF39BBB113B48BD; // 0x138(0x18)(Edit, BlueprintVisible)
	class FText                                  Skill_CritChance_144_4C5B878242E0503CD8079D9B439898C9; // 0x150(0x18)(Edit, BlueprintVisible)
};

}


