#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x5C (0x5C - 0x0)
// UserDefinedStruct Struct_ShieldAugData.Struct_ShieldAugData
struct FStruct_ShieldAugData
{
public:
	float                                        Capacity_26_1F88EEE04E890908FB52AE9442E35CE3;      // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        RechargeRate_27_8A47A06C426C0A244C25068F9B363075;  // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        RechargeDelay_28_56D5148C458B7E0E4C3DEB8437889B8E; // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_16A3[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Primary_Comment_47_6EF197CB417AF4CF276F8F9E8AB1D4CB; // 0x10(0x18)(Edit, BlueprintVisible)
	float                                        Primary_1_56_207C26E1450330458D6C38B245C338C5;     // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Primary_2_57_B75F9DB543F7963A15ECCBAC5D036A8E;     // 0x2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Primary_3_58_12AFE8834560F575F1813591F715BCE1;     // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_16B4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Secondary_Comment_49_64E6ADA2465F74EBB8D333B9DFDC26FC; // 0x38(0x18)(Edit, BlueprintVisible)
	float                                        Secondary_1_62_F1E72F2542B441230290B388F4C494D1;   // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Secondary_2_63_5492A1134C687D18D386DAA6A8FF185E;   // 0x54(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Secondary_3_64_A3C5C0EC446950EEEEC7E9B3776271B7;   // 0x58(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


