#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xF0 (0xF0 - 0x0)
// UserDefinedStruct Struct_AmuletNamingStrategy.Struct_AmuletNamingStrategy
struct FStruct_AmuletNamingStrategy
{
public:
	class FText                                  StatusChance_128_B24F2CB14D933BBAA28AFBAD0A612ED4; // 0x0(0x18)(Edit, BlueprintVisible)
	class FText                                  StatusDamage_130_0C4DD5FE4458DCA0726F04B04F5017DA; // 0x18(0x18)(Edit, BlueprintVisible)
	class FText                                  Luck_132_F7B776744C2934E3327585848202E8DA;         // 0x30(0x18)(Edit, BlueprintVisible)
	class FText                                  Skill_Cooldown_134_D46818AD4D17A8DFA23B25980C8A4079; // 0x48(0x18)(Edit, BlueprintVisible)
	class FText                                  Handling_139_EB8D2C7642341970D5C917A22AACE5BB;     // 0x60(0x18)(Edit, BlueprintVisible)
	class FText                                  AllDamage_136_6DFC9AB14A01FC5609465ABA28070223;    // 0x78(0x18)(Edit, BlueprintVisible)
	class FText                                  ReloadTime_138_8D519AC341D289D3B32D82A5166277BC;   // 0x90(0x18)(Edit, BlueprintVisible)
	class FText                                  MagSize_140_46DA66E648A60FEC40ABB68C8AD473AB;      // 0xA8(0x18)(Edit, BlueprintVisible)
	class FText                                  ExtraProjectile_119_54FE8C9E423F3007274E53B261A60685; // 0xC0(0x18)(Edit, BlueprintVisible)
	class FText                                  FireRate_141_82C764ED46725DFD3A8685BE05DC7E9D;     // 0xD8(0x18)(Edit, BlueprintVisible)
};

}


