#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x90 (0x90 - 0x0)
// UserDefinedStruct Struct_Melee_InitData.Struct_Melee_InitData
struct FStruct_Melee_InitData
{
public:
	struct FAttributeInitializationData          Damage_20_7777AC4C4968F9E6395DCEB224C8C6D0;        // 0x0(0x38)(Edit, BlueprintVisible, NoDestructor)
	float                                        AttackSpeed_7_43B201264CB1B5FE4E1F92A7C71965D9;    // 0x38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LerpDistance_6_9CBE2E5045B2A126A280FDA1838B48C2;   // 0x3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        MaxDistanceOpener_23_7EFC38854F750C6710E0659DAF3C7167; // 0x40(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Radius_NoLerp_19_2FEF08114F360601010E60A44B339704; // 0x44(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CritChance_12_E754B4B7456C6D0CFD9364A003393FFC;    // 0x48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CritDamage_13_E0501DEF44684F90F215F2807B6851FC;    // 0x4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Elemental_StatusEffectChance_15_0AEDA0E645C5CC3A0041DBAA0A1E09ED; // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_15E[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAttributeInitializationData          Elemental_StatusEffectDamage_24_05285E324F668CBE6A3B579347601EFA; // 0x58(0x38)(Edit, BlueprintVisible, NoDestructor)
};

}


