#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x6C8 (0x6C8 - 0x0)
// UserDefinedStruct Struct_Pauldron_Stats.Struct_Pauldron_Stats
struct FStruct_Pauldron_Stats
{
public:
	struct FAttributeInitializationData          ClassStat_Barbarian_8_F1A975FB4B901B5A35953D9F8A084CAF; // 0x0(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          ClassStat_GunMage_12_EFA64A7A407CCADFDE5024AED3847BAB; // 0x38(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          ClassStat_Knight_14_9CEF9CD74544EA2A92F59A99D52CC2F5; // 0x70(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          ClassStat_Necromancer_16_F67FF811449D2C4DDBACD69D2998911E; // 0xA8(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          ClassStat_Ranger_18_54CD0CBF4880E4977000E1979C78466A; // 0xE0(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          ClassStat_Rogue_20_8F727EAC4EA26C6403D5EEA01C673DB1; // 0x118(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          ClassStat_Secondary_Barbarian_9_9220D5AB4D8936A342BA9ABB37810773; // 0x150(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          ClassStat_Secondary_GunMage_26_DF21EEEB42C7894A891AB3B9A26DDCB8; // 0x188(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          ClassStat_Secondary_Knight_27_129E9CDF4E975CC9BBF507B7B7452885; // 0x1C0(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          ClassStat_Secondary_Necromancer_28_484B47384EE5E0C34F655FB3D4544EF3; // 0x1F8(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          ClassStat_Secondary_Ranger_29_66E6BF1E4E5D81A5FE763AA109E8A0DB; // 0x230(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          ClassStat_Secondary_Rogue_30_E7734D814ADE836FE2A5198F7EFA98C3; // 0x268(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          PlayerStat_AllDamage_72_43A82978455AD0AAC11A0A9E8E29217B; // 0x2A0(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          PlayerStat_CompanionCritChance_10_2AE7B85E4960F05A813AA7B86D911697; // 0x2D8(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          PlayerStat_CompanionDamage_48_4DFFDDC1417D7B2B625690BC4780A10D; // 0x310(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          PlayerStat_FireRate_50_D09C8C3E4EC23B5AE13008815D205841; // 0x348(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          PlayerStat_GunCritChance_71_097B66024FF90F13BA59C98B6F1427DA; // 0x380(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          PlayerStat_GunDamage_52_B377E9C74B2FDA250296B293A12C735B; // 0x3B8(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          PlayerStat_HealthMax_53_EBF0DFE7496767DA50AD3DAAA013C60C; // 0x3F0(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          PlayerStat_HealthRegen_54_E881A3354F37FC112E2ADD9FD848B314; // 0x428(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          PlayerStat_MeleeCritChance_55_66EBDF2449A6E62253A3CAA8CE568862; // 0x460(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          PlayerStat_MeleeDamage_57_500B35C44C0DEC4BC8E491B1BC780579; // 0x498(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          PlayerStat_MoveSpeed_58_6BDA6DCC4F967202ECA3FE852444253B; // 0x4D0(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          PlayerStat_SkillDamage_59_10D7A31D4BC6DFAD158E408314DF8F3F; // 0x508(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          PlayerStat_SkillCritChance_77_98B8355F4D1355CB4AB026A302939679; // 0x540(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          PlayerStat_SpellCritChance_60_1761DDEF4EAB83A31B3D48BD32344F48; // 0x578(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          PlayerStat_SpellDamage_61_065AD9034F8881B5A459BBB982E2157C; // 0x5B0(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          PlayerStat_SplashDamage_62_88AE419B44F44919391AE289B8AD866E; // 0x5E8(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          PlayerStat_WardDelay_63_D2B6770744CF80DC1CDEE3AB014B1140; // 0x620(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          PlayerStat_WardMax_64_1396D3C448E2D6CCB6E1C4B54F92E766; // 0x658(0x38)(Edit, BlueprintVisible, NoDestructor)
	struct FAttributeInitializationData          PlayerStat_WardRegenRate_66_0A8156FC4F2AC35ACC63AC9232607D83; // 0x690(0x38)(Edit, BlueprintVisible, NoDestructor)
};

}


