#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0xC0 (0xC0 - 0x0)
// UserDefinedStruct Struct_PauldronNamingStrategy_Class.Struct_PauldronNamingStrategy_Class
struct FStruct_PauldronNamingStrategy_Class
{
public:
	class FText                                  Single_148_DF41649E47B88D12CE7B9C85A3A63561;       // 0x0(0x18)(Edit, BlueprintVisible)
	class FText                                  Barbarian_S_111_A8A6F06F4CFD8874143366BE4F96A360;  // 0x18(0x18)(Edit, BlueprintVisible)
	class FText                                  GunMage_S_112_BC00C9FD49DEC7D5A896CEB3A2E51B79;    // 0x30(0x18)(Edit, BlueprintVisible)
	class FText                                  Knight_S_113_3A38B40D47A4C765979897BEAC94135E;     // 0x48(0x18)(Edit, BlueprintVisible)
	class FText                                  Necromancer_S_114_F7B776744C2934E3327585848202E8DA; // 0x60(0x18)(Edit, BlueprintVisible)
	class FText                                  Ranger_S_115_D46818AD4D17A8DFA23B25980C8A4079;     // 0x78(0x18)(Edit, BlueprintVisible)
	class FText                                  Rogue_S_116_546C4384435BEB76A67D01A5FCBD1D51;      // 0x90(0x18)(Edit, BlueprintVisible)
	class FText                                  Shaman_S_151_96D0BE1E429B70FA856F9F9E513FDAE2;     // 0xA8(0x18)(Edit, BlueprintVisible)
};

}


