#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x9C (0x9C - 0x0)
// UserDefinedStruct Struct_Spell_Init_Stats.Struct_Spell_Init_Stats
struct FStruct_Spell_Init_Stats
{
public:
	struct FAttributeInitializationData          Damage_55_7777AC4C4968F9E6395DCEB224C8C6D0;        // 0x0(0x38)(Edit, BlueprintVisible, NoDestructor)
	float                                        BaseCooldown_44_43B201264CB1B5FE4E1F92A7C71965D9;  // 0x38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CritChance_31_638FF3C14ADAB7F159BE329B08298ECC;    // 0x3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CritDamage_68_C18926344BBD27A5147F678050464B99;    // 0x40(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        ElementalChance_40_080FCB7D48D1426B096E3EB6D4801126; // 0x44(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FAttributeInitializationData          ElementalDamage_56_4446F2344AD080540FB9CF9C2D115026; // 0x48(0x38)(Edit, BlueprintVisible, NoDestructor)
	float                                        NumProjectiles_47_DCBE369A476C0DB8810AE2B194563414; // 0x80(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        ExtraCharges_50_5A30DE1349BD7725006B94B2472BC48B;  // 0x84(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Radius_36_A6FF250A4DA6B0332EA504898436F488;        // 0x88(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Duration_59_70AD44A7482D1B8EF31FCA9E86342AFD;      // 0x8C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Force_53_A0B96A694F53B63E9D9D5299A1B965D7;         // 0x90(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        CastSpeed_62_9A24EE394700DF90922D5DB9E24CE618;     // 0x94(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        ProjectileSpeed_65_710E539843E5217FF1A87E9A7F62AFC0; // 0x98(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


