#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xBC (0x31C - 0x260)
// WidgetBlueprintGeneratedClass WBP_MapPOIHUD.WBP_MapPOIHUD_C
class UWBP_MapPOIHUD_C : public UUserWidget
{
public:
	class UImage*                                DIVIDERHIGHLIGHT;                                  // 0x260(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            FlavorText;                                        // 0x268(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Icon;                                              // 0x270(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          MirabilisData;                                     // 0x278(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            MirabilisLabel;                                    // 0x280(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        MirabilisList;                                     // 0x288(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScaleBox*                             PuzzleAwakenContainer;                             // 0x290(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            PuzzleProgress;                                    // 0x298(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            PUZZLETOBEAWAKENED;                                // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            QuestType;                                         // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               REQUIREMENTBOX;                                    // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            RequirementsLabel;                                 // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          RequirementsList;                                  // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            Subtitle;                                          // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            TITLE;                                             // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_AwakenedPuzzle_C*                 WBP_AwakenedPuzzle;                                // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BigMirabilisObtained_C*           WBP_BigMirabilisObtained;                          // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BigMirabilisObtained_C*           WBP_BigMirabilisObtained_111;                      // 0x2E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BigMirabilisUnobtained_C*         WBP_BigMirabilisUnobtained;                        // 0x2F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BigMirabilisUnobtained_C*         WBP_BigMirabilisUnobtained_1;                      // 0x2F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_BigMirabilisUnobtained_C*         WBP_BigMirabilisUnobtained_140;                    // 0x300(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LevelGateItem_C*                  WBP_LevelGateItem;                                 // 0x308(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_LevelGateItem_C*                  WBP_LevelGateItem_1;                               // 0x310(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	int32                                        ObtainedMirabilisCount;                            // 0x318(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UWBP_MapPOIHUD_C* GetDefaultObj();

	void DisplayMapPOI(const struct FLocationMarkerData& MarkerData, const TArray<struct FLevelRestrictionItem>& LevelRestrictionItems, const TArray<bool>& BlueOrbData, class UTexture2D* Temp_object_Variable, bool CallFunc_IsValid_ReturnValue, class ADungeon* K2Node_DynamicCast_AsDungeon, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_GetOwnedPuzzleCompletionData_TotalPuzzles, int32 CallFunc_GetOwnedPuzzleCompletionData_SolvedPuzzles, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, class ALevelRestrictionVolume* K2Node_DynamicCast_AsLevel_Restriction_Volume, bool K2Node_DynamicCast_bSuccess_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, bool CallFunc_TextIsEmpty_ReturnValue, bool CallFunc_IsSolved_ReturnValue, bool CallFunc_TextIsEmpty_ReturnValue_1, bool CallFunc_TextIsEmpty_ReturnValue_2, bool CallFunc_TextIsEmpty_ReturnValue_3, int32 CallFunc_GetOwnedPuzzleCompletionData_TotalPuzzles_1, int32 CallFunc_GetOwnedPuzzleCompletionData_SolvedPuzzles_1, bool CallFunc_TextIsEmpty_ReturnValue_4, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_3, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, bool CallFunc_IsValid_ReturnValue_1, class FText CallFunc_Format_ReturnValue_1, bool CallFunc_IsSolved_ReturnValue_1, TArray<bool>& CallFunc_GetBlueOrbCounts_ReturnValue, bool CallFunc_IsValidClass_ReturnValue, bool CallFunc_IsValidClass_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_TextIsEmpty_ReturnValue_5, bool Temp_bool_Variable, bool CallFunc_TextIsEmpty_ReturnValue_6, class FText Temp_text_Variable, bool Temp_bool_Variable_1, class FText K2Node_Select_Default, class UTexture2D* Temp_object_Variable_1, class UWBP_LevelGateItem_C* CallFunc_Create_ReturnValue, bool Temp_bool_Variable_2, class UTexture2D* K2Node_Select_Default_1, class FText K2Node_Select_Default_2, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool Temp_bool_Variable_3, bool CallFunc_Greater_IntInt_ReturnValue, class UTexture2D* K2Node_Select_Default_3, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Array_Length_ReturnValue_2, const struct FLevelRestrictionItem& CallFunc_Array_Get_Item, bool CallFunc_UpdateFromPack_IsSatisfied, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable_1, class FText Temp_text_Variable_1, bool CallFunc_Array_Get_Item_1, bool Temp_bool_Variable_4, class FText K2Node_Select_Default_4, class UClass* Temp_class_Variable, class UClass* Temp_class_Variable_1, bool Temp_bool_Variable_5, class FText Temp_text_Variable_2, class UClass* K2Node_Select_Default_5, class UUserWidget* CallFunc_Create_ReturnValue_1, class UPanelSlot* CallFunc_AddChild_ReturnValue, class FText Temp_text_Variable_3, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, class UVerticalBoxSlot* CallFunc_AddChildToVerticalBox_ReturnValue, class APawn* CallFunc_GetOwningPlayerPawn_ReturnValue, int32 Temp_int_Variable, class ASophiaCharacter* K2Node_DynamicCast_AsSophia_Character, bool K2Node_DynamicCast_bSuccess_2, TArray<struct FLevelRestrictionItem>& CallFunc_GetProgressFor_ReturnValue, bool Temp_bool_Variable_6, class FText K2Node_Select_Default_6, int32 CallFunc_Add_IntInt_ReturnValue_2);
};

}


