#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x80 (0x368 - 0x2E8)
// WidgetBlueprintGeneratedClass WBP_Journal.WBP_Journal_C
class UWBP_Journal_C : public UBaseWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x2E8(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalRadioSelect_C*                BonusAvailable;                                    // 0x2F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalRadioSelect_C*              CategoryRadioSelect;                               // 0x2F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       CategorySwitcher;                                  // 0x300(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalRadioSelect_C*                Completed;                                         // 0x308(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_StyledSophiaScrollBox_C*           CompletedScrollBox;                                // 0x310(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       CompletedWidgetSwitcher;                           // 0x318(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalRadioSelect_C*                InProgress;                                        // 0x320(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWBP_StyledButton_C*                   InProgressPinButton;                               // 0x328(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBP_StyledSophiaScrollBox_C*           InProgressScrollBox;                               // 0x330(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       InProgressWidgetSwitcher;                          // 0x338(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Space;                                             // 0x340(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                               Spacer;                                            // 0x348(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                               Spacer_447;                                        // 0x350(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class AFirstPersonCharacter_C*               PlayerRef;                                         // 0x358(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	class UWBP_QuestJournalCard_C*               SelectedInProgressJournalCard;                     // 0x360(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UWBP_Journal_C* GetDefaultObj();

	void PopulateWithQuest(class UVerticalRadioSelect_C* ToFill, class FName QuestID, class UWorldQuest* QuestRef, class APlayerController* CallFunc_GetPlayerController_ReturnValue, TArray<class FText>& CallFunc_GetObjectivesData_QuestObjectives, TArray<bool>& CallFunc_GetObjectivesData_CompleteStatuses, class UWBP_QuestJournalCard_C* CallFunc_Create_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue, class FText CallFunc_TextToUpper_ReturnValue, const struct FSettingOption& K2Node_MakeStruct_SettingOption, class UPanelSlot* CallFunc_AddRadioButton_outPanelSlot, const class FString& CallFunc_Conv_TextToString_ReturnValue_1, int32 CallFunc_GetMinLevelToUnlock_ReturnValue, int32 CallFunc_GetBlueOrbReward_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, class FText CallFunc_Conv_IntToText_ReturnValue, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, int32 CallFunc_GetXPReward_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue_1, int32 CallFunc_GetGoldReward_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue_2, class FText CallFunc_GetFlavorText_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void GetObjectivesData(class UQuest* InQuest, TArray<class FText>* QuestObjectives, TArray<bool>* CompleteStatuses, const TArray<bool>& _CompleteStatuses, const TArray<class FText>& _QuestObjectives, const TArray<class FText>& ObjectiveMessages, TArray<class UQuestObjective*>& CallFunc_GetObjectives_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Array_Length_ReturnValue, class UQuestObjective* CallFunc_Array_Get_Item, bool CallFunc_IsComplete_ReturnValue, bool CallFunc_ShouldDisplay_ReturnValue, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1);
	enum class ESlateVisibility GetVisibility_1(bool Temp_bool_Variable, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, bool CallFunc_IsScrollBarCollapsed_ReturnValue, enum class ESlateVisibility K2Node_Select_Default);
	enum class ESlateVisibility GetVisibility_0(bool Temp_bool_Variable, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, bool CallFunc_IsScrollBarCollapsed_ReturnValue, enum class ESlateVisibility K2Node_Select_Default);
	void RemoveChild(class UScrollBox* QuestScrollBox, int32 CallFunc_GetChildrenCount_ReturnValue, int32 Temp_int_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class UWidget* CallFunc_GetChildAt_ReturnValue, class UWBP_QuestJournalCard_C* K2Node_DynamicCast_AsWBP_Quest_Journal_Card, bool K2Node_DynamicCast_bSuccess, bool CallFunc_LessEqual_IntInt_ReturnValue);
	void PopulateWithQuests(class UVerticalRadioSelect_C* ToFill, TSet<class FName> NewParam, TArray<class FName>& CallFunc_Set_ToArray_Result, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, class FName CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class UWBP_QuestJournalCard_C* CallFunc_Create_ReturnValue, class UWorldQuest* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, class FText CallFunc_GetFlavorText_ReturnValue, TArray<class FText>& CallFunc_GetObjectivesData_QuestObjectives, TArray<bool>& CallFunc_GetObjectivesData_CompleteStatuses, const class FString& CallFunc_Conv_TextToString_ReturnValue, class FText CallFunc_TextToUpper_ReturnValue, const struct FSettingOption& K2Node_MakeStruct_SettingOption, class UPanelSlot* CallFunc_AddRadioButton_outPanelSlot, const class FString& CallFunc_Conv_TextToString_ReturnValue_1, int32 CallFunc_GetMinLevelToUnlock_ReturnValue, int32 CallFunc_GetBlueOrbReward_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, class FText CallFunc_Conv_IntToText_ReturnValue, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, int32 CallFunc_GetXPReward_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue_1, int32 CallFunc_GetGoldReward_ReturnValue, class FText CallFunc_Conv_IntToText_ReturnValue_2);
	void Construct();
	void BndEvt__WBP_Journal_HorizontalRadioSelect_K2Node_ComponentBoundEvent_0_RadioSelectedSignature__DelegateSignature(const class FString& Value);
	void BndEvt__WBP_Journal_InProgress_K2Node_ComponentBoundEvent_1_RadioSelectedSignature__DelegateSignature(const class FString& Value);
	void BndEvt__WBP_Journal_InProgressPinButton_K2Node_ComponentBoundEvent_2_Pressed__DelegateSignature();
	void ExecuteUbergraph_WBP_Journal(int32 EntryPoint, class FText Temp_text_Variable, enum class EQuestState Temp_byte_Variable, class UVerticalRadioSelect_C* Temp_object_Variable, class UVerticalRadioSelect_C* Temp_object_Variable_1, int32 Temp_int_Array_Index_Variable, class FText Temp_text_Variable_1, bool Temp_bool_Variable, class ACharacter* CallFunc_GetPlayerCharacter_ReturnValue, const class FString& K2Node_ComponentBoundEvent_Value_1, class AFirstPersonCharacter_C* K2Node_DynamicCast_AsFirst_Person_Character, bool K2Node_DynamicCast_bSuccess, int32 CallFunc_Conv_StringToInt_ReturnValue, const class FString& K2Node_ComponentBoundEvent_Value, bool CallFunc_IsValid_ReturnValue, class UWBP_QuestJournalCard_C* K2Node_DynamicCast_AsWBP_Quest_Journal_Card, bool K2Node_DynamicCast_bSuccess_1, class FText K2Node_Select_Default, bool CallFunc_IsValid_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class FName>& CallFunc_Map_Keys_Keys, class FName CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UWorldQuest* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, enum class EQuestState CallFunc_GetQuestState_ReturnValue, class UVerticalRadioSelect_C* K2Node_Select_Default_1, bool CallFunc_HasAnyChildren_ReturnValue, int32 CallFunc_Conv_BoolToInt_ReturnValue, bool CallFunc_HasAnyChildren_ReturnValue_1, int32 CallFunc_Conv_BoolToInt_ReturnValue_1);
};

}


