#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x30 (0x30 - 0x0)
// Function WBP_FreeCamMenu.WBP_FreeCamMenu_C.GetText_7
struct UWBP_FreeCamMenu_C_GetText_7_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue;             // 0x18(0x18)(None)
};

// 0x30 (0x30 - 0x0)
// Function WBP_FreeCamMenu.WBP_FreeCamMenu_C.GetText_6
struct UWBP_FreeCamMenu_C_GetText_6_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue;             // 0x18(0x18)(None)
};

// 0x30 (0x30 - 0x0)
// Function WBP_FreeCamMenu.WBP_FreeCamMenu_C.GetText_5
struct UWBP_FreeCamMenu_C_GetText_5_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue;             // 0x18(0x18)(None)
};

// 0x30 (0x30 - 0x0)
// Function WBP_FreeCamMenu.WBP_FreeCamMenu_C.GetText_4
struct UWBP_FreeCamMenu_C_GetText_4_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue;             // 0x18(0x18)(None)
};

// 0x38 (0x38 - 0x0)
// Function WBP_FreeCamMenu.WBP_FreeCamMenu_C.GetText_3
struct UWBP_FreeCamMenu_C_GetText_3_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm)
	float                                        CallFunc_Divide_FloatFloat_ReturnValue;            // 0x18(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_C35[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue;             // 0x20(0x18)(None)
};

// 0x30 (0x30 - 0x0)
// Function WBP_FreeCamMenu.WBP_FreeCamMenu_C.GetText_2
struct UWBP_FreeCamMenu_C_GetText_2_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue;             // 0x18(0x18)(None)
};

// 0x30 (0x30 - 0x0)
// Function WBP_FreeCamMenu.WBP_FreeCamMenu_C.GetText_1
struct UWBP_FreeCamMenu_C_GetText_1_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue;             // 0x18(0x18)(None)
};

// 0x30 (0x30 - 0x0)
// Function WBP_FreeCamMenu.WBP_FreeCamMenu_C.GetText_0
struct UWBP_FreeCamMenu_C_GetText_0_Params
{
public:
	class FText                                  ReturnValue;                                       // 0x0(0x18)(Parm, OutParm, ReturnParm)
	class FText                                  CallFunc_Conv_FloatToText_ReturnValue;             // 0x18(0x18)(None)
};

}
}


