#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x2B8 (0x790 - 0x4D8)
// BlueprintGeneratedClass BP_AISpawner.BP_AISpawner_C
class ABP_AISpawner_C : public AAISpawner
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x4D8(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class USceneComponent*                       DefaultSceneRoot;                                  // 0x4E0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	int32                                        AmountToSpawn;                                     // 0x4E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_6539[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AActor*>                        SpawnedActors;                                     // 0x4F0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	float                                        SpawnRadius;                                       // 0x500(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        MaxPlayerDistance;                                 // 0x504(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                               SpawnLocation;                                     // 0x508(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         SpawningActivated;                                 // 0x514(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_653E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class APlayerController*, struct FActorArrayStruct> TetheredAIMap;                                     // 0x518(0x50)(Edit, BlueprintVisible, DisableEditOnTemplate, DisableEditOnInstance)
	class APlayerController*                     NextTetherTarget;                                  // 0x568(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FActorArrayStruct                     CurrentTethers;                                    // 0x570(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	struct FTimerHandle                          TetherCleanupTimer;                                // 0x580(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                         RandomStream;                                      // 0x588(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NoDestructor)
	TArray<class UObject*>                       StoredGameplayTextures;                            // 0x590(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<TSoftObjectPtr<class UGameplayTexture>> HeatmapTextures;                                   // 0x5A0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class AIcarusNPCGOAPCharacter*               SpawnedNPC;                                        // 0x5B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        DefaultSpawnDensity;                               // 0x5B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsRunningSpawnEQS;                                 // 0x5BC(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_654F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AIcarusNPCGOAPCharacter*>       SpawnedChildren;                                   // 0x5C0(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate)
	class ABP_WeatherController_C*               WeatherControllerRef;                              // 0x5D0(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FBiomesRowHandle, int32>         BiomePerceptionModifiers;                          // 0x5D8(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FAISpawnConfigData                    Spawn_Config;                                      // 0x628(0xA0)(Edit, BlueprintVisible, DisableEditOnInstance)
	enum class EBPLogVerbosity                   LoggingVerbosity;                                  // 0x6C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_655B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaximumAILevel;                                    // 0x6CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        MinimumAILevel;                                    // 0x6D0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                        GeneratedLevel;                                    // 0x6D4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TMap<struct FVector, float>                  RecentSpawnBlockerLocations;                       // 0x6D8(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         ShouldBlockSpawningNearRecentDeath;                // 0x728(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6561[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          SpawnBlockerUpdateTimer;                           // 0x730(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                        SpawnBlockerRadius;                                // 0x738(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        SpawnBlockerDuration;                              // 0x73C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DebugSpawnBlockers;                                // 0x740(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6564[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FSpawnBlocker>                 ActiveSpawnBlockers;                               // 0x748(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FName                                  ProtectedActorKey;                                 // 0x758(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsSpawningActor;                                   // 0x760(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6567[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAISetupRowHandle                     CurrentAISpawnType;                                // 0x764(0x18)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	bool                                         SpawnMultipleAI;                                   // 0x77C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6569[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AIcarusNPCGOAPCharacter*>       SpawnedFollowers;                                  // 0x780(0x10)(Edit, BlueprintVisible, DisableEditOnTemplate)

	static class UClass* StaticClass();
	static class ABP_AISpawner_C* GetDefaultObj();

