#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x7D2 (0xC52 - 0x480)
// BlueprintGeneratedClass BP_ActionableBehaviour_DeployableBase.BP_ActionableBehaviour_DeployableBase_C
class UBP_ActionableBehaviour_DeployableBase_C : public UBP_ActionableBehaviour_SimplePlaceWithVariants_C
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x480(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class ABP_DeployablePreview_C*               PreviewActor;                                      // 0x488(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CurrentPlacementValid;                             // 0x490(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_69EF[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDeployableData                       DeployableData;                                    // 0x498(0xA8)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UDeployableComponent*                  DeployableComponent;                               // 0x540(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_69F1[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            CachedPreviewTransform;                            // 0x550(0x30)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	float                                        UpwardsFacingLimit;                                // 0x580(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsRotating;                                        // 0x584(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_69F4[0xB];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            PlayerPlacementTransform;                          // 0x590(0x30)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FRotator                              DesiredLocalDeployableRotation;                    // 0x5C0(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_69F6[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            DeployablePlacementTransform;                      // 0x5D0(0x30)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AActor*                                FoundationActor;                                   // 0x600(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         SnapRotationToBuildingGrid;                        // 0x608(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_69FA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AngleSnapAmount;                                   // 0x60C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                ClassToSnapTo;                                     // 0x610(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         ActorSnapValid;                                    // 0x618(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_69FD[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                SnapActor;                                         // 0x620(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FItemData                             ItemData;                                          // 0x628(0x1F0)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FName                                  SnapSocket;                                        // 0x818(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DebugDeployment;                                   // 0x820(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6A00[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItemData                             SpawnedItem;                                       // 0x828(0x1F0)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FHitResult                            LastDeployAttemptTrace;                            // 0xA18(0x88)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor, ContainsInstancedReference)
	class UFMODEvent*                            FMODEvent_DeployFail;                              // 0xAA0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         TriedToShowRadialMenu;                             // 0xAA8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6A08[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        SelectedVariantIndex;                              // 0xAAC(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	struct FDeployableSetup                      DeployableSetup;                                   // 0xAB0(0x188)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         SnapOverridePressed;                               // 0xC38(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_6A0E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSoftClassPtr<class AActor>>          BlacklistedFoundationClasses;                      // 0xC40(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         IsPreviewActorSheltered;                           // 0xC50(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsPreviewActorOutsidePlaceOnly;                    // 0xC51(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class UBP_ActionableBehaviour_DeployableBase_C* GetDefaultObj();

	void CustomDeploymentCheck(class AActor* HitActor, bool* ValidPlacement, class FText* Reason);
	void BlueprintDeploy(const struct FTransform& DeployTransform, class AActor* FoundationActor, const struct FItemData& ItemData, int32 VarientIndex);
