#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x164 (0x46E - 0x30A)
// BlueprintGeneratedClass BP_ActionableBehaviour_Fishing_Rod.BP_ActionableBehaviour_Fishing_Rod_C
class UBP_ActionableBehaviour_Fishing_Rod_C : public UBP_ActionableBehaviour_Base_C
{
public:
	uint8                                        Pad_5E6A[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x310(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	bool                                         ButtonPressed;                                     // 0x318(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         TimerStarted;                                      // 0x319(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         WaterEventFired;                                   // 0x31A(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         LureInWater;                                       // 0x31B(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         CompletedMinigame;                                 // 0x31C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsInspectingFish;                                  // 0x31D(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsFiring;                                          // 0x31E(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5E70[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinigameReactionTimer;                             // 0x320(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        ThrowOffset;                                       // 0x324(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        DrawPower;                                         // 0x328(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        MinFishingTimer;                                   // 0x32C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        MaxFishingTimer;                                   // 0x330(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        WaterRaytraceTimer;                                // 0x334(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        GroundRaytraceDistance;                            // 0x338(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        LastFireDrawPower;                                 // 0x33C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRangedWeaponData                     RangedWeaponData;                                  // 0x340(0xD0)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FTimerHandle                          MinigameTimer;                                     // 0x410(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class AIcarusPlayerCharacter*                OwningPlayer;                                      // 0x418(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_SkeletalItem_Fishing_Rod_C*        Rod;                                               // 0x420(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_UserInterface_C*                  UserInterface;                                     // 0x428(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            InspectionStateChanged;                            // 0x430(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                        DefaultDistance;                                   // 0x440(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        DistanceIncrement;                                 // 0x444(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         HasSetDefault;                                     // 0x448(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         HasSetupIncrement;                                 // 0x449(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_5EB3[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               TargetLureLocation;                                // 0x44C(0xC)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            FishAdded;                                         // 0x458(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	float                                        LureMovementDetectRadius;                          // 0x468(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         IsFishInGoldenZone;                                // 0x46C(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         CanCancelInspect;                                  // 0x46D(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class UBP_ActionableBehaviour_Fishing_Rod_C* GetDefaultObj();

	void Grant_Experience(const struct FItemData& Fish, class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_GrantExperienceToActor_ReturnValue, int32 CallFunc_GetStat_ReturnValue, int32 CallFunc_GetStat_ReturnValue_1, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue_1, int32 CallFunc_GetStat_ReturnValue_2, bool CallFunc_GrantExperienceToActor_ReturnValue_1, bool CallFunc_EqualEqual_IntInt_ReturnValue_2, bool CallFunc_GrantExperienceToActor_ReturnValue_2, bool CallFunc_GrantExperienceToActor_ReturnValue_3);
	void ShouldPlayReelingAnimation(bool* ShouldPlay, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod, bool CallFunc_BooleanOR_ReturnValue);
	void GetStatAdjustedDurability(int32 DurabilityLoss, int32* RodDurabilityLoss, int32* LureDurabilityLoss, class UIcarusStatContainer* StatContainer, int32 CallFunc_Divide_IntInt_ReturnValue, int32 CallFunc_GetStat_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_GetStat_ReturnValue_1, float CallFunc_Conv_IntToFloat_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_Conv_IntToFloat_ReturnValue_1, float CallFunc_Multiply_IntFloat_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue_1, int32 CallFunc_FFloor_ReturnValue, float CallFunc_Multiply_IntFloat_ReturnValue_1, int32 CallFunc_FFloor_ReturnValue_1, int32 CallFunc_GetStat_ReturnValue_2, float CallFunc_Conv_IntToFloat_ReturnValue_2, float CallFunc_Divide_FloatFloat_ReturnValue_2, bool CallFunc_IsValid_ReturnValue, bool CallFunc_RandomBoolWithWeight_ReturnValue, class UIcarusStatContainer* CallFunc_GetComponentByClass_ReturnValue);
	void SetupIncrementDistance(float Current_Progress, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod, class ABP_Fishing_Rod_Lure_C* CallFunc_GetLure_Lure, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, float CallFunc_Vector_Distance_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue);
	void SetupFishMovement();
	void CheckMovementValidity(bool* IsValid, TArray<class AActor*>& Temp_object_Variable, TArray<enum class EObjectTypeQuery>& K2Node_MakeArray_Array, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod, class ABP_Fishing_Rod_Lure_C* CallFunc_GetLure_Lure, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, const struct FVector& CallFunc_Normal_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1, const struct FHitResult& CallFunc_LineTraceSingleForObjects_OutHit, bool CallFunc_LineTraceSingleForObjects_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue);
	void FishMovement(bool CallFunc_CheckMovementValidity_IsValid, bool CallFunc_NotEqualExactly_VectorVector_ReturnValue, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod, float CallFunc_GetWorldDeltaSeconds_ReturnValue, class ABP_Fishing_Rod_Lure_C* CallFunc_GetLure_Lure, float CallFunc_Multiply_FloatFloat_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, float CallFunc_FClamp_ReturnValue, const struct FVector& CallFunc_VEase_ReturnValue, bool CallFunc_HasAuthority_ReturnValue, const struct FHitResult& CallFunc_K2_SetActorLocation_SweepHitResult, bool CallFunc_K2_SetActorLocation_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void ResetIfLureIsTooClose(class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_IsLureTooClose_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void ReelLogic(class USkeletalMeshComponent* CallFunc_GetFirstPersonMesh_ReturnValue, bool CallFunc_IsValid_ReturnValue, class UAnimInstance* CallFunc_GetAnimInstance_ReturnValue, float CallFunc_GetCurveValue_ReturnValue, bool CallFunc_LessEqual_FloatFloat_ReturnValue);
	void OnFishLost();
	void OnFishCaught();
	void FishingMinigameLogic(FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, bool CallFunc_ResetIfLureOnRod_IsLureOffRod);
	void FishingTimerEnd();
	void FishingTimerStart(class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod_1, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue);
	void IsFullyCasted(bool* FullyCasted, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod);
	void GetFishingRod(class ABP_SkeletalItem_Fishing_Rod_C** BP_Skeletal_Item_Fishing_Rod, bool CallFunc_IsValid_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, class ABP_SkeletalItem_Fishing_Rod_C* K2Node_DynamicCast_AsBP_Skeletal_Item_Fishing_Rod, bool K2Node_DynamicCast_bSuccess);
	void Completed_Reaction(class ACharacter* CallFunc_GetPlayerCharacter_ReturnValue, class ABP_IcarusPlayerCharacterSurvival_C* K2Node_DynamicCast_AsBP_Icarus_Player_Character_Survival, bool K2Node_DynamicCast_bSuccess);
	void ResetIfLureIsTooFar(class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod, bool CallFunc_IsLureTooFar_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void ResetIfLureOnRod(bool* IsLureOffRod, class AActor* CallFunc_GetOwner_ReturnValue, class ABP_SkeletalItem_Fishing_Rod_C* K2Node_DynamicCast_AsBP_Skeletal_Item_Fishing_Rod, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsCasted_Casted);
	void ToggleCatchFishUI(bool CallFunc_LocalOrServer_Local, bool CallFunc_LocalOrServer_Server, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod, class ABP_Fishing_Rod_Lure_C* CallFunc_GetLure_Lure, class UBP_UIProjectionComponent_Fishing_C* CallFunc_GetProjectionComponent_BP_UIProjectionComponent_Fishing, bool CallFunc_Not_PreBool_ReturnValue);
	void IsLureInWater(bool* InWater, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod, bool CallFunc_Is_Lure_Overlapping_Water_IsFloating);
	void LocalOrServer(bool* Local, bool* Server, bool CallFunc_IsValid_ReturnValue, bool CallFunc_HasAuthority_ReturnValue, bool CallFunc_IsLocallyControlled_ReturnValue);
	void GetCurrentDrawPercentage(float* Percentage, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_Subtract_FloatFloat_ReturnValue_1, bool CallFunc_EqualEqual_FloatFloat_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue);
	void DoThrow(float Power, float CallFunc_Multiply_FloatFloat_ReturnValue, const struct FVector& CallFunc_GetForwardVector_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, class ABP_SkeletalItem_Fishing_Rod_C* K2Node_DynamicCast_AsBP_Skeletal_Item_Fishing_Rod, bool K2Node_DynamicCast_bSuccess);
	void Setup(class AActor* OwningActor, const struct FGameplayConfig& CallFunc_GetGameplayConfigStruct_GameplayConfig, enum class EValid CallFunc_GetGameplayConfigStruct_Paths, bool CallFunc_IsValid_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, const struct FGameplayConfig& CallFunc_GetGameplayConfigStruct_GameplayConfig_1, enum class EValid CallFunc_GetGameplayConfigStruct_Paths_1, bool K2Node_SwitchEnum_CmpSuccess_1, class AIcarusItem* K2Node_DynamicCast_AsIcarus_Item, bool K2Node_DynamicCast_bSuccess, class AIcarusItem* K2Node_DynamicCast_AsIcarus_Item_1, bool K2Node_DynamicCast_bSuccess_1, class UMeshComponent* CallFunc_GetRootMeshComponent_ReturnValue, const struct FRangedWeaponData& CallFunc_GetRangedWeaponData_RangedWeaponData, enum class EDataValid CallFunc_GetRangedWeaponData_Paths, bool CallFunc_IsValid_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess_2, const struct FVector& CallFunc_GetComponentBounds_Origin, const struct FVector& CallFunc_GetComponentBounds_BoxExtent, float CallFunc_GetComponentBounds_SphereRadius, float CallFunc_Add_FloatFloat_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_IsValid_ReturnValue_2, class AIcarusPlayerCharacter* K2Node_DynamicCast_AsIcarus_Player_Character, bool K2Node_DynamicCast_bSuccess_2);
	void ReceiveBeginPlay();
	void Server_Reel(bool Reel);
	void ReceiveTick(float DeltaSeconds);
	void Server_QuickReel();
	void Reel(bool Reel);
	void Server_GrantFish(class AIcarusPlayerCharacterSurvival* Fisher);
	void ReceiveEndPlay(enum class EEndPlayReason EndPlayReason);
	void Reset_Timer();
	void CheckForWater();
	void Multicast_PostThrow();
	void Server_RequestThrow(float Power);
	void FishToInventory();
	void Multicast_InspectFish();
	void ResetMinigame();
	void ResetOnLureDistance();
	void Server_SetLureProgress(float CurrentProgress, bool IsInGoldenZone);
	void OnActionAborted(enum class EActionableEventType EventType);
	void SetUpdateProgress();
	void PerformAction(class AActor* InvokingActor, enum class EActionableEventType OnActionType, enum class EActionableTrigger ActionTrigger);
	void Server_ResetTargetLocation();
	void Server_DeliverFish();
	void Multicast_FinishInspect();
	void EndInspectingMontage();
	void ExecuteUbergraph_BP_ActionableBehaviour_Fishing_Rod(int32 EntryPoint, float CallFunc_GetWorldDeltaSeconds_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, bool CallFunc_NotEqual_FloatFloat_ReturnValue, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, float CallFunc_Divide_FloatFloat_ReturnValue_1, bool K2Node_CustomEvent_Reel_1, float K2Node_Event_DeltaSeconds, float CallFunc_SelectFloat_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue_1, float CallFunc_FMin_ReturnValue, float CallFunc_FMin_ReturnValue_1, float CallFunc_FInterpTo_Constant_ReturnValue, bool K2Node_CustomEvent_Reel, class AActor* CallFunc_GetOwner_ReturnValue_1, bool CallFunc_LocalOrServer_Local, bool CallFunc_LocalOrServer_Server, class AActor* CallFunc_GetOwner_ReturnValue_2, bool CallFunc_IsValid_ReturnValue, class ABP_IcarusPlayerCharacterSurvival_C* K2Node_DynamicCast_AsBP_Icarus_Player_Character_Survival, bool K2Node_DynamicCast_bSuccess, float CallFunc_GetWorldDeltaSeconds_ReturnValue_1, float CallFunc_FInterpTo_Constant_ReturnValue_1, class AIcarusPlayerCharacterSurvival* K2Node_CustomEvent_Fisher, float CallFunc_FMin_ReturnValue_2, const struct FItemData& CallFunc_CatchFishInZone_Fish, bool CallFunc_CatchFishInZone_ReturnValue, const struct FItemData& CallFunc_CatchFish_Fish, bool CallFunc_CatchFish_ReturnValue, const struct FGameplayTag& Temp_struct_Variable, enum class EEndPlayReason K2Node_Event_EndPlayReason, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod, bool CallFunc_IsLocallyControlled_ReturnValue, bool CallFunc_IsCasted_Casted, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod_1, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod_2, bool Temp_bool_Has_Been_Initd_Variable, float CallFunc_RandomFloatInRange_ReturnValue, int32 CallFunc_FTrunc_ReturnValue, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, int32 CallFunc_GetStat_ReturnValue, float CallFunc_ModifyValueByPlusPercent_ReturnValue, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, float CallFunc_SelectFloat_ReturnValue_1, float CallFunc_Multiply_FloatFloat_ReturnValue_2, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod_4, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod_5, class ABP_Fishing_Rod_Lure_C* CallFunc_GetLure_Lure, bool CallFunc_BooleanOR_ReturnValue, TArray<class AActor*>& K2Node_MakeArray_Array, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue, TArray<enum class EObjectTypeQuery>& K2Node_MakeArray_Array_1, const struct FVector& CallFunc_Add_VectorVector_ReturnValue, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue, TArray<enum class EObjectTypeQuery>& K2Node_MakeArray_Array_2, const struct FHitResult& CallFunc_LineTraceSingleForObjects_OutHit, bool CallFunc_LineTraceSingleForObjects_ReturnValue, class UFishingSubsystem* CallFunc_GetWorldSubsystem_ReturnValue, bool CallFunc_BreakHitResult_bBlockingHit, bool CallFunc_BreakHitResult_bInitialOverlap, float CallFunc_BreakHitResult_Time, float CallFunc_BreakHitResult_Distance, const struct FVector& CallFunc_BreakHitResult_Location, const struct FVector& CallFunc_BreakHitResult_ImpactPoint, const struct FVector& CallFunc_BreakHitResult_Normal, const struct FVector& CallFunc_BreakHitResult_ImpactNormal, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat, class AActor* CallFunc_BreakHitResult_HitActor, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent, class FName CallFunc_BreakHitResult_HitBoneName, int32 CallFunc_BreakHitResult_HitItem, int32 CallFunc_BreakHitResult_ElementIndex, int32 CallFunc_BreakHitResult_FaceIndex, const struct FVector& CallFunc_BreakHitResult_TraceStart, const struct FVector& CallFunc_BreakHitResult_TraceEnd, float CallFunc_BreakVector_X, float CallFunc_BreakVector_Y, float CallFunc_BreakVector_Z, class APlayerCameraManager* CallFunc_GetPlayerCameraManager_ReturnValue, class UCameraShakeBase* CallFunc_StartCameraShake_ReturnValue, class UProspectSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue, const struct FProspectInfo& CallFunc_GetActiveProspectInfo_ReturnValue, bool CallFunc_IsTestProspect_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod_6, class APlayerController* CallFunc_GetPlayerController_ReturnValue, TScriptInterface<class IUIControllerInterface_C> K2Node_DynamicCast_AsUIController_Interface, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_Not_PreBool_ReturnValue, class UUMG_UserInterface_Base_C* CallFunc_GetUserInterface_UserInterface, TArray<class AActor*>& Temp_object_Variable, const struct FHitResult& CallFunc_LineTraceSingleForObjects_OutHit_1, bool CallFunc_LineTraceSingleForObjects_ReturnValue_1, class UUMG_UserInterface_C* K2Node_DynamicCast_AsUMG_User_Interface, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_BreakHitResult_bBlockingHit_1, bool CallFunc_BreakHitResult_bInitialOverlap_1, float CallFunc_BreakHitResult_Time_1, float CallFunc_BreakHitResult_Distance_1, const struct FVector& CallFunc_BreakHitResult_Location_1, const struct FVector& CallFunc_BreakHitResult_ImpactPoint_1, const struct FVector& CallFunc_BreakHitResult_Normal_1, const struct FVector& CallFunc_BreakHitResult_ImpactNormal_1, class UPhysicalMaterial* CallFunc_BreakHitResult_PhysMat_1, class AActor* CallFunc_BreakHitResult_HitActor_1, class UPrimitiveComponent* CallFunc_BreakHitResult_HitComponent_1, class FName CallFunc_BreakHitResult_HitBoneName_1, int32 CallFunc_BreakHitResult_HitItem_1, int32 CallFunc_BreakHitResult_ElementIndex_1, int32 CallFunc_BreakHitResult_FaceIndex_1, const struct FVector& CallFunc_BreakHitResult_TraceStart_1, const struct FVector& CallFunc_BreakHitResult_TraceEnd_1, const struct FGameplayTagContainer& CallFunc_GetGameplayTagContainer_OutContainer, bool CallFunc_GetGameplayTagContainer_ReturnValue, TArray<struct FGameplayTag>& CallFunc_BreakGameplayTagContainer_GameplayTags, bool CallFunc_Array_Contains_ReturnValue, float CallFunc_BreakVector_X_1, float CallFunc_BreakVector_Y_1, float CallFunc_BreakVector_Z_1, bool CallFunc_Greater_FloatFloat_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, float K2Node_CustomEvent_Power, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod_7, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, bool CallFunc_IsLocallyControlled_ReturnValue_1, bool CallFunc_IsLocallyControlled_ReturnValue_2, float K2Node_CustomEvent_CurrentProgress, bool K2Node_CustomEvent_IsInGoldenZone, bool Temp_bool_IsClosed_Variable, float CallFunc_Subtract_FloatFloat_ReturnValue, enum class EActionableEventType K2Node_Event_EventType, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_1, bool CallFunc_IsFishInZone_InZone, float CallFunc_Multiply_FloatFloat_ReturnValue_3, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod_8, const struct FVector& CallFunc_K2_GetActorLocation_ReturnValue_2, class ABP_Fishing_Rod_Lure_C* CallFunc_GetLure_Lure_1, class AActor* K2Node_Event_InvokingActor, enum class EActionableEventType K2Node_Event_OnActionType, enum class EActionableTrigger K2Node_Event_ActionTrigger, bool K2Node_SwitchEnum_CmpSuccess, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess_1, const struct FVector& CallFunc_Subtract_VectorVector_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess_2, const struct FVector& CallFunc_Normal_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_3, const struct FVector& CallFunc_Multiply_VectorFloat_ReturnValue, const struct FVector& CallFunc_Add_VectorVector_ReturnValue_1, bool CallFunc_NotEqual_ByteByte_ReturnValue, float CallFunc_BreakVector_X_2, float CallFunc_BreakVector_Y_2, float CallFunc_BreakVector_Z_2, bool K2Node_SwitchEnum_CmpSuccess_4, bool K2Node_SwitchEnum_CmpSuccess_5, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod_9, class ABP_Fishing_Rod_Lure_C* CallFunc_GetLure_Lure_2, const struct FVector& CallFunc_K2_GetComponentLocation_ReturnValue_2, float CallFunc_BreakVector_X_3, float CallFunc_BreakVector_Y_3, float CallFunc_BreakVector_Z_3, bool CallFunc_Not_PreBool_ReturnValue_1, const struct FVector& CallFunc_MakeVector_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, bool CallFunc_IsLocallyControlled_ReturnValue_3, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod_10, const struct FItemData& Temp_wildcard_Variable, class AIcarusPlayerController* CallFunc_GetIcarusPlayerController_ReturnValue, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod_11, class ABP_SkeletalItem_Fishing_Rod_C* CallFunc_GetFishingRod_BP_Skeletal_Item_Fishing_Rod_12, enum class EDataValid CallFunc_ItemDataValid_Paths, bool K2Node_SwitchEnum_CmpSuccess_6, bool CallFunc_IsLocallyOwned_LocallyOwned, int32 CallFunc_GetStatAdjustedDurability_RodDurabilityLoss, int32 CallFunc_GetStatAdjustedDurability_LureDurabilityLoss, class AActor* CallFunc_GetOwner_ReturnValue_3, class UInventory* CallFunc_GetAttachmentSlotActor_Inventory, int32 CallFunc_GetAttachmentSlotActor_Slot, enum class EDataValid CallFunc_GetAttachmentSlotActor_Paths, bool CallFunc_DealSelfDamage_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_7, bool CallFunc_DealDamageToInventoryItem_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_2, bool CallFunc_BooleanAND_ReturnValue_2, bool CallFunc_HasAuthority_ReturnValue, bool CallFunc_EqualEqual_FloatFloat_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_3);
	void FishAdded__DelegateSignature();
	void InspectionStateChanged__DelegateSignature(bool IsInspecting);
};

}


