#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x41 (0x41 - 0x0)
// Function BP_Fireplace_Chimney_Cap_Half.BP_Fireplace_Chimney_Cap_Half_C.ExecuteUbergraph_BP_Fireplace_Chimney_Cap_Half
struct ABP_Fireplace_Chimney_Cap_Half_C_ExecuteUbergraph_BP_Fireplace_Chimney_Cap_Half_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2247[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ADeployable*                           CallFunc_GetAttachedDeployableParent_ReturnValue;  // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Fireplace_Chimney_Ext_C*           K2Node_DynamicCast_AsBP_Fireplace_Chimney_Ext;     // 0x10(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess;                       // 0x18(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2261[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_Fireplace_C*                       K2Node_DynamicCast_AsBP_Fireplace;                 // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess_1;                     // 0x28(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_229D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_DeployableBase_C*                  CallFunc_GetParentFireplace_Parent;                // 0x30(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_Fireplace_C*                       K2Node_DynamicCast_AsBP_Fireplace_1;               // 0x38(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_DynamicCast_bSuccess_2;                     // 0x40(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

}
}


