#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x54 (0x7C8 - 0x774)
// BlueprintGeneratedClass BP_Vapour_Condenser.BP_Vapour_Condenser_C
class ABP_Vapour_Condenser_C : public ABP_DeployableBase_C
{
public:
	uint8                                        Pad_524A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x778(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetComponent*                      Widget_HordeInterface;                             // 0x780(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGenericAITargetComponent*             GenericAITarget;                                   // 0x788(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UBPQC_HordeMode_C*                     BPQC_HordeMode;                                    // 0x790(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UNiagaraComponent*                     Niagara;                                           // 0x798(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFMODAudioComponent*                   FMODAudio;                                         // 0x7A0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UPointLightComponent*                  PointLight;                                        // 0x7A8(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                       ActiveEffects;                                     // 0x7B0(0x8)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UGenericAITargetComponent*             GeneratedTargetComponent;                          // 0x7B8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         DeviceActive;                                      // 0x7C0(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor)
	uint8                                        Pad_527F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Completions;                                       // 0x7C4(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class ABP_Vapour_Condenser_C* GetDefaultObj();

	void GetCreatureMultiplierFromCompletions(int32 Completions, float* Multiplier, float CallFunc_Multiply_IntFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue);
	void UpdateWidgetState(class UProspectSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue, class UWorldStatsSubsystem* CallFunc_GetWorldSubsystem_ReturnValue, const struct FIcarusProspect& CallFunc_GetActiveProspectData_ReturnValue, TMap<struct FStatsRowHandle, int32> CallFunc_GetWorldStats_ReturnValue, const struct FStatsRowHandle& Temp_struct_Variable, bool CallFunc_Not_PreBool_ReturnValue, int32 CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, enum class EValid CallFunc_GetTrait_Paths, class UInventoryComponent* CallFunc_GetTrait_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, class UInventory* CallFunc_GetInventory_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_HasItems_ReturnValue, class AEnzymeGeyser* K2Node_DynamicCast_AsEnzyme_Geyser, bool K2Node_DynamicCast_bSuccess, class UUserWidget* CallFunc_GetUserWidgetObject_ReturnValue, const struct FHorde& CallFunc_GetHordeStruct_Horde, enum class EValid CallFunc_GetHordeStruct_Paths, class UUMG_Inworld_Vapour_Condenser_C* K2Node_DynamicCast_AsUMG_Inworld_Vapour_Condenser, bool K2Node_DynamicCast_bSuccess_1, bool K2Node_SwitchEnum_CmpSuccess_1, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1);
	void GrantRewards(const struct FHordeRowHandle& Horde, int32 Completions, const TArray<struct FItemData>& ItemsToAdd, const struct FItemData& ItemReward, const TArray<struct FItemRewardsRowHandle>& Rewards, float Temp_float_Variable, const struct FHorde& CallFunc_GetHordeStruct_Horde, enum class EValid CallFunc_GetHordeStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess, float Temp_float_Variable_1, bool CallFunc_Less_IntInt_ReturnValue, float Temp_float_Variable_2, float Temp_float_Variable_3, enum class EMissionDifficulty Temp_byte_Variable, float Temp_float_Variable_4, float Temp_float_Variable_5, float Temp_float_Variable_6, float Temp_float_Variable_7, float Temp_float_Variable_8, class UProspectSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue, const struct FIcarusProspect& CallFunc_GetActiveProspectData_ReturnValue, bool Temp_bool_Variable, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_BooleanAND_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue, TArray<struct FItemRewardsRowHandle>& K2Node_Select_Default, int32 Temp_int_Array_Index_Variable, float Temp_float_Variable_9, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_2, const struct FItemRewardsRowHandle& CallFunc_Array_Get_Item, const struct FItemRewards& CallFunc_GetItemRewardsStruct_ItemRewards, enum class EValid CallFunc_GetItemRewardsStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess_1, enum class EMissionDifficulty Temp_byte_Variable_1, const struct FItemRewardEntry& CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_2, const struct FItemData& CallFunc_GetItemTemplateStruct_ItemTemplate, enum class EValid CallFunc_GetItemTemplateStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess_2, enum class EMissionDifficulty CallFunc_GetCurrentProspectDifficulty_ReturnValue, enum class EMissionDifficulty CallFunc_GetCurrentProspectDifficulty_ReturnValue_1, float K2Node_Select_Default_1, float K2Node_Select_Default_2, class UWorldStatsSubsystem* CallFunc_GetWorldSubsystem_ReturnValue, float CallFunc_GetMultiplierFromCompletions_Multiplier, TMap<struct FStatsRowHandle, int32> CallFunc_GetWorldStats_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, const struct FStatsRowHandle& Temp_struct_Variable, TArray<class AIcarusPlayerCharacterSurvival*>& CallFunc_GetAllActorsOfClass_OutActors, int32 CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, class AIcarusPlayerCharacterSurvival* CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_GrantExperienceToActorWithMultiplier_ReturnValue, bool Temp_bool_Variable_1, TArray<struct FItemRewardsRowHandle>& K2Node_Select_Default_3, const struct FItemData& CallFunc_CreateItem_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, float CallFunc_GetMultiplierFromCompletions_Multiplier_1, int32 Temp_int_Loop_Counter_Variable_2, float CallFunc_Multiply_FloatFloat_ReturnValue_1, int32 CallFunc_GenerateRewardStackSize_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_3, enum class ESetDataSuccess CallFunc_SetItemPropertyValue_Paths, bool K2Node_SwitchEnum_CmpSuccess_3, int32 CallFunc_Add_IntInt_ReturnValue_2, enum class EValid CallFunc_GetTrait_Paths, class UInventoryComponent* CallFunc_GetTrait_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_4, class UInventory* CallFunc_GetInventory_ReturnValue, TArray<struct FItemData>& CallFunc_ForceAddItems_RemainingItems);
	void GetMultiplierFromCompletions(int32 Completions, float* Multiplier, float CallFunc_Multiply_IntFloat_ReturnValue, float CallFunc_Add_FloatFloat_ReturnValue);
	void OnRep_DeviceActive(class AEnzymeGeyser* K2Node_DynamicCast_AsEnzyme_Geyser, bool K2Node_DynamicCast_bSuccess, float CallFunc_GetCreatureMultiplierFromCompletions_Multiplier, bool CallFunc_IsServer_ReturnValue);
	void Deployable_Interact(class AActor* Interactor, enum class EValid CallFunc_GetTrait_Paths, class UInventoryComponent* CallFunc_GetTrait_ReturnValue, class UInventory* CallFunc_GetInventory_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_HasItems_ReturnValue);
	void ReceiveBeginPlay();
	void OnHordeComplete();
	void DeployableTick(float DeltaSeconds);
	void ExecuteUbergraph_BP_Vapour_Condenser(int32 EntryPoint, float K2Node_Event_DeltaSeconds, float CallFunc_GetProgress_Progress, class UUserWidget* CallFunc_GetUserWidgetObject_ReturnValue, class UUMG_Inworld_Vapour_Condenser_C* K2Node_DynamicCast_AsUMG_Inworld_Vapour_Condenser, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsActive_ReturnValue, bool CallFunc_IsServer_ReturnValue, class AEnzymeGeyser* K2Node_DynamicCast_AsEnzyme_Geyser, bool K2Node_DynamicCast_bSuccess_1, int32 CallFunc_Add_IntInt_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate);
};

}


