#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x68 (0x3A0 - 0x338)
// BlueprintGeneratedClass BP_WeatherController.BP_WeatherController_C
class ABP_WeatherController_C : public AWeatherController
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x338(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	float                                        Deployable_Max_Damage;                             // 0x340(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        Player_Max_Damage;                                 // 0x344(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            StormIncomingAlert;                                // 0x348(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            StormStartedAlert;                                 // 0x358(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	FMulticastInlineDelegateProperty_            AIPerceptionModifierUpdated;                       // 0x368(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TArray<struct FWeatherBiomeGroupsRowHandle>  ProspectBiomeGroups;                               // 0x378(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	int32                                        NumDaysToForecast;                                 // 0x388(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_11AC[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AWeatherForecastManager*               WeatherForecastManager;                            // 0x390(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRandomStream                         RandomStream;                                      // 0x398(0x8)(Edit, BlueprintVisible, ZeroConstructor, NoDestructor)

	static class UClass* StaticClass();
	static class ABP_WeatherController_C* GetDefaultObj();

