#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x2A (0x2A - 0x0)
// UserDefinedStruct FBoneAudioSetting.FBoneAudioSetting
struct FFBoneAudioSetting
{
public:
	class FName                                  Bone_2_0CC707A741BECCC6F92C0A9A4E987BD4;           // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  ReferenceBone_11_0C7C85464353E8925ECEDC91FB07ADB6; // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFMODEvent*                            AudioEvent_37_0CE866644C26058E92E071991A94123B;    // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FName                                  AttachPoint_30_C0ADA6184C4382363A4EEBA78B001A50;   // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        MinVelocity_14_E0E81F0E4855EB99E115EE9F2C64F9BA;   // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                        MaxVelocity_16_5A0B59EF47AE6300CBB8D1BC5CDF7A37;   // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EAudioEquipmentType               EquipmentType_33_1F747DCF4244083B0C5D8E8189E38A1D; // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EAudioPlayerPerspective           Perspective_36_A26692004B407084A73DAFB094CB22B0;   // 0x29(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}


