#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// ENUMS
//---------------------------------------------------------------------------------------------------------------------

enum class EGOAPCharacterStance : uint8
{
	Standing                       = 0,
	Sitting                        = 1,
	Lying                          = 2,
	EGOAPCharacterStance_MAX       = 3,
};

enum class EBuildingDestroyReason : uint8
{
	Stability                      = 0,
	Player                         = 1,
	Damaged                        = 2,
	Replaced                       = 3,
	EBuildingDestroyReason_MAX     = 4,
};

enum class EStealthAttackType : uint8
{
	NoStealth                      = 0,
	PartialStealth                 = 1,
	FullStealth                    = 2,
	EStealthAttackType_MAX         = 3,
};

enum class EProjectileBreakModifier : uint8
{
	NoChange                       = 0,
	Unbreakable                    = 1,
	MustBreak                      = 2,
	EProjectileBreakModifier_MAX   = 3,
};

enum class EViewTraceResultPriority : uint8
{
	Blocking                       = 0,
	Ignore                         = 1,
	Low                            = 2,
	Normal                         = 3,
	High                           = 4,
	EViewTraceResultPriority_MAX   = 5,
};

enum class EViewTraceHitType : uint8
{
	None                           = 0,
	LineTrace                      = 1,
	VolumeTrace                    = 2,
	EViewTraceHitType_MAX          = 3,
};

enum class EDynamicItemProperties : uint8
{
	AssociatedItemInventoryId      = 0,
	AssociatedItemInventorySlot    = 1,
	DynamicState                   = 2,
	GunCurrentMagSize              = 3,
	CurrentAmmoType                = 4,
	BuildingVariation              = 5,
	Durability                     = 6,
	ItemableStack                  = 7,
	MillijoulesRemaining           = 8,
	TransmutableUnits              = 9,
	Fillable_StoredUnits           = 10,
	Fillable_Type                  = 11,
	Decayable_CurrentSpoilTime     = 12,
	InventoryContainer_LinkedInventoryId = 13,
	MaxDynamicItemProperties       = 14,
	EDynamicItemProperties_MAX     = 15,
};

enum class EBestiaryUnlockPopup : uint8
{
	Creature                       = 0,
	Stat1                          = 1,
	Stat2                          = 2,
	Lore1                          = 3,
	Lore2                          = 4,
	Lore3                          = 5,
	Weaknesses                     = 6,
	Loot                           = 7,
	EBestiaryUnlockPopup_MAX       = 8,
};

enum class ETalentState : uint8
{
	Locked                         = 0,
	Available                      = 1,
	Unlocked                       = 2,
	Completed                      = 3,
	ETalentState_MAX               = 4,
};

enum class ELastProspectHostType : uint8
{
	LocalHost                      = 0,
	SteamP2P                       = 1,
	DedicatedServer                = 2,
	ELastProspectHostType_MAX      = 3,
};

enum class EEndProspectSessionContext : uint8
{
	Undefined                      = 0,
	HostLeavingSession             = 1,
	ExpiredProspect                = 2,
	Error_InvalidHost              = 3,
	Error_FailedToHostSession      = 4,
	EEndProspectSessionContext_MAX = 5,
};

enum class EOverallSetting : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Epic                           = 3,
	Cinematic                      = 4,
	NumSettings                    = 5,
	Custom                         = 255,
	EOverallSetting_MAX            = 256,
};

enum class EViewDistanceSetting : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Epic                           = 3,
	Cinematic                      = 4,
	NumSettings                    = 5,
	Custom                         = 255,
	EViewDistanceSetting_MAX       = 256,
};

enum class EPostProcessingSetting : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Epic                           = 3,
	Cinematic                      = 4,
	NumSettings                    = 5,
	Custom                         = 255,
	EPostProcessingSetting_MAX     = 256,
};

enum class EShadowsSetting : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Epic                           = 3,
	Cinematic                      = 4,
	NumSettings                    = 5,
	Custom                         = 255,
	EShadowsSetting_MAX            = 256,
};

enum class EShadowFilterMethodSetting : uint8
{
	PCF                            = 0,
	PCSS                           = 1,
	NumSettings                    = 2,
	Custom                         = 255,
	EShadowFilterMethodSetting_MAX = 256,
};

enum class ETexturesSetting : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Epic                           = 3,
	Cinematic                      = 4,
	NumSettings                    = 5,
	Custom                         = 255,
	ETexturesSetting_MAX           = 256,
};

enum class EEffectsSetting : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Epic                           = 3,
	Cinematic                      = 4,
	NumSettings                    = 5,
	Custom                         = 255,
	EEffectsSetting_MAX            = 256,
};

enum class EFoliageSetting : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Epic                           = 3,
	Cinematic                      = 4,
	NumSettings                    = 5,
	Custom                         = 255,
	EFoliageSetting_MAX            = 256,
};

enum class EShadingSetting : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Epic                           = 3,
	Cinematic                      = 4,
	NumSettings                    = 5,
	Custom                         = 255,
	EShadingSetting_MAX            = 256,
};

enum class EAntiAliasingSetting : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	Epic                           = 3,
	Cinematic                      = 4,
	NumSettings                    = 5,
	Custom                         = 255,
	EAntiAliasingSetting_MAX       = 256,
};

enum class ESkyboxQualitySetting : uint8
{
	Low                            = 0,
	Normal                         = 1,
	NumSettings                    = 2,
	Custom                         = 255,
	ESkyboxQualitySetting_MAX      = 256,
};

enum class ESuperResolutionSetting : uint8
{
	Off                            = 0,
	Auto                           = 1,
	Quality                        = 2,
	Balanced                       = 3,
	Performance                    = 4,
	Ultra_Performance              = 5,
	NumSettings                    = 6,
	Custom                         = 255,
	ESuperResolutionSetting_MAX    = 256,
};

enum class ENVIDIAReflexLowLatencySetting : uint8
{
	Off                            = 0,
	On                             = 1,
	On_Plus_Boost                  = 2,
	NumSettings                    = 3,
	Custom                         = 255,
	ENVIDIAReflexLowLatencySetting_MAX = 256,
};

enum class EFSRModeSetting : uint8
{
	Off                            = 0,
	Performance                    = 1,
	Balanced                       = 2,
	Quality                        = 3,
	Ultra_Quality                  = 4,
	NumSettings                    = 5,
	Custom                         = 255,
	EFSRModeSetting_MAX            = 256,
};

enum class EDisplayTemperatureSetting : uint8
{
	Celsius                        = 0,
	Fahrenheit                     = 1,
	NumSettings                    = 2,
	Custom                         = 255,
	EDisplayTemperatureSetting_MAX = 256,
};

enum class EInputTypeSetting : uint8
{
	Keyboard                       = 0,
	Controller                     = 1,
	NumSettings                    = 2,
	Custom                         = 255,
	EInputTypeSetting_MAX          = 256,
};

enum class EControllerIconsSetting : uint8
{
	Xbox                           = 0,
	Playstation                    = 1,
	Switch                         = 2,
	NumSettings                    = 3,
	Custom                         = 255,
	EControllerIconsSetting_MAX    = 256,
};

enum class ERemoteUserSetting : uint8
{
	DisableCameraFocusOnProcessor  = 0,
	ERemoteUserSetting_MAX         = 1,
};

enum class EEventEndReason : uint8
{
	InvalidReason                  = 0,
	Completed                      = 1,
	Timeout                        = 2,
	Aborted                        = 3,
	EEventEndReason_MAX            = 4,
};

enum class ELevel : uint8
{
	NoLogging                      = 0,
	Error                          = 1,
	Warning                        = 2,
	Info                           = 3,
	ELevel_MAX                     = 4,
};

enum class ERequestPlayerPersonaErrorCode : uint8
{
	NoError                        = 0,
	InvalidId                      = 1,
	RequestTimedOut                = 2,
	ERequestPlayerPersonaErrorCode_MAX = 3,
};

enum class EActionableEventType : uint8
{
	Undefined                      = 0,
	Primary                        = 1,
	Secondary                      = 2,
	Tertiary                       = 3,
	Reload                         = 4,
	MAX_VALUE                      = 5,
	EActionableEventType_MAX       = 6,
};

enum class EActionableTrigger : uint8
{
	ActionPressed                  = 0,
	ActionReleased                 = 1,
	ActionHeld                     = 2,
	EActionableTrigger_MAX         = 3,
};

enum class EPlantGrowthStates : uint8
{
	Unseeded                       = 0,
	Stage1                         = 1,
	Stage2                         = 2,
	Stage3                         = 3,
	Stage4                         = 4,
	Mature                         = 5,
	Decayed                        = 6,
	EPlantGrowthStates_MAX         = 7,
};

enum class EProcessorStoppedReason : uint8
{
	GenericFailure                 = 0,
	NoEnergy                       = 1,
	NoResources                    = 2,
	NoRecipe                       = 3,
	NoQueue                        = 4,
	NoSpace                        = 5,
	NotTurnedOn                    = 6,
	NoResourceRemaining            = 7,
	PlayerStopped                  = 8,
	EProcessorStoppedReason_MAX    = 9,
};

enum class ECaveLightType : uint8
{
	Spot                           = 0,
	Rect                           = 1,
	ECaveLightType_MAX             = 2,
};

enum class EAliveState : uint8
{
	Alive                          = 0,
	Dead                           = 1,
	EAliveState_MAX                = 2,
};

enum class EAIAudioState : uint8
{
	Undefined                      = 0,
	Idle                           = 1,
	Fleeing                        = 2,
	Attacking                      = 3,
	Dead                           = 4,
	Relaxing                       = 5,
	Mounted                        = 6,
	Stalking                       = 7,
	EAIAudioState_MAX              = 8,
};

enum class EAIEventRequestResponse : uint8
{
	Invalid                        = 0,
	FailedToStart                  = 1,
	EventStarted                   = 2,
	PendingLoad                    = 3,
	EAIEventRequestResponse_MAX    = 4,
};

enum class EHeatmapColorChannel : uint8
{
	Red                            = 0,
	Green                          = 1,
	Blue                           = 2,
	Alpha                          = 3,
	AnyChannel                     = 4,
	EHeatmapColorChannel_MAX       = 5,
};

enum class ERelationshipType : uint8
{
	Neutral                        = 0,
	Hostile                        = 1,
	Friendly                       = 2,
	ERelationshipType_MAX          = 3,
};

enum class EAIVocalisationType : uint8
{
	Attack                         = 0,
	Flinch                         = 1,
	Death                          = 2,
	EAIVocalisationType_MAX        = 3,
};

enum class EAnimStateFMODParam : uint8
{
	NotAnimating                   = 0,
	Animating                      = 1,
	EAnimStateFMODParam_MAX        = 2,
};

enum class EGenderedArmourType : uint8
{
	Invalid                        = 0,
	MaleThirdPerson                = 1,
	FemaleThirdPerson              = 2,
	GenericFirstPerson             = 3,
	EGenderedArmourType_MAX        = 4,
};

enum class EArmourType : uint8
{
	Undefined                      = 0,
	Head                           = 1,
	Chest                          = 2,
	Hands                          = 3,
	Legs                           = 4,
	Feet                           = 5,
	Undersuit                      = 6,
	Skin_Head                      = 7,
	Undersuit_Helmet               = 8,
	Skin_Head_Hair                 = 9,
	Backpack                       = 10,
	EArmourType_MAX                = 11,
};

enum class EAssetType : uint8
{
	Object                         = 0,
	Class                          = 1,
	EAssetType_MAX                 = 2,
};

enum class EAudioOcclusionMode : uint8
{
	Complex                        = 0,
	SourceSimple                   = 1,
	SourceAndListenerSimple        = 2,
	EAudioOcclusionMode_MAX        = 3,
};

enum class EAudioShelterState : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	EAudioShelterState_MAX         = 3,
};

enum class EAuthorityType : uint8
{
	ClientOnly                     = 0,
	ServerOnly                     = 1,
	Both                           = 2,
	EAuthorityType_MAX             = 3,
};

enum class ERateLimitedRequests : uint8
{
	None                           = 0,
	GetDropships                   = 1,
	GetMetaResources               = 2,
	GetMetaInventory               = 3,
	GetDropInventory               = 4,
	GetWorkshopPacks               = 5,
	GetCredits                     = 6,
	GetNotifications               = 7,
	SyncTalents                    = 8,
	ERateLimitedRequests_MAX       = 9,
};

enum class EPayloadDeploymentType : uint8
{
	OnProjectileMovementComplete   = 0,
	OnLaunch                       = 1,
	OnBounceImmediate              = 2,
	OnBounceWaitForHalt            = 3,
	OnTimerElapsed                 = 4,
	EPayloadDeploymentType_MAX     = 5,
};

enum class EBiomeImageType : uint8
{
	None                           = 0,
	Small                          = 1,
	Medium                         = 2,
	Large                          = 3,
	EBiomeImageType_MAX            = 4,
};

enum class EBuildingPieceType : uint8
{
	Floor                          = 0,
	Wall                           = 1,
	Frame                          = 2,
	Ramp                           = 3,
	EBuildingPieceType_MAX         = 4,
};

enum class EBuildingOpenFMODParam : uint8
{
	Closed                         = 0,
	Open                           = 1,
	EBuildingOpenFMODParam_MAX     = 2,
};

enum class EBuildingMeshType : uint8
{
	Invalid                        = 0,
	BaseMesh                       = 1,
	FrameMesh                      = 2,
	EBuildingMeshType_MAX          = 3,
};

enum class EBuildingUnzipFMODParam : uint8
{
	Normal                         = 0,
	Unzipping                      = 1,
	EBuildingUnzipFMODParam_MAX    = 2,
};

enum class ECaveContextFMODParam : uint8
{
	None                           = 0,
	ListenerOutSourceOut           = 1,
	ListenerOutSourceInCave        = 2,
	ListenerInCaveSourceOut        = 3,
	ListenerInCaveSourceInCave     = 4,
	ECaveContextFMODParam_MAX      = 5,
};

enum class ECombinedCaveComponentFlags : uint8
{
	None                           = 0,
	EntranceComponent              = 1,
	Void                           = 2,
	ECombinedCaveComponentFlags_MAX = 3,
};

enum class EChallengeTypes : uint8
{
	KillCreature                   = 0,
	CriticalHit                    = 1,
	StealthAttack                  = 2,
	SkinCreature                   = 3,
	HarvestCreatureItem            = 4,
	HarvestPlant                   = 5,
	FellTree                       = 6,
	CollectTreeItem                = 7,
	FullyMineVoxel                 = 8,
	MineResource                   = 9,
	EChallengeTypes_MAX            = 10,
};

enum class ECharacterCustomisationContext : uint8
{
	Undefined                      = 0,
	CharacterCreation              = 1,
	HABCustomisation               = 2,
	ECharacterCustomisationContext_MAX = 3,
};

enum class ECharacterBodyType : uint8
{
	Masculine                      = 0,
	Feminine                       = 1,
	Neutral                        = 2,
	ECharacterBodyType_MAX         = 3,
};

enum class ECharacterOptionCategory : uint8
{
	Head                           = 0,
	Body                           = 1,
	BodyColor                      = 2,
	HairStyle                      = 3,
	HairColor                      = 4,
	Head_Tattoo                    = 5,
	Head_Scar                      = 6,
	Head_FacialHair                = 7,
	SkinTone                       = 8,
	Color                          = 9,
	EyeColor                       = 10,
	Decal                          = 11,
	ECharacterOptionCategory_MAX   = 12,
};

enum class EControllerIconSet : uint8
{
	None                           = 0,
	Xbox                           = 1,
	Playstation                    = 2,
	NintendoSwitch                 = 3,
	EControllerIconSet_MAX         = 4,
};

enum class ERefundPermission : uint8
{
	Inherit                        = 0,
	Block                          = 1,
	Allow                          = 2,
	ERefundPermission_MAX          = 3,
};

enum class ECreatureAudioThreatTargetType : uint8
{
	Invalid                        = 0,
	OtherPlayer                    = 1,
	LocalPlayer                    = 2,
	OtherCreature                  = 3,
	Stimulus                       = 4,
	ECreatureAudioThreatTargetType_MAX = 5,
};

enum class ECreatureFoliageFMODParam : uint8
{
	NotInFoliage                   = 0,
	InFoliage                      = 1,
	ECreatureFoliageFMODParam_MAX  = 2,
};

enum class ECreatureFootstepTypeFMODParam : uint8
{
	FrontFoot                      = 0,
	RearFoot                       = 1,
	Jump                           = 2,
	JumpLand                       = 3,
	ECreatureFootstepTypeFMODParam_MAX = 4,
};

enum class EDamageTypeFMODParam : uint8
{
	Undefined                      = 0,
	Pure                           = 1,
	Physical                       = 2,
	Melee                          = 3,
	Ranged                         = 4,
	Fire                           = 5,
	FallDamage                     = 6,
	Collision                      = 7,
	Poison                         = 8,
	Wind                           = 9,
	EDamageTypeFMODParam_MAX       = 10,
};

enum class EWorldPlacementType : uint8
{
	GroundPlacement                = 0,
	WallPlacement                  = 1,
	WaterPlacement                 = 2,
	GroundOrWallPlacement          = 3,
	CeilingPlacement               = 4,
	LavaPlacement                  = 5,
	EWorldPlacementType_MAX        = 6,
};

enum class EDeployableSnapBehaviour : uint8
{
	WorldPlacementOnly             = 0,
	SnapPlacementOnly              = 1,
	WorldAndSnap                   = 2,
	EDeployableSnapBehaviour_MAX   = 3,
};

enum class EDialogueRedirectCondition : uint8
{
	None                           = 0,
	IsOpenWorldProspect            = 1,
	IsMissionProspect              = 2,
	EDialogueRedirectCondition_MAX = 3,
};

enum class EDropAbundance : uint8
{
	Low                            = 0,
	Medium                         = 1,
	High                           = 2,
	EDropAbundance_MAX             = 3,
};

enum class EDropTemperature : uint8
{
	Cold                           = 0,
	Normal                         = 1,
	Hot                            = 2,
	EDropTemperature_MAX           = 3,
};

enum class EDropshipDescentStateFMODParam : uint8
{
	MainEngines                    = 0,
	Booster                        = 1,
	Freefall                       = 2,
	Landed                         = 3,
	EnterSeat                      = 4,
	EDropshipDescentStateFMODParam_MAX = 5,
};

enum class EDynamicQuestDifficulty : uint8
{
	None                           = 0,
	Easy                           = 1,
	Medium                         = 2,
	Hard                           = 3,
	EDynamicQuestDifficulty_MAX    = 4,
};

enum class EEnvironmentLightningTargetFMODParam : uint8
{
	Random                         = 0,
	Player                         = 1,
	Tree                           = 2,
	Building                       = 3,
	EEnvironmentLightningTargetFMODParam_MAX = 4,
};

enum class EExperienceSource : uint8
{
	XP_None                        = 0,
	XP_OnAction                    = 1,
	XP_OnInteract                  = 2,
	XP_OnHit                       = 3,
	XP_OnDamaged                   = 4,
	XP_OnDeath                     = 5,
	XP_OnCraft                     = 6,
	XP_OnAchievement               = 7,
	XP_Misc                        = 8,
	XP_MAX                         = 9,
};

enum class ECropMeshRotationType : uint8
{
	NoRotation                     = 0,
	Random90                       = 1,
	FullyRandom                    = 2,
	ECropMeshRotationType_MAX      = 3,
};

enum class EFieldGuideItemHotToObtain : uint8
{
	Unobtainium                    = 0,
	Harvest                        = 1,
	Craft                          = 2,
	Kill                           = 4,
	Fishing                        = 8,
	PickAxe                        = 16,
	SledgeHammer                   = 32,
	DrillOrExtract                 = 64,
	Buy_At_Workshop                = 128,
	EFieldGuideItemHotToObtain_MAX = 129,
};

enum class EFirearmAttachType : uint8
{
	Weapon                         = 0,
	Player                         = 1,
	EFirearmAttachType_MAX         = 2,
};

enum class EFireExtinguishResult : uint8
{
	Failed                         = 0,
	ExtinguishedCombustion         = 1,
	ExtinguishedPyrolysis          = 2,
	EFireExtinguishResult_MAX      = 3,
};

enum class EFireMode : uint8
{
	Semiauto                       = 0,
	Burst                          = 1,
	Auto                           = 2,
	EFireMode_MAX                  = 3,
};

enum class EFireStateFMODParam : uint8
{
	NotOnFire                      = 0,
	OnFire                         = 1,
	EFireStateFMODParam_MAX        = 2,
};

enum class EFishType : uint8
{
	None                           = 0,
	Saltwater                      = 1,
	Freshwater                     = 2,
	EFishType_MAX                  = 3,
};

enum class EFishRarity : uint8
{
	None                           = 0,
	Common                         = 1,
	Uncommon                       = 2,
	Rare                           = 3,
	Unique                         = 4,
	EFishRarity_MAX                = 5,
};

enum class EFlagsTableType : uint8
{
	D_CharacterFlags               = 0,
	D_SessionFlags                 = 1,
	D_AccountFlags                 = 2,
	D_DLCPackageData               = 3,
	None                           = 255,
	EFlagsTableType_MAX            = 256,
};

enum class EFlammableAudioLocationType : uint8
{
	ActorLocation                  = 0,
	BoundsOrigin                   = 1,
	BoundsBase                     = 2,
	EFlammableAudioLocationType_MAX = 3,
};

enum class EFlammablePropagationType : uint8
{
	None                           = 0,
	Self                           = 1,
	FireInstance                   = 2,
	EFlammablePropagationType_MAX  = 3,
};

enum class EFlammableState : uint8
{
	None                           = 0,
	Detached                       = 1,
	Pyrolysis                      = 2,
	Combusting                     = 3,
	Combusted                      = 4,
	Destroyed                      = 5,
	EFlammableState_MAX            = 6,
};

enum class EFLODActorState : uint8
{
	Undefined                      = 0,
	Revealing                      = 2,
	Revealed                       = 4,
	Concealing                     = 8,
	Concealed                      = 16,
	EFLODActorState_MAX            = 17,
};

enum class EFLODLevelInfluenceType : uint8
{
	None                           = 0,
	ViewTrace                      = 1,
	Distance                       = 2,
	EFLODLevelInfluenceType_MAX    = 3,
};

enum class EAnimOverlayState : uint8
{
	Default                        = 0,
	OneHanded                      = 1,
	Bow                            = 2,
	TwoHandedRifle                 = 3,
	Driving                        = 4,
	Spear                          = 5,
	Carrying                       = 6,
	Firearm                        = 7,
	Fishing                        = 8,
	EAnimOverlayState_MAX          = 9,
};

enum class EGlobalDropStateFMODParam : uint8
{
	Hab                            = 0,
	Dropship                       = 1,
	Prospect                       = 2,
	LoadingProspect                = 3,
	EGlobalDropStateFMODParam_MAX  = 4,
};

enum class EGlobalEnvironmentBiomeFMODParam : uint8
{
	None                           = 0,
	Conifer                        = 1,
	Arctic                         = 2,
	Desert                         = 3,
	Lava                           = 4,
	Wetlands                       = 5,
	Grasslands                     = 6,
	EGlobalEnvironmentBiomeFMODParam_MAX = 7,
};

enum class EGlobalEnvironmentTerrainZoneFMODParam : uint8
{
	Default                        = 0,
	Canyon_Narrow                  = 1,
	Canyon_Med                     = 2,
	Canyon_Wide                    = 3,
	EGlobalEnvironmentTerrainZoneFMODParam_MAX = 4,
};

enum class EGlobalLoadingScreenStateFMODParam : uint8
{
	LoadingScreen_Inactive         = 0,
	LoadingScreen_Active           = 1,
	LoadingScreen_MAX              = 2,
};

enum class EGlobalPlayerCharacterVoiceFMODParam : uint8
{
	None                           = 0,
	VoiceA                         = 1,
	VoiceB                         = 2,
	EGlobalPlayerCharacterVoiceFMODParam_MAX = 3,
};

enum class EActionRangeCheckBehaviour : uint8
{
	ValidMove                      = 0,
	CustomFunction                 = 1,
	Both                           = 2,
	EActionRangeCheckBehaviour_MAX = 3,
};

enum class EGraphicsCardVendor : uint8
{
	Invalid                        = 0,
	Unknown                        = 1,
	Nvidia                         = 2,
	AMD                            = 3,
	Intel                          = 4,
	EGraphicsCardVendor_MAX        = 5,
};

enum class EHuntingClueType : uint8
{
	Footprint                      = 0,
	BloodTrail                     = 1,
	EHuntingClueType_MAX           = 2,
};

enum class EIcarusActorDestroyReason : uint8
{
	Other                          = 0,
	Pickup                         = 1,
	Durability                     = 2,
	EIcarusActorDestroyReason_MAX  = 3,
};

enum class EProgressState : uint8
{
	Prototype                      = 0,
	Review                         = 1,
	Complete                       = 2,
	NumStates                      = 3,
	EProgressState_MAX             = 4,
};

enum class ERollResult : uint8
{
	Success                        = 0,
	Failure                        = 1,
	ERollResult_MAX                = 2,
};

enum class ECheatsEnabled : uint8
{
	Enabled                        = 0,
	NotEnabled                     = 1,
	ECheatsEnabled_MAX             = 2,
};

enum class EIcarusClaimLaunchConfirmationStep : uint8
{
	ClaimingProspect               = 0,
	LoadingProspect                = 1,
	EIcarusClaimLaunchConfirmationStep_MAX = 2,
};

enum class ELookAtType : uint8
{
	PitchAndYaw                    = 0,
	VectorLocation                 = 1,
	AbsoluteLocation               = 2,
	ELookAtType_MAX                = 3,
};

enum class EIcarusDamageType : uint8
{
	Undefined                      = 0,
	Pure                           = 1,
	Melee                          = 2,
	Projectile                     = 3,
	Fire                           = 4,
	FallDamage                     = 5,
	Collision                      = 6,
	Poison                         = 7,
	Wind                           = 8,
	Shield                         = 9,
	Returned                       = 10,
	Frost                          = 11,
	Electric                       = 12,
	Explosive                      = 13,
	Shatter                        = 14,
	Felling                        = 15,
	EIcarusDamageType_MAX          = 16,
};

enum class EErrorTarget : uint8
{
	Log                            = 0,
	Widget                         = 1,
	Dialog                         = 2,
	EErrorTarget_MAX               = 3,
};

enum class EErrorAction : uint8
{
	Immediate                      = 0,
	Kick                           = 1,
	Queue                          = 2,
	AppClose                       = 3,
	EErrorAction_MAX               = 4,
};

enum class ECanHitResult : uint8
{
	CantHit                        = 0,
	Miss                           = 1,
	Hit                            = 2,
	ECanHitResult_MAX              = 3,
};

enum class EFound : uint8
{
	Found                          = 0,
	NotFound                       = 1,
	EFound_MAX                     = 2,
};

enum class EMissionState : uint8
{
	InProgress                     = 0,
	Completed                      = 1,
	Abandoned                      = 2,
	Failed                         = 3,
	MAX                            = 4,
};

enum class ESettingsCategory : uint8
{
	Display                        = 0,
	Audio                          = 1,
	Gameplay                       = 2,
	Controls                       = 3,
	ESettingsCategory_MAX          = 4,
};

enum class EDisplayMode : uint8
{
	Fullscreen                     = 0,
	Borderless                     = 1,
	Windowed                       = 2,
	EDisplayMode_MAX               = 3,
};

enum class ESettingType : uint8
{
	Bool                           = 0,
	Int                            = 1,
	Float                          = 2,
	Enum                           = 3,
	String                         = 4,
	ESettingType_MAX               = 5,
};

enum class EGOAPFactSource : uint8
{
	VisionPerception               = 0,
	SoundPerception                = 1,
	DamagePerception               = 2,
	ProtectiveMotivation           = 3,
	EGOAPFactSource_MAX            = 4,
};

enum class EGOAPObjectType : uint8
{
	Food                           = 0,
	Water                          = 1,
	Enemy                          = 2,
	MaxObjectTypes                 = 3,
	EGOAPObjectType_MAX            = 4,
};

enum class EGOAPProperty : uint8
{
	Hungry                         = 0,
	Thirsty                        = 1,
	HasFood                        = 2,
	HasWater                       = 3,
	FoundFood                      = 4,
	FoundWater                     = 5,
	Wander                         = 6,
	Scared                         = 7,
	RunForSafety                   = 8,
	MaxProperties                  = 9,
	EGOAPProperty_MAX              = 10,
};

enum class EIcarusItemContext : uint8
{
	None                           = 0,
	World                          = 1,
	EquipHand                      = 2,
	EquipBack                      = 3,
	Vehicle                        = 4,
	Deployable                     = 5,
	Slotable                       = 6,
	Buildable                      = 7,
	DropshipPart                   = 8,
	Gravestone                     = 9,
	Light                          = 10,
	EIcarusItemContext_MAX         = 11,
};

enum class EIcarusJoinConfirmationStep : uint8
{
	FindingSession                 = 0,
	JoiningProspect                = 1,
	LoadingProspect                = 2,
	EIcarusJoinConfirmationStep_MAX = 3,
};

enum class EDestroyPattern : uint8
{
	RadialOutward                  = 0,
	RadialInward                   = 1,
	Random                         = 2,
	EDestroyPattern_MAX            = 3,
};

enum class EDirtierMode : uint8
{
	OwningActor                    = 0,
	AffectedObjectsList            = 1,
	EDirtierMode_MAX               = 2,
};

enum class EGOAPControllerState : uint8
{
	Idle                           = 0,
	GetNewAction                   = 1,
	MoveToAction                   = 2,
	PerformAction                  = 3,
	EGOAPControllerState_MAX       = 4,
};

enum class EIcarusOrchestrationStateFlag : uint8
{
	None                           = 0,
	DatabaseReloadRequired         = 1,
	DatabaseReloadBegin            = 2,
	DatabaseReloadComplete         = 3,
	ActorsReloadedToDatabaseState  = 4,
	IcarusBeginPlay                = 5,
	ClearedAllConcerns             = 6,
	RaiseCurtain                   = 7,
	GameModeBeginPlay              = 8,
	AllRequiredActorsSpawned       = 9,
	EIcarusOrchestrationStateFlag_MAX = 10,
};

enum class EMetaHashResult : uint8
{
	None                           = 0,
	FilesNotFound                  = 1,
	BadFileSize                    = 2,
	ExtraFilesFound                = 4,
	ModFilesFound                  = 8,
	All                            = 255,
	EMetaHashResult_MAX            = 256,
};

enum class EInteractableHitLookupType : uint8
{
	None                           = 0,
	FLOD_Instance                  = 1,
	EInteractableHitLookupType_MAX = 2,
};

enum class EDataValidity : uint8
{
	Valid                          = 0,
	Invalid                        = 1,
	EDataValidity_MAX              = 2,
};

enum class ESurvivalConsumableType : uint8
{
	Food                           = 0,
	Water                          = 1,
	Oxygen                         = 2,
	ESurvivalConsumableType_MAX    = 3,
};

enum class EForceRemovePlayerReason : uint8
{
	Initialisation_NotApproved     = 0,
	KickedByHostingPlayer          = 1,
	EForceRemovePlayerReason_MAX   = 2,
};

enum class ELeaveProspectSessionType : uint8
{
	None                           = 0,
	Quit                           = 1,
	ReturnToCharacterSelect        = 2,
	LeaveByDropship                = 3,
	ReturnToTitlescreen            = 4,
	Disconnected                   = 5,
	ELeaveProspectSessionType_MAX  = 6,
};

enum class EIcarusResourceType : uint8
{
	None                           = 0,
	Energy                         = 1,
	Water                          = 2,
	Fuel                           = 3,
	Oxygen                         = 4,
	Chute                          = 5,
	MaxResourceTypes               = 6,
	EIcarusResourceType_MAX        = 7,
};

enum class EIcarusResumeConfirmationStep : uint8
{
	ResumeRequest                  = 0,
	ConfirmationHost               = 1,
	ConfirmationJoin               = 2,
	LoadingProspectHost            = 3,
	FindingSessionJoin             = 4,
	LoadingProspectJoin            = 5,
	Mismatch                       = 6,
	EIcarusResumeConfirmationStep_MAX = 7,
};

enum class EResumeStep : uint8
{
	None                           = 0,
	AskHost                        = 1,
	AskJoin                        = 2,
	ShouldHost                     = 3,
	ShouldJoin                     = 4,
	ShouldMismatch                 = 5,
	EResumeStep_MAX                = 6,
};

enum class ERocketState : uint8
{
	Inactive                       = 0,
	Descending                     = 1,
	Landed                         = 2,
	Ascending                      = 3,
	ERocketState_MAX               = 4,
};

enum class ERocketPartConnectionType : uint8
{
	Undefined                      = 0,
	MK1_TOP                        = 1,
	MK1_BOTTOM                     = 2,
	MK2_TOP                        = 3,
	MK2_BOTTOM                     = 4,
	ERocketPartConnectionType_MAX  = 5,
};

enum class ENavigationType : uint8
{
	Jump                           = 0,
	Teleport                       = 1,
	MaxNavigationTypes             = 2,
	ENavigationType_MAX            = 3,
};

enum class EStatDisplayOperation : uint8
{
	None                           = 0,
	Multiply                       = 1,
	Division                       = 2,
	Addition                       = 3,
	EStatDisplayOperation_MAX      = 4,
};

enum class EStateRecorderOwnerResolvePolicy : uint8
{
	FindOnly                       = 0,
	RespawnOnly                    = 1,
	FindOrRespawn                  = 2,
	ManuallyResolved               = 3,
	EStateRecorderOwnerResolvePolicy_MAX = 4,
};

enum class ETamingTemperatureState : uint8
{
	JustRight                      = 0,
	TooHot                         = 1,
	TooCold                        = 2,
	ETamingTemperatureState_MAX    = 3,
};

enum class ETamedState : uint8
{
	NotTamed                       = 0,
	Tamed                          = 1,
	Domesticated                   = 2,
	ETamedState_MAX                = 3,
};

enum class ETestRailState : uint8
{
	Inactive                       = 0,
	Initialising                   = 1,
	Running                        = 2,
	Complete                       = 3,
	ETestRailState_MAX             = 4,
};

enum class EIcarusWeatherDifficulty : uint8
{
	Light                          = 0,
	Medium                         = 1,
	Heavy                          = 2,
	Extreme                        = 3,
	EIcarusWeatherDifficulty_MAX   = 4,
};

enum class EFeatureLevelCheckResult : uint8
{
	Unchecked                      = 0,
	Fail_FeatureLevel              = 1,
	Fail_Flag                      = 2,
	Unknown_CouldNotCheckFlag      = 3,
	Pass                           = 4,
	EFeatureLevelCheckResult_MAX   = 5,
};

enum class EInteractType : uint8
{
	Undefined                      = 0,
	WorldPress                     = 1,
	WorldHold                      = 2,
	WorldAltHold                   = 3,
	EInteractType_MAX              = 4,
};

enum class EItemDestructionContext : uint8
{
	Decayed                        = 0,
	Dismantled                     = 1,
	FellOutOfWorld                 = 2,
	EItemDestructionContext_MAX    = 3,
};

enum class ESetDataSuccess : uint8
{
	Success                        = 0,
	Failed                         = 1,
	ESetDataSuccess_MAX            = 2,
};

enum class EDataValid : uint8
{
	DataValid                      = 0,
	DataInvalid                    = 1,
	EDataValid_MAX                 = 2,
};

enum class EInventorySortType : uint8
{
	ByTag                          = 0,
	ByWeight                       = 1,
	ByStackCount                   = 2,
	ByAlphaNumeric                 = 3,
	EInventorySortType_MAX         = 4,
};

enum class EHandedness : uint8
{
	Right                          = 0,
	Left                           = 1,
	Both                           = 2,
	EHandedness_MAX                = 3,
};

enum class EItemCraftingTypeFMODParam : uint8
{
	Player                         = 0,
	World                          = 1,
	EItemCraftingTypeFMODParam_MAX = 2,
};

enum class ECanUseItemResult : uint8
{
	VisibleAndEnabled              = 0,
	VisibleAndDisabled             = 1,
	Hidden                         = 2,
	ECanUseItemResult_MAX          = 3,
};

enum class ESecondaryItemTypes : uint8
{
	Generic                        = 0,
	Helmet                         = 1,
	Chest                          = 2,
	Gloves                         = 3,
	Pants                          = 4,
	Boots                          = 5,
	Envirosuit                     = 6,
	FoodResource                   = 7,
	WaterResource                  = 8,
	OxygenResource                 = 9,
	Utility                        = 10,
	FuelA                          = 11,
	FuelB                          = 12,
	FuelC                          = 13,
	ESecondaryItemTypes_MAX        = 14,
};

enum class EPrimaryItemTypes : uint8
{
	Generic                        = 0,
	Actionable                     = 1,
	Armor                          = 2,
	Ballistic                      = 3,
	Buildable                      = 4,
	Consumable                     = 5,
	Combustible                    = 6,
	Deployable                     = 7,
	Energy                         = 8,
	Equippable                     = 9,
	Highlightable                  = 10,
	Interactable                   = 11,
	Itemable                       = 12,
	Meshable                       = 13,
	Processing                     = 14,
	Useable                        = 15,
	Weight                         = 16,
	Tool                           = 17,
	Resource                       = 18,
	Rocketable                     = 19,
	EPrimaryItemTypes_MAX          = 20,
};

enum class EKeybindVisibility : uint8
{
	VisibleRemap                   = 0,
	VisibleNoRemap                 = 1,
	Invisible                      = 2,
	EKeybindVisibility_MAX         = 3,
};

enum class EInputContext : uint8
{
	Both                           = 0,
	KeyboardOnly                   = 1,
	ControllerOnly                 = 2,
	EInputContext_MAX              = 3,
};

enum class ELineDrawMethod : uint8
{
	Unspecified                    = 0,
	NoLine                         = 1,
	ShortestDistance               = 2,
	XThenY                         = 3,
	YThenX                         = 4,
	ELineDrawMethod_MAX            = 5,
};

enum class ELobbyPrivacy : uint8
{
	Unknown                        = 0,
	FriendsOnly                    = 1,
	Private                        = 2,
	ELobbyPrivacy_MAX              = 3,
};

enum class EMapTileRadarFlag : uint8
{
	NotScanned                     = 0,
	NoResource                     = 1,
	FoundResource                  = 2,
	Scanning                       = 3,
	FogOfWar                       = 4,
	EMapTileRadarFlag_MAX          = 5,
};

enum class ESessionFilterState : uint8
{
	None                           = 0,
	ShowOnly                       = 1,
	HideOnly                       = 2,
	ESessionFilterState_MAX        = 3,
};

enum class ESessionSortDirection : uint8
{
	Ascending                      = 0,
	Descending                     = 1,
	ESessionSortDirection_MAX      = 2,
};

enum class ESessionSortType : uint8
{
	None                           = 0,
	LobbyName                      = 1,
	ProspectName                   = 2,
	Duration                       = 3,
	Difficulty                     = 4,
	PlayerCount                    = 5,
	Ping                           = 6,
	Hardcore                       = 7,
	ESessionSortType_MAX           = 8,
};

enum class ESteamSearchType : uint8
{
	Internet                       = 0,
	Favorites                      = 1,
	History                        = 2,
	Spectate                       = 3,
	Lan                            = 4,
	Friends                        = 5,
	ESteamSearchType_MAX           = 6,
};

enum class ESessionSearchType : uint8
{
	PlayerHosted                   = 0,
	Dedicated                      = 1,
	ESessionSearchType_MAX         = 2,
};

enum class EModifierMergeType : uint8
{
	Stack                          = 0,
	LongestDuration                = 1,
	Replace                        = 2,
	Count                          = 3,
	EModifierMergeType_MAX         = 4,
};

enum class EModifierType : uint8
{
	Buff                           = 0,
	Debuff                         = 1,
	EModifierType_MAX              = 2,
};

enum class EMountCombatBehaviourState : uint8
{
	Invalid                        = 0,
	DoNotEngage                    = 1,
	NeutralEngagement              = 2,
	AggressiveEngagement           = 3,
	EMountCombatBehaviourState_MAX = 4,
};

enum class EMountMovementBehaviourState : uint8
{
	Invalid                        = 0,
	Follow                         = 1,
	IdleWander                     = 2,
	IdleStanding                   = 3,
	IdleLying                      = 4,
	EMountMovementBehaviourState_MAX = 5,
};

enum class EMovementState : uint8
{
	Undefined                      = 0,
	Stationary                     = 1,
	Sneak                          = 2,
	Walk                           = 3,
	Jog                            = 4,
	Run                            = 5,
	Sprint                         = 6,
	Attacking                      = 7,
	EMovementState_MAX             = 8,
};

enum class EMusicConditionCombatState : uint8
{
	None                           = 0,
	Idle                           = 1,
	InCombat                       = 2,
	InCombat_Boss                  = 4,
	InCombat_EpicBoss              = 8,
	EMusicConditionCombatState_MAX = 9,
};

enum class EMusicConditionDisaster : uint8
{
	None                           = 0,
	Normal                         = 1,
	Fire                           = 2,
	EMusicConditionDisaster_MAX    = 3,
};

enum class EMusicConditionDropState : uint8
{
	None                           = 0,
	DropShipDescending             = 1,
	Prospect                       = 2,
	DropShipAscending              = 4,
	Hab                            = 8,
	LoadingProspect                = 16,
	EMusicConditionDropState_MAX   = 17,
};

enum class EMusicConditionDropTime : uint8
{
	None                           = 0,
	Normal                         = 1,
	TimeRunningOut                 = 2,
	EMusicConditionDropTime_MAX    = 3,
};

enum class EMusicConditionGameplayEvent : uint8
{
	None                           = 0,
	DiscoveredMetaResource         = 1,
	Revived                        = 2,
	EMusicConditionGameplayEvent_MAX = 3,
};

enum class EMusicConditionPlayerState : uint8
{
	None                           = 0,
	Alive                          = 1,
	Dead                           = 2,
	LowHealth                      = 4,
	EMusicConditionPlayerState_MAX = 5,
};

enum class EMusicConditionTimeOfDay : uint8
{
	None                           = 0,
	Dawn                           = 1,
	Day                            = 2,
	Dusk                           = 4,
	Night                          = 8,
	EMusicConditionTimeOfDay_MAX   = 9,
};

enum class EMusicConditionWeather : uint8
{
	None                           = 0,
	Normal                         = 1,
	Storm_Ramp                     = 2,
	Storm_Damage                   = 4,
	Storm_Chaos                    = 8,
	EMusicConditionWeather_MAX     = 9,
};

enum class EObjectSlotType : uint8
{
	ObjectSlotInput                = 0,
	ObjectSlotOutput               = 1,
	ObjectSlotStorage              = 2,
	EObjectSlotType_MAX            = 3,
};

enum class EOcclusionShelterContextFMODParam : uint8
{
	None                           = 0,
	ListenerLowSourceLow           = 1,
	ListenerLowSourceMed           = 2,
	ListenerLowSourceHigh          = 3,
	ListenerMedSourceLow           = 4,
	ListenerMedSourceMed           = 5,
	ListenerMedSourceHigh          = 6,
	ListenerHighSourceLow          = 7,
	ListenerHighSourceMed          = 8,
	ListenerHighSourceHigh         = 9,
	EOcclusionShelterContextFMODParam_MAX = 10,
};

enum class EMigrationStep : uint8
{
	Start                          = 0,
	CreatePlayerDataFolder         = 1,
	MigrateMetaInventoryFormat     = 2,
	OnlineGetUserProfile           = 3,
	OnlineGetCharacterData         = 4,
	OnlineGetCharacterLoadouts     = 5,
	OnlineGetMetaInventory         = 6,
	SwitchToOffline                = 7,
	CacheOfflineManagers           = 8,
	OfflineGetUserProfile          = 9,
	OfflineGetCharacterData        = 10,
	OfflineGetCharacterLoadouts    = 11,
	OfflineGetMetaInventory        = 12,
	MergeProfileData               = 13,
	MergeCharacterData             = 14,
	MergeLoadoutData               = 15,
	MergeMetaInventories           = 16,
	MergeOutpostFiles              = 17,
	UpdateLoadoutData              = 18,
	MigrateSaveFormat              = 19,
	DeletingOldFiles               = 20,
	FinaliseMigration              = 21,
	EMigrationStep_MAX             = 22,
};

enum class EPlayerArmourTypeFMODParam : uint8
{
	None                           = 0,
	Fiber                          = 1,
	Fur                            = 2,
	Leather                        = 3,
	Ghillie                        = 4,
	Carbon                         = 5,
	Composite                      = 6,
	Polar                          = 7,
	Scale                          = 8,
	Bone                           = 9,
	Obsidian                       = 10,
	EPlayerArmourTypeFMODParam_MAX = 11,
};

enum class EPlayerAudioFoliageType : uint8
{
	Undefined                      = 0,
	Tree                           = 1,
	Bush                           = 2,
	EPlayerAudioFoliageType_MAX    = 3,
};

enum class EFishUnlockPopup : uint8
{
	None                           = 0,
	FishCaught                     = 1,
	Quality                        = 2,
	Weight                         = 4,
	Length                         = 8,
	All                            = 255,
	EFishUnlockPopup_MAX           = 256,
};

enum class EPlayerFoliageFMODParam : uint8
{
	None                           = 0,
	Bush                           = 1,
	BushDry                        = 2,
	BushLow                        = 3,
	BushTwiggy                     = 4,
	Flower                         = 5,
	Bramble                        = 6,
	EPlayerFoliageFMODParam_MAX    = 7,
};

enum class EPlayerGroundStateFMODParam : uint8
{
	Earth                          = 0,
	Air                            = 1,
	Water                          = 2,
	EPlayerGroundStateFMODParam_MAX = 3,
};

enum class EPlayerStanceFMODParam : uint8
{
	Jogging                        = 0,
	Sprinting                      = 1,
	Crouching                      = 2,
	Walking                        = 3,
	EPlayerStanceFMODParam_MAX     = 4,
};

enum class ETrackerSetType : uint8
{
	Overwrite                      = 0,
	KeepHighest                    = 1,
	ETrackerSetType_MAX            = 2,
};

enum class ETagRequirement : uint8
{
	HasAllTags                     = 0,
	HasAnyTags                     = 1,
	ETagRequirement_MAX            = 2,
};

enum class EPlayerTypeFMODParam : uint8
{
	LocalPlayerFirstPerson         = 0,
	LocalPlayerThirdPerson         = 1,
	OtherPlayer                    = 2,
	EPlayerTypeFMODParam_MAX       = 3,
};

enum class EProcessorPurpose : uint8
{
	Crafting                       = 0,
	Repairing                      = 1,
	EProcessorPurpose_MAX          = 2,
};

enum class EOnProspectAvailability : uint8
{
	None                           = 0,
	Base                           = 1,
	Upgrade1                       = 2,
	Upgrade2                       = 3,
	EOnProspectAvailability_MAX    = 4,
};

enum class EProspectRequiredTech : uint8
{
	None                           = 0,
	Tier1                          = 1,
	Tier2                          = 2,
	Tier3                          = 3,
	Tier4                          = 4,
	EProspectRequiredTech_MAX      = 5,
};

enum class EIcarusProspectDifficulty : uint8
{
	Easy                           = 0,
	Normal                         = 1,
	Hard                           = 2,
	Extreme                        = 3,
	EIcarusProspectDifficulty_MAX  = 4,
};

enum class EQuestModifiersTableType : uint8
{
	D_QuestWeatherModifiers        = 0,
	D_QuestEnemyModifiers          = 1,
	D_QuestVocalisationModifiers   = 2,
	None                           = 255,
	EQuestModifiersTableType_MAX   = 256,
};

enum class EDialogueEvents : uint8
{
	None                           = 0,
	QuestStart                     = 1,
	QuestEnd                       = 2,
	EDialogueEvents_MAX            = 3,
};

enum class EQuestActorState : uint8
{
	Valid                          = 0,
	Invalid                        = 1,
	EQuestActorState_MAX           = 2,
};

enum class EQuestState : uint8
{
	Complete                       = 0,
	Incomplete                     = 1,
	EQuestState_MAX                = 2,
};

enum class EQuestVocalisationType : uint8
{
	InitialAudio                   = 0,
	UpdateAudio                    = 1,
	FinishAudio                    = 2,
	EQuestVocalisationType_MAX     = 3,
};

enum class ERCONCommandPlatformContext : uint8
{
	Any                            = 0,
	DedicatedServer                = 1,
	P2P                            = 2,
	ERCONCommandPlatformContext_MAX = 3,
};

enum class ERCONCommandContext : uint8
{
	Any                            = 0,
	ServerLobby                    = 1,
	Survival                       = 2,
	ERCONCommandContext_MAX        = 3,
};

enum class EReloadType : uint8
{
	Magazine                       = 0,
	Chambered                      = 1,
	EReloadType_MAX                = 2,
};

enum class ERepairItemTier : uint8
{
	RepairTierUnknown              = 0,
	RepairTier1                    = 1,
	RepairTier2                    = 2,
	RepairTier3                    = 3,
	RepairTier4                    = 4,
	RepairTierWorkshop             = 5,
	ERepairItemTier_MAX            = 6,
};

enum class ECanRepair : uint8
{
	HaveIngredients                = 0,
	RequiresIngredients            = 1,
	NeedsPower                     = 2,
	ToResolve                      = 3,
	ECanRepair_MAX                 = 4,
};

enum class EClassRepPolicy : uint8
{
	NotRouted                      = 0,
	ManuallyRouted                 = 1,
	RelevantAllConnections         = 2,
	Spatialize_Static              = 3,
	Spatialize_Dynamic             = 4,
	Spatialize_Dormancy            = 5,
	EClassRepPolicy_MAX            = 6,
};

enum class ERiverAudioState : uint8
{
	InfrequentlyChecking           = 0,
	FrequentlyChecking             = 1,
	ActivelyUpdating               = 2,
	RiverAudioState_MAX            = 3,
};

enum class ERocketPartType : uint8
{
	Undefined                      = 0,
	ERocketPartType_MAX            = 1,
};

enum class ESplineLoopDirection : uint8
{
	Undetermined                   = 0,
	Anticlockwise                  = 1,
	Clockwise                      = 2,
	ESplineLoopDirection_MAX       = 3,
};

enum class EStaminaBracket : uint8
{
	Empty                          = 0,
	Low                            = 1,
	Normal                         = 2,
	Full                           = 3,
	EStaminaBracket_MAX            = 4,
};

enum class EComparisonType : uint8
{
	Equals                         = 0,
	NotEquals                      = 1,
	LessThan                       = 2,
	LessThanOrEqual                = 3,
	GreaterThan                    = 4,
	GreaterThanOrEqual             = 5,
	EComparisonType_MAX            = 6,
};

enum class EFunctionOutcome : uint8
{
	Success                        = 0,
	Failure                        = 1,
	EFunctionOutcome_MAX           = 2,
};

enum class EInputStatSourceType : uint8
{
	Aiming                         = 0,
	EInputStatSourceType_MAX       = 1,
};

enum class EStatSources : uint8
{
	Base                           = 0,
	FromServer                     = 1,
	Armour                         = 2,
	Buff                           = 3,
	Item                           = 4,
	Durable                        = 5,
	Buildable                      = 6,
	DropShip                       = 7,
	Attributes                     = 8,
	Perks                          = 9,
	Projectile                     = 10,
	GOAP                           = 11,
	EquippedItems                  = 12,
	MapManager                     = 13,
	ArmourSetBonus                 = 14,
	AIManager                      = 15,
	Talents                        = 16,
	Biome                          = 17,
	TimeOfDay                      = 18,
	Weather                        = 19,
	BackingStatsContainer          = 20,
	Weight                         = 21,
	World                          = 22,
	Ruleset                        = 23,
	AISetup                        = 24,
	AISpawner                      = 25,
	EpicCreature                   = 26,
	DamageEnabledAnimNotify        = 27,
	BTTaskPerformAction            = 28,
	Input                          = 29,
	GOAPAction                     = 30,
	CriticalHit                    = 31,
	GenericBehaviourTree           = 32,
	Alteration                     = 33,
	TamingComponent                = 34,
	Atmosphere                     = 35,
	Shield                         = 36,
	Mount                          = 37,
	CreatureModifiers              = 38,
	BestiaryProgress               = 39,
	IcarusMountCharacter           = 40,
	EStatSources_MAX               = 41,
};

enum class ESurfaceFMODParam : uint8
{
	Default                        = 0,
	Dirt                           = 1,
	Sand                           = 2,
	Grass                          = 3,
	Wood                           = 4,
	Rock                           = 5,
	Plastic                        = 6,
	Metal                          = 7,
	Carpet                         = 8,
	Snow                           = 9,
	Water                          = 10,
	Gravel                         = 11,
	Flesh                          = 12,
	Concrete                       = 13,
	Mud                            = 14,
	Ice                            = 15,
	Tree                           = 16,
	VoxelRock                      = 17,
	VoxelMetal                     = 18,
	Bush                           = 19,
	Glass                          = 20,
	Thatch                         = 21,
	Cactus                         = 22,
	Bone                           = 23,
	CorrugatedIron                 = 24,
	Lava                           = 25,
	Slime                          = 26,
	ESurfaceFMODParam_MAX          = 27,
};

enum class ESurveyLaserFMODParam : uint8
{
	LaserOff                       = 0,
	LaserOn                        = 1,
	ESurveyLaserFMODParam_MAX      = 2,
};

enum class ESurveyTransmitFMODParam : uint8
{
	NotTransmitting                = 0,
	Transmitting                   = 1,
	ESurveyTransmitFMODParam_MAX   = 2,
};

enum class ESurvivalStatType : uint8
{
	Food                           = 0,
	Water                          = 1,
	Oxygen                         = 2,
	ESurvivalStatType_MAX          = 3,
};

enum class ETalentModelStorage : uint8
{
	None                           = 0,
	Character                      = 1,
	Account                        = 2,
	ETalentModelStorage_MAX        = 3,
};

enum class ERefundTalentResponse : uint8
{
	Invalid                        = 0,
	Success                        = 1,
	NullModel                      = 2,
	NotUnlocked                    = 3,
	IsDependency                   = 4,
	InvalidatesRank                = 5,
	ERefundTalentResponse_MAX      = 6,
};

enum class ETamedCreatureType : uint8
{
	Juvenile                       = 0,
	TamedCreature                  = 1,
	Both                           = 2,
	ETamedCreatureType_MAX         = 3,
};

enum class ETargetRangeState : uint8
{
	Waiting                        = 0,
	Active                         = 1,
	ETargetRangeState_MAX          = 2,
};

enum class ETerrainAnchorState : uint8
{
	Undefined                      = 0,
	Valid                          = 1,
	Invalid                        = 2,
	ETerrainAnchorState_MAX        = 3,
};

enum class ESleepResult : uint8
{
	Valid                          = 0,
	InvalidTime                    = 1,
	ESleepResult_MAX               = 2,
};

enum class ETreeDetachContextFMODParam : uint8
{
	Collision                      = 0,
	PlayerCollision                = 1,
	PlayerActionIndirect           = 2,
	PlayerActionDirect             = 3,
	ETreeDetachContextFMODParam_MAX = 4,
};

enum class ETreePrimitiveDetachContext : uint8
{
	None                           = 0,
	PlayerAction_Direct            = 1,
	PlayerAction_Indirect          = 2,
	Collision                      = 3,
	Fire                           = 4,
	Storm                          = 5,
	ETreePrimitiveDetachContext_MAX = 6,
};

enum class ETreePrimitiveItemReplaceMethod : uint8
{
	None                           = 0,
	SpawnWorldItem                 = 1,
	DirectIntoInventory            = 2,
	ETreePrimitiveItemReplaceMethod_MAX = 3,
};

enum class ETreePrimitiveType : uint8
{
	None                           = 0,
	Root                           = 1,
	Trunk                          = 2,
	Branch                         = 3,
	Leaf                           = 4,
	Socketable                     = 5,
	ETreePrimitiveType_MAX         = 6,
};

enum class EFloatRoundingMode : uint8
{
	Round                          = 0,
	Floor                          = 1,
	Ceiling                        = 2,
	EFloatRoundingMode_MAX         = 3,
};

enum class EIcarusGameVersionFlags : uint8
{
	None                           = 0,
	Major                          = 1,
	Minor                          = 2,
	Patch                          = 4,
	Changelist                     = 8,
	BuildType                      = 16,
	FeatureLevel                   = 32,
	Numbers                        = 15,
	All                            = 63,
	EIcarusGameVersionFlags_MAX    = 64,
};

enum class EVocalisationPlayResult : uint8
{
	Cancelled                      = 0,
	Played                         = 1,
	Queued                         = 2,
	EVocalisationPlayResult_MAX    = 3,
};

enum class EVocalisationPriority : uint8
{
	Lowest                         = 0,
	Low                            = 1,
	Medium                         = 2,
	High                           = 3,
	Highest                        = 4,
	EVocalisationPriority_MAX      = 5,
};

enum class EVocalisationInterruptType : uint8
{
	Interrupt                      = 0,
	Cancel                         = 1,
	Queue                          = 2,
	EVocalisationInterruptType_MAX = 3,
};

enum class EVoxelMinedState : uint8
{
	NotMined                       = 0,
	PartiallyMined                 = 1,
	FullyMined                     = 2,
	EVoxelMinedState_MAX           = 3,
};

enum class EUVWrapMethod : uint8
{
	UV_TripleProjection            = 0,
	UV_ZProjection                 = 1,
	UV_Spherical                   = 2,
	UV_MAX                         = 3,
};

enum class EVoxelResourceCategory : uint8
{
	None                           = 0,
	Stone                          = 1,
	Metal                          = 2,
	Oxite                          = 3,
	Copper                         = 4,
	Gold                           = 5,
	Bauxite                        = 6,
	Sulfur                         = 7,
	Silica                         = 8,
	Ice                            = 9,
	Platinum                       = 10,
	Titanium                       = 11,
	Coal                           = 12,
	Exotic_A                       = 13,
	Salt                           = 14,
	Limestone                      = 15,
	EVoxelResourceCategory_MAX     = 16,
};

enum class EWeaponAimingFMODParam : uint8
{
	NotAiming                      = 0,
	Aiming                         = 1,
	EWeaponAimingFMODParam_MAX     = 2,
};

enum class EWeaponChargingFMODParam : uint8
{
	NotCharging                    = 0,
	Charging                       = 1,
	EWeaponChargingFMODParam_MAX   = 2,
};

enum class EWeaponReloadingFMODParam : uint8
{
	NotReloading                   = 0,
	Reloading                      = 1,
	EWeaponReloadingFMODParam_MAX  = 2,
};


//---------------------------------------------------------------------------------------------------------------------
// STRUCTS
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.CriticalHitAreasEnum
struct FCriticalHitAreasEnum : public FRowEnum
{
public:
};

// 0xD8 (0xD8 - 0x0)
// ScriptStruct Icarus.IcarusDamagePacket
struct FIcarusDamagePacket
{
public:
	struct FDamageEvent                          DamageEvent;                                       // 0x0(0x10)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                        TotalDamage;                                       // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AppliedDamage;                                     // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSuppressDamageNumbers;                            // 0x18(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89C8[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AController*                           EventInstigator;                                   // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                DamageCauser;                                      // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FHitResult                            HitResult;                                         // 0x30(0x88)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	float                                        Timestamp;                                         // 0xB8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bWasRadialDamage;                                  // 0xBC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsKillCam;                                        // 0xBD(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89C9[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FCriticalHitAreasEnum                 CriticalHitArea;                                   // 0xC0(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsStealthHit;                                     // 0xD0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89CA[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.ExperienceEventsRowHandle
struct FExperienceEventsRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.StatCategoriesEnum
struct FStatCategoriesEnum : public FRowEnum
{
public:
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Icarus.ProjectileFireParams
struct FProjectileFireParams
{
public:
	float                                        RangedWeaponDamageMultiplier;                      // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUnbreakable;                                      // 0x4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EProjectileBreakModifier          ProjectileBreakModifier;                           // 0x5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EStealthAttackType                StealthAttack;                                     // 0x6(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOwnerHighlightProjectile;                         // 0x7(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8C (0x8C - 0x0)
// ScriptStruct Icarus.ViewTraceResult
struct FViewTraceResult
{
public:
	struct FHitResult                            Hit;                                               // 0x0(0x88)(BlueprintVisible, IsPlainOldData, NoDestructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	enum class EViewTraceHitType                 Type;                                              // 0x88(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89CB[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.GOAPPropertiesRowHandle
struct FGOAPPropertiesRowHandle : public FRowHandle
{
public:
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Icarus.FLODInstanceID
struct FFLODInstanceID
{
public:
	TWeakObjectPtr<class AFLODTile>              FLODTile;                                          // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RecordIndex;                                       // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InstanceIndex;                                     // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0x1C - 0x10)
// ScriptStruct Icarus.FLODActorRecordInstance
struct FFLODActorRecordInstance : public FFLODInstanceID
{
public:
	int32                                        LevelIndex;                                        // 0x10(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  TileName;                                          // 0x14(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.TalentsRowHandle
struct FTalentsRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.WeatherEventsRowHandle
struct FWeatherEventsRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.ItemsStaticRowHandle
struct FItemsStaticRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.StatsEnum
struct FStatsEnum : public FRowEnum
{
public:
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Icarus.IcarusStatReplicated
struct FIcarusStatReplicated
{
public:
	struct FStatsEnum                            Stat;                                              // 0x0(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Value;                                             // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89CC[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.AlterationsEnum
struct FAlterationsEnum : public FRowEnum
{
public:
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.LivingItemUpgradesEnum
struct FLivingItemUpgradesEnum : public FRowEnum
{
public:
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Icarus.LivingItemUpgradeSlot
struct FLivingItemUpgradeSlot
{
public:
	struct FLivingItemUpgradesEnum               UpgradeSelection;                                  // 0x0(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        UnlockProgress;                                    // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89CD[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Icarus.CustomProperties
struct FCustomProperties
{
public:
	TArray<struct FIcarusStatReplicated>         StaticWorldStats;                                  // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FIcarusStatReplicated>         StaticWorldHeldStats;                              // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FIcarusStatReplicated>         Stats;                                             // 0x20(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAlterationsEnum>              Alterations;                                       // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FLivingItemUpgradeSlot>        LivingItemSlots;                                   // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x8 (0x20 - 0x18)
// ScriptStruct Icarus.ItemDynamicData
struct FItemDynamicData : public FIcarusTableRowBase
{
public:
	enum class EDynamicItemProperties            PropertyType;                                      // 0x18(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89CE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Value;                                             // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x108 (0x108 - 0x0)
// ScriptStruct Icarus.StatContainer
struct FStatContainer
{
public:
	uint8                                        Pad_89CF[0xF8];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UIcarusStatContainer*                  IcarusStatComponent;                               // 0xF8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_89D0[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x110 (0x110 - 0x0)
// ScriptStruct Icarus.CachedItemStatContainer
struct FCachedItemStatContainer
{
public:
	struct FStatContainer                        StatContainer;                                     // 0x0(0x108)(Transient, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                         bHasBuilt;                                         // 0x108(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsHeldItem;                                       // 0x109(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIncludesAlterations;                              // 0x10A(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89D1[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1D8 (0x1F0 - 0x18)
// ScriptStruct Icarus.ItemData
struct FItemData : public FIcarusTableRowBase
{
public:
	struct FItemsStaticRowHandle                 ItemStaticData;                                    // 0x18(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FItemDynamicData>              ItemDynamicData;                                   // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FIcarusStatReplicated>         ItemCustomStats;                                   // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FCustomProperties                     CustomProperties;                                  // 0x50(0x50)(NativeAccessSpecifierPublic)
	struct FCachedItemStatContainer              CachedStats;                                       // 0xA0(0x110)(Transient, RepSkip, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                         bIsItemInstance;                                   // 0x1B0(0x1)(ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89D2[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                DatabaseGUID;                                      // 0x1B8(0x10)(ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemOwnerLookupId;                                 // 0x1C8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89D3[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 RuntimeTags;                                       // 0x1D0(0x20)(NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct Icarus.IcarusPlayerChatMessage
struct FIcarusPlayerChatMessage
{
public:
	class FString                                PlayerID;                                          // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                PlayerName;                                        // 0x10(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            PlayerIcon;                                        // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                PlayerColour;                                      // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89D4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Message;                                           // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.BestiaryDataRowHandle
struct FBestiaryDataRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.FishDataRowHandle
struct FFishDataRowHandle : public FRowHandle
{
public:
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Icarus.FishTypeTracking
struct FFishTypeTracking
{
public:
	struct FFishDataRowHandle                    FishRow;                                           // 0x0(0x18)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxQuality;                                        // 0x18(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxWeight;                                         // 0x1C(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxLength;                                         // 0x20(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CaughtCount;                                       // 0x24(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Icarus.TalentModelData
struct FTalentModelData
{
public:
	enum class ETalentState                      State;                                             // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89D5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Rank;                                              // 0x4(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxRank;                                           // 0x8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLocked;                                           // 0xC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89D6[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Icarus.LastProspectHostInfo
struct FLastProspectHostInfo
{
public:
	enum class ELastProspectHostType             LastHostType;                                      // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89D7[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                SteamP2PHostId;                                    // 0x8(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                DedicatedServerIP;                                 // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                CachedServerName;                                  // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC8 (0xC8 - 0x0)
// ScriptStruct Icarus.AssociatedProspectInfo
struct FAssociatedProspectInfo
{
public:
	struct FProspectInfo                         AssociatedProspect;                                // 0x0(0x90)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLastProspectHostInfo                 HostedBy;                                          // 0x90(0x38)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.FieldGuideCategoriesRowHandle
struct FFieldGuideCategoriesRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.DialogueRowHandle
struct FDialogueRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.FactionMissionsRowHandle
struct FFactionMissionsRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.ProspectForecastRowHandle
struct FProspectForecastRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.ProcessorRecipesRowHandle
struct FProcessorRecipesRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.FarmingSeedsRowHandle
struct FFarmingSeedsRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.StatsRowHandle
struct FStatsRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.StatAfflictionsRowHandle
struct FStatAfflictionsRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.IcarusAttachmentsRowHandle
struct FIcarusAttachmentsRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.MetaCurrencyRowHandle
struct FMetaCurrencyRowHandle : public FRowHandle
{
public:
};

// 0x1C (0x1C - 0x0)
// ScriptStruct Icarus.TimeLockedMissionInfo
struct FTimeLockedMissionInfo
{
public:
	struct FFactionMissionsRowHandle             Mission;                                           // 0x0(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LockedUntilProspectTime;                           // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x3D0 (0x3D0 - 0x0)
// ScriptStruct Icarus.PlayerLoadoutData
struct FPlayerLoadoutData
{
public:
	struct FItemData                             EnviroSuit;                                        // 0x0(0x1F0)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FDropship                             Dropship;                                          // 0x1F0(0xE0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FItemData>                     MetaItems;                                         // 0x2D0(0x10)(Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FProspectInfo                         AssociatedProspect;                                // 0x2E0(0x90)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLastProspectHostInfo                 HostedBy;                                          // 0x370(0x38)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                         bInsured;                                          // 0x3A8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSettled;                                          // 0x3A9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89D8[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int64                                        LoadoutClaimTime;                                  // 0x3B0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ChrSlot;                                           // 0x3B8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89D9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Guid;                                              // 0x3C0(0x10)(Edit, BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.ErrorCodesEnum
struct FErrorCodesEnum : public FRowEnum
{
public:
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.LogCategoriesEnum
struct FLogCategoriesEnum : public FRowEnum
{
public:
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Icarus.IcarusLogEntry
struct FIcarusLogEntry
{
public:
	struct FLogCategoriesEnum                    OutputCategory;                                    // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ELevel                            LogLevel;                                          // 0x10(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89DA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                LogMessage;                                        // 0x18(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                             Timestamp;                                         // 0x28(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.AccoladesRowHandle
struct FAccoladesRowHandle : public FRowHandle
{
public:
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Icarus.AccoladeCompletedState
struct FAccoladeCompletedState
{
public:
	struct FAccoladesRowHandle                   Accolade;                                          // 0x0(0x18)(BlueprintVisible, BlueprintReadOnly, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDateTime                             TimeCompleted;                                     // 0x18(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                ProspectID;                                        // 0x20(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Icarus.IcarusPlayerPersona
struct FIcarusPlayerPersona
{
public:
	class FString                                PlayerID;                                          // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  Name;                                              // 0x10(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	class UTexture2D*                            Avatar;                                            // 0x28(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Icarus.GetIcarusPlayerPersonaResult
struct FGetIcarusPlayerPersonaResult
{
public:
	struct FIcarusPlayerPersona                  Persona;                                           // 0x0(0x30)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	enum class ERequestPlayerPersonaErrorCode    ErrorCode;                                         // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSuccess;                                          // 0x31(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89DB[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Icarus.PlayerCharacterID
struct FPlayerCharacterID
{
public:
	class FString                                PlayerID;                                          // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ChrSlot;                                           // 0x10(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89DC[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Icarus.ConnectedPlayer
struct FConnectedPlayer
{
public:
	struct FPlayerCharacterID                    PlayerCharacterID;                                 // 0x0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AIcarusPlayerController*               PlayerController;                                  // 0x18(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AIcarusPlayerCharacter*                PlayerCharacter;                                   // 0x20(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AIcarusPlayerState*                    PlayerState;                                       // 0x28(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ConnectionStartTime;                               // 0x30(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ConnectionCompleteTime;                            // 0x34(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.PlayerTrackersRowHandle
struct FPlayerTrackersRowHandle : public FRowHandle
{
public:
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Icarus.Subtitle
struct FSubtitle
{
public:
	class FText                                  Text;                                              // 0x0(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  SpeakerName;                                       // 0x18(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                        Length;                                            // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Time;                                              // 0x34(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.BiomesRowHandle
struct FBiomesRowHandle : public FRowHandle
{
public:
};

// 0x24 (0x24 - 0x0)
// ScriptStruct Icarus.ProcessingItem
struct FProcessingItem
{
public:
	TWeakObjectPtr<class AIcarusPlayerCharacter> CraftingPlayer;                                    // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FProcessorRecipesRowHandle            Recipe;                                            // 0x8(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CraftCount;                                        // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.PlayerAccoladeCategoriesEnum
struct FPlayerAccoladeCategoriesEnum : public FRowEnum
{
public:
};

// 0xE8 (0x100 - 0x18)
// ScriptStruct Icarus.AccoladeData
struct FAccoladeData : public FIcarusTableRowBase
{
public:
	class FText                                  DisplayName;                                       // 0x18(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x30(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             Icon;                                              // 0x48(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UAccoladeImpl>           AccoladeImpl;                                      // 0x70(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPlayerAccoladeCategoriesEnum         Category;                                          // 0x98(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FPlayerTrackersRowHandle              Tracker;                                           // 0xA8(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 Tags;                                              // 0xC0(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FRowHandle>                    ExtraDatas;                                        // 0xE0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        GoalCount;                                         // 0xF0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  SteamAchievementId;                                // 0xF4(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89DD[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Icarus.TrackerTaskListProgress
struct FTrackerTaskListProgress
{
public:
	TSet<class FName>                            CompletedTasks;                                    // 0x0(0x50)(BlueprintVisible, BlueprintReadOnly, SaveGame, NativeAccessSpecifierPublic)
};

// 0xB0 (0xB0 - 0x0)
// ScriptStruct Icarus.AccoladeSaveData
struct FAccoladeSaveData
{
public:
	TArray<struct FAccoladeCompletedState>       CompletedAccolades;                                // 0x0(0x10)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	TMap<struct FPlayerTrackersRowHandle, int32> PlayerTrackers;                                    // 0x10(0x50)(SaveGame, NativeAccessSpecifierPublic)
	TMap<struct FPlayerTrackersRowHandle, struct FTrackerTaskListProgress> PlayerTaskListTrackers;                            // 0x60(0x50)(SaveGame, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.AccoladesEnum
struct FAccoladesEnum : public FRowEnum
{
public:
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Icarus.AccoladeTaskState
struct FAccoladeTaskState
{
public:
	class FText                                  TaskName;                                          // 0x0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	bool                                         bComplete;                                         // 0x18(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89DE[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.AccountFlag
struct FAccountFlag : public FIcarusTableRowBase
{
public:
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.AccountFlagsEnum
struct FAccountFlagsEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.AccountFlagsRowHandle
struct FAccountFlagsRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.StaminaActionCostsRowHandle
struct FStaminaActionCostsRowHandle : public FRowHandle
{
public:
};

// 0x1C (0x1C - 0x0)
// ScriptStruct Icarus.ActionStaminaCostEventPairing
struct FActionStaminaCostEventPairing
{
public:
	enum class EActionableEventType              Event;                                             // 0x0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89DF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FStaminaActionCostsRowHandle          StaminaCost;                                       // 0x4(0x18)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.ActionsRowHandle
struct FActionsRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.ModifierStatesRowHandle
struct FModifierStatesRowHandle : public FRowHandle
{
public:
};

// 0x68 (0x68 - 0x0)
// ScriptStruct Icarus.ActionList
struct FActionList
{
public:
	TMap<enum class EActionableEventType, struct FStaminaActionCostsRowHandle> InputTypes;                                        // 0x0(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FModifierStatesRowHandle              ModifierState;                                     // 0x50(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x80 - 0x18)
// ScriptStruct Icarus.ActionableData
struct FActionableData : public FIcarusTableRowBase
{
public:
	TMap<struct FActionsRowHandle, struct FActionList> ActionMapping;                                     // 0x18(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                         bUseClientPrediction;                              // 0x68(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89E0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FRowHandle>                    GenericData;                                       // 0x70(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.ActionableEnum
struct FActionableEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.ActionableRowHandle
struct FActionableRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.ValidHitTypesRowHandle
struct FValidHitTypesRowHandle : public FRowHandle
{
public:
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Icarus.SuccessAnimSet
struct FSuccessAnimSet
{
public:
	struct FValidHitTypesRowHandle               SuccessType;                                       // 0x0(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                          SuccessMontageVariations;                          // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0xE8 (0x100 - 0x18)
// ScriptStruct Icarus.ActionData
struct FActionData : public FIcarusTableRowBase
{
public:
	TSubclassOf<class UActionableBehaviour>      Behaviour;                                         // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>           TP_ActionMontage;                                  // 0x20(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSuccessAnimSet>               TP_SuccessAnimations;                              // 0x48(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                          TP_ActionFailMontageVariations;                    // 0x58(0x10)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	TArray<class FName>                          TP_ActionMissMontageVariations;                    // 0x68(0x10)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UAnimMontage>           FP_ActionMontage;                                  // 0x78(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FSuccessAnimSet>               FP_SuccessAnimations;                              // 0xA0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class FName>                          FP_ActionFailMontageVariations;                    // 0xB0(0x10)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	TArray<class FName>                          FP_ActionMissMontageVariations;                    // 0xC0(0x10)(Edit, BlueprintVisible, ZeroConstructor, AdvancedDisplay, NativeAccessSpecifierPublic)
	class FName                                  BeginStaminaActionNotify;                          // 0xD0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         WaitForActionComplete;                             // 0xD8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89E1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ActionCooldown;                                    // 0xDC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FStatsEnum>                    CooldownMultipliers;                               // 0xE0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FStatsEnum                            RequiredStat;                                      // 0xF0(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.ActionsEnum
struct FActionsEnum : public FRowEnum
{
public:
};

// 0x40 (0x40 - 0x0)
// ScriptStruct Icarus.PrefabTriggerBox
struct FPrefabTriggerBox
{
public:
	struct FTransform                            Transform;                                         // 0x0(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                               BoxExtent;                                         // 0x30(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89E2[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x38 (0x38 - 0x0)
// ScriptStruct Icarus.PrefabFoliage
struct FPrefabFoliage
{
public:
	TSoftObjectPtr<class UFoliageType>           FoliageType;                                       // 0x0(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                    Instances;                                         // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Icarus.PrefabLavaFlowPoint
struct FPrefabLavaFlowPoint
{
public:
	struct FTransform                            Transform;                                         // 0x0(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                        FlowSpeed;                                         // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BaseToFlowing;                                     // 0x34(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Dryness;                                           // 0x38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EdgeTaper;                                         // 0x3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EdgeNoise;                                         // 0x40(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                             Scale;                                             // 0x44(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89E3[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Icarus.PrefabWaterfall
struct FPrefabWaterfall
{
public:
	struct FTransform                            Transform;                                         // 0x0(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                        Width;                                             // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Height;                                            // 0x34(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Curve;                                             // 0x38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MeshType;                                          // 0x3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseCalmVariant;                                   // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsInCave;                                         // 0x41(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsLava;                                           // 0x42(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89E4[0xD];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.WaterSetupRowHandle
struct FWaterSetupRowHandle : public FRowHandle
{
public:
};

// 0x70 (0x70 - 0x0)
// ScriptStruct Icarus.PrefabLake
struct FPrefabLake
{
public:
	struct FTransform                            Transform;                                         // 0x0(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FWaterSetupRowHandle                  WaterSetup;                                        // 0x30(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESplineLoopDirection              SplineDirection;                                   // 0x48(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89E5[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVector>                       EdgeSplinePoints;                                  // 0x50(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        EdgeSplineDensity;                                 // 0x60(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89E6[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Icarus.PrefabTransform
struct FPrefabTransform
{
public:
	struct FTransform                            Transform;                                         // 0x0(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct Icarus.PrefabActorClass
struct FPrefabActorClass
{
public:
	TSubclassOf<class AActor>                    ActorClass;                                        // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89E7[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            Transform;                                         // 0x10(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x80 (0x80 - 0x0)
// ScriptStruct Icarus.PrefabCaveLight
struct FPrefabCaveLight
{
public:
	struct FTransform                            Transform;                                         // 0x0(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	enum class ECaveLightType                    LightType;                                         // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bTrackSun;                                         // 0x31(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89E8[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        SunlightPercentage;                                // 0x34(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FColor                                LightTint;                                         // 0x38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Intensity;                                         // 0x3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCastShadows;                                      // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89E9[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        VolumetricScatteringIntensity;                     // 0x44(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCastVolumetricShadow;                             // 0x48(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89EA[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MaxDrawDistance;                                   // 0x4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Temperature;                                       // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseTemperature;                                   // 0x54(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89EB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AttenuationRadius;                                 // 0x58(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InnerConeAngle;                                    // 0x5C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OuterConeAngle;                                    // 0x60(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SourceRadius;                                      // 0x64(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SourceWidth;                                       // 0x68(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SourceHeight;                                      // 0x6C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BarnDoorAngle;                                     // 0x70(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89EC[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xB0 (0xB0 - 0x0)
// ScriptStruct Icarus.PrefabStaticMesh
struct FPrefabStaticMesh
{
public:
	TSoftObjectPtr<class UStaticMesh>            StaticMesh;                                        // 0x0(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<int32, TSoftObjectPtr<class UMaterialInterface>> MaterialOverrides;                                 // 0x28(0x50)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	uint8                                        Pad_89ED[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            Transform;                                         // 0x80(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Icarus.ModifierStateSaveData
struct FModifierStateSaveData
{
public:
	class FName                                  RowName;                                           // 0x0(0x8)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeRemaining;                                     // 0x8(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InitialModifierLifeTime;                           // 0xC(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DurationBuffModifier;                              // 0x10(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ModifierEffectiveness;                             // 0x14(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Icarus.SerializedActorArray
struct FSerializedActorArray
{
public:
	uint8                                        Pad_89EE[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Icarus.SerializedIcarusActorRef
struct FSerializedIcarusActorRef
{
public:
	uint8                                        Pad_89EF[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1C (0x1C - 0x0)
// ScriptStruct Icarus.FLODActorComponentSaveData
struct FFLODActorComponentSaveData
{
public:
	class FName                                  TileName;                                          // 0x0(0x8)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LevelIndex;                                        // 0x8(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RecordIndex;                                       // 0xC(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        InstanceIndex;                                     // 0x10(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSpawnedFromPool;                                  // 0x14(0x1)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bIsReservingInstance;                              // 0x15(0x1)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89F0[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        CurrentFLODState;                                  // 0x18(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Icarus.InventorySlotDynamicData
struct FInventorySlotDynamicData
{
public:
	int32                                        Index;                                             // 0x0(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Value;                                             // 0x4(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Icarus.InventorySlotStatData
struct FInventorySlotStatData
{
public:
	int32                                        Index;                                             // 0x0(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89F1[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                Name;                                              // 0x8(0x10)(ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Value;                                             // 0x18(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89F2[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Icarus.InventorySlotAlterationData
struct FInventorySlotAlterationData
{
public:
	class FString                                Name;                                              // 0x0(0x10)(ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Icarus.LivingItemSlotSaveData
struct FLivingItemSlotSaveData
{
public:
	int32                                        CurrentProgress;                                   // 0x0(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89F3[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                CurrentUpgrade;                                    // 0x8(0x10)(ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x68 (0x68 - 0x0)
// ScriptStruct Icarus.InventorySlotSaveData
struct FInventorySlotSaveData
{
public:
	int32                                        Location;                                          // 0x0(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  ItemStaticData;                                    // 0x4(0x8)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89F4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ItemGuid;                                          // 0x10(0x10)(ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemOwnerLookupId;                                 // 0x20(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89F5[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FInventorySlotDynamicData>     DynamicData;                                       // 0x28(0x10)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	TArray<struct FInventorySlotStatData>        AdditionalStats;                                   // 0x38(0x10)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	TArray<struct FInventorySlotAlterationData>  Alterations;                                       // 0x48(0x10)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	TArray<struct FLivingItemSlotSaveData>       LivingItemSlots;                                   // 0x58(0x10)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Icarus.InventorySaveData
struct FInventorySaveData
{
public:
	TArray<struct FInventorySlotSaveData>        Slots;                                             // 0x0(0x10)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	int32                                        InventoryID;                                       // 0x10(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89F6[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1 (0x1 - 0x0)
// ScriptStruct Icarus.GeneratorTraitRecord
struct FGeneratorTraitRecord
{
public:
	bool                                         bActive;                                           // 0x0(0x1)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// ScriptStruct Icarus.WaterTraitRecord
struct FWaterTraitRecord
{
public:
	bool                                         bActive;                                           // 0x0(0x1)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x1 (0x1 - 0x0)
// ScriptStruct Icarus.EnergyTraitRecord
struct FEnergyTraitRecord
{
public:
	bool                                         bActive;                                           // 0x0(0x1)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Icarus.LinearColorVariableRecord
struct FLinearColorVariableRecord
{
public:
	class FName                                  VariableName;                                      // 0x0(0x8)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          Variable;                                          // 0x8(0x10)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Icarus.ActorNameVariableRecord
struct FActorNameVariableRecord
{
public:
	class FName                                  VariableName;                                      // 0x0(0x8)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  Variable;                                          // 0x8(0x8)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// ScriptStruct Icarus.ActorBoolVariableRecord
struct FActorBoolVariableRecord
{
public:
	class FName                                  VariableName;                                      // 0x0(0x8)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bVariable;                                         // 0x8(0x1)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89F7[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xC (0xC - 0x0)
// ScriptStruct Icarus.ActorIntVariableRecord
struct FActorIntVariableRecord
{
public:
	class FName                                  VariableName;                                      // 0x0(0x8)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        IVariable;                                         // 0x8(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0x40 - 0x18)
// ScriptStruct Icarus.AfflictionChance
struct FAfflictionChance : public FIcarusTableRowBase
{
public:
	TArray<struct FModifierStatesRowHandle>      Afflictions;                                       // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FStatsEnum                            ChanceStat;                                        // 0x28(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ChanceInPercent;                                   // 0x38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DurationInSeconds;                                 // 0x3C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.AfflictionChanceEnum
struct FAfflictionChanceEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.AfflictionChanceRowHandle
struct FAfflictionChanceRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.VocalisationsRowHandle
struct FVocalisationsRowHandle : public FRowHandle
{
public:
};

// 0x48 (0x48 - 0x0)
// ScriptStruct Icarus.AIStateVocalisation
struct FAIStateVocalisation
{
public:
	struct FVocalisationsRowHandle               StateEnteredVocalisation;                          // 0x0(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVocalisationsRowHandle               StatePersistentVocalisation;                       // 0x18(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVocalisationsRowHandle               StateExitedVocalisation;                           // 0x30(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.CreatureAudioThreatDataRowHandle
struct FCreatureAudioThreatDataRowHandle : public FRowHandle
{
public:
};

// 0x1B8 (0x1D0 - 0x18)
// ScriptStruct Icarus.AIAudioData
struct FAIAudioData : public FIcarusTableRowBase
{
public:
	TSoftObjectPtr<class UFMODEvent>             FootstepSound;                                     // 0x18(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  FrontFootSocket;                                   // 0x40(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  RearFootSocket;                                    // 0x48(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  JumpSocket;                                        // 0x50(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFMODEvent>             MovementSound;                                     // 0x58(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFMODEvent>             DeathCollisionSound;                               // 0x80(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  DeathCollisionSocket;                              // 0xA8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFMODEvent>             WaterDeathSound;                                   // 0xB0(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  VocalisationSocket;                                // 0xD8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVocalisationsRowHandle               AttackVocalisation;                                // 0xE0(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVocalisationsRowHandle               FlinchVocalisation;                                // 0xF8(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVocalisationsRowHandle               DeathVocalisation;                                 // 0x110(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<enum class EAIAudioState, struct FAIStateVocalisation> StateVocalisations;                                // 0x128(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UCreatureAudioThreatComponent> ThreatComponentClass;                              // 0x178(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ThreatLevel;                                       // 0x1A0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCreatureAudioThreatDataRowHandle     ThreatConfig;                                      // 0x1A4(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EMusicConditionCombatState        CombatMusicConditionOverride;                      // 0x1BC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89F8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MusicConditionOverrideMinThreatLevel;              // 0x1C0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FootstepMaxDistance;                               // 0x1C4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FoliageCheckMaxDistance;                           // 0x1C8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUsesShelter;                                      // 0x1CC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89F9[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.AIAudioDataEnum
struct FAIAudioDataEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.AIAudioDataRowHandle
struct FAIAudioDataRowHandle : public FRowHandle
{
public:
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Icarus.EventCooldownList
struct FEventCooldownList
{
public:
	TArray<float>                                Cooldowns;                                         // 0x0(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Icarus.ActiveEvent
struct FActiveEvent
{
public:
	class AAIEvent*                              Event;                                             // 0x0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                InstigatorActor;                                   // 0x8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.VirtualStatsEnum
struct FVirtualStatsEnum : public FStatsEnum
{
public:
};

// 0x70 (0x88 - 0x18)
// ScriptStruct Icarus.AICreatureType
struct FAICreatureType : public FIcarusTableRowBase
{
public:
	class FText                                  CreatureName;                                      // 0x18(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTag                          Tag;                                               // 0x30(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVirtualStatsEnum                     SpawnStat;                                         // 0x38(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVirtualStatsEnum                     AdditionalDamageStat;                              // 0x48(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVirtualStatsEnum                     AdditionalResistanceStat;                          // 0x58(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FExperienceEventsRowHandle            SkinningXPEvent;                                   // 0x68(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          ParentCreatureTag;                                 // 0x80(0x8)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.AICreatureTypeEnum
struct FAICreatureTypeEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.AICreatureTypeRowHandle
struct FAICreatureTypeRowHandle : public FRowHandle
{
public:
};

// 0x30 (0x48 - 0x18)
// ScriptStruct Icarus.AIDescriptor
struct FAIDescriptor : public FIcarusTableRowBase
{
public:
	struct FGameplayTagContainer                 Tags;                                              // 0x18(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FStatsEnum>                    DescriptorStats;                                   // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.AIDescriptorsEnum
struct FAIDescriptorsEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.AIDescriptorsRowHandle
struct FAIDescriptorsRowHandle : public FRowHandle
{
public:
};

// 0x38 (0x50 - 0x18)
// ScriptStruct Icarus.AIEventData
struct FAIEventData : public FIcarusTableRowBase
{
public:
	TSoftClassPtr<class AAIEvent>                AIEventBehaviourClass;                             // 0x18(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxSimultaneousEvents;                             // 0x40(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CooldownDuration;                                  // 0x44(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CooldownRandomDeviation;                           // 0x48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStartOnCooldown;                                  // 0x4C(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89FA[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.AIEventsEnum
struct FAIEventsEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.AIEventsRowHandle
struct FAIEventsRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.BaseStatsEnum
struct FBaseStatsEnum : public FStatsEnum
{
public:
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Icarus.CustomScaledStat
struct FCustomScaledStat
{
public:
	struct FBaseStatsEnum                        Stat;                                              // 0x0(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                           Curve;                                             // 0x10(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x88 (0xA0 - 0x18)
// ScriptStruct Icarus.AIGrowth
struct FAIGrowth : public FIcarusTableRowBase
{
public:
	TMap<struct FBaseStatsEnum, int32>           Base;                                              // 0x18(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UCurveFloat*                           Health;                                            // 0x68(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                           MeleeDamage;                                       // 0x70(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                           MovementSpeed;                                     // 0x78(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCustomScaledStat>             CustomStats;                                       // 0x80(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	class UCurveFloat*                           ExperienceMultiplier;                              // 0x90(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                           ProtectiveThreatOverDistance;                      // 0x98(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.AIGrowthEnum
struct FAIGrowthEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.AIGrowthRowHandle
struct FAIGrowthRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.AIRelationshipsRowHandle
struct FAIRelationshipsRowHandle : public FRowHandle
{
public:
};

// 0x30 (0x48 - 0x18)
// ScriptStruct Icarus.AIRelationshipData
struct FAIRelationshipData : public FIcarusTableRowBase
{
public:
	TArray<struct FAIRelationshipsRowHandle>     HostileRelationships;                              // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAIRelationshipsRowHandle>     NeutralRelationships;                              // 0x28(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAIRelationshipsRowHandle>     FriendlyRelationships;                             // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.AIRelationshipsEnum
struct FAIRelationshipsEnum : public FRowEnum
{
public:
};

// 0x1C (0x1C - 0x0)
// ScriptStruct Icarus.MovementStateData
struct FMovementStateData
{
public:
	float                                        MaxWalkSpeed;                                      // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GroundFriction;                                    // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BrakingFriction;                                   // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxAcceleration;                                   // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BrakingDeceleration;                               // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RotationRate;                                      // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxSwimSpeed;                                      // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.GOAPSetupRowHandle
struct FGOAPSetupRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.TagQueriesRowHandle
struct FTagQueriesRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.HuntingSetupRowHandle
struct FHuntingSetupRowHandle : public FRowHandle
{
public:
};

// 0xC (0xC - 0x0)
// ScriptStruct Icarus.CriticalHitLocation
struct FCriticalHitLocation
{
public:
	class FName                                  BoneName;                                          // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         AffectsChildren;                                   // 0x8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89FB[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.ItemRewardsRowHandle
struct FItemRewardsRowHandle : public FRowHandle
{
public:
};

// 0x218 (0x230 - 0x18)
// ScriptStruct Icarus.AISetup
struct FAISetup : public FIcarusTableRowBase
{
public:
	TSoftClassPtr<class AActor>                  ActorClass;                                        // 0x18(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AController>             ControllerClass;                                   // 0x40(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAICreatureTypeRowHandle              CreatureType;                                      // 0x68(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAIDescriptorsRowHandle>       Descriptors;                                       // 0x80(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FItemsStaticRowHandle                 DeadItem;                                          // 0x90(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGOAPSetupRowHandle                   GOAPSetup;                                         // 0xA8(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavigationQueryFilter>    DefaultNavigationFilter;                           // 0xC0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAIRelationshipsRowHandle             Relationships;                                     // 0xC8(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTagQueriesRowHandle>          NotifiedNPCTypes;                                  // 0xE0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bNotifySelfType;                                   // 0xF0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89FC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAIGrowthRowHandle                    AIGrowth;                                          // 0xF4(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89FD[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<enum class EMovementState, struct FMovementStateData> MovementMapping;                                   // 0x110(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FHuntingSetupRowHandle                HuntingSetup;                                      // 0x160(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCriticalHitLocation>          CriticalHitBones;                                  // 0x178(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FAIAudioDataRowHandle                 Audio;                                             // 0x188(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class FName>                          CollisionHitEventBones;                            // 0x1A0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        LatentDeathDuration;                               // 0x1B0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FItemRewardsRowHandle                 Trophy;                                            // 0x1B4(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FItemRewardsRowHandle                 Loot;                                              // 0x1CC(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FItemRewardsRowHandle                 Hitable;                                           // 0x1E4(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseSurvivalCharacterState;                        // 0x1FC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStartWithSurvivalTickDisabled;                    // 0x1FD(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89FE[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBestiaryDataRowHandle                BestiaryGroup;                                     // 0x200(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCriticalHitLocation>          BlacklistBones;                                    // 0x218(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        MinimumSpawnGroupSize;                             // 0x228(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaximumSpawnGroupSize;                             // 0x22C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.AISetupEnum
struct FAISetupEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.AISetupRowHandle
struct FAISetupRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.AISpawnZonesRowHandle
struct FAISpawnZonesRowHandle : public FRowHandle
{
public:
};

// 0x1C (0x1C - 0x0)
// ScriptStruct Icarus.AISpawnZoneSetup
struct FAISpawnZoneSetup
{
public:
	struct FColor                                Color;                                             // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAISpawnZonesRowHandle                SpawnZone;                                         // 0x4(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.AISpawnRulesEnum
struct FAISpawnRulesEnum : public FRowEnum
{
public:
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Icarus.AISpawnRulesList
struct FAISpawnRulesList
{
public:
	TArray<struct FAISpawnRulesEnum>             SpawnRules;                                        // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x88 (0xA0 - 0x18)
// ScriptStruct Icarus.AISpawnConfigData
struct FAISpawnConfigData : public FIcarusTableRowBase
{
public:
	TMap<struct FAISetupEnum, struct FAISpawnRulesList> AISpawnRules;                                      // 0x18(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UGameplayTexture>       SpawnMap;                                          // 0x68(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAISpawnZoneSetup>             SpawnZones;                                        // 0x90(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Icarus.HeatmapAISpawnData
struct FHeatmapAISpawnData
{
public:
	TSoftObjectPtr<class UGameplayTexture>       HeatmapTexture;                                    // 0x0(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EHeatmapColorChannel              HeatmapTextureChannel;                             // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_89FF[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        HeatmapSpawnWeight;                                // 0x2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.AutonomousSpawnsRowHandle
struct FAutonomousSpawnsRowHandle : public FRowHandle
{
public:
};

// 0x68 (0x68 - 0x0)
// ScriptStruct Icarus.BiomeAISpawnData
struct FBiomeAISpawnData
{
public:
	TMap<struct FAISetupEnum, int32>             SpawnList;                                         // 0x0(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                        BiomeSpawnDensity;                                 // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A00[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FAutonomousSpawnsRowHandle>    RelevantAutonomousSpawners;                        // 0x58(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.AISpawnConfigEnum
struct FAISpawnConfigEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.AISpawnConfigRowHandle
struct FAISpawnConfigRowHandle : public FRowHandle
{
public:
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Icarus.SpawnBlocker
struct FSpawnBlocker
{
public:
	struct FVector                               BlockerLocation;                                   // 0x0(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ExpirationTime;                                    // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Duration;                                          // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHasPlayerLeftArea;                                // 0x14(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A01[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Icarus.TileSpawnData
struct FTileSpawnData
{
public:
	TArray<struct FVector>                       SpawnPoints;                                       // 0x0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, NativeAccessSpecifierPublic)
};

// 0x80 (0x98 - 0x18)
// ScriptStruct Icarus.AISpawnRuleData
struct FAISpawnRuleData : public FIcarusTableRowBase
{
public:
	TSoftClassPtr<class UIcarusAISpawnFilter>    SpawnFilter;                                       // 0x18(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         InverseCondition;                                  // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A02[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class FString, int32>                   FilterParams;                                      // 0x48(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.AISpawnRulesRowHandle
struct FAISpawnRulesRowHandle : public FRowHandle
{
public:
};

// 0x78 (0x90 - 0x18)
// ScriptStruct Icarus.AISpawnZones
struct FAISpawnZones : public FIcarusTableRowBase
{
public:
	struct FBiomeAISpawnData                     Creatures;                                         // 0x18(0x68)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                        MinLevel;                                          // 0x80(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MedianLevel;                                       // 0x84(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxLevel;                                          // 0x88(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A03[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.AISpawnZonesEnum
struct FAISpawnZonesEnum : public FRowEnum
{
public:
};

// 0xB8 (0xD0 - 0x18)
// ScriptStruct Icarus.Alteration
struct FAlteration : public FIcarusTableRowBase
{
public:
	class FText                                  DisplayName;                                       // 0x18(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             Icon;                                              // 0x30(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             RankIcon;                                          // 0x58(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FStatsEnum, int32>               Stats;                                             // 0x80(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.AlterationsRowHandle
struct FAlterationsRowHandle : public FRowHandle
{
public:
};

// 0x60 (0x78 - 0x18)
// ScriptStruct Icarus.AmmoTypeData
struct FAmmoTypeData : public FIcarusTableRowBase
{
public:
	int32                                        ProjectileCount;                                   // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ProjectileDamage;                                  // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                             ProjectileAccuracy;                                // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FStatsEnum, int32>               Stats;                                             // 0x28(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.AmmoTypesEnum
struct FAmmoTypesEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.AmmoTypesRowHandle
struct FAmmoTypesRowHandle : public FRowHandle
{
public:
};

// 0x24 (0x24 - 0x0)
// ScriptStruct Icarus.ExtensionLimitLimbDefinition
struct FExtensionLimitLimbDefinition
{
public:
	struct FBoneReference                        IKLimbBone;                                        // 0x0(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                        FKLimbBone;                                        // 0x10(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        NumBonesInLimb;                                    // 0x20(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0xD8 - 0xC8)
// ScriptStruct Icarus.AnimNode_ExtensionLimit
struct FAnimNode_ExtensionLimit : public FAnimNode_SkeletalControlBase
{
public:
	TArray<struct FExtensionLimitLimbDefinition> LimbDefinitions;                                   // 0xC8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x34 (0x34 - 0x0)
// ScriptStruct Icarus.SpeedWarping3DLimbDefinition
struct FSpeedWarping3DLimbDefinition
{
public:
	struct FBoneReference                        IKLimbBone;                                        // 0x0(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                        FKLimbBone;                                        // 0x10(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	struct FBoneReference                        IKLimbTargetBone;                                  // 0x20(0x10)(Edit, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        NumBonesInLimb;                                    // 0x30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x28 (0xF0 - 0xC8)
// ScriptStruct Icarus.AnimNode_SpeedWarping3D
struct FAnimNode_SpeedWarping3D : public FAnimNode_SkeletalControlBase
{
public:
	TArray<struct FSpeedWarping3DLimbDefinition> LimbDefinitions;                                   // 0xC8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	enum class EBoneControlSpace                 Space;                                             // 0xD8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECollisionChannel                 TraceProfile;                                      // 0xD9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A04[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Direction;                                         // 0xDC(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SpeedScaling;                                      // 0xE8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A05[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.ArmourSetBonusRowHandle
struct FArmourSetBonusRowHandle : public FRowHandle
{
public:
};

// 0x18 (0x30 - 0x18)
// ScriptStruct Icarus.ArmourSet
struct FArmourSet : public FIcarusTableRowBase
{
public:
	TArray<struct FArmourSetBonusRowHandle>      SetBonus;                                          // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	enum class EPlayerArmourTypeFMODParam        FMODParam;                                         // 0x28(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A06[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x70 (0x88 - 0x18)
// ScriptStruct Icarus.ArmourSetBonus
struct FArmourSetBonus : public FIcarusTableRowBase
{
public:
	int32                                        RequiredGear;                                      // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A07[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Description;                                       // 0x20(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<struct FBaseStatsEnum, int32>           StatsGranted;                                      // 0x38(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.ArmourSetsRowHandle
struct FArmourSetsRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.ArmourRowHandle
struct FArmourRowHandle : public FRowHandle
{
public:
};

// 0x2E8 (0x300 - 0x18)
// ScriptStruct Icarus.ArmourData
struct FArmourData : public FIcarusTableRowBase
{
public:
	TSoftObjectPtr<class USkeletalMesh>          ArmourMesh;                                        // 0x18(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USkeletalMesh>          HabArmourMesh;                                     // 0x40(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USkeletalMesh>          FemaleMeshVariant;                                 // 0x68(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USkeletalMesh>          FirstPersonMeshVariant;                            // 0x90(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideFirstPersonUndersuit;                         // 0xB8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A08[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UAnimInstance>           AnimBlueprintClass;                                // 0xC0(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UAnimInstance>           FemaleAnimBlueprintClass;                          // 0xE8(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UAnimInstance>           FirstPersonAnimBlueprintClass;                     // 0x110(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UGFurComponent>          TPFurClass;                                        // 0x138(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UGFurComponent>          FPFurClass;                                        // 0x160(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FBaseStatsEnum, int32>           ArmourStats;                                       // 0x188(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	enum class EArmourType                       ArmourType;                                        // 0x1D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A09[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FArmourSetsRowHandle                  ArmourSet;                                         // 0x1DC(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A0A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FArmourRowHandle>              ImplicitDefaultArmour;                             // 0x1F8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bOverrideDefaultMaterials;                         // 0x208(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A0B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<int32, TSoftObjectPtr<class UMaterialInterface>> ArmourMeshMaterialOverrides;                       // 0x210(0x50)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<int32, TSoftObjectPtr<class UMaterialInterface>> FemaleArmourMeshMaterialOverrides;                 // 0x260(0x50)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<int32, TSoftObjectPtr<class UMaterialInterface>> FPArmourMeshMaterialOverrides;                     // 0x2B0(0x50)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.ArmourEnum
struct FArmourEnum : public FRowEnum
{
public:
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.ArmourSetBonusEnum
struct FArmourSetBonusEnum : public FRowEnum
{
public:
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.ArmourSetsEnum
struct FArmourSetsEnum : public FRowEnum
{
public:
};

// 0x70 (0x88 - 0x18)
// ScriptStruct Icarus.AssetReferenceData
struct FAssetReferenceData : public FIcarusTableRowBase
{
public:
	enum class EAssetType                        AssetType;                                         // 0x18(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A0C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UObject>                 SoftClassPtr;                                      // 0x20(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UObject>                SoftObjectPtr;                                     // 0x48(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClass*                                HardClassPtr;                                      // 0x70(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UObject*                               HardObjectPtr;                                     // 0x78(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHardReference;                                    // 0x80(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPreload;                                          // 0x81(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A0D[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.AssetReferencesEnum
struct FAssetReferencesEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.AssetReferencesRowHandle
struct FAssetReferencesRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.AtmospheresEnum
struct FAtmospheresEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.AtmospheresRowHandle
struct FAtmospheresRowHandle : public FRowHandle
{
public:
};

// 0x40 (0x58 - 0x18)
// ScriptStruct Icarus.AttachmentIcon
struct FAttachmentIcon : public FIcarusTableRowBase
{
public:
	struct FTagQueriesRowHandle                  TagQuery;                                          // 0x18(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             Icon;                                              // 0x30(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.AttachmentIconsEnum
struct FAttachmentIconsEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.AttachmentIconsRowHandle
struct FAttachmentIconsRowHandle : public FRowHandle
{
public:
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Icarus.AudioContextCaveColliderSet
struct FAudioContextCaveColliderSet
{
public:
	TSet<class UPrimitiveComponent*>             Colliders;                                         // 0x0(0x50)(ExportObject, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Icarus.AudioContextSubscriber
struct FAudioContextSubscriber
{
public:
	class UFMODAudioComponent*                   AudioComponent;                                    // 0x0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A0E[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Icarus.AudioOcclusionSocketTracePoint
struct FAudioOcclusionSocketTracePoint
{
public:
	class FName                                  TraceName;                                         // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  TargetSocket;                                      // 0x8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USceneComponent*                       Target;                                            // 0x10(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x14 (0x14 - 0x0)
// ScriptStruct Icarus.AudioOcclusionTracePoint
struct FAudioOcclusionTracePoint
{
public:
	class FName                                  Name;                                              // 0x0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               Location;                                          // 0x8(0xC)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Icarus.AudioOcclusionTraceResult
struct FAudioOcclusionTraceResult
{
public:
	uint8                                        Pad_8A0F[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x40 - 0x18)
// ScriptStruct Icarus.AuraInfo
struct FAuraInfo : public FIcarusTableRowBase
{
public:
	struct FModifierStatesRowHandle              Modifier;                                          // 0x18(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStatsEnum                            Stat;                                              // 0x30(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Icarus.FindAuraResult
struct FFindAuraResult
{
public:
	struct FModifierStatesRowHandle              AuraType;                                          // 0x0(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UModifierStateComponent*               Component;                                         // 0x18(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x4 (0x4 - 0x0)
// ScriptStruct Icarus.AuraFlags
struct FAuraFlags
{
public:
	bool                                         EffectsSelf;                                       // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         EffectsPlayers;                                    // 0x1(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         EffectsNPCs;                                       // 0x2(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         EffectsDeployables;                                // 0x3(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.ModifierStateAudioDataRowHandle
struct FModifierStateAudioDataRowHandle : public FRowHandle
{
public:
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Icarus.RandomRangeValue
struct FRandomRangeValue
{
public:
	float                                        BaseValue;                                         // 0x0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Deviation;                                         // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x238 (0x250 - 0x18)
// ScriptStruct Icarus.ModifierStateData
struct FModifierStateData : public FIcarusTableRowBase
{
public:
	class UTexture2D*                            ModifierIcon;                                      // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EModifierType                     Type;                                              // 0x20(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A10[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  ModifierName;                                      // 0x28(0x18)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FText                                  ModifierDescription;                               // 0x40(0x18)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                         VisibleToPlayer;                                   // 0x58(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A11[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class USceneComponent>         CosmeticAttachComponent;                           // 0x60(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FModifierStateAudioDataRowHandle      AudioData;                                         // 0x88(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FStatsEnum, int32>               GrantedStats;                                      // 0xA0(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TArray<struct FStatsEnum>                    ModifierEffectivenessAffectors;                    // 0xF0(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                         bAura;                                             // 0x100(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A12[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        AuraRange;                                         // 0x104(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAuraFlags                            AuraFlags;                                         // 0x108(0x4)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	struct FModifierStatesRowHandle              ModifierGrantedByAura;                             // 0x10C(0x18)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEscalates;                                        // 0x124(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A13[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAfflictionChanceRowHandle            Escalation;                                        // 0x128(0x18)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        EscalationTime;                                    // 0x140(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRemovedOnEscalation;                              // 0x144(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A14[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class UModifierStateComponent> Behaviour;                                         // 0x148(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class FString, struct FRandomRangeValue> ModifierVariables;                                 // 0x170(0x50)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                         ShouldTick;                                        // 0x1C0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         TickOnApply;                                       // 0x1C1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A15[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ModifierTickRate;                                  // 0x1C4(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FStatsEnum>                    ModifierLifetimeAffectors;                         // 0x1C8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                         RemovedOnDeath;                                    // 0x1D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EModifierMergeType                MergeType;                                         // 0x1D9(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A16[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        MaxStackNum;                                       // 0x1DC(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 ModifierTags;                                      // 0x1E0(0x20)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                     ModifierAllowedQuery;                              // 0x200(0x48)(Edit, BlueprintVisible, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                         bEffectsObjects;                                   // 0x248(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEffectsNPCs;                                      // 0x249(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEffectsPlayers;                                   // 0x24A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         SaveToDatabase;                                    // 0x24B(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         RemovedOnClick;                                    // 0x24C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A17[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x2C8 (0x2C8 - 0x0)
// ScriptStruct Icarus.AuraInstance
struct FAuraInstance
{
public:
	struct FModifierStateData                    AuraModifier;                                      // 0x0(0x250)(NativeAccessSpecifierPublic)
	struct FModifierStatesRowHandle              ModifierRow;                                       // 0x250(0x18)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UModifierStateComponent*               OwningStateComp;                                   // 0x268(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<class AActor*, int32>                   CurrentAffectedActors;                             // 0x270(0x50)(NativeAccessSpecifierPublic)
	int32                                        AuraRange;                                         // 0x2C0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A18[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Icarus.AuraInstances
struct FAuraInstances
{
public:
	TArray<struct FAuraInstance>                 Instances;                                         // 0x0(0x10)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x90 (0xA8 - 0x18)
// ScriptStruct Icarus.AutonomousSpawnData
struct FAutonomousSpawnData : public FIcarusTableRowBase
{
public:
	struct FAISetupEnum                          AISetup;                                           // 0x18(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AIcarusActor>            IcarusActorClass;                                  // 0x28(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UObject>                 AISpawnBehaviour;                                  // 0x50(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxNumAroundPlayers;                               // 0x78(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxSpawnCount;                                     // 0x7C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxDistanceToPlayers;                              // 0x80(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A19[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 GameplayTagsToApply;                               // 0x88(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.AutonomousSpawnsEnum
struct FAutonomousSpawnsEnum : public FRowEnum
{
public:
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Icarus.PendingInventorySwap
struct FPendingInventorySwap
{
public:
	uint8                                        Pad_8A1A[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x40 - 0x18)
// ScriptStruct Icarus.BagPriorityData
struct FBagPriorityData : public FIcarusTableRowBase
{
public:
	struct FTagQueriesRowHandle                  ItemQuery;                                         // 0x18(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FItemsStaticRowHandle>         BagItems;                                          // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.BagPriorityEnum
struct FBagPriorityEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.BagPriorityRowHandle
struct FBagPriorityRowHandle : public FRowHandle
{
public:
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Icarus.BounceSettings
struct FBounceSettings
{
public:
	bool                                         bBounceAngleAffectsFriction;                       // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A1B[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Bounciness;                                        // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Friction;                                          // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BounceVelocityStopSimulatingThreshold;             // 0xC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinFrictionFraction;                               // 0x10(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinTimeBetweenBounces;                             // 0x14(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x58 (0x58 - 0x0)
// ScriptStruct Icarus.BallisticAudioData
struct FBallisticAudioData
{
public:
	TSoftObjectPtr<class UFMODEvent>             FlySound;                                          // 0x0(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFMODEvent>             ImpactSound;                                       // 0x28(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPlayImpactSoundOnPayload;                         // 0x50(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A1C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1C8 (0x1E0 - 0x18)
// ScriptStruct Icarus.BallisticData
struct FBallisticData : public FIcarusTableRowBase
{
public:
	TSoftClassPtr<class UBallisticComponent>     Behaviour;                                         // 0x18(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Damage;                                            // 0x40(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DamageVariationPercentage;                         // 0x44(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanStealthAttack;                                 // 0x48(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHomingProjectile;                                 // 0x49(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanKillCam;                                       // 0x4A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUnbreakableDuringKillCam;                         // 0x4B(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Weight;                                            // 0x4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GravityScale;                                      // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         AllowPickupAfterSettle;                            // 0x54(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A1D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftClassPtr<class AIcarusPayload>          PayloadClass;                                      // 0x58(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPayloadDeploymentType            PayloadDeploymentType;                             // 0x80(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A1E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        PayloadDeploymentTimerDelay;                       // 0x84(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFXSystemAsset>         TrailParticle;                                     // 0x88(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BreakChance;                                       // 0xB0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DurabilityDamage;                                  // 0xB4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PostDeployLifetime;                                // 0xB8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CullDistanceSquared;                               // 0xBC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         AttachOnHit;                                       // 0xC0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A1F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBounceSettings                       ProjectileBounceSettings;                          // 0xC4(0x18)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A20[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UStaticMesh>            OverrideStaticMesh;                                // 0xE0(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class USkeletalMesh>          OverrideSkeletalMesh;                              // 0x108(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UPhysicsAsset>          OverridePhysicsAsset;                              // 0x130(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         RotationFollowsVelocity;                           // 0x158(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A21[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              VelocityRotationOffset;                            // 0x15C(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FRotator                              AngularRotation;                                   // 0x168(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                               SpawnPositionOffset;                               // 0x174(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBallisticAudioData                   AudioData;                                         // 0x180(0x58)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	bool                                         bUseActorPooling;                                  // 0x1D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisableRecorderComponent;                         // 0x1D9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A22[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        OnHitAINoiseEventRange;                            // 0x1DC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.BallisticEnum
struct FBallisticEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.BallisticRowHandle
struct FBallisticRowHandle : public FRowHandle
{
public:
};

// 0x40 (0x40 - 0x0)
// ScriptStruct Icarus.FiredProjectileInfo
struct FFiredProjectileInfo
{
public:
	struct FTransform                            SpawnTransform;                                    // 0x0(0x30)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                        SpawnTimeInGameSeconds;                            // 0x30(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TWeakObjectPtr<class AIcarusItem>            Projectile;                                        // 0x34(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A23[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x34 - 0xC)
// ScriptStruct Icarus.FishDataFastArrayItem
struct FFishDataFastArrayItem : public FFastArraySerializerItem
{
public:
	struct FFishDataRowHandle                    FishRow;                                           // 0xC(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxQuality;                                        // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxWeight;                                         // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxLength;                                         // 0x2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CaughtCount;                                       // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x158 - 0x108)
// ScriptStruct Icarus.FishDataFastArray
struct FFishDataFastArray : public FFastArraySerializer
{
public:
	TArray<struct FFishDataFastArrayItem>        FishEntries;                                       // 0x108(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A24[0x40];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x1C (0x28 - 0xC)
// ScriptStruct Icarus.BestiaryFastArrayItem
struct FBestiaryFastArrayItem : public FFastArraySerializerItem
{
public:
	struct FBestiaryDataRowHandle                BestiaryRowHandle;                                 // 0xC(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PointScore;                                        // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x158 - 0x108)
// ScriptStruct Icarus.BestiaryFastArray
struct FBestiaryFastArray : public FFastArraySerializer
{
public:
	TArray<struct FBestiaryFastArrayItem>        BestiaryEntries;                                   // 0x108(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A25[0x40];                                    // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.TerrainsRowHandle
struct FTerrainsRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.BestiaryTraitsRowHandle
struct FBestiaryTraitsRowHandle : public FRowHandle
{
public:
};

// 0x1C0 (0x1D8 - 0x18)
// ScriptStruct Icarus.BestiaryData
struct FBestiaryData : public FIcarusTableRowBase
{
public:
	class FText                                  CreatureName;                                      // 0x18(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             Image;                                             // 0x30(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PopupImageScale;                                   // 0x58(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                             PopupImageOffset;                                  // 0x5C(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBiomeImageType                   BiomeImageType;                                    // 0x64(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A26[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UFMODEvent>             CreatureSound;                                     // 0x68(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAISetupRowHandle>             SpecificCreatures;                                 // 0x90(0x10)(Edit, ZeroConstructor, Transient, EditConst, NativeAccessSpecifierPublic)
	TArray<struct FAtmospheresRowHandle>         Biomes;                                            // 0xA0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FTerrainsRowHandle>            Maps;                                              // 0xB0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        TotalPointsRequired;                               // 0xC0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A27[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Lore1;                                             // 0xC8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  Lore2;                                             // 0xE0(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  Lore3;                                             // 0xF8(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FBestiaryTraitsRowHandle>      Traits;                                            // 0x110(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<struct FBaseStatsEnum, int32>           StatsUnlock1;                                      // 0x120(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TMap<struct FBaseStatsEnum, int32>           StatsUnlock2;                                      // 0x170(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<struct FBaseStatsEnum>                ProgressiveStat;                                   // 0x1C0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bIsBoss;                                           // 0x1D0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A28[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.BestiaryDataEnum
struct FBestiaryDataEnum : public FRowEnum
{
public:
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Icarus.FishRarity
struct FFishRarity
{
public:
	TArray<struct FFishDataRowHandle>            Fish;                                              // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Icarus.FishCategory
struct FFishCategory
{
public:
	TMap<enum class EFishRarity, struct FFishRarity> Rarity;                                            // 0x0(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Icarus.BestiaryBiome
struct FBestiaryBiome
{
public:
	TArray<struct FBestiaryDataRowHandle>        Creatures;                                         // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Icarus.BestiaryCategory
struct FBestiaryCategory
{
public:
	TMap<struct FAtmospheresRowHandle, struct FBestiaryBiome> Biomes;                                            // 0x0(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x8 (0x20 - 0x18)
// ScriptStruct Icarus.BestiaryPoints
struct FBestiaryPoints : public FIcarusTableRowBase
{
public:
	int32                                        PointsAwarded;                                     // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A29[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.BestiaryPointsEnum
struct FBestiaryPointsEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.BestiaryPointsRowHandle
struct FBestiaryPointsRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.BestiaryTraitTypesRowHandle
struct FBestiaryTraitTypesRowHandle : public FRowHandle
{
public:
};

// 0x68 (0x80 - 0x18)
// ScriptStruct Icarus.BestiaryTraitData
struct FBestiaryTraitData : public FIcarusTableRowBase
{
public:
	class FText                                  TraitName;                                         // 0x18(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FBestiaryTraitTypesRowHandle          Type;                                              // 0x30(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          OverrideColor;                                     // 0x48(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             OverrideIcon;                                      // 0x58(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.BestiaryTraitsEnum
struct FBestiaryTraitsEnum : public FRowEnum
{
public:
};

// 0x38 (0x50 - 0x18)
// ScriptStruct Icarus.BestiaryTraitType
struct FBestiaryTraitType : public FIcarusTableRowBase
{
public:
	struct FLinearColor                          Color;                                             // 0x18(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             Icon;                                              // 0x28(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.BestiaryTraitTypesEnum
struct FBestiaryTraitTypesEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.MusicLocationConditionsRowHandle
struct FMusicLocationConditionsRowHandle : public FRowHandle
{
public:
};

// 0x70 (0x88 - 0x18)
// ScriptStruct Icarus.BiomeAudioData
struct FBiomeAudioData : public FIcarusTableRowBase
{
public:
	enum class EGlobalEnvironmentBiomeFMODParam  BiomeFMODParam;                                    // 0x18(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A2A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FMusicLocationConditionsRowHandle     MusicLocationCondition;                            // 0x1C(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A2B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UFMODEvent>             AudioAmbienceBase;                                 // 0x38(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFMODEvent>             AudioAmbienceTransitional;                         // 0x60(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.BiomeAudioDataEnum
struct FBiomeAudioDataEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.BiomeAudioDataRowHandle
struct FBiomeAudioDataRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.BiomesEnum
struct FBiomesEnum : public FRowEnum
{
public:
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Icarus.PersistentBlockerRecord
struct FPersistentBlockerRecord
{
public:
	uint8                                        Pad_8A2C[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                BlockerActorClassName;                             // 0x8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        BlockerActorIcarusUID;                             // 0x18(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A2D[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.CharacterFlagsRowHandle
struct FCharacterFlagsRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.ItemableRowHandle
struct FItemableRowHandle : public FRowHandle
{
public:
};

// 0x40 (0x58 - 0x18)
// ScriptStruct Icarus.BlueprintUnlock
struct FBlueprintUnlock : public FIcarusTableRowBase
{
public:
	struct FItemableRowHandle                    Itemable;                                          // 0x18(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FCharacterFlagsRowHandle>      Requirements;                                      // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCharacterFlagsRowHandle>      Unlocks;                                           // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        RequiredPointsToUnlock;                            // 0x50(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RequiredLevel;                                     // 0x54(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.BlueprintUnlocksEnum
struct FBlueprintUnlocksEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.BlueprintUnlocksRowHandle
struct FBlueprintUnlocksRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.ItemTemplateRowHandle
struct FItemTemplateRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.DurableRowHandle
struct FDurableRowHandle : public FRowHandle
{
public:
};

// 0x90 (0xA8 - 0x18)
// ScriptStruct Icarus.BreakableRockData
struct FBreakableRockData : public FIcarusTableRowBase
{
public:
	struct FItemRewardsRowHandle                 ItemReward;                                        // 0x18(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FItemTemplateRowHandle                PyriticCrustItemType;                              // 0x30(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FDurableRowHandle                     Durable;                                           // 0x48(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 Tags;                                              // 0x60(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFMODEvent>             BreakSound;                                        // 0x80(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.BreakableRockDataEnum
struct FBreakableRockDataEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.BreakableRockDataRowHandle
struct FBreakableRockDataRowHandle : public FRowHandle
{
public:
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Icarus.FunctionContext
struct FFunctionContext
{
public:
	TSubclassOf<class UObject>                   ContextClass;                                      // 0x0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FString                                FunctionToExecute;                                 // 0x8(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x170 (0x188 - 0x18)
// ScriptStruct Icarus.BuildableAudioData
struct FBuildableAudioData : public FIcarusTableRowBase
{
public:
	TSoftObjectPtr<class UFMODEvent>             BuildingPlacedSound;                               // 0x18(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFMODEvent>             BuildingStressDamageSound;                         // 0x40(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFMODEvent>             BuildingDestroyedSound;                            // 0x68(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFMODEvent>             BuildingDamagedSound;                              // 0x90(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFMODEvent>             BuildingDestructibleDamagedSound;                  // 0xB8(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFMODEvent>             BuildingWeatherDamageSound;                        // 0xE0(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFMODEvent>             BuildingWeatherDamageStrippedSound;                // 0x108(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFMODEvent>             BuildingWeatherUnzippingSound;                     // 0x130(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UFMODEvent>             BuildingRepairedSound;                             // 0x158(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BuildingOcclusionValue;                            // 0x180(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A2E[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.BuildableAudioDataEnum
struct FBuildableAudioDataEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.BuildableAudioDataRowHandle
struct FBuildableAudioDataRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.BuildingTypesRowHandle
struct FBuildingTypesRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.BuildingStabilityRowHandle
struct FBuildingStabilityRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.BuildingPiecesRowHandle
struct FBuildingPiecesRowHandle : public FRowHandle
{
public:
};

// 0x30 (0x30 - 0x0)
// ScriptStruct Icarus.BuildingVariation
struct FBuildingVariation
{
public:
	struct FTalentsRowHandle                     Requirement;                                       // 0x0(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBuildingPiecesRowHandle              Piece;                                             // 0x18(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xA0 (0xB8 - 0x18)
// ScriptStruct Icarus.BuildableData
struct FBuildableData : public FIcarusTableRowBase
{
public:
	TSubclassOf<class UBuildableComponent>       Behaviour;                                         // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBuildingStabilityRowHandle           Stability;                                         // 0x20(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBuildingTypesRowHandle               Type;                                              // 0x38(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EBuildingPieceType                PieceType;                                         // 0x50(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A2F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FBuildingVariation>            Variations;                                        // 0x58(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<struct FStatsEnum, int32>               Stats;                                             // 0x68(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.BuildableEnum
struct FBuildableEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.BuildableRowHandle
struct FBuildableRowHandle : public FRowHandle
{
public:
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Icarus.GridPoint
struct FGridPoint
{
public:
	TArray<class ABuildingBase*>                 Buildings;                                         // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Icarus.VectorPair
struct FVectorPair
{
public:
	struct FVector                               StartPoint;                                        // 0x0(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               EndPoint;                                          // 0xC(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Icarus.BuildingList
struct FBuildingList
{
public:
	TArray<class ABuildingBase*>                 Buildings;                                         // 0x0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x60 (0x60 - 0x0)
// ScriptStruct Icarus.SerializedGrid
struct FSerializedGrid
{
public:
	struct FTransform                            GridTrans;                                         // 0x0(0x30)(Edit, BlueprintVisible, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<TSubclassOf<class ABuildingBase>>     BuildingClasses;                                   // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, UObjectWrapper, NativeAccessSpecifierPublic)
	TArray<struct FTransform>                    BuildingTrans;                                     // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FItemData>                     BuildingItemData;                                  // 0x50(0x10)(Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct Icarus.BuildingInstance
struct FBuildingInstance
{
public:
	struct FTransform                            Transform;                                         // 0x0(0x30)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        Variation;                                         // 0x30(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        IcarusUID;                                         // 0x34(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BurnTimeRemaining;                                 // 0x38(0x4)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A30[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Icarus.DatabaseBuildingType
struct FDatabaseBuildingType
{
public:
	class FName                                  BuildableRowName;                                  // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  BuildingItemStaticRowName;                         // 0x8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBuildingInstance>             BuildingInstances;                                 // 0x10(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x40 (0x40 - 0x0)
// ScriptStruct Icarus.DatabaseBuildingGrid
struct FDatabaseBuildingGrid
{
public:
	struct FTransform                            GridTransform;                                     // 0x0(0x30)(BlueprintVisible, BlueprintReadOnly, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FDatabaseBuildingType>         BuildingTypes;                                     // 0x30(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// ScriptStruct Icarus.BuildingRecordStatData
struct FBuildingRecordStatData
{
public:
	class FName                                  Stat;                                              // 0x0(0x8)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Value;                                             // 0x8(0x4)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0xC (0xC - 0x0)
// ScriptStruct Icarus.BuildingRecordAlterationData
struct FBuildingRecordAlterationData
{
public:
	class FName                                  Alteration;                                        // 0x0(0x8)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Value;                                             // 0x8(0x4)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x70 (0x70 - 0x0)
// ScriptStruct Icarus.BuildingInfo
struct FBuildingInfo
{
public:
	struct FTransform                            Transform;                                         // 0x0(0x30)(BlueprintVisible, SaveGame, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	int32                                        Variation;                                         // 0x30(0x4)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        IcarusUID;                                         // 0x34(0x4)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        BurnTimeRemaining;                                 // 0x38(0x4)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        HealthPercentage;                                  // 0x3C(0x4)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBuildingRecordStatData>       AdditionalStats;                                   // 0x40(0x10)(BlueprintVisible, ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	TArray<struct FBuildingRecordAlterationData> Alterations;                                       // 0x50(0x10)(BlueprintVisible, ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	bool                                         bIsInCave;                                         // 0x60(0x1)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSupportedByGround;                                // 0x61(0x1)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A31[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AnchorStrength;                                    // 0x64(0x4)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A32[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Icarus.DatabaseBuildingData
struct FDatabaseBuildingData
{
public:
	class FName                                  BuildableRowName;                                  // 0x0(0x8)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  BuildingItemStaticRowName;                         // 0x8(0x8)(BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FBuildingInfo>                 BuildingInstances;                                 // 0x10(0x10)(BlueprintVisible, ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
};

// 0x50 (0x50 - 0x0)
// ScriptStruct Icarus.BuildingGridSaveData
struct FBuildingGridSaveData
{
public:
	uint8                                        Pad_8A33[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            GridTransform;                                     // 0x10(0x30)(BlueprintVisible, SaveGame, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	TArray<struct FDatabaseBuildingData>         BuildingTypes;                                     // 0x40(0x10)(BlueprintVisible, ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
};

// 0x120 (0x138 - 0x18)
// ScriptStruct Icarus.BuildingLookup
struct FBuildingLookup : public FIcarusTableRowBase
{
public:
	class FText                                  PieceName;                                         // 0x18(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FBuildingPiecesRowHandle              Thatch;                                            // 0x30(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBuildingPiecesRowHandle              Wood;                                              // 0x48(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBuildingPiecesRowHandle              Refined_Wood;                                      // 0x60(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBuildingPiecesRowHandle              Stone;                                             // 0x78(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBuildingPiecesRowHandle              Concrete;                                          // 0x90(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBuildingPiecesRowHandle              Aluminium;                                         // 0xA8(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBuildingPiecesRowHandle              Glass;                                             // 0xC0(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBuildingPiecesRowHandle              ClayBrick;                                         // 0xD8(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBuildingPiecesRowHandle              Scoria;                                            // 0xF0(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBuildingPiecesRowHandle              ScoriaBrick;                                       // 0x108(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBuildingPiecesRowHandle              Ice;                                               // 0x120(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.BuildingLookupEnum
struct FBuildingLookupEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.BuildingLookupRowHandle
struct FBuildingLookupRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.BuildingSkinsRowHandle
struct FBuildingSkinsRowHandle : public FRowHandle
{
public:
};

// 0x98 (0xB0 - 0x18)
// ScriptStruct Icarus.BuildingPiece
struct FBuildingPiece : public FIcarusTableRowBase
{
public:
	struct FBuildingLookupRowHandle              Type;                                              // 0x18(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             Icon;                                              // 0x30(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class ABuildingBase>           Blueprint;                                         // 0x58(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBuildableAudioDataRowHandle          Audio;                                             // 0x80(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBuildingSkinsRowHandle               Skin;                                              // 0x98(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.BuildingPiecesEnum
struct FBuildingPiecesEnum : public FRowEnum
{
public:
};

// 0xA0 (0xB8 - 0x18)
// ScriptStruct Icarus.BuildingSkin
struct FBuildingSkin : public FIcarusTableRowBase
{
public:
	TMap<int32, TSoftObjectPtr<class UMaterialInterface>> BaseMeshMaterialSlotOverrides;                     // 0x18(0x50)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	TMap<int32, TSoftObjectPtr<class UMaterialInterface>> FrameMaterialSlotOverrides;                        // 0x68(0x50)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.BuildingSkinsEnum
struct FBuildingSkinsEnum : public FRowEnum
{
public:
};

// 0x28 (0x40 - 0x18)
// ScriptStruct Icarus.BuildingStability
struct FBuildingStability : public FIcarusTableRowBase
{
public:
	float                                        BuildingTier;                                      // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxHardStability;                                  // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        HardStabilityMaxRange;                             // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinimumUnstableStability;                          // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StabilityPassMultiplier;                           // 0x28(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxAnchoredStability;                              // 0x2C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LowestGreenStability;                              // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        YellowStability;                                   // 0x34(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HighestRedStability;                               // 0x38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A34[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.BuildingStabilityEnum
struct FBuildingStabilityEnum : public FRowEnum
{
public:
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.BuildingTypesEnum
struct FBuildingTypesEnum : public FRowEnum
{
public:
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Icarus.CargoLandingPadRecord
struct FCargoLandingPadRecord
{
public:
	int32                                        LeftSlotUID;                                       // 0x0(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RightSlotUID;                                      // 0x4(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Icarus.CaveActorSpawnTimeStamp
struct FCaveActorSpawnTimeStamp
{
public:
	class FString                                CaveActorClassName;                                // 0x0(0x10)(ZeroConstructor, SaveGame, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<float>                                SpawnTimestamps;                                   // 0x10(0x10)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
};

// 0x58 (0x70 - 0x18)
// ScriptStruct Icarus.Challenge
struct FChallenge : public FIcarusTableRowBase
{
public:
	class FText                                  ChallengeName;                                     // 0x18(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  ChallengeDescription;                              // 0x30(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	enum class EChallengeTypes                   Type;                                              // 0x48(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A35[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        RequiredCount;                                     // 0x4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 OptionalRequiredTags;                              // 0x50(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.ChallengesEnum
struct FChallengesEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.ChallengesRowHandle
struct FChallengesRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.DLCPackageDataRowHandle
struct FDLCPackageDataRowHandle : public FRowHandle
{
public:
};

// 0x110 (0x128 - 0x18)
// ScriptStruct Icarus.CharacterCreationData
struct FCharacterCreationData : public FIcarusTableRowBase
{
public:
	class FText                                  DisplayName;                                       // 0x18(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	enum class ECharacterOptionCategory          Category;                                          // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECharacterBodyType                BodyType;                                          // 0x31(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A36[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UTexture2D>             Icon;                                              // 0x38(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FItemTemplateRowHandle                Item;                                              // 0x60(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FColor>                        Color;                                             // 0x78(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	float                                        ScalarParamValue;                                  // 0x88(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A37[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UTexture2D>             TextureParamValue;                                 // 0x90(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<TSoftObjectPtr<class UMaterialInterface>, TSoftObjectPtr<class UMaterialInterface>> MaterialOverrides;                                 // 0xB8(0x50)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                         bEnabled;                                          // 0x108(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A38[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDLCPackageDataRowHandle              RequiredPackageID;                                 // 0x10C(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A39[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.CharacterCreationDataEnum
struct FCharacterCreationDataEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.CharacterCreationDataRowHandle
struct FCharacterCreationDataRowHandle : public FRowHandle
{
public:
};

// 0x18 (0x30 - 0x18)
// ScriptStruct Icarus.CharacterFlag
struct FCharacterFlag : public FIcarusTableRowBase
{
public:
	class FText                                  Description;                                       // 0x18(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.CharacterFlagsEnum
struct FCharacterFlagsEnum : public FRowEnum
{
public:
};

// 0x30 (0x48 - 0x18)
// ScriptStruct Icarus.CharacterGrowth
struct FCharacterGrowth : public FIcarusTableRowBase
{
public:
	class UCurveFloat*                           ExperienceCurve;                                   // 0x18(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                           AttributeCurve;                                    // 0x20(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                           BlueprintPointsPerLevel;                           // 0x28(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                           TalentPointsPerLevel;                              // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCurveFloat*                           SoloPointsPerLevel;                                // 0x38(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxDisplayLevel;                                   // 0x40(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxLevel;                                          // 0x44(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.CharacterGrowthEnum
struct FCharacterGrowthEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.CharacterGrowthRowHandle
struct FCharacterGrowthRowHandle : public FRowHandle
{
public:
};

// 0xB0 (0xC8 - 0x18)
// ScriptStruct Icarus.CharacterPerk
struct FCharacterPerk : public FIcarusTableRowBase
{
public:
	class FText                                  Name;                                              // 0x18(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x30(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             Icon;                                              // 0x48(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECharacterAttribute               Attribute;                                         // 0x70(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A3A[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        RequiredAttributeLevel;                            // 0x74(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FStatsEnum, int32>               StatsGranted;                                      // 0x78(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.CharacterPerksEnum
struct FCharacterPerksEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.CharacterPerksRowHandle
struct FCharacterPerksRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.CharacterStartingStatsEnum
struct FCharacterStartingStatsEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.CharacterStartingStatsRowHandle
struct FCharacterStartingStatsRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.TimelineRanksRowHandle
struct FTimelineRanksRowHandle : public FRowHandle
{
public:
};

// 0x48 (0x60 - 0x18)
// ScriptStruct Icarus.CharacterTimeline
struct FCharacterTimeline : public FIcarusTableRowBase
{
public:
	int32                                        Level;                                             // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A3B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UTexture2D>             Image;                                             // 0x20(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FTimelineRanksRowHandle>       TimelineRanks;                                     // 0x48(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         FeatureLocked;                                     // 0x58(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A3C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.CharacterTimelineEnum
struct FCharacterTimelineEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.CharacterTimelineRowHandle
struct FCharacterTimelineRowHandle : public FRowHandle
{
public:
};

// 0x20 (0x38 - 0x18)
// ScriptStruct Icarus.CharacterVoiceData
struct FCharacterVoiceData : public FIcarusTableRowBase
{
public:
	class FText                                  DisplayName;                                       // 0x18(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	enum class EGlobalPlayerCharacterVoiceFMODParam VoiceFMODParam;                                    // 0x30(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A3D[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.CharacterVoicesEnum
struct FCharacterVoicesEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.CharacterVoicesRowHandle
struct FCharacterVoicesRowHandle : public FRowHandle
{
public:
};

// 0x28 (0x40 - 0x18)
// ScriptStruct Icarus.CombustibleData
struct FCombustibleData : public FIcarusTableRowBase
{
public:
	int32                                        MillijoulesProvided;                               // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FItemTemplateRowHandle                ProducesItem;                                      // 0x1C(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  DescriptionText;                                   // 0x34(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A3E[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.CombustibleEnum
struct FCombustibleEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.CombustibleRowHandle
struct FCombustibleRowHandle : public FRowHandle
{
public:
};

// 0x98 (0x98 - 0x0)
// ScriptStruct Icarus.ConfirmationPopupDetails
struct FConfirmationPopupDetails
{
public:
	class FText                                  Description;                                       // 0x0(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  OptionA;                                           // 0x18(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  OptionB;                                           // 0x30(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UFMODEvent*                            OptionAAudioOverride;                              // 0x48(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFMODEvent*                            OptionBAudioOverride;                              // 0x50(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                           ContentWidget;                                     // 0x58(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUserWidget>               ContentWidgetClass;                                // 0x60(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            OptionAIcon;                                       // 0x68(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTexture2D*                            OptionBIcon;                                       // 0x70(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          OptionATint;                                       // 0x78(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          OptionBTint;                                       // 0x88(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x20 (0x20 - 0x0)
// ScriptStruct Icarus.Modifier
struct FModifier
{
public:
	struct FModifierStatesRowHandle              Modifier;                                          // 0x0(0x18)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ModifierLifetime;                                  // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ModifierEffectiveness;                             // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x88 (0xA0 - 0x18)
// ScriptStruct Icarus.ConsumableData
struct FConsumableData : public FIcarusTableRowBase
{
public:
	TMap<struct FStatsEnum, int32>               Stats;                                             // 0x18(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FModifier                             Modifier;                                          // 0x68(0x20)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	class FName                                  DescriptionText;                                   // 0x88(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FItemTemplateRowHandle>        Byproducts;                                        // 0x90(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.ConsumableEnum
struct FConsumableEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.ConsumableRowHandle
struct FConsumableRowHandle : public FRowHandle
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.ContextMenuGroupTypesRowHandle
struct FContextMenuGroupTypesRowHandle : public FRowHandle
{
public:
};

// 0xB0 (0xB0 - 0x0)
// ScriptStruct Icarus.ContextMenuItemData
struct FContextMenuItemData
{
public:
	class FName                                  ItemIdentifier;                                    // 0x0(0x8)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemPayload;                                       // 0x8(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FContextMenuGroupTypesRowHandle       GroupType;                                         // 0xC(0x18)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A3F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Label;                                             // 0x28(0x18)(BlueprintVisible, NativeAccessSpecifierPublic)
	int32                                        StackCount;                                        // 0x40(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A40[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UTexture2D>             Icon;                                              // 0x48(0x28)(BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnabled;                                          // 0x70(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A41[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFeatureLevelsRowHandle               FeatureLevel;                                      // 0x74(0x18)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FDelegateProperty_                           ItemClickedDelegate;                               // 0x8C(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A42[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UWidget*>                       ContextWidgets;                                    // 0xA0(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
};

// 0x20 (0x38 - 0x18)
// ScriptStruct Icarus.ContextMenuGroupType
struct FContextMenuGroupType : public FIcarusTableRowBase
{
public:
	class FText                                  GroupName;                                         // 0x18(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class UTexture2D*                            GroupIcon;                                         // 0x30(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.ContextMenuGroupTypesEnum
struct FContextMenuGroupTypesEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.ProcessingRowHandle
struct FProcessingRowHandle : public FRowHandle
{
public:
};

// 0x80 (0x98 - 0x18)
// ScriptStruct Icarus.CraftingAudioData
struct FCraftingAudioData : public FIcarusTableRowBase
{
public:
	TSoftObjectPtr<class UFMODEvent>             RecipeCraftedSound;                                // 0x18(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<struct FProcessingRowHandle, TSoftObjectPtr<class UFMODEvent>> ProcessorOverrideSounds;                           // 0x40(0x50)(Edit, BlueprintVisible, UObjectWrapper, NativeAccessSpecifierPublic)
	bool                                         bOnlyPlayForLastItemInQueue;                       // 0x90(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A43[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.CraftingAudioDataEnum
struct FCraftingAudioDataEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.CraftingAudioDataRowHandle
struct FCraftingAudioDataRowHandle : public FRowHandle
{
public:
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Icarus.ResourceItem
struct FResourceItem
{
public:
	enum class EIcarusResourceType               Type;                                              // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A44[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        RequiredUnits;                                     // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x8 (0x18 - 0x10)
// ScriptStruct Icarus.FlagsMultiRowHandle
struct FFlagsMultiRowHandle : public FMultiRowHandle
{
public:
	enum class EFlagsTableType                   DataTableName;                                     // 0x10(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_8A45[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.RecipeSetsRowHandle
struct FRecipeSetsRowHandle : public FRowHandle
{
public:
};

// 0x30 (0x48 - 0x18)
// ScriptStruct Icarus.CraftingInput
struct FCraftingInput : public FIcarusTableRowBase
{
public:
	struct FItemsStaticRowHandle                 Element;                                           // 0x18(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A46[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FItemDynamicData>              DynamicProperties;                                 // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x40 (0x58 - 0x18)
// ScriptStruct Icarus.CraftingOutput
struct FCraftingOutput : public FIcarusTableRowBase
{
public:
	struct FItemTemplateRowHandle                Element;                                           // 0x18(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Count;                                             // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A47[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FItemDynamicData>              DynamicProperties;                                 // 0x38(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FAlterationsRowHandle>         Alterations;                                       // 0x48(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
};

// 0x2D0 (0x2E8 - 0x18)
// ScriptStruct Icarus.ProcessorRecipe
struct FProcessorRecipe : public FIcarusTableRowBase
{
public:
	bool                                         bForceDisableRecipe;                               // 0x18(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A48[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTalentsRowHandle                     Requirement;                                       // 0x1C(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A49[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FFlagsMultiRowHandle                  SessionRequirement;                                // 0x38(0x18)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCharacterFlagsRowHandle              CharacterRequirement;                              // 0x50(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        RequiredMillijoules;                               // 0x68(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A4A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FRecipeSetsRowHandle>          RecipeSets;                                        // 0x70(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FStatsEnum>                    ResourceCostMultipliers;                           // 0x80(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FCraftingInput>                Inputs;                                            // 0x90(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FResourceItem>                 ResourceInputs;                                    // 0xA0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bSelectOutputItemRandomly;                         // 0xB0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A4B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItemData                             ItemRandomSelect;                                  // 0xB8(0x1F0)(Edit, BlueprintVisible, ContainsInstancedReference, NativeAccessSpecifierPublic)
	TArray<struct FCraftingOutput>               Outputs;                                           // 0x2A8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FResourceItem>                 ResourceOutputs;                                   // 0x2B8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	enum class ERefundPermission                 Refundable;                                        // 0x2C8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A4C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ExperienceMultiplier;                              // 0x2CC(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCraftingAudioDataRowHandle           Audio;                                             // 0x2D0(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x60 (0x78 - 0x18)
// ScriptStruct Icarus.RecipeSet
struct FRecipeSet : public FIcarusTableRowBase
{
public:
	class FText                                  RecipeSetName;                                     // 0x18(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	class FText                                  DisplayText;                                       // 0x30(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TSoftObjectPtr<class UTexture2D>             RecipeSetIcon;                                     // 0x48(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ExperienceMultiplier;                              // 0x70(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAllowRefundOfRecipesOnDestroy;                    // 0x74(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A4D[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x8 (0x8 - 0x0)
// ScriptStruct Icarus.ResourceRequirement
struct FResourceRequirement
{
public:
	enum class EIcarusResourceType               Resource;                                          // 0x0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A4E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        FlowRate;                                          // 0x4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x50 (0x68 - 0x18)
// ScriptStruct Icarus.CraftingModifications
struct FCraftingModifications : public FIcarusTableRowBase
{
public:
	struct FTagQueriesRowHandle                  Query;                                             // 0x18(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStatsEnum                            StatRequirement;                                   // 0x30(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FAlterationsEnum>              StatGrantedAlteration;                             // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FResourceRequirement                  ResourceRequirement;                               // 0x50(0x8)(Edit, BlueprintVisible, NoDestructor, NativeAccessSpecifierPublic)
	struct FAlterationsEnum                      ResourceGrantedAlteration;                         // 0x58(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.CraftingModificationsEnum
struct FCraftingModificationsEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.CraftingModificationsRowHandle
struct FCraftingModificationsRowHandle : public FRowHandle
{
public:
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Icarus.CreatureAudioThreatSetting
struct FCreatureAudioThreatSetting
{
public:
	class UCurveFloat*                           DistanceModifierCurve;                             // 0x0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GracePeriod;                                       // 0x8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A4F[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x50 (0x68 - 0x18)
// ScriptStruct Icarus.CreatureAudioThreatData
struct FCreatureAudioThreatData : public FIcarusTableRowBase
{
public:
	TMap<enum class ECreatureAudioThreatTargetType, struct FCreatureAudioThreatSetting> ThreatSettings;                                    // 0x18(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.CreatureAudioThreatDataEnum
struct FCreatureAudioThreatDataEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.CriticalHitAreaAudioDataRowHandle
struct FCriticalHitAreaAudioDataRowHandle : public FRowHandle
{
public:
};

// 0x68 (0x80 - 0x18)
// ScriptStruct Icarus.CriticalHitArea
struct FCriticalHitArea : public FIcarusTableRowBase
{
public:
	struct FStatsEnum                            DamageReductionStat;                               // 0x18(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStatsEnum                            DamageReductionMitigatingStat;                     // 0x28(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStatsEnum                            DamageMultiplierStat;                              // 0x38(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReductionStatMultiplier;                           // 0x48(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MultiplierStatMultiplier;                          // 0x4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FModifierStatesRowHandle>      ModifiersToApply;                                  // 0x50(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        Priority;                                          // 0x60(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCriticalHitAreaAudioDataRowHandle    AudioData;                                         // 0x64(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A50[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x30 (0x48 - 0x18)
// ScriptStruct Icarus.CriticalHitAreaAudioData
struct FCriticalHitAreaAudioData : public FIcarusTableRowBase
{
public:
	TSoftObjectPtr<class UFMODEvent>             PlayerFeedbackSound;                               // 0x18(0x28)(Edit, BlueprintVisible, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShouldCritZoneSuppressHitAudio;                   // 0x40(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A51[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.CriticalHitAreaAudioDataEnum
struct FCriticalHitAreaAudioDataEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.CriticalHitAreasRowHandle
struct FCriticalHitAreasRowHandle : public FRowHandle
{
public:
};

// 0x38 (0x50 - 0x18)
// ScriptStruct Icarus.CriticalHitPlayer
struct FCriticalHitPlayer : public FIcarusTableRowBase
{
public:
	float                                        TimeScale;                                         // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeLength;                                        // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FOV;                                               // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RotationOffset;                                    // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               PivotOffset;                                       // 0x28(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               CameraOffset;                                      // 0x34(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              CameraRotationOffset;                              // 0x40(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A52[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x28 (0x40 - 0x18)
// ScriptStruct Icarus.CriticalHitProjectile
struct FCriticalHitProjectile : public FIcarusTableRowBase
{
public:
	float                                        TimeScale;                                         // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               CameraOffset;                                      // 0x1C(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              CameraRotationOffset;                              // 0x28(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                        FOV;                                               // 0x34(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UMatineeCameraShake>       CameraShake;                                       // 0x38(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x50 - 0x18)
// ScriptStruct Icarus.CritialHitTarget
struct FCritialHitTarget : public FIcarusTableRowBase
{
public:
	float                                        TimeScale;                                         // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeLength;                                        // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FOV;                                               // 0x20(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RotationOffset;                                    // 0x24(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               PivotOffset;                                       // 0x28(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               CameraOffset;                                      // 0x34(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              CameraRotationOffset;                              // 0x40(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A53[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0xE8 (0x100 - 0x18)
// ScriptStruct Icarus.CriticalHitSetup
struct FCriticalHitSetup : public FIcarusTableRowBase
{
public:
	struct FCriticalHitPlayer                    PlayerConfig;                                      // 0x18(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FCriticalHitProjectile                ProjectileConfig;                                  // 0x68(0x40)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FCritialHitTarget                     TargetConfig;                                      // 0xA8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                        FinishTime;                                        // 0xF8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A54[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.CriticalHitSetupEnum
struct FCriticalHitSetupEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.CriticalHitSetupRowHandle
struct FCriticalHitSetupRowHandle : public FRowHandle
{
public:
};

// 0x10 (0x10 - 0x0)
// ScriptStruct Icarus.CultivationSaveData
struct FCultivationSaveData
{
public:
	class FName                                  Seed;                                              // 0x0(0x8)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GrowthTime;                                        // 0x8(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        GrowthState;                                       // 0xC(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x38 (0x50 - 0x18)
// ScriptStruct Icarus.CurrencyConversion
struct FCurrencyConversion : public FIcarusTableRowBase
{
public:
	struct FMetaCurrencyRowHandle                StartingCurrency;                                  // 0x18(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        StartingAmount;                                    // 0x30(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetaCurrencyRowHandle                ConvertedCurrency;                                 // 0x34(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ConvertedAmount;                                   // 0x4C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.CurrencyConversionsEnum
struct FCurrencyConversionsEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.CurrencyConversionsRowHandle
struct FCurrencyConversionsRowHandle : public FRowHandle
{
public:
};

// 0x28 (0x28 - 0x0)
// ScriptStruct Icarus.DamageTypeInfoModifier
struct FDamageTypeInfoModifier
{
public:
	struct FTagQueriesRowHandle                  Tag;                                               // 0x0(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStatsEnum                            Stat;                                              // 0x18(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
};

// 0x78 (0x90 - 0x18)
// ScriptStruct Icarus.DamageTypeInfo
struct FDamageTypeInfo : public FIcarusTableRowBase
{
public:
	enum class EIcarusDamageType                 DamageType;                                        // 0x18(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A55[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FColor                                Color;                                             // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FTagQueriesRowHandle                  RequiredDefenderQuery;                             // 0x20(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStatsEnum                            DamageStat;                                        // 0x38(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStatsEnum                            DamageVariationStat;                               // 0x48(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStatsEnum                            ResistanceStat;                                    // 0x58(0x10)(Edit, BlueprintVisible, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FDamageTypeInfoModifier>       ResistanceOverride;                                // 0x68(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FDamageTypeInfoModifier>       DefenderMultipliers;                               // 0x78(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bAddStealthMultiplier;                             // 0x88(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A56[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.DamageTypeInfoEnum
struct FDamageTypeInfoEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.DamageTypeInfoRowHandle
struct FDamageTypeInfoRowHandle : public FRowHandle
{
public:
};

// 0x28 (0x40 - 0x18)
// ScriptStruct Icarus.DecayableData
struct FDecayableData : public FIcarusTableRowBase
{
public:
	int32                                        DecayTime;                                         // 0x18(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        SpoilTime;                                         // 0x1C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FItemTemplateRowHandle                SpoiledItem;                                       // 0x20(0x18)(Edit, BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ResourceLeakage;                                   // 0x38(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8A57[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x0 (0x10 - 0x10)
// ScriptStruct Icarus.DecayableEnum
struct FDecayableEnum : public FRowEnum
{
public:
};

// 0x0 (0x18 - 0x18)
// ScriptStruct Icarus.DecayableRowHandle
struct FDecayableRowHandle : public FRowHandle
{
public:
};

// 0x18 (0x18 - 0x0)
// ScriptStruct Icarus.DensityAudioRecordSet
struct FDensityAudioRecordSet
{
public:
	TArray<class UObject*>                       Records;                                           // 0x0(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_8A58[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]
};

// 0x220 (0x220 - 0x0)
