#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x0 (0x28 - 0x28)
// Class Icarus.AccoladeImpl
class UAccoladeImpl : public UObject
{
public:

	static class UClass* StaticClass();
	static class UAccoladeImpl* GetDefaultObj();

	bool ShouldRunAccoladeOnStartup(class UWorld* WorldContext, const struct FAccoladesRowHandle& Accolade);
	bool RunAccolade(class UWorld* WorldContext, const struct FAccoladesRowHandle& Accolade);
	bool GetAccoladeProgress(class UWorld* WorldContext, const struct FAccoladesRowHandle& Accolade, int32* OutProgress);
	int32 GetAccoladeMaxProgressValue(class UWorld* WorldContext, const struct FAccoladesRowHandle& Accolade);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.AccoladesLibrary
class UAccoladesLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UAccoladesLibrary* GetDefaultObj();

	struct FAccoladesRowHandle StructToRowHandle(const struct FAccoladesEnum& EnumValue);
	class FName StructToName(const struct FAccoladesEnum& EnumValue);
	int32 StructToInt(const struct FAccoladesEnum& EnumValue);
	struct FAccoladesEnum RowHandleToStruct(const struct FAccoladesRowHandle& RowHandle);
	void RemoveRowFromAccoladesTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FAccoladesEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FAccoladesEnum& A, const struct FAccoladesEnum& B);
	struct FAccoladesEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FAccoladesRowHandle MakeLiteralAccolades(const struct FAccoladesRowHandle& RowHandle);
	struct FAccoladesRowHandle MakeAccoladesFromIndex(int32 Index);
	struct FAccoladesEnum MakeAccoladesEnum(const struct FAccoladesEnum& Enum);
	struct FAccoladesRowHandle MakeAccolades(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FAccoladesEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetAccoladesStruct(const struct FAccoladesRowHandle& RowHandle, struct FAccoladeData* Accolades, enum class EValid* Paths);
	bool EqualEqual_FAccoladesRowHandleFAccoladesRowHandle(const struct FAccoladesRowHandle& RowHandleA, const struct FAccoladesRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FAccoladesEnum& A, const struct FAccoladesEnum& B);
	struct FAccoladesRowHandle CastToAccoladesRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakAccoladesEnum(const struct FAccoladesEnum& Enum, class FName* Name, int32* Index);
	void AddRowToAccoladesTable(class FName Name, const struct FAccoladeData& Data, struct FAccoladesRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.AccoladesTable
class UAccoladesTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UAccoladesTable* GetDefaultObj();

};

// 0xC0 (0xF0 - 0x30)
// Class Icarus.AccoladeSubsystem
class UAccoladeSubsystem : public UWorldSubsystem
{
public:
	FMulticastInlineDelegateProperty_            OnAccoladeCompleted;                               // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	FMulticastInlineDelegateProperty_            OnAccoladeUpdated;                                 // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1744[0x38];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FAccoladeCompletedState>       CompletedAccolades;                                // 0x88(0x10)(ZeroConstructor, SaveGame, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1746[0x58];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAccoladeSubsystem* GetDefaultObj();

	void TryCompleteOneOffAccolade(class AIcarusPlayerCharacter* Player, const struct FAccoladesRowHandle& Accolade);
	void ResetAccolades();
	void PostPlayerTrackerInitialized();
	void OnTrackerUpdated(const struct FPlayerTrackersRowHandle& Tracker, int32 OldValue, int32 NewValue);
	void OnTalentUpdated(class AIcarusPlayerCharacter* Player);
	bool IsTaskListAccolade(struct FAccoladesRowHandle& AccoladeRow);
	bool IsAccoladeCompleted(struct FAccoladesRowHandle& AccoladeRow);
	TArray<struct FAccoladesRowHandle> GetSortedIncompleteAccolades();
	TArray<struct FAccoladeCompletedState> GetCompletedAccoladesWithProspectID(const class FString& ProspectID);
	TArray<struct FAccoladeCompletedState> GetCompletedAccolades();
	TArray<struct FAccoladeTaskState> GetAccoladeTaskStates(class AIcarusPlayerCharacter* Character, struct FAccoladesRowHandle& AccoladeRow);
	bool GetAccoladeProgress(struct FAccoladesRowHandle& AccoladeRow, int32* CurrentValue, int32* MaxValue, struct FDateTime* TimeCompleted);
	bool DeleteAccoladeSave(struct FPlayerCharacterID& PlayerCharacterID);
	void CheckAgainstCompletedAccolades();
};

// 0x0 (0x28 - 0x28)
// Class Icarus.AccountFlagsLibrary
class UAccountFlagsLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UAccountFlagsLibrary* GetDefaultObj();

	struct FAccountFlagsRowHandle StructToRowHandle(const struct FAccountFlagsEnum& EnumValue);
	class FName StructToName(const struct FAccountFlagsEnum& EnumValue);
	int32 StructToInt(const struct FAccountFlagsEnum& EnumValue);
	struct FAccountFlagsEnum RowHandleToStruct(const struct FAccountFlagsRowHandle& RowHandle);
	void RemoveRowFromAccountFlagsTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FAccountFlagsEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FAccountFlagsEnum& A, const struct FAccountFlagsEnum& B);
	struct FAccountFlagsEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FAccountFlagsRowHandle MakeLiteralAccountFlags(const struct FAccountFlagsRowHandle& RowHandle);
	struct FAccountFlagsRowHandle MakeAccountFlagsFromIndex(int32 Index);
	struct FAccountFlagsEnum MakeAccountFlagsEnum(const struct FAccountFlagsEnum& Enum);
	struct FAccountFlagsRowHandle MakeAccountFlags(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FAccountFlagsEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetAccountFlagsStruct(const struct FAccountFlagsRowHandle& RowHandle, struct FAccountFlag* AccountFlags, enum class EValid* Paths);
	bool EqualEqual_FAccountFlagsRowHandleFAccountFlagsRowHandle(const struct FAccountFlagsRowHandle& RowHandleA, const struct FAccountFlagsRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FAccountFlagsEnum& A, const struct FAccountFlagsEnum& B);
	struct FAccountFlagsRowHandle CastToAccountFlagsRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakAccountFlagsEnum(const struct FAccountFlagsEnum& Enum, class FName* Name, int32* Index);
	void AddRowToAccountFlagsTable(class FName Name, const struct FAccountFlag& Data, struct FAccountFlagsRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.AccountFlagsTable
class UAccountFlagsTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UAccountFlagsTable* GetDefaultObj();

};

// 0x10 (0xC0 - 0xB0)
// Class Icarus.TraitBehaviour
class UTraitBehaviour : public UActorComponent
{
public:
	class UTraitBehaviours*                      OwningComponent;                                   // 0xB0(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, InstancedReference, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBehaviourDelegatesBound;                          // 0xB8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1C32[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTraitBehaviour* GetDefaultObj();

	void OnTraitAnimNotify(struct FAnimNotifyEvent& Notify, class AActor* AnimInstancePawn);
	void OnRep_OwningComponent();
};

// 0x210 (0x2D0 - 0xC0)
// Class Icarus.ActionableBehaviour
class UActionableBehaviour : public UTraitBehaviour
{
public:
	TArray<enum class EActionableEventType>      ActionEventTypes;                                  // 0xC0(0x10)(Net, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FActionsRowHandle                     ActionRowHandle;                                   // 0xD0(0x18)(Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<enum class EActionableEventType, struct FStaminaActionCostsRowHandle> StaminaCosts;                                      // 0xE8(0x50)(NativeAccessSpecifierPublic)
	TArray<struct FActionStaminaCostEventPairing> ReplicatedStaminaCosts;                            // 0x138(0x10)(Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnCooldownElapsed;                                 // 0x148(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FModifierStatesRowHandle              ModifierRowHandle;                                 // 0x158(0x18)(BlueprintVisible, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2101[0x50];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UCharacterState*                       OwnerActorState;                                   // 0x1C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AActor*                                OwnerActor;                                        // 0x1C8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_210E[0xF8];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UIcarusAnimInstance*                   AnimatingMeshAnimInstance;                         // 0x2C8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UActionableBehaviour* GetDefaultObj();

	void PerformActionFromMenu(class AActor* InvokingActor);
	void PerformAction(class AActor* InvokingActor, enum class EActionableEventType OnActionType, enum class EActionableTrigger ActionTrigger);
	void OnUsedFromMenu(class AActor* InvokingActor);
	void OnRep_ReplicatedStaminaCosts();
	void OnActionNotify(class FName NotifyName);
	void OnActionInsufficientStamina(enum class EActionableTrigger ActionTrigger);
	void OnActionInsufficientDurability(enum class EActionableTrigger ActionTrigger);
	void OnActionHit(class AActor* InvokingActor, class UPrimitiveComponent* OverlappedComponent, struct FHitResult& SweepResult);
	void OnActionAborted(enum class EActionableEventType EventType);
	void OnAction(class AActor* InvokingActor, enum class EActionableEventType OnActionType, enum class EActionableTrigger ActionTrigger);
	void NetMulti_OnActionInsufficientStamina(enum class EActionableTrigger ActionTrigger);
	void Multicast_NotifyCurrentActionAborted(enum class EActionableEventType EventType);
	bool IsActionAborted(enum class EActionableEventType EventType);
	bool HasCooldownElapsed(enum class EActionableEventType ActionType);
	struct FStaminaCost GetStaminaCostForEventType(enum class EActionableEventType EventType);
	TArray<struct FRowHandle> GetGenericData();
	float GetCooldownSpeedMultiplier();
	float GetCooldownDuration();
	class USkeletalMeshComponent* GetAnimatingMesh();
	bool GetActionData(struct FActionData* OutData);
	class UActionableComponent* GetActionableComponent();
	void CheckCurrentActionAborted(class UActorState* ActorStateIn, int32 UID);
	void CancelStaminaActionForEventType(enum class EActionableEventType EventType);
	bool BP_ShouldApplyEndStaminaCost(enum class EActionableEventType EventType);
	void BeginActionCooldown(enum class EActionableEventType ActionableEvent);
	void ActionComplete(enum class EActionableEventType ActionType);
	void AbortAction(enum class EActionableEventType EventType, bool bApplyEndActionStaminaCost);
};

// 0x20 (0xD0 - 0xB0)
// Class Icarus.TraitComponent
class UTraitComponent : public UActorComponent
{
public:
	FMulticastSparseDelegateProperty_            DynamicDataUpdated;                                // 0xB0(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_22F0[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRowHandle                            DataRowHandle;                                     // 0xB4(0x18)(Edit, BlueprintVisible, Net, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_22F5[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTraitComponent* GetDefaultObj();

	void OnRep_DataRowHandle();
	void OnDataSet();
	void OnAnimNotify(struct FAnimNotifyEvent& Notify, class AActor* AnimInstancePawn);
	TSubclassOf<class UTraitComponent> GetTraitClassFromData(const struct FRowHandle& ItemDataRow);
	class AIcarusItem* GetOwnerIcarusItem();
	class AIcarusActor* GetOwnerIcarusActor();
};

// 0x18 (0xE8 - 0xD0)
// Class Icarus.TraitBehaviours
class UTraitBehaviours : public UTraitComponent
{
public:
	FMulticastSparseDelegateProperty_            OnTraitAnimNotify;                                 // 0xD0(0x1)(InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_246C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UTraitBehaviour*>               OwnedBehaviours;                                   // 0xD8(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UTraitBehaviours* GetDefaultObj();

	void RegisterBehaviour(class UTraitBehaviour* Behaviour);
	class UTraitBehaviour* GetFirstBehaviourOfType(TSubclassOf<class UTraitBehaviour> Class);
	TArray<class UTraitBehaviour*> GetBehaviours();
	void CreateBehaviours();
	class UTraitBehaviour* CreateBehaviour(TSubclassOf<class UTraitBehaviour> BehaviourClass);
};

// 0x70 (0x158 - 0xE8)
// Class Icarus.ActionableComponent
class UActionableComponent : public UTraitBehaviours
{
public:
	FMulticastSparseDelegateProperty_            OnAction;                                          // 0xE8(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnUsedFromMenu;                                    // 0xE9(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnActionHit;                                       // 0xEA(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnAssociatedItemUpdated;                           // 0xEB(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, BlueprintCallable, NativeAccessSpecifierPublic)
	uint8                                        Pad_298E[0x54];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        AssociatedItemInventoryId;                         // 0x140(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        AssociatedItemInventorySlot;                       // 0x144(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        DynamicState;                                      // 0x148(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        GunCurrentMagSize;                                 // 0x14C(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrentAmmoType;                                   // 0x150(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_2997[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UActionableComponent* GetDefaultObj();

	void UseFromMenu(class AActor* InvokingActor);
	void SetNewAssociatedItem(int32 NewAssociatedItemInventoryId, int32 NewAssocaitedItemSlot);
	void SetGunCurrentMagSize(int32 NewGunCurrentMagSize);
	void SetDynamicState(int32 NewDynamicState);
	void SetCurrentAmmoType(int32 NewCurrentAmmoType);
	void SetAssociatedItemInventorySlot(int32 NewAssociatedItemInventorySlot);
	void SetAssociatedItemInventoryId(int32 NewAssociatedItemInventoryId);
	void Server_OwningClientActionableHitNamed(class AActor* InvokingActor, class AActor* OverlappedComponentOwner, class FName OverlappedComponentName, struct FHitResult& SweepResult);
	void Server_OwningClientActionableHit(class AActor* InvokingActor, class UPrimitiveComponent* OverlappedComponent, struct FHitResult& SweepResult);
	void OnRep_CurrentAmmoType();
	void OnHeldTimerExpired(class AActor* InvokingActor, enum class EActionableEventType ActionType, bool bClientPrediction);
	void Multicast_ActionableHitNamed(class AActor* InvokingActor, class AActor* OverlappedComponentOwner, class FName OverlappedComponentName, struct FHitResult& SweepResult);
	void Multicast_ActionableHit(class AActor* InvokingActor, class UPrimitiveComponent* OverlappedComponent, struct FHitResult& SweepResult);
	class UActionableBehaviour* GetBehaviourForActionType(enum class EActionableEventType& EventType);
	bool GetActionData(const struct FActionsRowHandle& ActionRowHandle, struct FActionData* OutData);
	bool GetActionableData(struct FActionableData* OutData);
	void Action(class AActor* InvokingActor, enum class EActionableEventType ActionType, enum class EActionableTrigger ActionTrigger, bool bClientPrediction);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.ActionableLibrary
class UActionableLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UActionableLibrary* GetDefaultObj();

	struct FActionableRowHandle StructToRowHandle(const struct FActionableEnum& EnumValue);
	class FName StructToName(const struct FActionableEnum& EnumValue);
	int32 StructToInt(const struct FActionableEnum& EnumValue);
	struct FActionableEnum RowHandleToStruct(const struct FActionableRowHandle& RowHandle);
	void RemoveRowFromActionableTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FActionableEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FActionableEnum& A, const struct FActionableEnum& B);
	struct FActionableEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FActionableRowHandle MakeLiteralActionable(const struct FActionableRowHandle& RowHandle);
	struct FActionableRowHandle MakeActionableFromIndex(int32 Index);
	struct FActionableEnum MakeActionableEnum(const struct FActionableEnum& Enum);
	struct FActionableRowHandle MakeActionable(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FActionableEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetActionableStruct(const struct FActionableRowHandle& RowHandle, struct FActionableData* Actionable, enum class EValid* Paths);
	bool EqualEqual_FActionableRowHandleFActionableRowHandle(const struct FActionableRowHandle& RowHandleA, const struct FActionableRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FActionableEnum& A, const struct FActionableEnum& B);
	struct FActionableRowHandle CastToActionableRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakActionableEnum(const struct FActionableEnum& Enum, class FName* Name, int32* Index);
	void AddRowToActionableTable(class FName Name, const struct FActionableData& Data, struct FActionableRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.ActionableTable
class UActionableTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UActionableTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.ActionsLibrary
class UActionsLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UActionsLibrary* GetDefaultObj();

	struct FActionsRowHandle StructToRowHandle(const struct FActionsEnum& EnumValue);
	class FName StructToName(const struct FActionsEnum& EnumValue);
	int32 StructToInt(const struct FActionsEnum& EnumValue);
	struct FActionsEnum RowHandleToStruct(const struct FActionsRowHandle& RowHandle);
	void RemoveRowFromActionsTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FActionsEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FActionsEnum& A, const struct FActionsEnum& B);
	struct FActionsEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FActionsRowHandle MakeLiteralActions(const struct FActionsRowHandle& RowHandle);
	struct FActionsRowHandle MakeActionsFromIndex(int32 Index);
	struct FActionsEnum MakeActionsEnum(const struct FActionsEnum& Enum);
	struct FActionsRowHandle MakeActions(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FActionsEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetActionsStruct(const struct FActionsRowHandle& RowHandle, struct FActionData* Actions, enum class EValid* Paths);
	bool EqualEqual_FActionsRowHandleFActionsRowHandle(const struct FActionsRowHandle& RowHandleA, const struct FActionsRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FActionsEnum& A, const struct FActionsEnum& B);
	struct FActionsRowHandle CastToActionsRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakActionsEnum(const struct FActionsEnum& Enum, class FName* Name, int32* Index);
	void AddRowToActionsTable(class FName Name, const struct FActionData& Data, struct FActionsRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.ActionsTable
class UActionsTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UActionsTable* GetDefaultObj();

};

// 0x0 (0x30 - 0x30)
// Class Icarus.ActorPrefabAsset
class UActorPrefabAsset : public UDataAsset
{
public:

	static class UClass* StaticClass();
	static class UActorPrefabAsset* GetDefaultObj();

	TArray<class AActor*> DeserializePrefab(class UActorPrefabFunctionLibrary* PrefabLibrary, class AActor* PrefabActor);
};

// 0x0 (0x220 - 0x220)
// Class Icarus.ActorPrefab
class AActorPrefab : public AActor
{
public:

	static class UClass* StaticClass();
	static class AActorPrefab* GetDefaultObj();

	class UActorPrefabAsset* GetPrefabAsset();
};

// 0x8 (0x30 - 0x28)
// Class Icarus.ActorPrefabFunctionLibrary
class UActorPrefabFunctionLibrary : public UObject
{
public:
	class UObject*                               WorldContext;                                      // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UActorPrefabFunctionLibrary* GetDefaultObj();

	void SetLightUseTemperature(class ULightComponent* Light, bool bUseTemperature);
	void SetLightMaxDrawDistance(class ULightComponent* Light, float MaxDrawDistance);
	bool SerializePrefabWaterfall(class AActor* Waterfall, struct FTransform& Origin, struct FPrefabWaterfall* WaterfallData);
	bool SerializePrefabTransform(class AActor* Actor, struct FTransform& Origin, struct FPrefabTransform* TransformData);
	bool SerializePrefabStaticMesh(class UStaticMeshComponent* MeshComponent, struct FTransform& Origin, struct FPrefabStaticMesh* MeshData);
	bool SerializePrefabMegaTreeAudioVolume(class AActor* Actor, struct FTransform& Origin, struct FPrefabTriggerBox* Data);
	bool SerializePrefabLavaFlowPoint(class AActor* LavaFlowPoint, struct FTransform& Origin, struct FPrefabLavaFlowPoint* LavaFlowPointData);
	bool SerializePrefabLake(class AActor* Lake, struct FTransform& Origin, struct FPrefabLake* LakeData);
	bool SerializePrefabFoliage(class AInstancedFoliageActor* InFoliageActor, struct FTransform& Origin, TArray<struct FPrefabFoliage>* PrefabFoliage);
	bool SerializePrefabCaveLight(class AActor* CaveLight, struct FTransform& Origin, struct FPrefabCaveLight* CaveLightData);
	bool SerializePrefabCaveCreatureSpawns(TArray<class AActor*>& CreatureSpawns, struct FTransform& Origin, TMap<TSubclassOf<class AActor>, struct FVector2D>& PerActorMinMaxSpawnCounts, TMap<TSubclassOf<class AActor>, struct FCaveSpawnConfig>* CaveSpawnConfig);
	bool SerializePrefabActorClass(class AActor* Actor, struct FTransform& Origin, struct FPrefabActorClass* ActorData);
	class AActor* DeserializePrefabWaterfall(struct FPrefabWaterfall& WaterfallData, struct FTransform& Origin);
	struct FTransform DeserializePrefabTransform(struct FPrefabTransform& TransformData, struct FTransform& Origin);
	class AActor* DeserializePrefabStaticMesh(struct FPrefabStaticMesh& MeshData, struct FTransform& Origin);
	class AActor* DeserializePrefabMegaTreeAudioVolume(struct FTransform& Origin, struct FPrefabTriggerBox& Data);
	class AActor* DeserializePrefabLavaFlowPoint(struct FPrefabLavaFlowPoint& LavaFlowPointData, struct FTransform& Origin);
	class AActor* DeserializePrefabLake(struct FPrefabLake& LakeData, struct FTransform& Origin);
	bool DeserializePrefabFoliage(class AActor* PrefabActor, TArray<struct FPrefabFoliage>& PrefabFoliageData);
	class AActor* DeserializePrefabCaveLight(struct FPrefabCaveLight& CaveLightData, struct FTransform& Origin);
	class AActor* DeserializePrefabCaveCreatureSpawns(TMap<TSubclassOf<class AActor>, struct FCaveSpawnConfig>& CaveSpawnConfig, class UActorPrefabAsset* CavePrefab, struct FTransform& Origin);
	class AActor* DeserializePrefabActorClass(struct FPrefabActorClass& ActorData, struct FTransform& Origin);
	class AActor* DeserializeCaveInstance(TArray<struct FPrefabTransform>& Volumes, TArray<struct FPrefabTransform>& Entrances, struct FTransform& Origin);
};

// 0x1B0 (0x260 - 0xB0)
// Class Icarus.ActorState
class UActorState : public UActorComponent
{
public:
	struct FIcarusDamagePacket                   LastDamagePacket;                                  // 0xB0(0xD8)(BlueprintVisible, BlueprintReadOnly, ContainsInstancedReference, NativeAccessSpecifierPublic)
	bool                                         bKeepRecentDamageEvents;                           // 0x188(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_49A7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RecentDamageLifetime;                              // 0x18C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FIcarusDamagePacket>           RecentDamagePackets;                               // 0x190(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	uint8                                        Pad_49AB[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnActorStateReady;                                 // 0x1B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnActorDeath;                                      // 0x1C0(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnAliveStateChanged;                               // 0x1C1(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnDamaged;                                         // 0x1C2(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnHealthUpdated;                                   // 0x1C3(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnShelterUpdated;                                  // 0x1C4(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            BiomeUpdated;                                      // 0x1C5(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnActorDamaged;                                    // 0x1C6(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_49D8[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnDamageReturned;                                  // 0x1C8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                        Health;                                            // 0x1D8(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxHealth;                                         // 0x1DC(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Shelter;                                           // 0x1E0(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ExternalTemperature;                               // 0x1E4(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ModifiedExternalTemperature;                       // 0x1E8(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ModifiedInternalTemperature;                       // 0x1EC(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBiomesRowHandle                      CurrentBiome;                                      // 0x1F0(0x18)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAliveState                       CurrentAliveState;                                 // 0x208(0x1)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSkipStatContainerChecks;                          // 0x209(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_4A4C[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UIcarusStatContainer*                  OwnerStatContainer;                                // 0x210(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4A50[0xC];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBiomesRowHandle                      BiomeOverride;                                     // 0x224(0x18)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FAtmospheresRowHandle                 AtmosphereOverride;                                // 0x23C(0x18)(NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         BlockBiomeUpdate;                                  // 0x254(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         BlockAtmosphereUpdate;                             // 0x255(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4A5F[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bHasHealthRegen;                                   // 0x25C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4A64[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UActorState* GetDefaultObj();

	void WeatherTimeTick(float Delta);
	void TakeDamage(const struct FIcarusDamagePacket& DamagePacket);
	void StatContainerUpdated();
	void SetShelter(float Amount);
	void SetHealth(int32 Amount);
	void SetBlockBiomeUpdate(bool bLock);
	void SetBiomeOverride(const struct FBiomesRowHandle& Biome);
	void SetBiome(const struct FBiomesRowHandle& Biome);
	void Respawn();
	void RequestClientsideBiomeUpdate();
	void RequestBiomeUpdate();
	void RegenTick(float DeltaTime);
	void RecalculateHealthRegenRate();
	void RecalculateCurrentHealth();
	void OnRep_ModifiedExternalTemp();
	void OnRep_Health();
	void OnRep_CurrentBiome();
	void OnRep_CurrentAliveState();
	void OnCurrentBiomeUpdated(struct FBiomesRowHandle& NewBiome);
	void Multicast_OnDamaged(int32 InDamage, struct FDamageEvent& DamageEvent, class AController* Instigator, class AActor* DamageCauser);
	void Kill();
	bool IsAlive();
	void InternalTick(float DeltaTime);
	float GetTotalRecentDamage(float Duration);
	float GetShelter();
	float GetRecentDamageCausedByController(class AController* DamageInstigator, float Duration);
	float GetRecentDamageCausedByActor(class AActor* DamageCauser, float Duration);
	int32 GetMaxHealth();
	int32 GetHealth();
	int32 GetEnvironmentalTemperature();
	struct FBoxSphereBounds GetBoundsForTemperatureEffect();
	int32 ConsumeNextUID();
	bool CanRegenerateHealth();
	void AddHealth(int32 Amount);
};

// 0x28 (0xD8 - 0xB0)
// Class Icarus.IcarusStateRecorderComponent
class UIcarusStateRecorderComponent : public UActorComponent
{
public:
	bool                                         bBeginRecordingImmediately;                        // 0xB0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRetainOnDestroy;                                  // 0xB1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EStateRecorderOwnerResolvePolicy  OwnerResolvePolicy;                                // 0xB2(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUsesFastActorPathNameMatching;                    // 0xB3(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  ActorClassName;                                    // 0xB4(0x8)(Edit, ZeroConstructor, EditConst, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4BBE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FString                                ActorPathName;                                     // 0xC0(0x10)(Edit, ZeroConstructor, EditConst, SaveGame, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIsRecordingGameState;                             // 0xD0(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bHasRecordedValidState;                            // 0xD1(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_4BCD[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UIcarusStateRecorderComponent* GetDefaultObj();

	void OnResolvedOwnerEndPlay(class AActor* ResolvedOwner, enum class EEndPlayReason EndPlayReason);
	void EndRecording();
	void BeginRecording();
};

// 0xD0 (0x1A8 - 0xD8)
// Class Icarus.ActorStateRecorderComponent
class UActorStateRecorderComponent : public UIcarusStateRecorderComponent
{
public:
	bool                                         bSaveModifiers;                                    // 0xD8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bShouldReloadActorTransform;                       // 0xD9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4C25[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ActorStateRecorderVersion;                         // 0xDC(0x4)(Edit, ZeroConstructor, EditConst, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FTransform                            ActorTransform;                                    // 0xE0(0x30)(Edit, EditConst, SaveGame, IsPlainOldData, NoDestructor, Protected, NativeAccessSpecifierProtected)
	TArray<struct FInventorySaveData>            SavedInventories;                                  // 0x110(0x10)(Edit, ZeroConstructor, EditConst, SaveGame, Protected, NativeAccessSpecifierProtected)
	struct FFLODActorComponentSaveData           FLODComponentData;                                 // 0x120(0x1C)(Edit, EditConst, SaveGame, NoDestructor, Protected, NativeAccessSpecifierProtected)
	bool                                         bIgnoreUIDWhenFindingOwner;                        // 0x13C(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4C41[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        IcarusActorGUID;                                   // 0x140(0x4)(Edit, ZeroConstructor, EditConst, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  ObjectFName;                                       // 0x144(0x8)(Edit, ZeroConstructor, EditConst, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_4C50[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FModifierStateSaveData>        Modifiers;                                         // 0x150(0x10)(Edit, ZeroConstructor, EditConst, SaveGame, Protected, NativeAccessSpecifierProtected)
	struct FEnergyTraitRecord                    EnergyTraitRecord;                                 // 0x160(0x1)(Edit, EditConst, SaveGame, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FWaterTraitRecord                     WaterTraitRecord;                                  // 0x161(0x1)(Edit, EditConst, SaveGame, NoDestructor, Protected, NativeAccessSpecifierProtected)
	struct FGeneratorTraitRecord                 GeneratorTraitRecord;                              // 0x162(0x1)(Edit, EditConst, SaveGame, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_4C84[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FActorIntVariableRecord>       IntVariables;                                      // 0x168(0x10)(Edit, ZeroConstructor, EditConst, SaveGame, Protected, NativeAccessSpecifierProtected)
	TArray<struct FActorBoolVariableRecord>      BoolVariables;                                     // 0x178(0x10)(Edit, ZeroConstructor, EditConst, SaveGame, Protected, NativeAccessSpecifierProtected)
	TArray<struct FActorNameVariableRecord>      NameVariables;                                     // 0x188(0x10)(Edit, ZeroConstructor, EditConst, SaveGame, Protected, NativeAccessSpecifierProtected)
	TArray<struct FLinearColorVariableRecord>    LinearColorVariables;                              // 0x198(0x10)(Edit, ZeroConstructor, EditConst, SaveGame, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UActorStateRecorderComponent* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.AfflictionChanceLibrary
class UAfflictionChanceLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UAfflictionChanceLibrary* GetDefaultObj();

	struct FAfflictionChanceRowHandle StructToRowHandle(const struct FAfflictionChanceEnum& EnumValue);
	class FName StructToName(const struct FAfflictionChanceEnum& EnumValue);
	int32 StructToInt(const struct FAfflictionChanceEnum& EnumValue);
	struct FAfflictionChanceEnum RowHandleToStruct(const struct FAfflictionChanceRowHandle& RowHandle);
	void RemoveRowFromAfflictionChanceTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FAfflictionChanceEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FAfflictionChanceEnum& A, const struct FAfflictionChanceEnum& B);
	struct FAfflictionChanceEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FAfflictionChanceRowHandle MakeLiteralAfflictionChance(const struct FAfflictionChanceRowHandle& RowHandle);
	struct FAfflictionChanceRowHandle MakeAfflictionChanceFromIndex(int32 Index);
	struct FAfflictionChanceEnum MakeAfflictionChanceEnum(const struct FAfflictionChanceEnum& Enum);
	struct FAfflictionChanceRowHandle MakeAfflictionChance(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FAfflictionChanceEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetAfflictionChanceStruct(const struct FAfflictionChanceRowHandle& RowHandle, struct FAfflictionChance* AfflictionChance, enum class EValid* Paths);
	bool EqualEqual_FAfflictionChanceRowHandleFAfflictionChanceRowHandle(const struct FAfflictionChanceRowHandle& RowHandleA, const struct FAfflictionChanceRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FAfflictionChanceEnum& A, const struct FAfflictionChanceEnum& B);
	struct FAfflictionChanceRowHandle CastToAfflictionChanceRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakAfflictionChanceEnum(const struct FAfflictionChanceEnum& Enum, class FName* Name, int32* Index);
	void AddRowToAfflictionChanceTable(class FName Name, const struct FAfflictionChance& Data, struct FAfflictionChanceRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.AfflictionChanceTable
class UAfflictionChanceTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UAfflictionChanceTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.AIAudioDataLibrary
class UAIAudioDataLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UAIAudioDataLibrary* GetDefaultObj();

	struct FAIAudioDataRowHandle StructToRowHandle(const struct FAIAudioDataEnum& EnumValue);
	class FName StructToName(const struct FAIAudioDataEnum& EnumValue);
	int32 StructToInt(const struct FAIAudioDataEnum& EnumValue);
	struct FAIAudioDataEnum RowHandleToStruct(const struct FAIAudioDataRowHandle& RowHandle);
	void RemoveRowFromAIAudioDataTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FAIAudioDataEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FAIAudioDataEnum& A, const struct FAIAudioDataEnum& B);
	struct FAIAudioDataEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FAIAudioDataRowHandle MakeLiteralAIAudioData(const struct FAIAudioDataRowHandle& RowHandle);
	struct FAIAudioDataRowHandle MakeAIAudioDataFromIndex(int32 Index);
	struct FAIAudioDataEnum MakeAIAudioDataEnum(const struct FAIAudioDataEnum& Enum);
	struct FAIAudioDataRowHandle MakeAIAudioData(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FAIAudioDataEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetAIAudioDataStruct(const struct FAIAudioDataRowHandle& RowHandle, struct FAIAudioData* AIAudioData, enum class EValid* Paths);
	bool EqualEqual_FAIAudioDataRowHandleFAIAudioDataRowHandle(const struct FAIAudioDataRowHandle& RowHandleA, const struct FAIAudioDataRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FAIAudioDataEnum& A, const struct FAIAudioDataEnum& B);
	struct FAIAudioDataRowHandle CastToAIAudioDataRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakAIAudioDataEnum(const struct FAIAudioDataEnum& Enum, class FName* Name, int32* Index);
	void AddRowToAIAudioDataTable(class FName Name, const struct FAIAudioData& Data, struct FAIAudioDataRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.AIAudioDataTable
class UAIAudioDataTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UAIAudioDataTable* GetDefaultObj();

};

// 0x68 (0x98 - 0x30)
// Class Icarus.AICoordinatorSubsystem
class UAICoordinatorSubsystem : public UWorldSubsystem
{
public:
	TArray<struct FActiveEvent>                  ActiveEvents;                                      // 0x30(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<struct FAIEventsEnum, struct FEventCooldownList> EventsOnCooldown;                                  // 0x40(0x50)(Protected, NativeAccessSpecifierProtected)
	struct FTimerHandle                          CheckPendingCooldownsHandle;                       // 0x90(0x8)(NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAICoordinatorSubsystem* GetDefaultObj();

	void SetupInitialCooldowns();
	enum class EAIEventRequestResponse RequestAIEvent(const struct FAIEventsEnum& Event, class AActor* InstigatorActor);
	void PutEventOnCooldown(struct FAIEventsRowHandle& Event);
	void OnActiveEventEndPlay(class AActor* Actor, enum class EEndPlayReason EndPlayReason);
	bool IsEventActive(const struct FAIEventsEnum& Event);
	int32 GetActiveEventsOfType(const struct FAIEventsEnum& Event, TArray<class AAIEvent*>* OutEvents);
	void CleanupActiveEvent(class AAIEvent* Event);
	void CheckPendingCooldownTimers();
	bool CanRequestAIEvent(const struct FAIEventsEnum& Event);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.AICreatureTypeLibrary
class UAICreatureTypeLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UAICreatureTypeLibrary* GetDefaultObj();

	struct FAICreatureTypeRowHandle StructToRowHandle(const struct FAICreatureTypeEnum& EnumValue);
	class FName StructToName(const struct FAICreatureTypeEnum& EnumValue);
	int32 StructToInt(const struct FAICreatureTypeEnum& EnumValue);
	struct FAICreatureTypeEnum RowHandleToStruct(const struct FAICreatureTypeRowHandle& RowHandle);
	void RemoveRowFromAICreatureTypeTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FAICreatureTypeEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FAICreatureTypeEnum& A, const struct FAICreatureTypeEnum& B);
	struct FAICreatureTypeEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FAICreatureTypeRowHandle MakeLiteralAICreatureType(const struct FAICreatureTypeRowHandle& RowHandle);
	struct FAICreatureTypeRowHandle MakeAICreatureTypeFromIndex(int32 Index);
	struct FAICreatureTypeEnum MakeAICreatureTypeEnum(const struct FAICreatureTypeEnum& Enum);
	struct FAICreatureTypeRowHandle MakeAICreatureType(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FAICreatureTypeEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetAICreatureTypeStruct(const struct FAICreatureTypeRowHandle& RowHandle, struct FAICreatureType* AICreatureType, enum class EValid* Paths);
	bool EqualEqual_FAICreatureTypeRowHandleFAICreatureTypeRowHandle(const struct FAICreatureTypeRowHandle& RowHandleA, const struct FAICreatureTypeRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FAICreatureTypeEnum& A, const struct FAICreatureTypeEnum& B);
	struct FAICreatureTypeRowHandle CastToAICreatureTypeRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakAICreatureTypeEnum(const struct FAICreatureTypeEnum& Enum, class FName* Name, int32* Index);
	void AddRowToAICreatureTypeTable(class FName Name, const struct FAICreatureType& Data, struct FAICreatureTypeRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.AICreatureTypeTable
class UAICreatureTypeTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UAICreatureTypeTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.AIDescriptorsLibrary
class UAIDescriptorsLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UAIDescriptorsLibrary* GetDefaultObj();

	struct FAIDescriptorsRowHandle StructToRowHandle(const struct FAIDescriptorsEnum& EnumValue);
	class FName StructToName(const struct FAIDescriptorsEnum& EnumValue);
	int32 StructToInt(const struct FAIDescriptorsEnum& EnumValue);
	struct FAIDescriptorsEnum RowHandleToStruct(const struct FAIDescriptorsRowHandle& RowHandle);
	void RemoveRowFromAIDescriptorsTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FAIDescriptorsEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FAIDescriptorsEnum& A, const struct FAIDescriptorsEnum& B);
	struct FAIDescriptorsEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FAIDescriptorsRowHandle MakeLiteralAIDescriptors(const struct FAIDescriptorsRowHandle& RowHandle);
	struct FAIDescriptorsRowHandle MakeAIDescriptorsFromIndex(int32 Index);
	struct FAIDescriptorsEnum MakeAIDescriptorsEnum(const struct FAIDescriptorsEnum& Enum);
	struct FAIDescriptorsRowHandle MakeAIDescriptors(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FAIDescriptorsEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetAIDescriptorsStruct(const struct FAIDescriptorsRowHandle& RowHandle, struct FAIDescriptor* AIDescriptors, enum class EValid* Paths);
	bool EqualEqual_FAIDescriptorsRowHandleFAIDescriptorsRowHandle(const struct FAIDescriptorsRowHandle& RowHandleA, const struct FAIDescriptorsRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FAIDescriptorsEnum& A, const struct FAIDescriptorsEnum& B);
	struct FAIDescriptorsRowHandle CastToAIDescriptorsRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakAIDescriptorsEnum(const struct FAIDescriptorsEnum& Enum, class FName* Name, int32* Index);
	void AddRowToAIDescriptorsTable(class FName Name, const struct FAIDescriptor& Data, struct FAIDescriptorsRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.AIDescriptorsTable
class UAIDescriptorsTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UAIDescriptorsTable* GetDefaultObj();

};

// 0x28 (0x248 - 0x220)
// Class Icarus.AIEvent
class AAIEvent : public AActor
{
public:
	struct FAIEventsRowHandle                    AssignedEvent;                                     // 0x220(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, Net, DisableEditOnTemplate, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                InstigatorActor;                                   // 0x238(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, DisableEditOnTemplate, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TickInterval;                                      // 0x240(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_64F0[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAIEvent* GetDefaultObj();

	bool WasEventCompletionSuccessful();
	void TickEvent(float DeltaTime);
	void SetupEvent(const struct FAIEventsRowHandle& Event, class AActor* EventInstigator);
	void CompleteEvent(bool bSuccess);
	bool ArePreconditionsValid(class AActor* InInstigatorActor);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.AIEventsLibrary
class UAIEventsLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UAIEventsLibrary* GetDefaultObj();

	struct FAIEventsRowHandle StructToRowHandle(const struct FAIEventsEnum& EnumValue);
	class FName StructToName(const struct FAIEventsEnum& EnumValue);
	int32 StructToInt(const struct FAIEventsEnum& EnumValue);
	struct FAIEventsEnum RowHandleToStruct(const struct FAIEventsRowHandle& RowHandle);
	void RemoveRowFromAIEventsTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FAIEventsEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FAIEventsEnum& A, const struct FAIEventsEnum& B);
	struct FAIEventsEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FAIEventsRowHandle MakeLiteralAIEvents(const struct FAIEventsRowHandle& RowHandle);
	struct FAIEventsRowHandle MakeAIEventsFromIndex(int32 Index);
	struct FAIEventsEnum MakeAIEventsEnum(const struct FAIEventsEnum& Enum);
	struct FAIEventsRowHandle MakeAIEvents(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FAIEventsEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetAIEventsStruct(const struct FAIEventsRowHandle& RowHandle, struct FAIEventData* AIEvents, enum class EValid* Paths);
	bool EqualEqual_FAIEventsRowHandleFAIEventsRowHandle(const struct FAIEventsRowHandle& RowHandleA, const struct FAIEventsRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FAIEventsEnum& A, const struct FAIEventsEnum& B);
	struct FAIEventsRowHandle CastToAIEventsRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakAIEventsEnum(const struct FAIEventsEnum& Enum, class FName* Name, int32* Index);
	void AddRowToAIEventsTable(class FName Name, const struct FAIEventData& Data, struct FAIEventsRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.AIEventsTable
class UAIEventsTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UAIEventsTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.AIGrowthLibrary
class UAIGrowthLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UAIGrowthLibrary* GetDefaultObj();

	struct FAIGrowthRowHandle StructToRowHandle(const struct FAIGrowthEnum& EnumValue);
	class FName StructToName(const struct FAIGrowthEnum& EnumValue);
	int32 StructToInt(const struct FAIGrowthEnum& EnumValue);
	struct FAIGrowthEnum RowHandleToStruct(const struct FAIGrowthRowHandle& RowHandle);
	void RemoveRowFromAIGrowthTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FAIGrowthEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FAIGrowthEnum& A, const struct FAIGrowthEnum& B);
	struct FAIGrowthEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FAIGrowthRowHandle MakeLiteralAIGrowth(const struct FAIGrowthRowHandle& RowHandle);
	struct FAIGrowthRowHandle MakeAIGrowthFromIndex(int32 Index);
	struct FAIGrowthEnum MakeAIGrowthEnum(const struct FAIGrowthEnum& Enum);
	struct FAIGrowthRowHandle MakeAIGrowth(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FAIGrowthEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetAIGrowthStruct(const struct FAIGrowthRowHandle& RowHandle, struct FAIGrowth* AIGrowth, enum class EValid* Paths);
	bool EqualEqual_FAIGrowthRowHandleFAIGrowthRowHandle(const struct FAIGrowthRowHandle& RowHandleA, const struct FAIGrowthRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FAIGrowthEnum& A, const struct FAIGrowthEnum& B);
	struct FAIGrowthRowHandle CastToAIGrowthRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakAIGrowthEnum(const struct FAIGrowthEnum& Enum, class FName* Name, int32* Index);
	void AddRowToAIGrowthTable(class FName Name, const struct FAIGrowth& Data, struct FAIGrowthRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.AIGrowthTable
class UAIGrowthTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UAIGrowthTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.AIRelationshipsLibrary
class UAIRelationshipsLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UAIRelationshipsLibrary* GetDefaultObj();

	struct FAIRelationshipsRowHandle StructToRowHandle(const struct FAIRelationshipsEnum& EnumValue);
	class FName StructToName(const struct FAIRelationshipsEnum& EnumValue);
	int32 StructToInt(const struct FAIRelationshipsEnum& EnumValue);
	struct FAIRelationshipsEnum RowHandleToStruct(const struct FAIRelationshipsRowHandle& RowHandle);
	void RemoveRowFromAIRelationshipsTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FAIRelationshipsEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FAIRelationshipsEnum& A, const struct FAIRelationshipsEnum& B);
	struct FAIRelationshipsEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FAIRelationshipsRowHandle MakeLiteralAIRelationships(const struct FAIRelationshipsRowHandle& RowHandle);
	struct FAIRelationshipsRowHandle MakeAIRelationshipsFromIndex(int32 Index);
	struct FAIRelationshipsEnum MakeAIRelationshipsEnum(const struct FAIRelationshipsEnum& Enum);
	struct FAIRelationshipsRowHandle MakeAIRelationships(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FAIRelationshipsEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetAIRelationshipsStruct(const struct FAIRelationshipsRowHandle& RowHandle, struct FAIRelationshipData* AIRelationships, enum class EValid* Paths);
	bool EqualEqual_FAIRelationshipsRowHandleFAIRelationshipsRowHandle(const struct FAIRelationshipsRowHandle& RowHandleA, const struct FAIRelationshipsRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FAIRelationshipsEnum& A, const struct FAIRelationshipsEnum& B);
	struct FAIRelationshipsRowHandle CastToAIRelationshipsRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakAIRelationshipsEnum(const struct FAIRelationshipsEnum& Enum, class FName* Name, int32* Index);
	void AddRowToAIRelationshipsTable(class FName Name, const struct FAIRelationshipData& Data, struct FAIRelationshipsRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.AIRelationshipsTable
class UAIRelationshipsTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UAIRelationshipsTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.AISetupLibrary
class UAISetupLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UAISetupLibrary* GetDefaultObj();

	struct FAISetupRowHandle StructToRowHandle(const struct FAISetupEnum& EnumValue);
	class FName StructToName(const struct FAISetupEnum& EnumValue);
	int32 StructToInt(const struct FAISetupEnum& EnumValue);
	struct FAISetupEnum RowHandleToStruct(const struct FAISetupRowHandle& RowHandle);
	void RemoveRowFromAISetupTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FAISetupEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FAISetupEnum& A, const struct FAISetupEnum& B);
	struct FAISetupEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FAISetupRowHandle MakeLiteralAISetup(const struct FAISetupRowHandle& RowHandle);
	struct FAISetupRowHandle MakeAISetupFromIndex(int32 Index);
	struct FAISetupEnum MakeAISetupEnum(const struct FAISetupEnum& Enum);
	struct FAISetupRowHandle MakeAISetup(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FAISetupEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetAISetupStruct(const struct FAISetupRowHandle& RowHandle, struct FAISetup* AISetup, enum class EValid* Paths);
	bool EqualEqual_FAISetupRowHandleFAISetupRowHandle(const struct FAISetupRowHandle& RowHandleA, const struct FAISetupRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FAISetupEnum& A, const struct FAISetupEnum& B);
	struct FAISetupRowHandle CastToAISetupRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakAISetupEnum(const struct FAISetupEnum& Enum, class FName* Name, int32* Index);
	void AddRowToAISetupTable(class FName Name, const struct FAISetup& Data, struct FAISetupRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.AISetupTable
class UAISetupTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UAISetupTable* GetDefaultObj();

};

// 0xE8 (0x110 - 0x28)
// Class Icarus.AISpawnBehaviour
class UAISpawnBehaviour : public UObject
{
public:
	struct FAutonomousSpawnData                  SpawnData;                                         // 0x28(0xA8)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	struct FAutonomousSpawnsRowHandle            SpawnsRowHandle;                                   // 0xD0(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            SpawnComplete;                                     // 0xE8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class AActor*>                        SpawnedAI;                                         // 0xF8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TSubclassOf<class AIcarusActor>              CachedActorSpawnClass;                             // 0x108(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAISpawnBehaviour* GetDefaultObj();

	bool TrySpawnAI(class UObject* WorldContextObject);
	void TryCleanupIrrelevantAI();
	bool SpawnAI(class UObject* WorldContextObject, struct FTransform& SpawnTransform, class AActor** SpawnedAI, int32 Level, enum class ESpawnActorCollisionHandlingMethod CollisionHandlingMethod);
	void OnSpawnedActorDeath(class UActorState* ActorState);
	void InitialiseSpawnBehaviour(struct FAutonomousSpawnsRowHandle& InSpawnData);
	void CleanupAI(class AActor* AI);
	bool CanCleanupAI(class AActor* AI);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.AISpawnConfigLibrary
class UAISpawnConfigLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UAISpawnConfigLibrary* GetDefaultObj();

	struct FAISpawnConfigRowHandle StructToRowHandle(const struct FAISpawnConfigEnum& EnumValue);
	class FName StructToName(const struct FAISpawnConfigEnum& EnumValue);
	int32 StructToInt(const struct FAISpawnConfigEnum& EnumValue);
	struct FAISpawnConfigEnum RowHandleToStruct(const struct FAISpawnConfigRowHandle& RowHandle);
	void RemoveRowFromAISpawnConfigTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FAISpawnConfigEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FAISpawnConfigEnum& A, const struct FAISpawnConfigEnum& B);
	struct FAISpawnConfigEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FAISpawnConfigRowHandle MakeLiteralAISpawnConfig(const struct FAISpawnConfigRowHandle& RowHandle);
	struct FAISpawnConfigRowHandle MakeAISpawnConfigFromIndex(int32 Index);
	struct FAISpawnConfigEnum MakeAISpawnConfigEnum(const struct FAISpawnConfigEnum& Enum);
	struct FAISpawnConfigRowHandle MakeAISpawnConfig(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FAISpawnConfigEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetAISpawnConfigStruct(const struct FAISpawnConfigRowHandle& RowHandle, struct FAISpawnConfigData* AISpawnConfig, enum class EValid* Paths);
	bool EqualEqual_FAISpawnConfigRowHandleFAISpawnConfigRowHandle(const struct FAISpawnConfigRowHandle& RowHandleA, const struct FAISpawnConfigRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FAISpawnConfigEnum& A, const struct FAISpawnConfigEnum& B);
	struct FAISpawnConfigRowHandle CastToAISpawnConfigRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakAISpawnConfigEnum(const struct FAISpawnConfigEnum& Enum, class FName* Name, int32* Index);
	void AddRowToAISpawnConfigTable(class FName Name, const struct FAISpawnConfigData& Data, struct FAISpawnConfigRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.AISpawnConfigTable
class UAISpawnConfigTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UAISpawnConfigTable* GetDefaultObj();

};

// 0x2B8 (0x4D8 - 0x220)
// Class Icarus.AISpawner
class AAISpawner : public AActor
{
public:
	TArray<struct FTileSpawnData>                WorldSpawnData;                                    // 0x220(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, EditConst, NativeAccessSpecifierPublic)
	class UEnvQuery*                             Template;                                          // 0x230(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        NumberOfCachedSpawnPoints;                         // 0x238(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6AEF[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            GenerationComplete;                                // 0x240(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	int32                                        SelectedTile;                                      // 0x250(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FAISpawnConfigRowHandle               SpawnConfig;                                       // 0x254(0x18)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6AF0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<TSubclassOf<class UIcarusAISpawnFilter>> SpawnRules;                                        // 0x270(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, UObjectWrapper, NativeAccessSpecifierPublic)
	class UIcarusStatContainer*                  StatContainer;                                     // 0x280(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FWorldData                            WorldData;                                         // 0x288(0x160)(BlueprintVisible, BlueprintReadOnly, Protected, NativeAccessSpecifierProtected)
	TMap<struct FAISetupRowHandle, float>        LastAISetupSpawnTime;                              // 0x3E8(0x50)(Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_6AF1[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UAISpawnBehaviour*>             ActiveAutonomousSpawners;                          // 0x448(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, Protected, NativeAccessSpecifierProtected)
	TArray<class AActor*>                        ActorsPendingCleanup;                              // 0x458(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	TMap<struct FBiomesRowHandle, bool>          BlockedBiomes;                                     // 0x468(0x50)(Protected, NativeAccessSpecifierProtected)
	class AIcarusEQSTestingPawn*                 TestingPawn;                                       // 0x4B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6AF2[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AAISpawner* GetDefaultObj();

	void WorldStatsSet();
	void VisualiseTilePosition();
	void UnlinkSpawnedNPC(class AActor* NPC);
	void SpawnPointGenerationComplete();
	void SetupNPC(class AIcarusNPCGOAPCharacter* SpawnedNPC);
	void SetupAutonomousSpawnersPendingLoad();
	void SetupAutonomousSpawner(struct FAutonomousSpawnsRowHandle& AutonomousSpawnHandle);
	void SetDebugSpawnBlockers(bool bEnabled);
	void RemoveActorPendingCleanup(class AActor* Actor);
	void PrintDebugInformation();
	bool PerformNextTileEQS();
	void OnProspectDataSet();
	void OnNPCKilled(class UActorState* ActorState);
	void OnEQSQueryCompleted(TArray<struct FVector>& EQSResults);
	bool IsSpawnPointValid(struct FVector& InLocation, struct FAISetupEnum& InAISetup);
	bool IsBiomeDynamicSpawnLocationBlocked(struct FVector& Location);
	bool IsBiomeDynamicSpawnBlocked(struct FBiomesRowHandle& Biome);
	void InitialiseBehavioursForSpawnConfig(struct FAISpawnConfigData& SpawnConfig);
	int32 GetTotalNumNPCsUndergoingLatentDeath();
	int32 GetNumLatentDeathsForAISetup(const struct FAISetupRowHandle& AISetup);
	float GetLastAISetupSpawnTime(const struct FAISetupRowHandle& AISetup);
	float GetLastAISetupDeathTime(const struct FAISetupRowHandle& AISetup);
	bool GetDebugSpawnBlockers();
	void GenerateSingleTileSpawnPoints();
	void GenerateCachedSpawnPoints();
	void ClearLatentNPCDeaths();
	void BlockBiomeDynamicSpawns(struct FBiomesRowHandle& Biome, bool bBlock);
	void AddActorPendingCleanup(class AActor* Actor);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.AISpawnRulesLibrary
class UAISpawnRulesLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UAISpawnRulesLibrary* GetDefaultObj();

	struct FAISpawnRulesRowHandle StructToRowHandle(const struct FAISpawnRulesEnum& EnumValue);
	class FName StructToName(const struct FAISpawnRulesEnum& EnumValue);
	int32 StructToInt(const struct FAISpawnRulesEnum& EnumValue);
	struct FAISpawnRulesEnum RowHandleToStruct(const struct FAISpawnRulesRowHandle& RowHandle);
	void RemoveRowFromAISpawnRulesTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FAISpawnRulesEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FAISpawnRulesEnum& A, const struct FAISpawnRulesEnum& B);
	struct FAISpawnRulesEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FAISpawnRulesRowHandle MakeLiteralAISpawnRules(const struct FAISpawnRulesRowHandle& RowHandle);
	struct FAISpawnRulesRowHandle MakeAISpawnRulesFromIndex(int32 Index);
	struct FAISpawnRulesEnum MakeAISpawnRulesEnum(const struct FAISpawnRulesEnum& Enum);
	struct FAISpawnRulesRowHandle MakeAISpawnRules(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FAISpawnRulesEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetAISpawnRulesStruct(const struct FAISpawnRulesRowHandle& RowHandle, struct FAISpawnRuleData* AISpawnRules, enum class EValid* Paths);
	bool EqualEqual_FAISpawnRulesRowHandleFAISpawnRulesRowHandle(const struct FAISpawnRulesRowHandle& RowHandleA, const struct FAISpawnRulesRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FAISpawnRulesEnum& A, const struct FAISpawnRulesEnum& B);
	struct FAISpawnRulesRowHandle CastToAISpawnRulesRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakAISpawnRulesEnum(const struct FAISpawnRulesEnum& Enum, class FName* Name, int32* Index);
	void AddRowToAISpawnRulesTable(class FName Name, const struct FAISpawnRuleData& Data, struct FAISpawnRulesRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.AISpawnRulesTable
class UAISpawnRulesTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UAISpawnRulesTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.AISpawnZonesLibrary
class UAISpawnZonesLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UAISpawnZonesLibrary* GetDefaultObj();

	struct FAISpawnZonesRowHandle StructToRowHandle(const struct FAISpawnZonesEnum& EnumValue);
	class FName StructToName(const struct FAISpawnZonesEnum& EnumValue);
	int32 StructToInt(const struct FAISpawnZonesEnum& EnumValue);
	struct FAISpawnZonesEnum RowHandleToStruct(const struct FAISpawnZonesRowHandle& RowHandle);
	void RemoveRowFromAISpawnZonesTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FAISpawnZonesEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FAISpawnZonesEnum& A, const struct FAISpawnZonesEnum& B);
	struct FAISpawnZonesEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FAISpawnZonesRowHandle MakeLiteralAISpawnZones(const struct FAISpawnZonesRowHandle& RowHandle);
	struct FAISpawnZonesRowHandle MakeAISpawnZonesFromIndex(int32 Index);
	struct FAISpawnZonesEnum MakeAISpawnZonesEnum(const struct FAISpawnZonesEnum& Enum);
	struct FAISpawnZonesRowHandle MakeAISpawnZones(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FAISpawnZonesEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetAISpawnZonesStruct(const struct FAISpawnZonesRowHandle& RowHandle, struct FAISpawnZones* AISpawnZones, enum class EValid* Paths);
	bool EqualEqual_FAISpawnZonesRowHandleFAISpawnZonesRowHandle(const struct FAISpawnZonesRowHandle& RowHandleA, const struct FAISpawnZonesRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FAISpawnZonesEnum& A, const struct FAISpawnZonesEnum& B);
	struct FAISpawnZonesRowHandle CastToAISpawnZonesRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakAISpawnZonesEnum(const struct FAISpawnZonesEnum& Enum, class FName* Name, int32* Index);
	void AddRowToAISpawnZonesTable(class FName Name, const struct FAISpawnZones& Data, struct FAISpawnZonesRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.AISpawnZonesTable
class UAISpawnZonesTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UAISpawnZonesTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.AITargetable
class IAITargetable : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAITargetable* GetDefaultObj();

	bool ShouldOverrideTargetNeutrality(class AActor* TargetActor, bool* bIsTargetHostile);
	bool IsHidden();
	bool IsCriticalHitDisabled();
	bool IsActorAlive();
	struct FVector GetTargetLocation();
	int32 GetTargetAlertness();
	struct FAIRelationshipsRowHandle GetRelationshipData();
	TArray<struct FCriticalHitLocation> GetCriticalHitBones();
};

// 0x0 (0x28 - 0x28)
// Class Icarus.AITargetableFunctionLibrary
class UAITargetableFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UAITargetableFunctionLibrary* GetDefaultObj();

	void IsHostileTowards(class AActor* SelfTargetable, class AActor* OtherActorTargetable, enum class ERelationshipType* OutRelationshipSwitch, enum class ERelationshipType* OutRelationshipType);
	bool IsActorTargetable(class AActor* Actor, bool bOnlyAliveActors);
	enum class EStealthAttackType GetTargetStealth(class AActor* TargetableActor);
};

// 0x58 (0x108 - 0xB0)
// Class Icarus.VocalisationComponent
class UVocalisationComponent : public UActorComponent
{
public:
	class UFMODAudioComponent*                   AudioComponent;                                    // 0xB0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6C2E[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UVocalisationComponent* GetDefaultObj();

	enum class EVocalisationPlayResult TryPlayVocalisation(const struct FVocalisationsRowHandle& Vocalisation);
	void OnEventStopped();
	void Initialise(class USceneComponent* TargetComponent, class FName TargetSocket);
	float GetVocalisationLength(const struct FVocalisationsRowHandle& Vocalisation);
	float GetCurrentVocalisationLength();
};

// 0x8 (0x110 - 0x108)
// Class Icarus.AIVocalisationComponent
class UAIVocalisationComponent : public UVocalisationComponent
{
public:
	uint8                                        Pad_6C2F[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAIVocalisationComponent* GetDefaultObj();

	void SetAIState(enum class EAIAudioState State);
	void PlayAIVocalisation(enum class EAIVocalisationType Type);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.AllTalentsInTreeAccolade
class UAllTalentsInTreeAccolade : public UAccoladeImpl
{
public:

	static class UClass* StaticClass();
	static class UAllTalentsInTreeAccolade* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.AlterationsLibrary
class UAlterationsLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UAlterationsLibrary* GetDefaultObj();

	struct FAlterationsRowHandle StructToRowHandle(const struct FAlterationsEnum& EnumValue);
	class FName StructToName(const struct FAlterationsEnum& EnumValue);
	int32 StructToInt(const struct FAlterationsEnum& EnumValue);
	struct FAlterationsEnum RowHandleToStruct(const struct FAlterationsRowHandle& RowHandle);
	void RemoveRowFromAlterationsTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FAlterationsEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FAlterationsEnum& A, const struct FAlterationsEnum& B);
	struct FAlterationsEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FAlterationsRowHandle MakeLiteralAlterations(const struct FAlterationsRowHandle& RowHandle);
	struct FAlterationsRowHandle MakeAlterationsFromIndex(int32 Index);
	struct FAlterationsEnum MakeAlterationsEnum(const struct FAlterationsEnum& Enum);
	struct FAlterationsRowHandle MakeAlterations(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FAlterationsEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetAlterationsStruct(const struct FAlterationsRowHandle& RowHandle, struct FAlteration* Alterations, enum class EValid* Paths);
	bool EqualEqual_FAlterationsRowHandleFAlterationsRowHandle(const struct FAlterationsRowHandle& RowHandleA, const struct FAlterationsRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FAlterationsEnum& A, const struct FAlterationsEnum& B);
	struct FAlterationsRowHandle CastToAlterationsRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakAlterationsEnum(const struct FAlterationsEnum& Enum, class FName* Name, int32* Index);
	void AddRowToAlterationsTable(class FName Name, const struct FAlteration& Data, struct FAlterationsRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.AlterationsTable
class UAlterationsTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UAlterationsTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.AmmoTypesLibrary
class UAmmoTypesLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UAmmoTypesLibrary* GetDefaultObj();

	struct FAmmoTypesRowHandle StructToRowHandle(const struct FAmmoTypesEnum& EnumValue);
	class FName StructToName(const struct FAmmoTypesEnum& EnumValue);
	int32 StructToInt(const struct FAmmoTypesEnum& EnumValue);
	struct FAmmoTypesEnum RowHandleToStruct(const struct FAmmoTypesRowHandle& RowHandle);
	void RemoveRowFromAmmoTypesTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FAmmoTypesEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FAmmoTypesEnum& A, const struct FAmmoTypesEnum& B);
	struct FAmmoTypesEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FAmmoTypesRowHandle MakeLiteralAmmoTypes(const struct FAmmoTypesRowHandle& RowHandle);
	struct FAmmoTypesRowHandle MakeAmmoTypesFromIndex(int32 Index);
	struct FAmmoTypesEnum MakeAmmoTypesEnum(const struct FAmmoTypesEnum& Enum);
	struct FAmmoTypesRowHandle MakeAmmoTypes(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FAmmoTypesEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetAmmoTypesStruct(const struct FAmmoTypesRowHandle& RowHandle, struct FAmmoTypeData* AmmoTypes, enum class EValid* Paths);
	bool EqualEqual_FAmmoTypesRowHandleFAmmoTypesRowHandle(const struct FAmmoTypesRowHandle& RowHandleA, const struct FAmmoTypesRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FAmmoTypesEnum& A, const struct FAmmoTypesEnum& B);
	struct FAmmoTypesRowHandle CastToAmmoTypesRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakAmmoTypesEnum(const struct FAmmoTypesEnum& Enum, class FName* Name, int32* Index);
	void AddRowToAmmoTypesTable(class FName Name, const struct FAmmoTypeData& Data, struct FAmmoTypesRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.AmmoTypesTable
class UAmmoTypesTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UAmmoTypesTable* GetDefaultObj();

};

// 0x20 (0x58 - 0x38)
// Class Icarus.AnimNotify_IcarusPlaySound
class UAnimNotify_IcarusPlaySound : public UAnimNotify
{
public:
	class UFMODEvent*                            FMODEvent;                                         // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFollow;                                           // 0x40(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6CC5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  AttachSocket;                                      // 0x44(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseListenerRotation;                              // 0x4C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseOcclusion;                                     // 0x4D(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6CC7[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  OcclusionTrace;                                    // 0x50(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotify_IcarusPlaySound* GetDefaultObj();

};

// 0x18 (0x50 - 0x38)
// Class Icarus.AnimNotify_PlaySoundPlayer
class UAnimNotify_PlaySoundPlayer : public UAnimNotify
{
public:
	class UFMODEvent*                            FMODEvent;                                         // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseItemAnimData;                                  // 0x40(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6CCE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  ItemAnimName;                                      // 0x44(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ItemAnimIndex;                                     // 0x4C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAnimNotify_PlaySoundPlayer* GetDefaultObj();

	class UFMODEvent* GetFMODEvent(class AIcarusPlayerCharacter* PlayerCharacter);
};

// 0x28 (0x58 - 0x30)
// Class Icarus.AnimNotifyState_IcarusPlaySoundContinuous
class UAnimNotifyState_IcarusPlaySoundContinuous : public UAnimNotifyState
{
public:
	class UFMODEvent*                            FMODEvent;                                         // 0x30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  AttachSocket;                                      // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseListenerRotation;                              // 0x40(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseOcclusion;                                     // 0x41(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6CCF[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  OcclusionTrace;                                    // 0x44(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6CD0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFMODAudioComponent*                   AudioComponent;                                    // 0x50(0x8)(ExportObject, BlueprintReadOnly, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAnimNotifyState_IcarusPlaySoundContinuous* GetDefaultObj();

};

// 0x0 (0xD0 - 0xD0)
// Class Icarus.ArmourComponent
class UArmourComponent : public UTraitComponent
{
public:

	static class UClass* StaticClass();
	static class UArmourComponent* GetDefaultObj();

	bool GetArmourData(struct FArmourData* OutData);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.ArmourLibrary
class UArmourLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UArmourLibrary* GetDefaultObj();

	struct FArmourRowHandle StructToRowHandle(const struct FArmourEnum& EnumValue);
	class FName StructToName(const struct FArmourEnum& EnumValue);
	int32 StructToInt(const struct FArmourEnum& EnumValue);
	struct FArmourEnum RowHandleToStruct(const struct FArmourRowHandle& RowHandle);
	void RemoveRowFromArmourTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FArmourEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FArmourEnum& A, const struct FArmourEnum& B);
	struct FArmourEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FArmourRowHandle MakeLiteralArmour(const struct FArmourRowHandle& RowHandle);
	struct FArmourRowHandle MakeArmourFromIndex(int32 Index);
	struct FArmourEnum MakeArmourEnum(const struct FArmourEnum& Enum);
	struct FArmourRowHandle MakeArmour(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FArmourEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetArmourStruct(const struct FArmourRowHandle& RowHandle, struct FArmourData* Armour, enum class EValid* Paths);
	bool EqualEqual_FArmourRowHandleFArmourRowHandle(const struct FArmourRowHandle& RowHandleA, const struct FArmourRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FArmourEnum& A, const struct FArmourEnum& B);
	struct FArmourRowHandle CastToArmourRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakArmourEnum(const struct FArmourEnum& Enum, class FName* Name, int32* Index);
	void AddRowToArmourTable(class FName Name, const struct FArmourData& Data, struct FArmourRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.ArmourSetBonusLibrary
class UArmourSetBonusLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UArmourSetBonusLibrary* GetDefaultObj();

	struct FArmourSetBonusRowHandle StructToRowHandle(const struct FArmourSetBonusEnum& EnumValue);
	class FName StructToName(const struct FArmourSetBonusEnum& EnumValue);
	int32 StructToInt(const struct FArmourSetBonusEnum& EnumValue);
	struct FArmourSetBonusEnum RowHandleToStruct(const struct FArmourSetBonusRowHandle& RowHandle);
	void RemoveRowFromArmourSetBonusTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FArmourSetBonusEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FArmourSetBonusEnum& A, const struct FArmourSetBonusEnum& B);
	struct FArmourSetBonusEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FArmourSetBonusRowHandle MakeLiteralArmourSetBonus(const struct FArmourSetBonusRowHandle& RowHandle);
	struct FArmourSetBonusRowHandle MakeArmourSetBonusFromIndex(int32 Index);
	struct FArmourSetBonusEnum MakeArmourSetBonusEnum(const struct FArmourSetBonusEnum& Enum);
	struct FArmourSetBonusRowHandle MakeArmourSetBonus(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FArmourSetBonusEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetArmourSetBonusStruct(const struct FArmourSetBonusRowHandle& RowHandle, struct FArmourSetBonus* ArmourSetBonus, enum class EValid* Paths);
	bool EqualEqual_FArmourSetBonusRowHandleFArmourSetBonusRowHandle(const struct FArmourSetBonusRowHandle& RowHandleA, const struct FArmourSetBonusRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FArmourSetBonusEnum& A, const struct FArmourSetBonusEnum& B);
	struct FArmourSetBonusRowHandle CastToArmourSetBonusRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakArmourSetBonusEnum(const struct FArmourSetBonusEnum& Enum, class FName* Name, int32* Index);
	void AddRowToArmourSetBonusTable(class FName Name, const struct FArmourSetBonus& Data, struct FArmourSetBonusRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.ArmourSetBonusTable
class UArmourSetBonusTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UArmourSetBonusTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.ArmourSetsLibrary
class UArmourSetsLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UArmourSetsLibrary* GetDefaultObj();

	struct FArmourSetsRowHandle StructToRowHandle(const struct FArmourSetsEnum& EnumValue);
	class FName StructToName(const struct FArmourSetsEnum& EnumValue);
	int32 StructToInt(const struct FArmourSetsEnum& EnumValue);
	struct FArmourSetsEnum RowHandleToStruct(const struct FArmourSetsRowHandle& RowHandle);
	void RemoveRowFromArmourSetsTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FArmourSetsEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FArmourSetsEnum& A, const struct FArmourSetsEnum& B);
	struct FArmourSetsEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FArmourSetsRowHandle MakeLiteralArmourSets(const struct FArmourSetsRowHandle& RowHandle);
	struct FArmourSetsRowHandle MakeArmourSetsFromIndex(int32 Index);
	struct FArmourSetsEnum MakeArmourSetsEnum(const struct FArmourSetsEnum& Enum);
	struct FArmourSetsRowHandle MakeArmourSets(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FArmourSetsEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetArmourSetsStruct(const struct FArmourSetsRowHandle& RowHandle, struct FArmourSet* ArmourSets, enum class EValid* Paths);
	bool EqualEqual_FArmourSetsRowHandleFArmourSetsRowHandle(const struct FArmourSetsRowHandle& RowHandleA, const struct FArmourSetsRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FArmourSetsEnum& A, const struct FArmourSetsEnum& B);
	struct FArmourSetsRowHandle CastToArmourSetsRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakArmourSetsEnum(const struct FArmourSetsEnum& Enum, class FName* Name, int32* Index);
	void AddRowToArmourSetsTable(class FName Name, const struct FArmourSet& Data, struct FArmourSetsRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.ArmourSetsTable
class UArmourSetsTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UArmourSetsTable* GetDefaultObj();

};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.ArmourTable
class UArmourTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UArmourTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.AssetReferencesLibrary
class UAssetReferencesLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UAssetReferencesLibrary* GetDefaultObj();

	struct FAssetReferencesRowHandle StructToRowHandle(const struct FAssetReferencesEnum& EnumValue);
	class FName StructToName(const struct FAssetReferencesEnum& EnumValue);
	int32 StructToInt(const struct FAssetReferencesEnum& EnumValue);
	struct FAssetReferencesEnum RowHandleToStruct(const struct FAssetReferencesRowHandle& RowHandle);
	void RemoveRowFromAssetReferencesTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FAssetReferencesEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FAssetReferencesEnum& A, const struct FAssetReferencesEnum& B);
	struct FAssetReferencesEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FAssetReferencesRowHandle MakeLiteralAssetReferences(const struct FAssetReferencesRowHandle& RowHandle);
	struct FAssetReferencesRowHandle MakeAssetReferencesFromIndex(int32 Index);
	struct FAssetReferencesEnum MakeAssetReferencesEnum(const struct FAssetReferencesEnum& Enum);
	struct FAssetReferencesRowHandle MakeAssetReferences(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FAssetReferencesEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetAssetReferencesStruct(const struct FAssetReferencesRowHandle& RowHandle, struct FAssetReferenceData* AssetReferences, enum class EValid* Paths);
	bool EqualEqual_FAssetReferencesRowHandleFAssetReferencesRowHandle(const struct FAssetReferencesRowHandle& RowHandleA, const struct FAssetReferencesRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FAssetReferencesEnum& A, const struct FAssetReferencesEnum& B);
	struct FAssetReferencesRowHandle CastToAssetReferencesRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakAssetReferencesEnum(const struct FAssetReferencesEnum& Enum, class FName* Name, int32* Index);
	void AddRowToAssetReferencesTable(class FName Name, const struct FAssetReferenceData& Data, struct FAssetReferencesRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.AssetReferencesTable
class UAssetReferencesTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UAssetReferencesTable* GetDefaultObj();

};

// 0x0 (0x220 - 0x220)
// Class Icarus.AtmosphereController
class AAtmosphereController : public AInfo
{
public:

	static class UClass* StaticClass();
	static class AAtmosphereController* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.AtmospheresLibrary
class UAtmospheresLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UAtmospheresLibrary* GetDefaultObj();

	struct FAtmospheresRowHandle StructToRowHandle(const struct FAtmospheresEnum& EnumValue);
	class FName StructToName(const struct FAtmospheresEnum& EnumValue);
	int32 StructToInt(const struct FAtmospheresEnum& EnumValue);
	struct FAtmospheresEnum RowHandleToStruct(const struct FAtmospheresRowHandle& RowHandle);
	void RemoveRowFromAtmospheresTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FAtmospheresEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FAtmospheresEnum& A, const struct FAtmospheresEnum& B);
	struct FAtmospheresEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FAtmospheresRowHandle MakeLiteralAtmospheres(const struct FAtmospheresRowHandle& RowHandle);
	struct FAtmospheresRowHandle MakeAtmospheresFromIndex(int32 Index);
	struct FAtmospheresEnum MakeAtmospheresEnum(const struct FAtmospheresEnum& Enum);
	struct FAtmospheresRowHandle MakeAtmospheres(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FAtmospheresEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetAtmospheresStruct(const struct FAtmospheresRowHandle& RowHandle, struct FIcarusAtmosphere* Atmospheres, enum class EValid* Paths);
	bool EqualEqual_FAtmospheresRowHandleFAtmospheresRowHandle(const struct FAtmospheresRowHandle& RowHandleA, const struct FAtmospheresRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FAtmospheresEnum& A, const struct FAtmospheresEnum& B);
	struct FAtmospheresRowHandle CastToAtmospheresRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakAtmospheresEnum(const struct FAtmospheresEnum& Enum, class FName* Name, int32* Index);
	void AddRowToAtmospheresTable(class FName Name, const struct FIcarusAtmosphere& Data, struct FAtmospheresRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.AtmospheresTable
class UAtmospheresTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UAtmospheresTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.AttachmentIconsLibrary
class UAttachmentIconsLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UAttachmentIconsLibrary* GetDefaultObj();

	struct FAttachmentIconsRowHandle StructToRowHandle(const struct FAttachmentIconsEnum& EnumValue);
	class FName StructToName(const struct FAttachmentIconsEnum& EnumValue);
	int32 StructToInt(const struct FAttachmentIconsEnum& EnumValue);
	struct FAttachmentIconsEnum RowHandleToStruct(const struct FAttachmentIconsRowHandle& RowHandle);
	void RemoveRowFromAttachmentIconsTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FAttachmentIconsEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FAttachmentIconsEnum& A, const struct FAttachmentIconsEnum& B);
	struct FAttachmentIconsEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FAttachmentIconsRowHandle MakeLiteralAttachmentIcons(const struct FAttachmentIconsRowHandle& RowHandle);
	struct FAttachmentIconsRowHandle MakeAttachmentIconsFromIndex(int32 Index);
	struct FAttachmentIconsEnum MakeAttachmentIconsEnum(const struct FAttachmentIconsEnum& Enum);
	struct FAttachmentIconsRowHandle MakeAttachmentIcons(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FAttachmentIconsEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetAttachmentIconsStruct(const struct FAttachmentIconsRowHandle& RowHandle, struct FAttachmentIcon* AttachmentIcons, enum class EValid* Paths);
	bool EqualEqual_FAttachmentIconsRowHandleFAttachmentIconsRowHandle(const struct FAttachmentIconsRowHandle& RowHandleA, const struct FAttachmentIconsRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FAttachmentIconsEnum& A, const struct FAttachmentIconsEnum& B);
	struct FAttachmentIconsRowHandle CastToAttachmentIconsRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakAttachmentIconsEnum(const struct FAttachmentIconsEnum& Enum, class FName* Name, int32* Index);
	void AddRowToAttachmentIconsTable(class FName Name, const struct FAttachmentIcon& Data, struct FAttachmentIconsRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.AttachmentIconsTable
class UAttachmentIconsTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UAttachmentIconsTable* GetDefaultObj();

};

// 0xB0 (0x160 - 0xB0)
// Class Icarus.AudioContextComponent
class UAudioContextComponent : public UActorComponent
{
public:
	float                                        MaxUpdateDistance;                                 // 0xB0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OcclusionShelterContextThreshold;                  // 0xB4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnEnteredCave;                                     // 0xB8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnExitedCave;                                      // 0xC8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_6DF4[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	enum class EAudioShelterState                ShelterState;                                      // 0xD9(0x1)(Net, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6DF5[0x16];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UAudioOcclusionComponent*              OcclusionComponent;                                // 0xF0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FAudioContextSubscriber>       Subscribers;                                       // 0xF8(0x10)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TMap<class AActor*, struct FAudioContextCaveColliderSet> CaveOverlaps;                                      // 0x108(0x50)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6DF6[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAudioContextComponent* GetDefaultObj();

	void UnsubscribeAudioComponentFromUpdates(class UFMODAudioComponent* AudioComponent);
	void SubscribeAudioComponentToUpdates(class UFMODAudioComponent* AudioComponent, bool bUsesOcclusionParameter, class FName OcclusionTraceName, bool bUsesWaterImmersionParameter);
	void SetCaveOverlapOnceByLocation(const struct FVector& Location);
	void RemoveCaveOverlap(class AActor* Cave, class UPrimitiveComponent* Collider);
	enum class EAudioShelterState GetShelterState();
	enum class EOcclusionShelterContextFMODParam GetOcclusionShelterContextFMODParam(float OcclusionValue);
	float GetListenerCaveSpaceCorrelation();
	float GetCurrentWaterImmersion();
	float GetCurrentOcclusion(class FName TracePointName);
	enum class ECaveContextFMODParam GetCaveContextFMODParam();
	void AddCaveOverlap(class AActor* Cave, class UPrimitiveComponent* Collider);
};

// 0x8 (0x168 - 0x160)
// Class Icarus.AudioContextCreatureComponent
class UAudioContextCreatureComponent : public UAudioContextComponent
{
public:
	class UCreatureAudioComponent*               CreatureAudio;                                     // 0x160(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAudioContextCreatureComponent* GetDefaultObj();

};

// 0x10 (0x170 - 0x160)
// Class Icarus.AudioContextPlayerComponent
class UAudioContextPlayerComponent : public UAudioContextComponent
{
public:
	float                                        ShelterStateLowThreshold;                          // 0x160(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ShelterStateHighThreshold;                         // 0x164(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPlayerMovementAudioComponent*         PlayerMovementAudioComponent;                      // 0x168(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UAudioContextPlayerComponent* GetDefaultObj();

	void ServerSetNewShelter(enum class EAudioShelterState NewShelterState);
	void OnShelterUpdated(float NewShelter);
};

// 0x0 (0x470 - 0x470)
// Class Icarus.AudioListenerCollider
class UAudioListenerCollider : public USphereComponent
{
public:

	static class UClass* StaticClass();
	static class UAudioListenerCollider* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.AudioOccluderInterface
class IAudioOccluderInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAudioOccluderInterface* GetDefaultObj();

	float GetOcclusionValue();
};

// 0x78 (0x270 - 0x1F8)
// Class Icarus.AudioOcclusionComponent
class UAudioOcclusionComponent : public USceneComponent
{
public:
	bool                                         bDebug;                                            // 0x1F8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6E0C[0x77];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAudioOcclusionComponent* GetDefaultObj();

	TArray<struct FAudioOcclusionTracePoint> GetTracePoints(struct FVector& ListenerLocation);
};

// 0x10 (0x280 - 0x270)
// Class Icarus.AudioOcclusionSocketTraceComponent
class UAudioOcclusionSocketTraceComponent : public UAudioOcclusionComponent
{
public:
	TArray<struct FAudioOcclusionSocketTracePoint> TracePointDefinitions;                             // 0x270(0x10)(Edit, BlueprintVisible, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UAudioOcclusionSocketTraceComponent* GetDefaultObj();

	void SetTracePointTargets(class USceneComponent* TargetComponent);
};

// 0x0 (0x280 - 0x280)
// Class Icarus.AudioOcclusionCharacterComponent
class UAudioOcclusionCharacterComponent : public UAudioOcclusionSocketTraceComponent
{
public:

	static class UClass* StaticClass();
	static class UAudioOcclusionCharacterComponent* GetDefaultObj();

};

// 0x0 (0x270 - 0x270)
// Class Icarus.AudioOcclusionDropshipComponent
class UAudioOcclusionDropshipComponent : public UAudioOcclusionComponent
{
public:

	static class UClass* StaticClass();
	static class UAudioOcclusionDropshipComponent* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.AudioReflectorInterface
class IAudioReflectorInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAudioReflectorInterface* GetDefaultObj();

	struct FSurfaceAudioReflectionData GetReflectionValue();
};

// 0x0 (0x30 - 0x30)
// Class Icarus.AudioSettingsSubsystem
class UAudioSettingsSubsystem : public UGameInstanceSubsystem
{
public:

	static class UClass* StaticClass();
	static class UAudioSettingsSubsystem* GetDefaultObj();

	void OnSFXVolumeChanged(float Volume);
	void OnMusicVolumeChanged(float Volume);
	void OnMasterVolumeChanged(float Volume);
	void OnDialogueVolumeChanged(float Volume);
	void OnCharacterVoiceVolumeChanged(float Volume);
	void OnAmbientVolumeChanged(float Volume);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.AudioShelterInterface
class IAudioShelterInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IAudioShelterInterface* GetDefaultObj();

	float GetAudioShelterValue(class AIcarusPlayerCharacter* Player);
};

// 0x38 (0x580 - 0x548)
// Class Icarus.AudioSplineComponent
class UAudioSplineComponent : public USplineComponent
{
public:
	class UFMODEvent*                            Event;                                             // 0x548(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        UpdateFrequencyInListenerRange;                    // 0x550(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        UpdateFrequencyOutsideListenerRange;               // 0x554(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InterpSpeed;                                       // 0x558(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6E44[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UFMODAudioComponent*                   AudioComponent;                                    // 0x560(0x8)(ExportObject, ZeroConstructor, Transient, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_6E45[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAudioSplineComponent* GetDefaultObj();

};

// 0x218 (0x2C8 - 0xB0)
// Class Icarus.AuraManagerComponent
class UAuraManagerComponent : public UActorComponent
{
public:
	TSet<class AActor*>                          AllPlayers;                                        // 0xB0(0x50)(NativeAccessSpecifierPrivate)
	TSet<class AActor*>                          AllNPCs;                                           // 0x100(0x50)(NativeAccessSpecifierPrivate)
	TSet<class AActor*>                          AllDeployables;                                    // 0x150(0x50)(NativeAccessSpecifierPrivate)
	TMap<class AActor*, struct FAuraInstances>   AuraInstances;                                     // 0x1A0(0x50)(ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FGameplayTagQuery                     PlayerTagQuery;                                    // 0x1F0(0x48)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                     NPCTagQuery;                                       // 0x238(0x48)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagQuery                     DeployableTagQuery;                                // 0x280(0x48)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UAuraManagerComponent* GetDefaultObj();

	void UnregisterModifiableObject(class AActor* Modifiable);
	void TickModifier(class UModifierStateComponent* ModifierComp);
	void RemoveAura(class UModifierStateComponent* ModifierComp);
	void RegisterModifiableObject(class AActor* Modifiable);
	TArray<struct FFindAuraResult> GetAurasAtLocation(const struct FVector& Location);
	void AddAuraCustomRange(class UModifierStateComponent* ModifierComp, int32 Range);
	void AddAura(class UModifierStateComponent* ModifierComp);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.AutonomousSpawnsLibrary
class UAutonomousSpawnsLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UAutonomousSpawnsLibrary* GetDefaultObj();

	struct FAutonomousSpawnsRowHandle StructToRowHandle(const struct FAutonomousSpawnsEnum& EnumValue);
	class FName StructToName(const struct FAutonomousSpawnsEnum& EnumValue);
	int32 StructToInt(const struct FAutonomousSpawnsEnum& EnumValue);
	struct FAutonomousSpawnsEnum RowHandleToStruct(const struct FAutonomousSpawnsRowHandle& RowHandle);
	void RemoveRowFromAutonomousSpawnsTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FAutonomousSpawnsEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FAutonomousSpawnsEnum& A, const struct FAutonomousSpawnsEnum& B);
	struct FAutonomousSpawnsEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FAutonomousSpawnsRowHandle MakeLiteralAutonomousSpawns(const struct FAutonomousSpawnsRowHandle& RowHandle);
	struct FAutonomousSpawnsRowHandle MakeAutonomousSpawnsFromIndex(int32 Index);
	struct FAutonomousSpawnsEnum MakeAutonomousSpawnsEnum(const struct FAutonomousSpawnsEnum& Enum);
	struct FAutonomousSpawnsRowHandle MakeAutonomousSpawns(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FAutonomousSpawnsEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetAutonomousSpawnsStruct(const struct FAutonomousSpawnsRowHandle& RowHandle, struct FAutonomousSpawnData* AutonomousSpawns, enum class EValid* Paths);
	bool EqualEqual_FAutonomousSpawnsRowHandleFAutonomousSpawnsRowHandle(const struct FAutonomousSpawnsRowHandle& RowHandleA, const struct FAutonomousSpawnsRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FAutonomousSpawnsEnum& A, const struct FAutonomousSpawnsEnum& B);
	struct FAutonomousSpawnsRowHandle CastToAutonomousSpawnsRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakAutonomousSpawnsEnum(const struct FAutonomousSpawnsEnum& Enum, class FName* Name, int32* Index);
	void AddRowToAutonomousSpawnsTable(class FName Name, const struct FAutonomousSpawnData& Data, struct FAutonomousSpawnsRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.AutonomousSpawnsTable
class UAutonomousSpawnsTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UAutonomousSpawnsTable* GetDefaultObj();

};

// 0x420 (0x4D0 - 0xB0)
// Class Icarus.BackendProxyComponent
class UBackendProxyComponent : public UActorComponent
{
public:
	FMulticastSparseDelegateProperty_            MetaResourcesUpdated;                              // 0xB0(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            MetaInventoryUpdated;                              // 0xB1(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            MetaInventorySlotUpdated;                          // 0xB2(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            WorkshopPurchaseResult;                            // 0xB3(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            DropshipsUpdated;                                  // 0xB4(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            DropshipCreationResult;                            // 0xB5(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            DropshipModificationResult;                        // 0xB6(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            DropshipDeletionResult;                            // 0xB7(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            PreparedLoadoutUpdated;                            // 0xB8(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            CharacterLoadoutUpdated;                           // 0xB9(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            LoadoutInventoryUpdated;                           // 0xBA(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            LoadoutInventorySlotUpdated;                       // 0xBB(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            LoadoutPackaged;                                   // 0xBC(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            CreditsUpdated;                                    // 0xBD(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            ProspectsUpdated;                                  // 0xBE(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            ClaimedProspectResult;                             // 0xBF(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            SettleProspectResult;                              // 0xC0(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            NotificationsUpdated;                              // 0xC1(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            TalentUnlocked;                                    // 0xC2(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            TrackedStatisticsUpdateResult;                     // 0xC3(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            FactionMissionUpdateResult;                        // 0xC4(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            BackToHabResult;                                   // 0xC5(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_6EDC[0x52];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastSparseDelegateProperty_            GetCharacterProfileResult;                         // 0x118(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            GetUserProfileResult;                              // 0x119(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            PackageLoadoutResult;                              // 0x11A(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            WorkshopResearchResult;                            // 0x11B(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            WorkshopReplicationResult;                         // 0x11C(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            GetCharacterLoadoutResult;                         // 0x11D(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            UpdateCharacterProgressResult;                     // 0x11E(0x1)(InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            UpdateCharacterProspectLocationResult;             // 0x11F(0x1)(InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            SyncCharacterTalentsResult;                        // 0x120(0x1)(InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            SyncAccountTalentsResult;                          // 0x121(0x1)(InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            SyncAccountFlagsResult;                            // 0x122(0x1)(InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            ExchangeCurrencyResult;                            // 0x123(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            WorkshopRepairResult;                              // 0x124(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_6EDD[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UGetMetaResourceCallbackProxyGen*      MetaResourcesCallback;                             // 0x128(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGetMetaInventoryCallbackProxyGen*     MetaInventoryCallback;                             // 0x130(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGetLoadoutInventoryCallbackProxyGen*  LoadoutInventoryCallback;                          // 0x138(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UMoveMetaInventoryItemCallbackProxyGen* ShiftMetaItemCallbackProxy;                        // 0x140(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URemoveMetaItemCallbackProxyGen*       RemoveMetaItemCallbackProxy;                       // 0x148(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGetDropshipsCallbackProxyGen*         GetDropshipsCallbackProxy;                         // 0x150(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UCreateDropshipCallbackProxyGen*       CreateDropshipsCallbackProxy;                      // 0x158(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UModifyDropshipCallbackProxyGen*       ModifyDropshipsCallbackProxy;                      // 0x160(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDeleteDropshipCallbackProxyGen*       DeleteDropshipsCallbackProxy;                      // 0x168(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USelectDropshipCallbackProxyGen*       SelectDropshipCallbackProxy;                       // 0x170(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URemoveSelectedDropshipCallbackProxyGen* RemoveSelectedDropshipCallbackProxy;               // 0x178(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USelectEnvirosuitCallbackProxyGen*     SelectEnvirosuitCallbackProxy;                     // 0x180(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URemoveEnvirosuitCallbackProxyGen*     RemoveEnvirosuitCallbackProxy;                     // 0x188(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPackageLoadoutCallbackProxyGen*       PackageLoadoutCallbackProxy;                       // 0x190(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUnpackageLoadoutCallbackProxyGen*     UnpackageLoadoutCallbackProxy;                     // 0x198(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGetCharacterLoadoutCallbackProxyGen*  CharacterLoadoutCallbackProxy;                     // 0x1A0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGetPreparedLoadoutCallbackProxyGen*   PreparedLoadoutCallbackProxy;                      // 0x1A8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGetCreditsCallbackProxyGen*           GetCreditsCallbackProxy;                           // 0x1B0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGetAllProspectsCallbackProxyGen*      GetAllProspectsCallbackProxy;                      // 0x1B8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClaimProspectCallbackProxyGen*        ClaimProspectCallbackProxy;                        // 0x1C0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USettleProspectCallbackProxyGen*       SettleProspectCallbackProxy;                       // 0x1C8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGetNotificationsCallbackProxyGen*     GetNotificationsCallbackProxy;                     // 0x1D0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UClaimNotificationAttachmentsCallbackProxyGen* ClaimNotificationAttachmentsCallbackProxy;         // 0x1D8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UDeleteNotificationCallbackProxyGen*   DeleteNotificationCallbackProxy;                   // 0x1E0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UReadNotificationCallbackProxyGen*     ReadNotificationCallbackProxy;                     // 0x1E8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUpdateCharacterProgressCallbackProxyGen* UpdateCharacterProgressProxy;                      // 0x1F0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUpdateCharacterProspectLocationCallbackProxyGen* UpdateCharacterProspectLocationProxy;              // 0x1F8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUpdateTrackedStatsCallbackProxyGen*   UpdateTrackedStatsCallbackProxy;                   // 0x200(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUpdateFactionMissionProgressCallbackProxyGen* UpdateFactionMissionProgressCallbackProxy;         // 0x208(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USyncCharacterTalentsCallbackProxyGen* SyncCharacterTalentsCallbackProxy;                 // 0x210(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USyncAccountTalentsCallbackProxyGen*   SyncAccountTalentsCallbackProxy;                   // 0x218(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USyncAccountFlagsCallbackProxyGen*     SyncAccountFlagsCallbackProxy;                     // 0x220(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGetCharacterProfileCallbackProxyGen*  GetCharacterProfileCallbackProxy;                  // 0x228(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGetUserProfileCallbackProxyGen*       GetUserProfileCallbackProxy;                       // 0x230(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UBackToHabCallbackProxyGen*            BackToHabCallbackProxy;                            // 0x238(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUnlockWorkshopItemCallbackProxyGen*   UnlockWorkshopItemCallbackProxy;                   // 0x240(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UReplicateWorkshopItemCallbackProxyGen* ReplicateWorkshopItemCallbackProxy;                // 0x248(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class URepairWorkshopItemCallbackProxyGen*   RepairWorkshopItemCallbackProxy;                   // 0x250(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UExchangeCurrencyCallbackProxyGen*     ExchangeCurrencyCallbackProxy;                     // 0x258(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UTalentRefundCallbackProxyGen*         TalentRefundCallbackProxy;                         // 0x260(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<enum class ERateLimitedRequests, int32> RequestTimers;                                     // 0x268(0x50)(NativeAccessSpecifierPublic)
	float                                        CurrentTime;                                       // 0x2B8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6EDF[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FMetaResource>                 MetaResources;                                     // 0x2C0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	int32                                        Credits;                                           // 0x2D0(0x4)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6EE0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FMetaItem>                     MetaInventory;                                     // 0x2D8(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	TArray<struct FMetaItem>                     LoadoutInventory;                                  // 0x2E8(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	TArray<struct FDropship>                     Dropships;                                         // 0x2F8(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	int32                                        PreparedDropship;                                  // 0x308(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        PreparedDropshipID;                                // 0x30C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FMetaItem                             PreparedEnvirosuit;                                // 0x310(0x40)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	struct FCharacterLoadout                     CharacterLoadout;                                  // 0x350(0x138)(BlueprintVisible, BlueprintReadOnly, Net, RepNotify, NativeAccessSpecifierPublic)
	bool                                         PreparedLoadout;                                   // 0x488(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6EE1[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FProspectInfo>                 Prospects;                                         // 0x490(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	TArray<struct FNotification>                 Notifications;                                     // 0x4A0(0x10)(BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, RepNotify, NativeAccessSpecifierPublic)
	struct FPendingInventorySwap                 PendingInventorySwap;                              // 0x4B0(0x20)(ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBackendProxyComponent* GetDefaultObj();

	void UpdateSelectedDropship();
	void TriggerWorkshopPurchaseResult(bool Success);
	void TriggerTalentUnlocked(const struct FTalentsRowHandle& Talent, int32 Rank, bool Success);
	void TriggerProspectSettleResult(bool Success, struct FProspectInfo& ProspectInfo);
	void TriggerLoadoutPackage();
	void TriggerDropshipModificationResult(bool Success);
	void TriggerDropshipDeletionResult(bool Success);
	void TriggerDropshipCreationResult(bool Success);
	void TriggerClaimProspectResult(bool Success, const struct FProspectInfo& ProspectInfo);
	void RetrieveCharacterLoadout();
	void Response_WorkshopPurchaseWorkshopPack();
	void Response_WorkshopPacks(struct FResGetWorkshopPacks& Response);
	void Response_UpdateTrackedStats(struct FResUpdateTrackedStats& Response);
	void Response_UpdateFactionMissionProgress(struct FResUpdateFactionMissionProgress& Response);
	void Response_UpdateCharacterProspectLocation(struct FResUpdateCharacterProspectLocation& Response);
	void Response_UpdateCharacterProgress(struct FResUpdateCharacterProgress& Response);
	void Response_UnpackageLoadout(struct FResUnpackageLoadout& Response);
	void Response_UnlockWorkshopItem(struct FResUnlockWorkshopItem& Response);
	void Response_TalentRefund(struct FResTalentRefund& Response);
	void Response_SyncCharacterTalents(struct FResSyncCharacterTalents& Response);
	void Response_SyncAccountTalents(struct FResSyncAccountTalents& Response);
	void Response_SyncAccountFlags(struct FResSyncAccountFlags& Response);
	void Response_ShiftInventoryItem(struct FResMoveMetaInventoryItem& Response);
	void Response_SettleProspect(struct FResSettleProspect& Response);
	void Response_ReplicateWorkshopItem(struct FResReplicateWorkshopItem& Response);
	void Response_RepairWorkshopItem(struct FResRepairWorkshopItem& Response);
	void Response_RemovePreparedEnvirosuit(struct FResRemoveEnvirosuit& Response);
	void Response_RemovePreparedDropship(struct FResRemoveSelectedDropship& Response);
	void Response_RemoveMetaItem(struct FResRemoveMetaInventoryItem& Response);
	void Response_ReadNotification(struct FResReadNotification& Response);
	void Response_PrepareEnvirosuit(struct FResSelectEnvirosuit& Response);
	void Response_PrepareDropship(struct FResSelectDropship& Response);
	void Response_PreparedLoadout(struct FResPreparedLoadout& Response);
	void Response_PackageLoadout_WithCharacter(struct FResPackageLoadout& Response);
	void Response_ModifyDropship(struct FResModifyDropship& Response);
	void Response_MetaResources(struct FResGetMetaResources& Response);
	void Response_MetaInventory(struct FResGetMetaInventory& Response);
	void Response_LoadoutInventory(struct FResLoadoutInventory& Response);
	void Response_LeaveProspectByDropship(struct FResBackToHab& Response);
	void Response_GetUserProfile(struct FResGetUserProfile& Response);
	void Response_GetNotifications(struct FResGetNotifications& Response);
	void Response_GetCharacterProfile(struct FResGetCharacterProfile& Response);
	void Response_ExchangeCurrency(struct FResExchangeCurrency& Response);
	void Response_Dropships(struct FResGetDropships& Response);
	void Response_DeleteNotification(struct FResDeleteNotification& Response);
	void Response_DeleteDropship(struct FResDeleteDropship& Response);
	void Response_Credits(struct FResGetCredits& Response);
	void Response_CreateDropship(struct FResCreateDropship& Response);
	void Response_ClaimProspect(struct FResClaimProspect& Response);
	void Response_ClaimNotificationAttachements(struct FResClaimNotificationAttachments& Response);
	void Response_CharacterLoadout(struct FResGetCharacterLoadout& Response);
	void Response_AvailableProspects(struct FResGetAllProspects& Response);
	void Request_WorkshopPurchaseWorkshopPack(int32 Index);
	void Request_WorkshopPacks();
	void Request_UpdateTrackedStats();
	void Request_UpdateFactionMissionProgress(struct FFactionMissionsRowHandle& Mission, int32 Progress);
	void Request_UpdateCharacterProspectLocation(enum class EProspectLocation Location);
	void Request_UpdateCharacterProgress();
	void Request_UnpackageLoadout();
	void Request_UnlockWorkshopItem(struct FTalentsRowHandle& TalentsRowHandle);
	void Request_TalentRefund(struct FTalentsRowHandle& Talent, int32 CharacterSlot);
	void Request_SyncCharacterTalents();
	void Request_SyncAccountTalents();
	void Request_SyncAccountFlags();
	void Request_ShiftInventoryItem(class UInventory* SourceInventory, class UInventory* DestinationInventory, int32 SourceSlot, int32 DestinationSlot, int32 Amount);
	void Request_SettleProspect(const class FString& ProspectID, bool SettleProspect);
	void Request_ReplicateWorkshopItem(struct FTalentsRowHandle& TalentsRowHandle);
	void Request_RepairWorkshopItem(class UInventory* SourceInventory, int32 SourceSlot);
	void Request_RemovePreparedEnvirosuit();
	void Request_RemovePreparedDropship();
	void Request_RemoveMetaItem(class UInventory* SourceInventory, int32 SourceSlot, int32 Amount);
	void Request_ReadNotification(const class FString& NotificationID);
	void Request_PrepareEnvirosuit(class UInventory* Inventory, int32 Slot);
	void Request_PrepareDropship(int32 Index);
	void Request_PreparedLoadout();
	void Request_PackageLoadout_WithCharacter(struct FOnlineProfileCharacter& OnlineProfileCharacter);
	void Request_PackageLoadout();
	void Request_ModifyDropship(int32 Index, struct FDropshipModification& Dropship);
	void Request_MetaResources();
	void Request_MetaInventory();
	void Request_LoadoutInventory();
	void Request_LeaveProspectByDropship();
	void Request_GetUserProfile();
	void Request_GetNotifications(bool RequestCompleteList);
	void Request_GetCharacterProfile(int32 CharSlot);
	void Request_ExchangeCurrency(const struct FCurrencyConversionsRowHandle& Conversion, int32 Iterations);
	void Request_Dropships();
	void Request_DeleteNotification(const class FString& NotificationID);
	void Request_DeleteDropship(int32 Index);
	void Request_Credits();
	void Request_CreateDropship();
	void Request_ClaimProspect(struct FProspectInfo& ProspectInfo);
	void Request_ClaimNotificationAttachements(const class FString& NotificationID);
	void Request_CharacterLoadout();
	void Request_AvailableProspects();
	void RemoveDropship(int32 DropshipID);
	bool RateLimitCheck(enum class ERateLimitedRequests RequestType);
	void ProcessSwapInventoryDelta(struct FInventoryDelta& InventoryDelta);
	void ProcessResourceDelta(const TArray<struct FMetaResource>& ResourcesDelta);
	void ProcessInventoryDelta(struct FInventoryDelta& InventoryDelta);
	void ProcessDropshipDelta(const struct FDropshipDelta& DropshipDelta);
	void PrepareEnvirosuit(class UInventory* Inventory, int32 InventorySlot);
	void PrepareDropship(int32 Index);
	void OnUpdateCharacterProspectLocation(struct FResUpdateCharacterProspectLocation& Response);
	void OnUpdateCharacterProgress(struct FResUpdateCharacterProgress& Response);
	void OnUnpackageLoadoutRequestSuccess(struct FResUnpackageLoadout& Response);
	void OnUnpackageLoadoutRequestFailure(struct FResUnpackageLoadout& Response);
	void OnUnlockWorkshopItemSuccess(struct FResUnlockWorkshopItem& Response);
	void OnUnlockWorkshopItemFailure(struct FResUnlockWorkshopItem& Response);
	void OnTrackedStatsUpdated(struct FResUpdateTrackedStats& Response);
	void OnTalentRefundSuccess(struct FResTalentRefund& Response);
	void OnTalentRefundFailure(struct FResTalentRefund& Response);
	void OnSyncCharacterTalents(struct FResSyncCharacterTalents& Response);
	void OnSyncAccountTalents(struct FResSyncAccountTalents& Response);
	void OnSyncAccountFlags(struct FResSyncAccountFlags& Response);
	void OnShiftMetaItemRequestSuccess(struct FResMoveMetaInventoryItem& Response);
	void OnShiftMetaItemRequestFailure(struct FResMoveMetaInventoryItem& Response);
	void OnSettleProspectSuccess(struct FResSettleProspect& Response);
	void OnSettleProspectFailure(struct FResSettleProspect& Response);
	void OnReplicateWorkshopItemSuccess(struct FResReplicateWorkshopItem& Response);
	void OnReplicateWorkshopItemFailure(struct FResReplicateWorkshopItem& Response);
	void OnRepairWorkshopItem(struct FResRepairWorkshopItem& Response);
	void OnRep_WorkshopPacks();
	void OnRep_PreparedLoadout();
	void OnRep_PreparedEnvirosuit();
	void OnRep_PreparedDropship();
	void OnRep_Notifications();
	void OnRep_MetaResources();
	void OnRep_MetaInventory();
	void OnRep_LoadoutInventory();
	void OnRep_Dropships();
	void OnRep_Credits();
	void OnRep_CharacterLoadout();
	void OnRep_AvailableProspects();
	void OnRemovePreparedEnvirosuitRequestSuccess(struct FResRemoveEnvirosuit& Response);
	void OnRemovePreparedEnvirosuitRequestFailure(struct FResRemoveEnvirosuit& Response);
	void OnRemovePreparedDropshipRequestSuccess(struct FResRemoveSelectedDropship& Response);
	void OnRemovePreparedDropshipRequestFailure(struct FResRemoveSelectedDropship& Response);
	void OnRemoveMetaItemRequestSuccess(struct FResRemoveMetaInventoryItem& Response);
	void OnRemoveMetaItemRequestFailure(struct FResRemoveMetaInventoryItem& Response);
	void OnReadNotificationSuccess(struct FResReadNotification& Response);
	void OnReadNotificationFailure(struct FResReadNotification& Response);
	void OnPrepareEnvirosuitRequestSuccess(struct FResSelectEnvirosuit& Response);
	void OnPrepareEnvirosuitRequestFailure(struct FResSelectEnvirosuit& Response);
	void OnPrepareDropshipRequestSuccess(struct FResSelectDropship& Response);
	void OnPrepareDropshipRequestFailure(struct FResSelectDropship& Response);
	void OnPreparedLoadoutRequestSuccess(struct FResPreparedLoadout& Response);
	void OnPreparedLoadoutRequestFailure(struct FResPreparedLoadout& Response);
	void OnPackageLoadoutRequestFailure(struct FResPackageLoadout& Response);
	void OnOnPackageLoadoutRequestSuccess(struct FResPackageLoadout& Response);
	void OnModifyDropshipsRequestSuccess(struct FResModifyDropship& Response);
	void OnModifyDropshipsRequestFailure(struct FResModifyDropship& Response);
	void OnMetaResourcesRequestSuccess(struct FResGetMetaResources& Response);
	void OnMetaResourcesRequestFailure(struct FResGetMetaResources& Response);
	void OnLoadoutInventoryRequest(struct FResLoadoutInventory& Response);
	void OnInventoryRequestSuccess(struct FResGetMetaInventory& Response);
	void OnInventoryRequestFailure(struct FResGetMetaInventory& Response);
	void OnGetUserProfile(struct FResGetUserProfile& Response);
	void OnGetNotificationsSuccess(struct FResGetNotifications& Response);
	void OnGetNotificationsFailure(struct FResGetNotifications& Response);
	void OnGetDropshipsRequestSuccess(struct FResGetDropships& Response);
	void OnGetDropshipsRequestFailure(struct FResGetDropships& Response);
	void OnGetCreditsRequestSuccess(struct FResGetCredits& Response);
	void OnGetCreditsRequestFailure(struct FResGetCredits& Response);
	void OnGetCharacterProfile(struct FResGetCharacterProfile& Response);
	void OnGetAllProspectsSuccess(struct FResGetAllProspects& Response);
	void OnGetAllProspectsFailure(struct FResGetAllProspects& Response);
	void OnFactionMissionProgressUpdated(struct FResUpdateFactionMissionProgress& Response);
	void OnExchangeCurrency(struct FResExchangeCurrency& Response);
	void OnDeleteNotificationSuccess(struct FResDeleteNotification& Response);
	void OnDeleteNotificationFailure(struct FResDeleteNotification& Response);
	void OnDeleteDropshipsRequestSuccess(struct FResDeleteDropship& Response);
	void OnDeleteDropshipsRequestFailure(struct FResDeleteDropship& Response);
	void OnCreateDropshipsRequestSuccess(struct FResCreateDropship& Response);
	void OnCreateDropshipsRequestFailure(struct FResCreateDropship& Response);
	void OnClaimProspectSuccess(struct FResClaimProspect& Response);
	void OnClaimProspectFailure(struct FResClaimProspect& Response);
	void OnClaimNotificationAttachmentsSuccess(struct FResClaimNotificationAttachments& Response);
	void OnClaimNotificationAttachmentsFailure(struct FResClaimNotificationAttachments& Response);
	void OnCharacterLoadoutRequest(struct FResGetCharacterLoadout& Response);
	void OnBackToHab(struct FResBackToHab& Response);
	void LoadoutInventoryRequestFailure(struct FResLoadoutInventory& Response);
	TArray<struct FProspectInfo> GetProspects();
	TArray<struct FNotification> GetNotifications();
	TArray<struct FMetaResource> GetMetaResources();
	TArray<struct FMetaItem> GetMetaInventory();
	TArray<struct FMetaItem> GetLoadoutInventory();
	TArray<struct FDropship> GetDropships();
	int32 GetCredits();
	struct FCharacterLoadout GetCharacterLoadout();
	void Client_Request_WorkshopPurchaseWorkshopPack(int32 Index);
	void Client_Request_WorkshopPacks();
	void Client_Request_UpdateTrackedStats();
	void Client_Request_UpdateFactionMissionProgress(struct FFactionMissionsRowHandle& Mission, int32 Progress);
	void Client_Request_UpdateCharacterProspectLocation(enum class EProspectLocation Location);
	void Client_Request_UpdateCharacterProgress();
	void Client_Request_UnpackageLoadout();
	void Client_Request_UnlockWorkshopItem(struct FTalentsRowHandle& TalentsRowHandle);
	void Client_Request_TalentRefund(struct FTalentsRowHandle& Talent, int32 CharacterSlot);
	void Client_Request_SyncCharacterTalents();
	void Client_Request_SyncAccountTalents();
	void Client_Request_SyncAccountFlags();
	void Client_Request_ShiftInventoryItem(class UInventory* SourceInventory, class UInventory* DestinationInventory, int32 SourceSlot, int32 DestinationSlot, int32 Amount);
	void Client_Request_SettleProspect(const class FString& ProspectID, bool SettleProspect);
	void Client_Request_ReplicateWorkshopItem(struct FTalentsRowHandle& TalentsRowHandle);
	void Client_Request_RepairWorkshopItem(const class FString& ItemId);
	void Client_Request_RemovePreparedEnvirosuit();
	void Client_Request_RemovePreparedDropship();
	void Client_Request_RemoveMetaItem(class UInventory* SourceInventory, int32 SourceSlot, int32 Amount);
	void Client_Request_ReadNotification(const class FString& NotificationID);
	void Client_Request_PrepareEnvirosuit(class UInventory* Inventory, int32 Slot);
	void Client_Request_PrepareDropship(int32 Index);
	void Client_Request_PreparedLoadout();
	void Client_Request_PackageLoadout_WithCharacter(struct FOnlineProfileCharacter& OnlineProfileCharacter);
	void Client_Request_ModifyDropship(int32 Index, struct FDropshipModification& Dropship);
	void Client_Request_MetaResources();
	void Client_Request_MetaInventory();
	void Client_Request_LoadoutInventory();
	void Client_Request_LeaveProspectByDropship();
	void Client_Request_GetUserProfile();
	void Client_Request_GetNotifications(bool RequestCompleteList);
	void Client_Request_GetCharacterProfile(int32 CharSlot);
	void Client_Request_ExchangeCurrency(const struct FCurrencyConversionsRowHandle& Conversion, int32 Iterations);
	void Client_Request_Dropships();
	void Client_Request_DeleteNotification(const class FString& NotificationID);
	void Client_Request_DeleteDropship(int32 Index);
	void Client_Request_Credits();
	void Client_Request_CreateDropship();
	void Client_Request_ClaimProspect(struct FProspectInfo& ProspectInfo);
	void Client_Request_ClaimNotificationAttachements(const class FString& NotificationID);
	void Client_Request_CharacterLoadout();
	void Client_Request_AvailableProspects();
	bool CanPerformCurrencyConversion(const struct FCurrencyConversionsRowHandle& Conversion, int32 Iterations);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.BagPriorityLibrary
class UBagPriorityLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UBagPriorityLibrary* GetDefaultObj();

	struct FBagPriorityRowHandle StructToRowHandle(const struct FBagPriorityEnum& EnumValue);
	class FName StructToName(const struct FBagPriorityEnum& EnumValue);
	int32 StructToInt(const struct FBagPriorityEnum& EnumValue);
	struct FBagPriorityEnum RowHandleToStruct(const struct FBagPriorityRowHandle& RowHandle);
	void RemoveRowFromBagPriorityTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FBagPriorityEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FBagPriorityEnum& A, const struct FBagPriorityEnum& B);
	struct FBagPriorityEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FBagPriorityRowHandle MakeLiteralBagPriority(const struct FBagPriorityRowHandle& RowHandle);
	struct FBagPriorityRowHandle MakeBagPriorityFromIndex(int32 Index);
	struct FBagPriorityEnum MakeBagPriorityEnum(const struct FBagPriorityEnum& Enum);
	struct FBagPriorityRowHandle MakeBagPriority(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FBagPriorityEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetBagPriorityStruct(const struct FBagPriorityRowHandle& RowHandle, struct FBagPriorityData* BagPriority, enum class EValid* Paths);
	bool EqualEqual_FBagPriorityRowHandleFBagPriorityRowHandle(const struct FBagPriorityRowHandle& RowHandleA, const struct FBagPriorityRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FBagPriorityEnum& A, const struct FBagPriorityEnum& B);
	struct FBagPriorityRowHandle CastToBagPriorityRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakBagPriorityEnum(const struct FBagPriorityEnum& Enum, class FName* Name, int32* Index);
	void AddRowToBagPriorityTable(class FName Name, const struct FBagPriorityData& Data, struct FBagPriorityRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.BagPriorityTable
class UBagPriorityTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UBagPriorityTable* GetDefaultObj();

};

// 0x328 (0x3F8 - 0xD0)
// Class Icarus.BallisticComponent
class UBallisticComponent : public UTraitComponent
{
public:
	FMulticastSparseDelegateProperty_            OnFireProjectile;                                  // 0xD0(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, BlueprintCallable, NativeAccessSpecifierPublic)
	bool                                         bHasBeenFired;                                     // 0xD1(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F12[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UIcarusProjectileComponent*            ProjectileMovementComponent;                       // 0xD8(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USphereComponent*                      CollisionComponent;                                // 0xE0(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnProjectileHit;                                   // 0xE8(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, BlueprintCallable, NativeAccessSpecifierPublic)
	bool                                         bIsProjectileActive;                               // 0xE9(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F13[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBallisticData                        CachedBallisticData;                               // 0xF0(0x1E0)(Edit, BlueprintVisible, BlueprintReadOnly, EditConst, NativeAccessSpecifierPublic)
	class AActor*                                FiringActor;                                       // 0x2D0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F14[0x120];                                   // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBallisticComponent* GetDefaultObj();

	void SetProjectileActive(bool Active);
	void ProjectileHit(struct FHitResult& Hit);
	void ProjectileBounce(struct FHitResult& Hit, struct FVector& ImpactVelocity);
	void OnRep_bIsProjectileActive();
	void OnProjectileDeactivated();
	void OnProjectileActivated();
	struct FStatContainer GetDamageStatContainer();
	int32 GetDamageStat(const struct FStatsEnum& InStat);
	bool GetBallisticData(struct FBallisticData* OutData);
	void FireProjectile_Internal(struct FVector& Impulse, struct FVector& InstigatorVelocity, struct FProjectileFireParams& AdvancedParameters, class AActor* FiredBy);
	void FireProjectile(struct FVector& Impulse, struct FVector& InstigatorVelocity, struct FProjectileFireParams& AdvancedParameters, class AActor* Instigator);
	bool CleanupBallistic();
	void CheckWithinCullDistance();
};

// 0x0 (0x28 - 0x28)
// Class Icarus.BallisticLibrary
class UBallisticLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UBallisticLibrary* GetDefaultObj();

	struct FBallisticRowHandle StructToRowHandle(const struct FBallisticEnum& EnumValue);
	class FName StructToName(const struct FBallisticEnum& EnumValue);
	int32 StructToInt(const struct FBallisticEnum& EnumValue);
	struct FBallisticEnum RowHandleToStruct(const struct FBallisticRowHandle& RowHandle);
	void RemoveRowFromBallisticTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FBallisticEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FBallisticEnum& A, const struct FBallisticEnum& B);
	struct FBallisticEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FBallisticRowHandle MakeLiteralBallistic(const struct FBallisticRowHandle& RowHandle);
	struct FBallisticRowHandle MakeBallisticFromIndex(int32 Index);
	struct FBallisticEnum MakeBallisticEnum(const struct FBallisticEnum& Enum);
	struct FBallisticRowHandle MakeBallistic(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FBallisticEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetBallisticStruct(const struct FBallisticRowHandle& RowHandle, struct FBallisticData* Ballistic, enum class EValid* Paths);
	bool EqualEqual_FBallisticRowHandleFBallisticRowHandle(const struct FBallisticRowHandle& RowHandleA, const struct FBallisticRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FBallisticEnum& A, const struct FBallisticEnum& B);
	struct FBallisticRowHandle CastToBallisticRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakBallisticEnum(const struct FBallisticEnum& Enum, class FName* Name, int32* Index);
	void AddRowToBallisticTable(class FName Name, const struct FBallisticData& Data, struct FBallisticRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x50 (0x100 - 0xB0)
// Class Icarus.BallisticPoolManager
class UBallisticPoolManager : public UActorComponent
{
public:
	uint8                                        Pad_6F30[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBallisticPoolManager* GetDefaultObj();

	class AIcarusItem* RequestProjectile(struct FItemData& ProjectileData, struct FTransform& SpawnTransform, class AActor* Owner);
	void DestroyProjectile(class AIcarusItem* InProjectile, bool bSkipPoolRemoval);
	bool DeactivateProjectile(class AIcarusItem* InProjectile);
};

// 0x50 (0x80 - 0x30)
// Class Icarus.BallisticSubsystem
class UBallisticSubsystem : public UWorldSubsystem
{
public:
	TMap<class AIcarusPlayerCharacter*, struct FFiredProjectileInfo> PreviouslyFiredProjectiles;                        // 0x30(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnTemplate, EditConst, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBallisticSubsystem* GetDefaultObj();

	void RecordFiredProjectileInfo(class AIcarusPlayerCharacter* PlayerInstigator, class AIcarusItem* FiredProjectile);
	bool GetLastFiredProjectileInfo(class AIcarusPlayerCharacter* Player, struct FFiredProjectileInfo* ProjectileInfo);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.BallisticTable
class UBallisticTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UBallisticTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.StatsLibrary
class UStatsLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UStatsLibrary* GetDefaultObj();

	struct FStatsRowHandle StructToRowHandle(const struct FStatsEnum& EnumValue);
	class FName StructToName(const struct FStatsEnum& EnumValue);
	int32 StructToInt(const struct FStatsEnum& EnumValue);
	struct FStatsEnum RowHandleToStruct(const struct FStatsRowHandle& RowHandle);
	void RemoveRowFromStatsTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FStatsEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FStatsEnum& A, const struct FStatsEnum& B);
	struct FStatsEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FStatsRowHandle MakeStatsFromIndex(int32 Index);
	struct FStatsEnum MakeStatsEnum(const struct FStatsEnum& Enum);
	struct FStatsRowHandle MakeStats(class FName RowName);
	struct FStatsRowHandle MakeLiteralStats(const struct FStatsRowHandle& RowHandle);
	bool IsValidName(class FName NameValue);
	struct FStatsEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetStatsStruct(const struct FStatsRowHandle& RowHandle, struct FIcarusStatDescription* Stats, enum class EValid* Paths);
	bool EqualEqual_FStatsRowHandleFStatsRowHandle(const struct FStatsRowHandle& RowHandleA, const struct FStatsRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FStatsEnum& A, const struct FStatsEnum& B);
	struct FStatsRowHandle CastToStatsRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakStatsEnum(const struct FStatsEnum& Enum, class FName* Name, int32* Index);
	void AddRowToStatsTable(class FName Name, const struct FIcarusStatDescription& Data, struct FStatsRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.BaseStatsLibrary
class UBaseStatsLibrary : public UStatsLibrary
{
public:

	static class UClass* StaticClass();
	static class UBaseStatsLibrary* GetDefaultObj();

	struct FBaseStatsEnum MakeBaseStatsEnum(const struct FBaseStatsEnum& Enum);
	bool Filter(int32 Index);
	void BreakBaseStatsEnum(const struct FBaseStatsEnum& Enum, class FName* Name, int32* Index);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.BedRecorderInterface
class IBedRecorderInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IBedRecorderInterface* GetDefaultObj();

	void SetPlayerUIDArray(TArray<class FString>& PlayerUIDArray);
	TArray<class FString> GetPlayerUIDArray();
};

// 0x90 (0x238 - 0x1A8)
// Class Icarus.ItemStateRecorderComponent
class UItemStateRecorderComponent : public UActorStateRecorderComponent
{
public:
	class FName                                  StaticItemDataRowName;                             // 0x1A8(0x8)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FString                                DatabaseGUID;                                      // 0x1B0(0x10)(ZeroConstructor, SaveGame, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        ItemOwnerLookupId;                                 // 0x1C0(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6F5E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FItemRecordDynamicData>        DynamicData;                                       // 0x1C8(0x10)(ZeroConstructor, SaveGame, Protected, NativeAccessSpecifierProtected)
	TArray<struct FItemRecordStatData>           Stats;                                             // 0x1D8(0x10)(ZeroConstructor, SaveGame, Protected, NativeAccessSpecifierProtected)
	TArray<struct FItemRecordAlterationData>     Alterations;                                       // 0x1E8(0x10)(ZeroConstructor, SaveGame, Protected, NativeAccessSpecifierProtected)
	TArray<struct FLivingItemSlotSaveData>       LivingItemSlots;                                   // 0x1F8(0x10)(ZeroConstructor, SaveGame, Protected, NativeAccessSpecifierProtected)
	enum class EIcarusItemContext                SpawnedContext;                                    // 0x208(0x1)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6F5F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FIcarusItemConstructionParameters     ConstructionParameters;                            // 0x210(0x28)(SaveGame, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UItemStateRecorderComponent* GetDefaultObj();

};

// 0x20 (0x258 - 0x238)
// Class Icarus.DeployableRecorderComponent
class UDeployableRecorderComponent : public UItemStateRecorderComponent
{
public:
	struct FDeployableRecord                     DeployableRecord;                                  // 0x238(0x20)(SaveGame, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UDeployableRecorderComponent* GetDefaultObj();

};

// 0x18 (0x270 - 0x258)
// Class Icarus.BedRecorderComponent
class UBedRecorderComponent : public UDeployableRecorderComponent
{
public:
	TArray<class FString>                        PlayerUIDArrayRecord;                              // 0x258(0x10)(ZeroConstructor, SaveGame, NativeAccessSpecifierPublic)
	uint8                                        Pad_6F62[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBedRecorderComponent* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.BestiaryDataLibrary
class UBestiaryDataLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UBestiaryDataLibrary* GetDefaultObj();

	struct FBestiaryDataRowHandle StructToRowHandle(const struct FBestiaryDataEnum& EnumValue);
	class FName StructToName(const struct FBestiaryDataEnum& EnumValue);
	int32 StructToInt(const struct FBestiaryDataEnum& EnumValue);
	struct FBestiaryDataEnum RowHandleToStruct(const struct FBestiaryDataRowHandle& RowHandle);
	void RemoveRowFromBestiaryDataTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FBestiaryDataEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FBestiaryDataEnum& A, const struct FBestiaryDataEnum& B);
	struct FBestiaryDataEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FBestiaryDataRowHandle MakeLiteralBestiaryData(const struct FBestiaryDataRowHandle& RowHandle);
	struct FBestiaryDataRowHandle MakeBestiaryDataFromIndex(int32 Index);
	struct FBestiaryDataEnum MakeBestiaryDataEnum(const struct FBestiaryDataEnum& Enum);
	struct FBestiaryDataRowHandle MakeBestiaryData(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FBestiaryDataEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetBestiaryDataStruct(const struct FBestiaryDataRowHandle& RowHandle, struct FBestiaryData* BestiaryData, enum class EValid* Paths);
	bool EqualEqual_FBestiaryDataRowHandleFBestiaryDataRowHandle(const struct FBestiaryDataRowHandle& RowHandleA, const struct FBestiaryDataRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FBestiaryDataEnum& A, const struct FBestiaryDataEnum& B);
	struct FBestiaryDataRowHandle CastToBestiaryDataRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakBestiaryDataEnum(const struct FBestiaryDataEnum& Enum, class FName* Name, int32* Index);
	void AddRowToBestiaryDataTable(class FName Name, const struct FBestiaryData& Data, struct FBestiaryDataRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.BestiaryDataTable
class UBestiaryDataTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UBestiaryDataTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.BestiaryFunctionLibrary
class UBestiaryFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UBestiaryFunctionLibrary* GetDefaultObj();

	class UBestiaryManagerComponent* GetLocalBestiaryManagerComponent(class UObject* WorldContext);
	TMap<enum class EFishType, struct FFishCategory> GetFishingCategories(class UObject* WorldContext);
	TMap<struct FTerrainsRowHandle, struct FBestiaryCategory> GetBestiaryCategories(class UObject* WorldContext);
	TArray<struct FFishDataRowHandle> GetAllFishOrderedForBestiary(class UObject* WorldContext);
	TArray<struct FBestiaryDataRowHandle> GetAllBeastsOrderedForBestiary(class UObject* WorldContext);
};

// 0x380 (0x430 - 0xB0)
// Class Icarus.BestiaryManagerComponent
class UBestiaryManagerComponent : public UActorComponent
{
public:
	FMulticastInlineDelegateProperty_            OnReceivedPlayerBestiary;                          // 0xB0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FBestiaryFastArray                    BeastEntries;                                      // 0xC0(0x158)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, EditConst, Protected, NativeAccessSpecifierProtected)
	struct FFishDataFastArray                    FishEntries;                                       // 0x218(0x158)(Edit, BlueprintVisible, Net, DisableEditOnTemplate, EditConst, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_6F9F[0xA8];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        AutoSaveRate;                                      // 0x418(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_6FA0[0x14];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBestiaryManagerComponent* GetDefaultObj();

	void Server_ReceiveBestiaryData(TArray<struct FBestiaryFastArrayItem>& ClientBestiaryData, TArray<struct FFishDataFastArrayItem>& ClientFishData);
	void PerformAutoSave();
	void OnFishEntryRemoved(struct FFishDataFastArrayItem& Entry);
	void OnFishEntryChanged(struct FFishDataFastArrayItem& Entry);
	void OnFishEntryAdded(struct FFishDataFastArrayItem& Entry);
	void OnBeastEntryRemoved(struct FBestiaryFastArrayItem& Entry);
	void OnBeastEntryChanged(struct FBestiaryFastArrayItem& Entry);
	void OnBeastEntryAdded(struct FBestiaryFastArrayItem& Entry);
	void OnAllFishEntriesChanged();
	void OnAllBeastEntriesChanged();
	bool IsFishEntryUnlocked(struct FFishDataRowHandle& Fish);
	bool IsBeastEntryUnlocked(struct FBestiaryDataRowHandle& Entry);
	void IncrementBeastProgress(struct FBestiaryDataRowHandle& Entry, struct FBestiaryPointsRowHandle& Points);
	bool HasLoadedData();
	struct FFishTypeTracking GetFishDetails(struct FFishDataRowHandle& Fish);
	int32 GetBeastUnlockPercent(struct FBestiaryDataRowHandle& Entry);
	void ForceSave();
	void Client_RequestBestiaryData();
	void Cheat_SetFishCaught(struct FFishDataRowHandle& FishRow, int32 NumCaught);
	void Cheat_SetBeastPoints(struct FBestiaryDataRowHandle& Entry, int32 TotalPoints);
	void AddFishDetails(struct FFishTypeTracking& Fish);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.BestiaryPointsLibrary
class UBestiaryPointsLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UBestiaryPointsLibrary* GetDefaultObj();

	struct FBestiaryPointsRowHandle StructToRowHandle(const struct FBestiaryPointsEnum& EnumValue);
	class FName StructToName(const struct FBestiaryPointsEnum& EnumValue);
	int32 StructToInt(const struct FBestiaryPointsEnum& EnumValue);
	struct FBestiaryPointsEnum RowHandleToStruct(const struct FBestiaryPointsRowHandle& RowHandle);
	void RemoveRowFromBestiaryPointsTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FBestiaryPointsEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FBestiaryPointsEnum& A, const struct FBestiaryPointsEnum& B);
	struct FBestiaryPointsEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FBestiaryPointsRowHandle MakeLiteralBestiaryPoints(const struct FBestiaryPointsRowHandle& RowHandle);
	struct FBestiaryPointsRowHandle MakeBestiaryPointsFromIndex(int32 Index);
	struct FBestiaryPointsEnum MakeBestiaryPointsEnum(const struct FBestiaryPointsEnum& Enum);
	struct FBestiaryPointsRowHandle MakeBestiaryPoints(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FBestiaryPointsEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetBestiaryPointsStruct(const struct FBestiaryPointsRowHandle& RowHandle, struct FBestiaryPoints* BestiaryPoints, enum class EValid* Paths);
	bool EqualEqual_FBestiaryPointsRowHandleFBestiaryPointsRowHandle(const struct FBestiaryPointsRowHandle& RowHandleA, const struct FBestiaryPointsRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FBestiaryPointsEnum& A, const struct FBestiaryPointsEnum& B);
	struct FBestiaryPointsRowHandle CastToBestiaryPointsRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakBestiaryPointsEnum(const struct FBestiaryPointsEnum& Enum, class FName* Name, int32* Index);
	void AddRowToBestiaryPointsTable(class FName Name, const struct FBestiaryPoints& Data, struct FBestiaryPointsRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.BestiaryPointsTable
class UBestiaryPointsTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UBestiaryPointsTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.BestiaryTraitsLibrary
class UBestiaryTraitsLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UBestiaryTraitsLibrary* GetDefaultObj();

	struct FBestiaryTraitsRowHandle StructToRowHandle(const struct FBestiaryTraitsEnum& EnumValue);
	class FName StructToName(const struct FBestiaryTraitsEnum& EnumValue);
	int32 StructToInt(const struct FBestiaryTraitsEnum& EnumValue);
	struct FBestiaryTraitsEnum RowHandleToStruct(const struct FBestiaryTraitsRowHandle& RowHandle);
	void RemoveRowFromBestiaryTraitsTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FBestiaryTraitsEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FBestiaryTraitsEnum& A, const struct FBestiaryTraitsEnum& B);
	struct FBestiaryTraitsEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FBestiaryTraitsRowHandle MakeLiteralBestiaryTraits(const struct FBestiaryTraitsRowHandle& RowHandle);
	struct FBestiaryTraitsRowHandle MakeBestiaryTraitsFromIndex(int32 Index);
	struct FBestiaryTraitsEnum MakeBestiaryTraitsEnum(const struct FBestiaryTraitsEnum& Enum);
	struct FBestiaryTraitsRowHandle MakeBestiaryTraits(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FBestiaryTraitsEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetBestiaryTraitsStruct(const struct FBestiaryTraitsRowHandle& RowHandle, struct FBestiaryTraitData* BestiaryTraits, enum class EValid* Paths);
	bool EqualEqual_FBestiaryTraitsRowHandleFBestiaryTraitsRowHandle(const struct FBestiaryTraitsRowHandle& RowHandleA, const struct FBestiaryTraitsRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FBestiaryTraitsEnum& A, const struct FBestiaryTraitsEnum& B);
	struct FBestiaryTraitsRowHandle CastToBestiaryTraitsRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakBestiaryTraitsEnum(const struct FBestiaryTraitsEnum& Enum, class FName* Name, int32* Index);
	void AddRowToBestiaryTraitsTable(class FName Name, const struct FBestiaryTraitData& Data, struct FBestiaryTraitsRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.BestiaryTraitsTable
class UBestiaryTraitsTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UBestiaryTraitsTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.BestiaryTraitTypesLibrary
class UBestiaryTraitTypesLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UBestiaryTraitTypesLibrary* GetDefaultObj();

	struct FBestiaryTraitTypesRowHandle StructToRowHandle(const struct FBestiaryTraitTypesEnum& EnumValue);
	class FName StructToName(const struct FBestiaryTraitTypesEnum& EnumValue);
	int32 StructToInt(const struct FBestiaryTraitTypesEnum& EnumValue);
	struct FBestiaryTraitTypesEnum RowHandleToStruct(const struct FBestiaryTraitTypesRowHandle& RowHandle);
	void RemoveRowFromBestiaryTraitTypesTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FBestiaryTraitTypesEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FBestiaryTraitTypesEnum& A, const struct FBestiaryTraitTypesEnum& B);
	struct FBestiaryTraitTypesEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FBestiaryTraitTypesRowHandle MakeLiteralBestiaryTraitTypes(const struct FBestiaryTraitTypesRowHandle& RowHandle);
	struct FBestiaryTraitTypesRowHandle MakeBestiaryTraitTypesFromIndex(int32 Index);
	struct FBestiaryTraitTypesEnum MakeBestiaryTraitTypesEnum(const struct FBestiaryTraitTypesEnum& Enum);
	struct FBestiaryTraitTypesRowHandle MakeBestiaryTraitTypes(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FBestiaryTraitTypesEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetBestiaryTraitTypesStruct(const struct FBestiaryTraitTypesRowHandle& RowHandle, struct FBestiaryTraitType* BestiaryTraitTypes, enum class EValid* Paths);
	bool EqualEqual_FBestiaryTraitTypesRowHandleFBestiaryTraitTypesRowHandle(const struct FBestiaryTraitTypesRowHandle& RowHandleA, const struct FBestiaryTraitTypesRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FBestiaryTraitTypesEnum& A, const struct FBestiaryTraitTypesEnum& B);
	struct FBestiaryTraitTypesRowHandle CastToBestiaryTraitTypesRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakBestiaryTraitTypesEnum(const struct FBestiaryTraitTypesEnum& Enum, class FName* Name, int32* Index);
	void AddRowToBestiaryTraitTypesTable(class FName Name, const struct FBestiaryTraitType& Data, struct FBestiaryTraitTypesRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.BestiaryTraitTypesTable
class UBestiaryTraitTypesTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UBestiaryTraitTypesTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.BiomeAudioDataLibrary
class UBiomeAudioDataLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UBiomeAudioDataLibrary* GetDefaultObj();

	struct FBiomeAudioDataRowHandle StructToRowHandle(const struct FBiomeAudioDataEnum& EnumValue);
	class FName StructToName(const struct FBiomeAudioDataEnum& EnumValue);
	int32 StructToInt(const struct FBiomeAudioDataEnum& EnumValue);
	struct FBiomeAudioDataEnum RowHandleToStruct(const struct FBiomeAudioDataRowHandle& RowHandle);
	void RemoveRowFromBiomeAudioDataTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FBiomeAudioDataEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FBiomeAudioDataEnum& A, const struct FBiomeAudioDataEnum& B);
	struct FBiomeAudioDataEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FBiomeAudioDataRowHandle MakeLiteralBiomeAudioData(const struct FBiomeAudioDataRowHandle& RowHandle);
	struct FBiomeAudioDataRowHandle MakeBiomeAudioDataFromIndex(int32 Index);
	struct FBiomeAudioDataEnum MakeBiomeAudioDataEnum(const struct FBiomeAudioDataEnum& Enum);
	struct FBiomeAudioDataRowHandle MakeBiomeAudioData(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FBiomeAudioDataEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetBiomeAudioDataStruct(const struct FBiomeAudioDataRowHandle& RowHandle, struct FBiomeAudioData* BiomeAudioData, enum class EValid* Paths);
	bool EqualEqual_FBiomeAudioDataRowHandleFBiomeAudioDataRowHandle(const struct FBiomeAudioDataRowHandle& RowHandleA, const struct FBiomeAudioDataRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FBiomeAudioDataEnum& A, const struct FBiomeAudioDataEnum& B);
	struct FBiomeAudioDataRowHandle CastToBiomeAudioDataRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakBiomeAudioDataEnum(const struct FBiomeAudioDataEnum& Enum, class FName* Name, int32* Index);
	void AddRowToBiomeAudioDataTable(class FName Name, const struct FBiomeAudioData& Data, struct FBiomeAudioDataRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.BiomeAudioDataTable
class UBiomeAudioDataTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UBiomeAudioDataTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.BiomesLibrary
class UBiomesLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UBiomesLibrary* GetDefaultObj();

	struct FBiomesRowHandle StructToRowHandle(const struct FBiomesEnum& EnumValue);
	class FName StructToName(const struct FBiomesEnum& EnumValue);
	int32 StructToInt(const struct FBiomesEnum& EnumValue);
	struct FBiomesEnum RowHandleToStruct(const struct FBiomesRowHandle& RowHandle);
	void RemoveRowFromBiomesTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FBiomesEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FBiomesEnum& A, const struct FBiomesEnum& B);
	struct FBiomesEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FBiomesRowHandle MakeLiteralBiomes(const struct FBiomesRowHandle& RowHandle);
	struct FBiomesRowHandle MakeBiomesRowFromColor(struct FColor& InColor);
	struct FBiomesRowHandle MakeBiomesFromIndex(int32 Index);
	struct FBiomesEnum MakeBiomesEnum(const struct FBiomesEnum& Enum);
	struct FBiomesRowHandle MakeBiomes(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FBiomesEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetBiomesStruct(const struct FBiomesRowHandle& RowHandle, struct FIcarusBiome* Biomes, enum class EValid* Paths);
	bool EqualEqual_FBiomesRowHandleFBiomesRowHandle(const struct FBiomesRowHandle& RowHandleA, const struct FBiomesRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FBiomesEnum& A, const struct FBiomesEnum& B);
	struct FBiomesRowHandle CastToBiomesRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakBiomesEnum(const struct FBiomesEnum& Enum, class FName* Name, int32* Index);
	void AddRowToBiomesTable(class FName Name, const struct FIcarusBiome& Data, struct FBiomesRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.BiomesTable
class UBiomesTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UBiomesTable* GetDefaultObj();

};

// 0x28 (0x1D0 - 0x1A8)
// Class Icarus.BlockerSpawnerRecorderComponent
class UBlockerSpawnerRecorderComponent : public UActorStateRecorderComponent
{
public:
	bool                                         bHasSpawned;                                       // 0x1A8(0x1)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7009[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FPersistentBlockerRecord              PersistentBlockerRecord;                           // 0x1B0(0x20)(SaveGame, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBlockerSpawnerRecorderComponent* GetDefaultObj();

};

// 0x48 (0xF8 - 0xB0)
// Class Icarus.TalentControllerComponent
class UTalentControllerComponent : public UActorComponent
{
public:
	uint8                                        Pad_700B[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnModelViewChangedEvent;                           // 0xB8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UTalentModelInterface*                 Model;                                             // 0xC8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UTalentViewInterface*                  View;                                              // 0xD0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_700C[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTalentControllerComponent* GetDefaultObj();

	void TriggerModelStateRefresh();
	void Setup();
	void OnSessionFlagsUpdated();
	void OnModelViewChanged(class UTalentModelInterface* InModel, class UTalentViewInterface* InView);
	void OnLevelUp();
	void OnCharacterFlagsUpdated();
	void OnAccountFlagsUpdated();
	void NativeModelStateChanged(class UTalentModelInterface_Const* InModel);
	void BP_ForceRefresh();
};

// 0x0 (0xF8 - 0xF8)
// Class Icarus.BlueprintTalentControllerComponent
class UBlueprintTalentControllerComponent : public UTalentControllerComponent
{
public:

	static class UClass* StaticClass();
	static class UBlueprintTalentControllerComponent* GetDefaultObj();

};

// 0xC0 (0xE8 - 0x28)
// Class Icarus.TalentModelInterface_Const
class UTalentModelInterface_Const : public UObject
{
public:
	FMulticastInlineDelegateProperty_            OnModelStateChanged;                               // 0x28(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnModelTalentStateChanged;                         // 0x38(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_701B[0xA0];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UTalentModelInterface_Const* GetDefaultObj();

	void OnModelViewChanged(class UTalentModelInterface* InModel, class UTalentViewInterface* InView);
	bool IsTalentUnlocked(struct FTalentsRowHandle& Talent);
	int32 GetTotalTalentsForTree(struct FTalentTreesRowHandle& TalentTree);
	int32 GetTotalPoints();
	int32 GetTotalNonRestrictedTalentsForTree(struct FTalentTreesRowHandle& TalentTree);
	TArray<struct FTalentTreesRowHandle> GetTalentTreesForArchetype(const struct FTalentArchetypesRowHandle& Archetype);
	TArray<struct FTalentTreesRowHandle> GetTalentTrees();
	bool GetTalentState(struct FTalentsRowHandle& Talent, struct FTalentModelData* OutData);
	TArray<struct FTalentsRowHandle> GetTalents();
	int32 GetTalentRank(struct FTalentsRowHandle& Talent);
	int32 GetSpentPointsForTree(struct FTalentTreesRowHandle& TalentTree);
	int32 GetSpentPoints();
	int32 GetPointsForLevel(int32 InLevel);
	int32 GetNonRestrictedSpentPointsForTree(struct FTalentTreesRowHandle& TalentTree);
	struct FTalentModelsRowHandle GetModelRowHandle();
	struct FTalentModelsRowHandle GetModelData();
	int32 GetLevel();
	TScriptInterface<class ITalentControllerInterface> GetController();
	int32 GetAvailablePoints();
	TArray<struct FTalentArchetypesRowHandle> GetArchetypes();
	bool DoesModelContainTalent(struct FTalentsRowHandle& Talent);
	bool CanUnlockTalent(struct FTalentsRowHandle& Talent, int32 Rank, bool bIgnoreLockedState);
};

// 0x0 (0xE8 - 0xE8)
// Class Icarus.TalentModelInterface
class UTalentModelInterface : public UTalentModelInterface_Const
{
public:

	static class UClass* StaticClass();
	static class UTalentModelInterface* GetDefaultObj();

	void SetLevel(int32 InLevel);
	void SetController(TScriptInterface<class ITalentControllerInterface>& InController);
	void ResetTalents();
};

// 0x0 (0xE8 - 0xE8)
// Class Icarus.BlueprintTalentModel
class UBlueprintTalentModel : public UTalentModelInterface
{
public:

	static class UClass* StaticClass();
	static class UBlueprintTalentModel* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.BlueprintUnlocksLibrary
class UBlueprintUnlocksLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UBlueprintUnlocksLibrary* GetDefaultObj();

	struct FBlueprintUnlocksRowHandle StructToRowHandle(const struct FBlueprintUnlocksEnum& EnumValue);
	class FName StructToName(const struct FBlueprintUnlocksEnum& EnumValue);
	int32 StructToInt(const struct FBlueprintUnlocksEnum& EnumValue);
	struct FBlueprintUnlocksEnum RowHandleToStruct(const struct FBlueprintUnlocksRowHandle& RowHandle);
	void RemoveRowFromBlueprintUnlocksTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FBlueprintUnlocksEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FBlueprintUnlocksEnum& A, const struct FBlueprintUnlocksEnum& B);
	struct FBlueprintUnlocksEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FBlueprintUnlocksRowHandle MakeLiteralBlueprintUnlocks(const struct FBlueprintUnlocksRowHandle& RowHandle);
	struct FBlueprintUnlocksRowHandle MakeBlueprintUnlocksFromIndex(int32 Index);
	struct FBlueprintUnlocksEnum MakeBlueprintUnlocksEnum(const struct FBlueprintUnlocksEnum& Enum);
	struct FBlueprintUnlocksRowHandle MakeBlueprintUnlocks(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FBlueprintUnlocksEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetBlueprintUnlocksStruct(const struct FBlueprintUnlocksRowHandle& RowHandle, struct FBlueprintUnlock* BlueprintUnlocks, enum class EValid* Paths);
	bool EqualEqual_FBlueprintUnlocksRowHandleFBlueprintUnlocksRowHandle(const struct FBlueprintUnlocksRowHandle& RowHandleA, const struct FBlueprintUnlocksRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FBlueprintUnlocksEnum& A, const struct FBlueprintUnlocksEnum& B);
	struct FBlueprintUnlocksRowHandle CastToBlueprintUnlocksRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakBlueprintUnlocksEnum(const struct FBlueprintUnlocksEnum& Enum, class FName* Name, int32* Index);
	void AddRowToBlueprintUnlocksTable(class FName Name, const struct FBlueprintUnlock& Data, struct FBlueprintUnlocksRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.BlueprintUnlocksTable
class UBlueprintUnlocksTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UBlueprintUnlocksTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.BreakableRockDataLibrary
class UBreakableRockDataLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UBreakableRockDataLibrary* GetDefaultObj();

	struct FBreakableRockDataRowHandle StructToRowHandle(const struct FBreakableRockDataEnum& EnumValue);
	class FName StructToName(const struct FBreakableRockDataEnum& EnumValue);
	int32 StructToInt(const struct FBreakableRockDataEnum& EnumValue);
	struct FBreakableRockDataEnum RowHandleToStruct(const struct FBreakableRockDataRowHandle& RowHandle);
	void RemoveRowFromBreakableRockDataTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FBreakableRockDataEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FBreakableRockDataEnum& A, const struct FBreakableRockDataEnum& B);
	struct FBreakableRockDataEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FBreakableRockDataRowHandle MakeLiteralBreakableRockData(const struct FBreakableRockDataRowHandle& RowHandle);
	struct FBreakableRockDataRowHandle MakeBreakableRockDataFromIndex(int32 Index);
	struct FBreakableRockDataEnum MakeBreakableRockDataEnum(const struct FBreakableRockDataEnum& Enum);
	struct FBreakableRockDataRowHandle MakeBreakableRockData(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FBreakableRockDataEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetBreakableRockDataStruct(const struct FBreakableRockDataRowHandle& RowHandle, struct FBreakableRockData* BreakableRockData, enum class EValid* Paths);
	bool EqualEqual_FBreakableRockDataRowHandleFBreakableRockDataRowHandle(const struct FBreakableRockDataRowHandle& RowHandleA, const struct FBreakableRockDataRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FBreakableRockDataEnum& A, const struct FBreakableRockDataEnum& B);
	struct FBreakableRockDataRowHandle CastToBreakableRockDataRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakBreakableRockDataEnum(const struct FBreakableRockDataEnum& Enum, class FName* Name, int32* Index);
	void AddRowToBreakableRockDataTable(class FName Name, const struct FBreakableRockData& Data, struct FBreakableRockDataRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.BreakableRockDataTable
class UBreakableRockDataTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UBreakableRockDataTable* GetDefaultObj();

};

// 0x20 (0xB0 - 0x90)
// Class Icarus.BTComposite_SelectPseudoRandom
class UBTComposite_SelectPseudoRandom : public UBTCompositeNode
{
public:
	bool                                         bAlreadyRan;                                       // 0x90(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7060[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                PossibleChildren;                                  // 0x98(0x10)(ZeroConstructor, NativeAccessSpecifierPublic)
	int32                                        LastChild;                                         // 0xA8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7061[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTComposite_SelectPseudoRandom* GetDefaultObj();

};

// 0x8 (0x98 - 0x90)
// Class Icarus.BTComposite_SelectRandom
class UBTComposite_SelectRandom : public UBTCompositeNode
{
public:
	bool                                         bAlreadyRan;                                       // 0x90(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7062[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTComposite_SelectRandom* GetDefaultObj();

};

// 0x10 (0xA0 - 0x90)
// Class Icarus.BTComposite_SequenceLoop
class UBTComposite_SequenceLoop : public UBTComposite_Sequence
{
public:
	int32                                        LoopCount;                                         // 0x90(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        LoopDeviation;                                     // 0x94(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        CurrentLoopCount;                                  // 0x98(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ActiveLoopCount;                                   // 0x9C(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTComposite_SequenceLoop* GetDefaultObj();

};

// 0x18 (0xB8 - 0xA0)
// Class Icarus.BTComposite_SequenceLoop_Scaled
class UBTComposite_SequenceLoop_Scaled : public UBTComposite_SequenceLoop
{
public:
	struct FScalingRulesEnum                     LoopCountScalingRule;                              // 0xA0(0x10)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AActor*                                OwningPawnReference;                               // 0xB0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBTComposite_SequenceLoop_Scaled* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Icarus.BTD_CustomTagCooldown
class UBTD_CustomTagCooldown : public UBTDecorator
{
public:
	struct FGameplayTag                          CooldownTag;                                       // 0x68(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStatsEnum                            ActionsPerMinuteStat;                              // 0x70(0x10)(Edit, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DefaultCooldownDuration;                           // 0x80(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAddToExistingDuration;                            // 0x84(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bActivatesCooldown;                                // 0x85(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7065[0xA];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTD_CustomTagCooldown* GetDefaultObj();

};

// 0x8 (0x70 - 0x68)
// Class Icarus.BTD_DoOnce
class UBTD_DoOnce : public UBTDecorator
{
public:
	bool                                         MustSucceed;                                       // 0x68(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         SucceedOnSubsequentCalls;                          // 0x69(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7066[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTD_DoOnce* GetDefaultObj();

};

// 0x18 (0x80 - 0x68)
// Class Icarus.BTD_HasPerceivedTarget
class UBTD_HasPerceivedTarget : public UBTDecorator
{
public:
	TSubclassOf<class UAISense>                  SenseToUse;                                        // 0x68(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOnlyCountAliveTargets;                            // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFilterByRelationshipType;                         // 0x71(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ERelationshipType                 RelationshipType;                                  // 0x72(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7067[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AAIController*                         OwnerAIController;                                 // 0x78(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBTD_HasPerceivedTarget* GetDefaultObj();

};

// 0x48 (0xE0 - 0x98)
// Class Icarus.BTT_ExecuteFunction
class UBTT_ExecuteFunction : public UBTTask_BlackboardBase
{
public:
	struct FFunctionContext                      FunctionContext;                                   // 0x98(0x18)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                Target;                                            // 0xB0(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bReturnSuccessIfInvalid;                           // 0xD8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7068[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTT_ExecuteFunction* GetDefaultObj();

};

// 0x30 (0xE8 - 0xB8)
// Class Icarus.BTTask_IcarusMoveDirectlyToward
class UBTTask_IcarusMoveDirectlyToward : public UBTTask_MoveDirectlyToward
{
public:
	bool                                         bUseBlackboardDefinedAcceptanceRadius;             // 0xB8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIgnoreInvalidRadiusValues;                        // 0xB9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_7069[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                AcceptableRadiusKey;                               // 0xC0(0x28)(Edit, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBTTask_IcarusMoveDirectlyToward* GetDefaultObj();

};

// 0x30 (0xE0 - 0xB0)
// Class Icarus.BTTask_IcarusMoveTo
class UBTTask_IcarusMoveTo : public UBTTask_MoveTo
{
public:
	bool                                         bUseBlackboardDefinedAcceptanceRadius;             // 0xB0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIgnoreInvalidRadiusValues;                        // 0xB1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_706A[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                AcceptableRadiusKey;                               // 0xB8(0x28)(Edit, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBTTask_IcarusMoveTo* GetDefaultObj();

};

// 0x18 (0x88 - 0x70)
// Class Icarus.BTTask_SetTagCooldownWithDeviation
class UBTTask_SetTagCooldownWithDeviation : public UBTTaskNode
{
public:
	struct FGameplayTag                          CooldownTag;                                       // 0x70(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAddToExistingDuration;                            // 0x78(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_706C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CooldownDuration;                                  // 0x7C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RandomDeviation;                                   // 0x80(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_706D[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_SetTagCooldownWithDeviation* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.BuildableAudioDataLibrary
class UBuildableAudioDataLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UBuildableAudioDataLibrary* GetDefaultObj();

	struct FBuildableAudioDataRowHandle StructToRowHandle(const struct FBuildableAudioDataEnum& EnumValue);
	class FName StructToName(const struct FBuildableAudioDataEnum& EnumValue);
	int32 StructToInt(const struct FBuildableAudioDataEnum& EnumValue);
	struct FBuildableAudioDataEnum RowHandleToStruct(const struct FBuildableAudioDataRowHandle& RowHandle);
	void RemoveRowFromBuildableAudioDataTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FBuildableAudioDataEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FBuildableAudioDataEnum& A, const struct FBuildableAudioDataEnum& B);
	struct FBuildableAudioDataEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FBuildableAudioDataRowHandle MakeLiteralBuildableAudioData(const struct FBuildableAudioDataRowHandle& RowHandle);
	struct FBuildableAudioDataRowHandle MakeBuildableAudioDataFromIndex(int32 Index);
	struct FBuildableAudioDataEnum MakeBuildableAudioDataEnum(const struct FBuildableAudioDataEnum& Enum);
	struct FBuildableAudioDataRowHandle MakeBuildableAudioData(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FBuildableAudioDataEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetBuildableAudioDataStruct(const struct FBuildableAudioDataRowHandle& RowHandle, struct FBuildableAudioData* BuildableAudioData, enum class EValid* Paths);
	bool EqualEqual_FBuildableAudioDataRowHandleFBuildableAudioDataRowHandle(const struct FBuildableAudioDataRowHandle& RowHandleA, const struct FBuildableAudioDataRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FBuildableAudioDataEnum& A, const struct FBuildableAudioDataEnum& B);
	struct FBuildableAudioDataRowHandle CastToBuildableAudioDataRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakBuildableAudioDataEnum(const struct FBuildableAudioDataEnum& Enum, class FName* Name, int32* Index);
	void AddRowToBuildableAudioDataTable(class FName Name, const struct FBuildableAudioData& Data, struct FBuildableAudioDataRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.BuildableAudioDataTable
class UBuildableAudioDataTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UBuildableAudioDataTable* GetDefaultObj();

};

// 0x10 (0xE0 - 0xD0)
// Class Icarus.BuildableComponent
class UBuildableComponent : public UTraitComponent
{
public:
	TSubclassOf<class AIcarusActor>              ClassToBuild;                                      // 0xD0(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Variation;                                         // 0xD8(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_708C[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBuildableComponent* GetDefaultObj();

	void SetVariation(int32 NewVariation);
	bool GetBuildableData(struct FBuildableData* OutData);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.BuildableLibrary
class UBuildableLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UBuildableLibrary* GetDefaultObj();

	struct FBuildableRowHandle StructToRowHandle(const struct FBuildableEnum& EnumValue);
	class FName StructToName(const struct FBuildableEnum& EnumValue);
	int32 StructToInt(const struct FBuildableEnum& EnumValue);
	struct FBuildableEnum RowHandleToStruct(const struct FBuildableRowHandle& RowHandle);
	void RemoveRowFromBuildableTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FBuildableEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FBuildableEnum& A, const struct FBuildableEnum& B);
	struct FBuildableEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FBuildableRowHandle MakeLiteralBuildable(const struct FBuildableRowHandle& RowHandle);
	struct FBuildableRowHandle MakeBuildableFromIndex(int32 Index);
	struct FBuildableEnum MakeBuildableEnum(const struct FBuildableEnum& Enum);
	struct FBuildableRowHandle MakeBuildable(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FBuildableEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetBuildableStruct(const struct FBuildableRowHandle& RowHandle, struct FBuildableData* Buildable, enum class EValid* Paths);
	bool EqualEqual_FBuildableRowHandleFBuildableRowHandle(const struct FBuildableRowHandle& RowHandleA, const struct FBuildableRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FBuildableEnum& A, const struct FBuildableEnum& B);
	struct FBuildableRowHandle CastToBuildableRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakBuildableEnum(const struct FBuildableEnum& Enum, class FName* Name, int32* Index);
	void AddRowToBuildableTable(class FName Name, const struct FBuildableData& Data, struct FBuildableRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.BuildableTable
class UBuildableTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UBuildableTable* GetDefaultObj();

};

// 0xA0 (0x2C0 - 0x220)
// Class Icarus.IcarusActor
class AIcarusActor : public AActor
{
public:
	uint8                                        Pad_70A8[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UIcarusStatContainer*                  StatContainer;                                     // 0x240(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UActorState*                           ActorState;                                        // 0x248(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, Net, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EProgressState                    ProgressState;                                     // 0x250(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnActorPreDestroy;                                 // 0x251(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_70A9[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnModifierStateUpdated;                            // 0x258(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UTerrainAnchorComponent*               TerrainAnchor;                                     // 0x268(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UTerrainAnchorComponent>   TerrainAnchorClass;                                // 0x270(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_70AA[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 GameplayTags;                                      // 0x280(0x20)(Edit, BlueprintVisible, Net, NativeAccessSpecifierPublic)
	uint8                                        Pad_70AB[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UIcarusStateRecorderComponent> RecorderClass;                                     // 0x2A8(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSaveModifiersToDatabase;                          // 0x2B0(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_70AC[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UIcarusStateRecorderComponent*         Recorder;                                          // 0x2B8(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class AIcarusActor* GetDefaultObj();

	void SetRecorderShouldRetainOnDestroy(bool bShouldRetain);
	void SetIcarusUID(int32 ForcedUID);
	void RepairObject();
	void RecorderEndRecording();
	void RecorderBeginRecording();
	void RaiseTheCurtain();
	void OnTerrainAnchorStateChanged();
	void OnDatabaseLoadComplete();
	void IcarusBeginPlay();
	bool HasRecorder();
	int32 GetIcarusUID();
	void DestroyIcarusActorInternal(enum class EIcarusActorDestroyReason Reason);
	void DestroyIcarusActor(enum class EIcarusActorDestroyReason Reason);
	void ClaimUniqueIcarusUIDFromLibrary(int32 SuggestedUID);
};

// 0x2B0 (0x570 - 0x2C0)
// Class Icarus.IcarusItem
class AIcarusItem : public AIcarusActor
{
public:
	class UInventory*                            ItemInventory;                                     // 0x2C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        ItemInventoryLocation;                             // 0x2C8(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         HasLink;                                           // 0x2CC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	FMulticastSparseDelegateProperty_            PickedUp;                                          // 0x2CD(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_70C4[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UTraitComponent*>               TraitComponents;                                   // 0x2D0(0x10)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, ContainsInstancedReference, NativeAccessSpecifierPublic)
	struct FItemData                             ItemData;                                          // 0x2E0(0x1F0)(BlueprintVisible, Net, RepNotify, ContainsInstancedReference, Protected, ExposeOnSpawn, NativeAccessSpecifierProtected)
	struct FIcarusItemConstructionParameters     ConstructionParameters;                            // 0x4D0(0x28)(Edit, BlueprintVisible, Net, RepNotify, NativeAccessSpecifierPublic)
	enum class EIcarusItemContext                SpawnedContext;                                    // 0x4F8(0x1)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_70C6[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItemTemplateRowHandle                OverrideInstanceItemTemplate;                      // 0x4FC(0x18)(Edit, BlueprintVisible, DisableEditOnTemplate, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_70C7[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USmoothSync*                           SmoothSyncComponent;                               // 0x518(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, DisableEditOnTemplate, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSkipAttachmentReplication;                        // 0x520(0x1)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_70C8[0xF];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTransform                            ConstructionTransfrom;                             // 0x530(0x30)(IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            DynamicDataUpdated;                                // 0x560(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class AIcarusItem* GetDefaultObj();

	bool WorldPickup(class UItemableComponent* ItemIn, class AActor* Interactor, struct FHitResult& HitResult);
	void StackUpdated();
	void SetItemVisible(bool bVisible);
	bool ServerSetupTraitComponents();
	void ServerSetItemData(struct FItemData& InItemData);
	bool ServerLoadItemData(const struct FItemTemplateRowHandle& ItemTemplate);
	void SerializeItemData(struct FItemData* OutItemData);
	void ResetDecaySpoilTime();
	void ReconstructItem(struct FIcarusItemConstructionParameters& NewConstructionParameters);
	void OverwriteInventoryItemDynamicProperty(enum class EDynamicItemProperties Property, int32 Value);
	void OnWorldPickup(class UItemableComponent* ItemIn, class AActor* Interactor, struct FHitResult& HitResult);
	void OnRep_ItemData();
	void OnRep_ConstructionParameters();
	bool OnPickedUp(class AIcarusItem* Item);
	void OnItemDataChanged();
	void OnDynamicDataUpdated();
	bool OnDropped();
	void ItemContainerDataUpdated();
	bool HasInventoryItemLink();
	struct FItemData GetSerialisedItemData();
	class UMeshComponent* GetRootMeshComponent();
	class AIcarusPlayerCharacter* GetOwningIcarusPlayerCharacter();
	TArray<struct FItemDynamicData> GetMutableItemDynamicData();
	struct FItemData GetItemData();
	void FillableUpdated();
	void EstablishLink(class UInventory* Inventory, int32 Location);
	void DurabilityUpdated();
	void DestroyLinkedInventoryItem();
	void DestroyLink();
	void DeserializeItemData(struct FItemData& InItemData);
	void DecayableDataUpdated();
	void ActionableUpdated();
};

// 0x90 (0x600 - 0x570)
// Class Icarus.BuildingBase
class ABuildingBase : public AIcarusItem
{
public:
	class UIcarusNavigationDirtier*              NavigationDirtier;                                 // 0x570(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnBuildingDestroyed;                               // 0x578(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnBuildingReplaced;                                // 0x588(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	struct FVector                               GridSpaceCenterLocation;                           // 0x598(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               GridLocation;                                      // 0x5A4(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FVectorPair>                   BlockingLines;                                     // 0x5B0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bStartsDormant;                                    // 0x5C0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_70CC[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UMaterialInterface*>            DefaultMainMeshMaterials;                          // 0x5C8(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bUseDestructibleMaterialMap;                       // 0x5D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_70CD[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                DestructibleMaterialSlotsToMainMesh;               // 0x5E0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_70CE[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingBase* GetDefaultObj();

	void StartDestruction(class AIcarusPlayerController* TriggeringPlayer, enum class EBuildingDestroyReason DestroyReason);
	void NotifyBuildingReplaced(class ABuildingBase* NewBuilding);
	void NotifyBuildingDestroyed(enum class EBuildingDestroyReason Reason);
	void MarkDirty();
	int32 ManhattanDistanceToBuilding(class ABuildingBase* OtherBuilding);
	bool IsReceivingWindDamage();
	bool IsBuildingOutside();
	bool IsBuildingDestroyed();
	bool HasCachedData();
	class UDestructibleComponent* GetStrippedDestructibleMesh();
	class UStaticMeshComponent* GetStrippedBuildingMesh();
	enum class EBuildingPieceType GetPieceType();
	class ABuildingGridBase* GetParentGrid();
	class UStaticMeshComponent* GetMainBuildingMesh();
	class UDestructibleComponent* GetDestructibleBuildingMesh();
	class USceneComponent* GetCenterComponent();
	float GetBuildingTier();
	class UDestructibleComponent* CreateDestructibleMeshComponent();
	void CalculateStabilityState();
	void ApplyBuildingSkinMaterialOverrides();
};

// 0x0 (0x28 - 0x28)
// Class Icarus.BuildingFunctionLibrary
class UBuildingFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UBuildingFunctionLibrary* GetDefaultObj();

	struct FVector RoundVector(const struct FVector& Input);
	TMap<int32, TSoftObjectPtr<class UMaterialInterface>> GetMaterialOverridesForBuildingVariation(struct FBuildableData& BuildableData, int32 Variation, enum class EBuildingMeshType InMeshType, bool* bHasOverrideMaterials);
	TMap<int32, TSoftObjectPtr<class UMaterialInterface>> GetMaterialOverridesForBuilding(class ABuildingBase* Building, enum class EBuildingMeshType InMeshType, bool* bHasOverrideMaterials);
	int32 GetBuildingVariation(class ABuildingBase* Building);
	struct FBuildingPiecesRowHandle GetBuildingUpgrade(class ABuildingBase* Building, const struct FBuildingTypesEnum& Type);
	TArray<struct FVectorPair> AddReverseLinesToVectorPairArray(TArray<struct FVectorPair>& VectorPairs);
};

// 0x190 (0x450 - 0x2C0)
// Class Icarus.BuildingGridBase
class ABuildingGridBase : public AIcarusActor
{
public:
	int32                                        BuildingCount;                                     // 0x2C0(0x4)(BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_70E2[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class ABuildingBase*>                 BuildingsSelectedForWindDamage;                    // 0x2C8(0x10)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_70E3[0xF8];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<struct FVector, struct FGridPoint>      GridPoints;                                        // 0x3D0(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	TArray<class ABuildingBase*>                 BuildingsRequiringNavUpdate;                       // 0x420(0x10)(Edit, BlueprintVisible, ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_70E4[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ABuildingGridBase* GetDefaultObj();

	bool TryAddNewBuildingFromWorldSpace(const struct FTransform& WorldSpaceTransform, TSubclassOf<class ABuildingBase> DesiredClass, bool bAlternateRotation, const struct FItemData& Item, class ABuildingBase** Building);
	void StartDirtyingBuildingNavigation();
	void SetQueued(bool bQueued);
	void SetAutomaticResumingDestructionEnabled(bool bEnabled);
	struct FSerializedGrid SerializeForSaveGame(class AActor* Origin);
	void RemoveBuildingFromStabilityUpdateQueue(class ABuildingBase* BuildingPiece);
	void QueueStabilityUpdate(class ABuildingBase* BuildingPiece);
	void OnBuildingPieceRemoved(class ABuildingBase* BuildingPiece);
	void OnBuildingPieceAdded(class ABuildingBase* BuildingPiece);
	void LoadGridAndBuildingsFromRecord(class UBuildingGridRecorderComponent* RecorderComponent);
	bool GetIsQueued();
	void GetGridBuildingDataForRecord(class UBuildingGridRecorderComponent* RecorderComponent);
	void GetAllTouchingBuildings(TSubclassOf<class ABuildingBase> Class, const struct FTransform& InTransform, TArray<class ABuildingBase*>* NeighborBuildings);
	void FindNearbyTouchingBuildings(class ABuildingBase* StartingBuilding, class ABuildingBase* CurrentBuilding, int32 MaximumDepth, TArray<class ABuildingBase*>* FoundBuildings, TArray<class ABuildingBase*>* CheckedBuildings);
	void AddChildBuildingToDestroy(class ABuildingBase* BuildingToDestroy);
};

// 0x18 (0x58 - 0x40)
// Class Icarus.BuildingGridManagerSubsystem
class UBuildingGridManagerSubsystem : public UTickableWorldSubsystem
{
public:
	uint8                                        Pad_70E5[0x14];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        WeatherSortingBudget;                              // 0x54(0x4)(ZeroConstructor, Config, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBuildingGridManagerSubsystem* GetDefaultObj();

};

// 0x58 (0x200 - 0x1A8)
// Class Icarus.BuildingGridRecorderComponent
class UBuildingGridRecorderComponent : public UActorStateRecorderComponent
{
public:
	uint8                                        Pad_70E6[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBuildingGridSaveData                 BuildingGridRecord;                                // 0x1B0(0x50)(BlueprintVisible, SaveGame, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBuildingGridRecorderComponent* GetDefaultObj();

	void AddBuildingToGrid(struct FTransform& GridTransform, class FName& BuildableRowName, class FName& BuildingItemName, struct FItemData& BuildingItemData, const struct FBuildingInfo& BuildingInfo);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.BuildingLookupLibrary
class UBuildingLookupLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UBuildingLookupLibrary* GetDefaultObj();

	struct FBuildingLookupRowHandle StructToRowHandle(const struct FBuildingLookupEnum& EnumValue);
	class FName StructToName(const struct FBuildingLookupEnum& EnumValue);
	int32 StructToInt(const struct FBuildingLookupEnum& EnumValue);
	struct FBuildingLookupEnum RowHandleToStruct(const struct FBuildingLookupRowHandle& RowHandle);
	void RemoveRowFromBuildingLookupTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FBuildingLookupEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FBuildingLookupEnum& A, const struct FBuildingLookupEnum& B);
	struct FBuildingLookupEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FBuildingLookupRowHandle MakeLiteralBuildingLookup(const struct FBuildingLookupRowHandle& RowHandle);
	struct FBuildingLookupRowHandle MakeBuildingLookupFromIndex(int32 Index);
	struct FBuildingLookupEnum MakeBuildingLookupEnum(const struct FBuildingLookupEnum& Enum);
	struct FBuildingLookupRowHandle MakeBuildingLookup(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FBuildingLookupEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetBuildingLookupStruct(const struct FBuildingLookupRowHandle& RowHandle, struct FBuildingLookup* BuildingLookup, enum class EValid* Paths);
	bool EqualEqual_FBuildingLookupRowHandleFBuildingLookupRowHandle(const struct FBuildingLookupRowHandle& RowHandleA, const struct FBuildingLookupRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FBuildingLookupEnum& A, const struct FBuildingLookupEnum& B);
	struct FBuildingLookupRowHandle CastToBuildingLookupRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakBuildingLookupEnum(const struct FBuildingLookupEnum& Enum, class FName* Name, int32* Index);
	void AddRowToBuildingLookupTable(class FName Name, const struct FBuildingLookup& Data, struct FBuildingLookupRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.BuildingLookupTable
class UBuildingLookupTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UBuildingLookupTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.BuildingPiecesLibrary
class UBuildingPiecesLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UBuildingPiecesLibrary* GetDefaultObj();

	struct FBuildingPiecesRowHandle StructToRowHandle(const struct FBuildingPiecesEnum& EnumValue);
	class FName StructToName(const struct FBuildingPiecesEnum& EnumValue);
	int32 StructToInt(const struct FBuildingPiecesEnum& EnumValue);
	struct FBuildingPiecesEnum RowHandleToStruct(const struct FBuildingPiecesRowHandle& RowHandle);
	void RemoveRowFromBuildingPiecesTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FBuildingPiecesEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FBuildingPiecesEnum& A, const struct FBuildingPiecesEnum& B);
	struct FBuildingPiecesEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FBuildingPiecesRowHandle MakeLiteralBuildingPieces(const struct FBuildingPiecesRowHandle& RowHandle);
	struct FBuildingPiecesRowHandle MakeBuildingPiecesFromIndex(int32 Index);
	struct FBuildingPiecesEnum MakeBuildingPiecesEnum(const struct FBuildingPiecesEnum& Enum);
	struct FBuildingPiecesRowHandle MakeBuildingPieces(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FBuildingPiecesEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetBuildingPiecesStruct(const struct FBuildingPiecesRowHandle& RowHandle, struct FBuildingPiece* BuildingPieces, enum class EValid* Paths);
	bool EqualEqual_FBuildingPiecesRowHandleFBuildingPiecesRowHandle(const struct FBuildingPiecesRowHandle& RowHandleA, const struct FBuildingPiecesRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FBuildingPiecesEnum& A, const struct FBuildingPiecesEnum& B);
	struct FBuildingPiecesRowHandle CastToBuildingPiecesRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakBuildingPiecesEnum(const struct FBuildingPiecesEnum& Enum, class FName* Name, int32* Index);
	void AddRowToBuildingPiecesTable(class FName Name, const struct FBuildingPiece& Data, struct FBuildingPiecesRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.BuildingPiecesTable
class UBuildingPiecesTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UBuildingPiecesTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.BuildingSkinsLibrary
class UBuildingSkinsLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UBuildingSkinsLibrary* GetDefaultObj();

	struct FBuildingSkinsRowHandle StructToRowHandle(const struct FBuildingSkinsEnum& EnumValue);
	class FName StructToName(const struct FBuildingSkinsEnum& EnumValue);
	int32 StructToInt(const struct FBuildingSkinsEnum& EnumValue);
	struct FBuildingSkinsEnum RowHandleToStruct(const struct FBuildingSkinsRowHandle& RowHandle);
	void RemoveRowFromBuildingSkinsTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FBuildingSkinsEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FBuildingSkinsEnum& A, const struct FBuildingSkinsEnum& B);
	struct FBuildingSkinsEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FBuildingSkinsRowHandle MakeLiteralBuildingSkins(const struct FBuildingSkinsRowHandle& RowHandle);
	struct FBuildingSkinsRowHandle MakeBuildingSkinsFromIndex(int32 Index);
	struct FBuildingSkinsEnum MakeBuildingSkinsEnum(const struct FBuildingSkinsEnum& Enum);
	struct FBuildingSkinsRowHandle MakeBuildingSkins(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FBuildingSkinsEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetBuildingSkinsStruct(const struct FBuildingSkinsRowHandle& RowHandle, struct FBuildingSkin* BuildingSkins, enum class EValid* Paths);
	bool EqualEqual_FBuildingSkinsRowHandleFBuildingSkinsRowHandle(const struct FBuildingSkinsRowHandle& RowHandleA, const struct FBuildingSkinsRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FBuildingSkinsEnum& A, const struct FBuildingSkinsEnum& B);
	struct FBuildingSkinsRowHandle CastToBuildingSkinsRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakBuildingSkinsEnum(const struct FBuildingSkinsEnum& Enum, class FName* Name, int32* Index);
	void AddRowToBuildingSkinsTable(class FName Name, const struct FBuildingSkin& Data, struct FBuildingSkinsRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.BuildingSkinsTable
class UBuildingSkinsTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UBuildingSkinsTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.BuildingStabilityLibrary
class UBuildingStabilityLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UBuildingStabilityLibrary* GetDefaultObj();

	struct FBuildingStabilityRowHandle StructToRowHandle(const struct FBuildingStabilityEnum& EnumValue);
	class FName StructToName(const struct FBuildingStabilityEnum& EnumValue);
	int32 StructToInt(const struct FBuildingStabilityEnum& EnumValue);
	struct FBuildingStabilityEnum RowHandleToStruct(const struct FBuildingStabilityRowHandle& RowHandle);
	void RemoveRowFromBuildingStabilityTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FBuildingStabilityEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FBuildingStabilityEnum& A, const struct FBuildingStabilityEnum& B);
	struct FBuildingStabilityEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FBuildingStabilityRowHandle MakeLiteralBuildingStability(const struct FBuildingStabilityRowHandle& RowHandle);
	struct FBuildingStabilityRowHandle MakeBuildingStabilityFromIndex(int32 Index);
	struct FBuildingStabilityEnum MakeBuildingStabilityEnum(const struct FBuildingStabilityEnum& Enum);
	struct FBuildingStabilityRowHandle MakeBuildingStability(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FBuildingStabilityEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetBuildingStabilityStruct(const struct FBuildingStabilityRowHandle& RowHandle, struct FBuildingStability* BuildingStability, enum class EValid* Paths);
	bool EqualEqual_FBuildingStabilityRowHandleFBuildingStabilityRowHandle(const struct FBuildingStabilityRowHandle& RowHandleA, const struct FBuildingStabilityRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FBuildingStabilityEnum& A, const struct FBuildingStabilityEnum& B);
	struct FBuildingStabilityRowHandle CastToBuildingStabilityRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakBuildingStabilityEnum(const struct FBuildingStabilityEnum& Enum, class FName* Name, int32* Index);
	void AddRowToBuildingStabilityTable(class FName Name, const struct FBuildingStability& Data, struct FBuildingStabilityRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.BuildingStabilityTable
class UBuildingStabilityTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UBuildingStabilityTable* GetDefaultObj();

};

// 0x20 (0x50 - 0x30)
// Class Icarus.BuildingSubsystem
class UBuildingSubsystem : public UWorldSubsystem
{
public:
	FMulticastInlineDelegateProperty_            OnBuildingPiecePlacedNotify;                       // 0x30(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnBuildingPieceRemovedNotify;                      // 0x40(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBuildingSubsystem* GetDefaultObj();

	void BroadcastBuildingPieceRemovedDelegate(class AIcarusPlayerCharacter* Player, class ABuildingBase* Building);
	void BroadcastBuildingPiecePlacedDelegate(class AIcarusPlayerCharacter* Player, class ABuildingBase* Building);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.BuildingTypesLibrary
class UBuildingTypesLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UBuildingTypesLibrary* GetDefaultObj();

	struct FBuildingTypesRowHandle StructToRowHandle(const struct FBuildingTypesEnum& EnumValue);
	class FName StructToName(const struct FBuildingTypesEnum& EnumValue);
	int32 StructToInt(const struct FBuildingTypesEnum& EnumValue);
	struct FBuildingTypesEnum RowHandleToStruct(const struct FBuildingTypesRowHandle& RowHandle);
	void RemoveRowFromBuildingTypesTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FBuildingTypesEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FBuildingTypesEnum& A, const struct FBuildingTypesEnum& B);
	struct FBuildingTypesEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FBuildingTypesRowHandle MakeLiteralBuildingTypes(const struct FBuildingTypesRowHandle& RowHandle);
	struct FBuildingTypesRowHandle MakeBuildingTypesFromIndex(int32 Index);
	struct FBuildingTypesEnum MakeBuildingTypesEnum(const struct FBuildingTypesEnum& Enum);
	struct FBuildingTypesRowHandle MakeBuildingTypes(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FBuildingTypesEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetBuildingTypesStruct(const struct FBuildingTypesRowHandle& RowHandle, struct FIcarusBuildingType* BuildingTypes, enum class EValid* Paths);
	bool EqualEqual_FBuildingTypesRowHandleFBuildingTypesRowHandle(const struct FBuildingTypesRowHandle& RowHandleA, const struct FBuildingTypesRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FBuildingTypesEnum& A, const struct FBuildingTypesEnum& B);
	struct FBuildingTypesRowHandle CastToBuildingTypesRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakBuildingTypesEnum(const struct FBuildingTypesEnum& Enum, class FName* Name, int32* Index);
	void AddRowToBuildingTypesTable(class FName Name, const struct FIcarusBuildingType& Data, struct FBuildingTypesRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.BuildingTypesTable
class UBuildingTypesTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UBuildingTypesTable* GetDefaultObj();

};

// 0x18 (0xE8 - 0xD0)
// Class Icarus.FloatableComponent
class UFloatableComponent : public UTraitComponent
{
public:
	TArray<class UPrimitiveComponent*>           OverlappedComponents;                              // 0xD0(0x10)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnFloatableUpdated;                                // 0xE0(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_7166[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UFloatableComponent* GetDefaultObj();

	void UpdateOverlappedState();
	void RemoveOverlap(class UPrimitiveComponent* Component);
	TArray<struct FWaterSetupRowHandle> GetWaterSetupsFromOverlaps();
	bool GetFloatableData(struct FFloatableData* OutData);
	void FloatableUpdated(bool bNewFloating);
	void CheckOverlapArray();
	void AddOverlap(class UPrimitiveComponent* Component);
};

// 0x30 (0x118 - 0xE8)
// Class Icarus.BuoyancyBehaviour
class UBuoyancyBehaviour : public UFloatableComponent
{
public:
	struct FVector                               VelocityDamper;                                    // 0xE8(0xC)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBuoyancyEnabled;                                  // 0xF4(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAutoGenerateFloatingPoints;                       // 0xF5(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7169[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        FloatingPointRadius;                               // 0xF8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_716A[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVector>                       FloatingPoints;                                    // 0x100(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_716C[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBuoyancyBehaviour* GetDefaultObj();

	void GenerateFloatingPoints();
	float FindWaterHeight();
};

// 0x0 (0x28 - 0x28)
// Class Icarus.BW3ObjectiveRecorderInterface
class IBW3ObjectiveRecorderInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class IBW3ObjectiveRecorderInterface* GetDefaultObj();

	void SetObjectiveState(int32 State);
	void GetObjectiveState(int32* State);
};

// 0x8 (0xE0 - 0xD8)
// Class Icarus.BW3ObjectiveRecorderComponent
class UBW3ObjectiveRecorderComponent : public UIcarusStateRecorderComponent
{
public:
	int32                                        SavedState;                                        // 0xD8(0x4)(ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_716D[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBW3ObjectiveRecorderComponent* GetDefaultObj();

};

// 0x8 (0xB8 - 0xB0)
// Class Icarus.CargoLandingPadComponent
class UCargoLandingPadComponent : public UActorComponent
{
public:
	int32                                        LeftSlotUID;                                       // 0xB0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        RightSlotUID;                                      // 0xB4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UCargoLandingPadComponent* GetDefaultObj();

	bool HasAvailableSlot();
	bool HasAssignedSlot();
	int32 GetRightSlotUID();
	int32 GetLeftSlotUID();
	int32 ClearSlot(class AIcarusActor* Object);
	int32 AssignAvailableSlot(class AIcarusActor* Object);
};

// 0x8 (0x260 - 0x258)
// Class Icarus.CargoLandingPadRecorderComponent
class UCargoLandingPadRecorderComponent : public UDeployableRecorderComponent
{
public:
	struct FCargoLandingPadRecord                LandingPadRecord;                                  // 0x258(0x8)(SaveGame, NoDestructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UCargoLandingPadRecorderComponent* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.CargoLandingPadSnapInterface
class ICargoLandingPadSnapInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class ICargoLandingPadSnapInterface* GetDefaultObj();

	struct FVector GetSnapPoint(int32 Index);
};

// 0x10 (0x40 - 0x30)
// Class Icarus.CargoLandingPadSubsystem
class UCargoLandingPadSubsystem : public UWorldSubsystem
{
public:
	uint8                                        Pad_7179[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCargoLandingPadSubsystem* GetDefaultObj();

	void UnRegisterLandingPad(class AIcarusActor* LandingPad);
	void TransportPodDeparted(class AIcarusActor* CargoPod);
	void RegisterLandingPad(class AIcarusActor* LandingPad);
	bool FindNearbyLandingPad(class AIcarusActor* CargoPod, class AActor* Querier, float MaxDistance, bool bIsPlayer, struct FVector& LocationOut);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.CaveInterface
class ICaveInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class ICaveInterface* GetDefaultObj();

	float GetSpelunkingDepthFromLocation(const struct FVector& Location);
	float GetCurrentSpelunkingDepth();
};

// 0x0 (0x220 - 0x220)
// Class Icarus.Cave
class ACave : public AActor
{
public:

	static class UClass* StaticClass();
	static class ACave* GetDefaultObj();

};

// 0x18 (0x1C0 - 0x1A8)
// Class Icarus.CaveAIRecorderComponent
class UCaveAIRecorderComponent : public UActorStateRecorderComponent
{
public:
	TArray<struct FCaveActorSpawnTimeStamp>      SaveData;                                          // 0x1A8(0x10)(ZeroConstructor, SaveGame, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_717B[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCaveAIRecorderComponent* GetDefaultObj();

};

// 0x0 (0x2C0 - 0x2C0)
// Class Icarus.CaveEntranceBase
class ACaveEntranceBase : public AIcarusActor
{
public:

	static class UClass* StaticClass();
	static class ACaveEntranceBase* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.CaveEntranceRecorderInterface
class ICaveEntranceRecorderInterface : public IInterface
{
public:

	static class UClass* StaticClass();
	static class ICaveEntranceRecorderInterface* GetDefaultObj();

	void SetVoxelBlockerSaveData(TArray<struct FVoxelMinedSphere>& VoxelBlockerSaveData);
	class AVoxelResource* GetVoxelActor();
};

// 0x38 (0x1E0 - 0x1A8)
// Class Icarus.CaveEntranceRecorderComponent
class UCaveEntranceRecorderComponent : public UActorStateRecorderComponent
{
public:
	struct FVoxelSaveData                        VoxelBlockerSaveData;                              // 0x1A8(0x38)(SaveGame, Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UCaveEntranceRecorderComponent* GetDefaultObj();

};

// 0x110 (0x140 - 0x30)
// Class Icarus.CavePrefabAsset
class UCavePrefabAsset : public UActorPrefabAsset
{
public:
	TArray<struct FPrefabStaticMesh>             StaticMeshes;                                      // 0x30(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPrefabActorClass>             Voids;                                             // 0x40(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPrefabTransform>              Volumes;                                           // 0x50(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPrefabTransform>              Entrances;                                         // 0x60(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPrefabLake>                   Lakes;                                             // 0x70(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPrefabWaterfall>              Waterfalls;                                        // 0x80(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPrefabLavaFlowPoint>          LavaFlowPoints;                                    // 0x90(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPrefabFoliage>                Foliage;                                           // 0xA0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPrefabCaveLight>              CaveLights;                                        // 0xB0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPrefabActorClass>             EntranceActors;                                    // 0xC0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPrefabTransform>              ExoticVoxels;                                      // 0xD0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FPrefabTransform>              DeepMiningOreDeposit;                              // 0xE0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TMap<TSubclassOf<class AActor>, struct FCaveSpawnConfig> CaveActorSpawnMap;                                 // 0xF0(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCavePrefabAsset* GetDefaultObj();

};

// 0x18 (0x238 - 0x220)
// Class Icarus.CavePrefab
class ACavePrefab : public AActorPrefab
{
public:
	class UCavePrefabAsset*                      PrefabAsset;                                       // 0x220(0x8)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDebug;                                            // 0x228(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseEntrance;                                      // 0x229(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        CombinedCaveIncludeFlags;                          // 0x22A(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCaveInstanceResolved;                             // 0x22B(0x1)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_717F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UObject*                               CaveGroup;                                         // 0x230(0x8)(Edit, BlueprintVisible, ZeroConstructor, Transient, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class ACavePrefab* GetDefaultObj();

	bool HasResolved();
};

// 0x0 (0x28 - 0x28)
// Class Icarus.ChallengesLibrary
class UChallengesLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UChallengesLibrary* GetDefaultObj();

	struct FChallengesRowHandle StructToRowHandle(const struct FChallengesEnum& EnumValue);
	class FName StructToName(const struct FChallengesEnum& EnumValue);
	int32 StructToInt(const struct FChallengesEnum& EnumValue);
	struct FChallengesEnum RowHandleToStruct(const struct FChallengesRowHandle& RowHandle);
	void RemoveRowFromChallengesTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FChallengesEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FChallengesEnum& A, const struct FChallengesEnum& B);
	struct FChallengesEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FChallengesRowHandle MakeLiteralChallenges(const struct FChallengesRowHandle& RowHandle);
	struct FChallengesRowHandle MakeChallengesFromIndex(int32 Index);
	struct FChallengesEnum MakeChallengesEnum(const struct FChallengesEnum& Enum);
	struct FChallengesRowHandle MakeChallenges(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FChallengesEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetChallengesStruct(const struct FChallengesRowHandle& RowHandle, struct FChallenge* Challenges, enum class EValid* Paths);
	bool EqualEqual_FChallengesRowHandleFChallengesRowHandle(const struct FChallengesRowHandle& RowHandleA, const struct FChallengesRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FChallengesEnum& A, const struct FChallengesEnum& B);
	struct FChallengesRowHandle CastToChallengesRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakChallengesEnum(const struct FChallengesEnum& Enum, class FName* Name, int32* Index);
	void AddRowToChallengesTable(class FName Name, const struct FChallenge& Data, struct FChallengesRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.ChallengesTable
class UChallengesTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UChallengesTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.CharacterCreationDataLibrary
class UCharacterCreationDataLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UCharacterCreationDataLibrary* GetDefaultObj();

	struct FCharacterCreationDataRowHandle StructToRowHandle(const struct FCharacterCreationDataEnum& EnumValue);
	class FName StructToName(const struct FCharacterCreationDataEnum& EnumValue);
	int32 StructToInt(const struct FCharacterCreationDataEnum& EnumValue);
	struct FCharacterCreationDataEnum RowHandleToStruct(const struct FCharacterCreationDataRowHandle& RowHandle);
	void RemoveRowFromCharacterCreationDataTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FCharacterCreationDataEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FCharacterCreationDataEnum& A, const struct FCharacterCreationDataEnum& B);
	struct FCharacterCreationDataEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FCharacterCreationDataRowHandle MakeLiteralCharacterCreationData(const struct FCharacterCreationDataRowHandle& RowHandle);
	struct FCharacterCreationDataRowHandle MakeCharacterCreationDataFromIndex(int32 Index);
	struct FCharacterCreationDataEnum MakeCharacterCreationDataEnum(const struct FCharacterCreationDataEnum& Enum);
	struct FCharacterCreationDataRowHandle MakeCharacterCreationData(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FCharacterCreationDataEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetCharacterCreationDataStruct(const struct FCharacterCreationDataRowHandle& RowHandle, struct FCharacterCreationData* CharacterCreationData, enum class EValid* Paths);
	bool EqualEqual_FCharacterCreationDataRowHandleFCharacterCreationDataRowHandle(const struct FCharacterCreationDataRowHandle& RowHandleA, const struct FCharacterCreationDataRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FCharacterCreationDataEnum& A, const struct FCharacterCreationDataEnum& B);
	struct FCharacterCreationDataRowHandle CastToCharacterCreationDataRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakCharacterCreationDataEnum(const struct FCharacterCreationDataEnum& Enum, class FName* Name, int32* Index);
	void AddRowToCharacterCreationDataTable(class FName Name, const struct FCharacterCreationData& Data, struct FCharacterCreationDataRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.CharacterCreationDataTable
class UCharacterCreationDataTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UCharacterCreationDataTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.CharacterFlagsLibrary
class UCharacterFlagsLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UCharacterFlagsLibrary* GetDefaultObj();

	struct FCharacterFlagsRowHandle StructToRowHandle(const struct FCharacterFlagsEnum& EnumValue);
	class FName StructToName(const struct FCharacterFlagsEnum& EnumValue);
	int32 StructToInt(const struct FCharacterFlagsEnum& EnumValue);
	struct FCharacterFlagsEnum RowHandleToStruct(const struct FCharacterFlagsRowHandle& RowHandle);
	void RemoveRowFromCharacterFlagsTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FCharacterFlagsEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FCharacterFlagsEnum& A, const struct FCharacterFlagsEnum& B);
	struct FCharacterFlagsEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FCharacterFlagsRowHandle MakeLiteralCharacterFlags(const struct FCharacterFlagsRowHandle& RowHandle);
	struct FCharacterFlagsRowHandle MakeCharacterFlagsFromIndex(int32 Index);
	struct FCharacterFlagsEnum MakeCharacterFlagsEnum(const struct FCharacterFlagsEnum& Enum);
	struct FCharacterFlagsRowHandle MakeCharacterFlags(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FCharacterFlagsEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetCharacterFlagsStruct(const struct FCharacterFlagsRowHandle& RowHandle, struct FCharacterFlag* CharacterFlags, enum class EValid* Paths);
	bool EqualEqual_FCharacterFlagsRowHandleFCharacterFlagsRowHandle(const struct FCharacterFlagsRowHandle& RowHandleA, const struct FCharacterFlagsRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FCharacterFlagsEnum& A, const struct FCharacterFlagsEnum& B);
	struct FCharacterFlagsRowHandle CastToCharacterFlagsRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakCharacterFlagsEnum(const struct FCharacterFlagsEnum& Enum, class FName* Name, int32* Index);
	void AddRowToCharacterFlagsTable(class FName Name, const struct FCharacterFlag& Data, struct FCharacterFlagsRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.CharacterFlagsTable
class UCharacterFlagsTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UCharacterFlagsTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.CharacterGrowthLibrary
class UCharacterGrowthLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UCharacterGrowthLibrary* GetDefaultObj();

	struct FCharacterGrowthRowHandle StructToRowHandle(const struct FCharacterGrowthEnum& EnumValue);
	class FName StructToName(const struct FCharacterGrowthEnum& EnumValue);
	int32 StructToInt(const struct FCharacterGrowthEnum& EnumValue);
	struct FCharacterGrowthEnum RowHandleToStruct(const struct FCharacterGrowthRowHandle& RowHandle);
	void RemoveRowFromCharacterGrowthTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FCharacterGrowthEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FCharacterGrowthEnum& A, const struct FCharacterGrowthEnum& B);
	struct FCharacterGrowthEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FCharacterGrowthRowHandle MakeLiteralCharacterGrowth(const struct FCharacterGrowthRowHandle& RowHandle);
	struct FCharacterGrowthRowHandle MakeCharacterGrowthFromIndex(int32 Index);
	struct FCharacterGrowthEnum MakeCharacterGrowthEnum(const struct FCharacterGrowthEnum& Enum);
	struct FCharacterGrowthRowHandle MakeCharacterGrowth(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FCharacterGrowthEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetCharacterGrowthStruct(const struct FCharacterGrowthRowHandle& RowHandle, struct FCharacterGrowth* CharacterGrowth, enum class EValid* Paths);
	bool EqualEqual_FCharacterGrowthRowHandleFCharacterGrowthRowHandle(const struct FCharacterGrowthRowHandle& RowHandleA, const struct FCharacterGrowthRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FCharacterGrowthEnum& A, const struct FCharacterGrowthEnum& B);
	struct FCharacterGrowthRowHandle CastToCharacterGrowthRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakCharacterGrowthEnum(const struct FCharacterGrowthEnum& Enum, class FName* Name, int32* Index);
	void AddRowToCharacterGrowthTable(class FName Name, const struct FCharacterGrowth& Data, struct FCharacterGrowthRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.CharacterGrowthTable
class UCharacterGrowthTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UCharacterGrowthTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.CharacterPerksLibrary
class UCharacterPerksLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UCharacterPerksLibrary* GetDefaultObj();

	struct FCharacterPerksRowHandle StructToRowHandle(const struct FCharacterPerksEnum& EnumValue);
	class FName StructToName(const struct FCharacterPerksEnum& EnumValue);
	int32 StructToInt(const struct FCharacterPerksEnum& EnumValue);
	struct FCharacterPerksEnum RowHandleToStruct(const struct FCharacterPerksRowHandle& RowHandle);
	void RemoveRowFromCharacterPerksTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FCharacterPerksEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FCharacterPerksEnum& A, const struct FCharacterPerksEnum& B);
	struct FCharacterPerksEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FCharacterPerksRowHandle MakeLiteralCharacterPerks(const struct FCharacterPerksRowHandle& RowHandle);
	struct FCharacterPerksRowHandle MakeCharacterPerksFromIndex(int32 Index);
	struct FCharacterPerksEnum MakeCharacterPerksEnum(const struct FCharacterPerksEnum& Enum);
	struct FCharacterPerksRowHandle MakeCharacterPerks(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FCharacterPerksEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetCharacterPerksStruct(const struct FCharacterPerksRowHandle& RowHandle, struct FCharacterPerk* CharacterPerks, enum class EValid* Paths);
	bool EqualEqual_FCharacterPerksRowHandleFCharacterPerksRowHandle(const struct FCharacterPerksRowHandle& RowHandleA, const struct FCharacterPerksRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FCharacterPerksEnum& A, const struct FCharacterPerksEnum& B);
	struct FCharacterPerksRowHandle CastToCharacterPerksRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakCharacterPerksEnum(const struct FCharacterPerksEnum& Enum, class FName* Name, int32* Index);
	void AddRowToCharacterPerksTable(class FName Name, const struct FCharacterPerk& Data, struct FCharacterPerksRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.CharacterPerksTable
class UCharacterPerksTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UCharacterPerksTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.CharacterStartingStatsLibrary
class UCharacterStartingStatsLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UCharacterStartingStatsLibrary* GetDefaultObj();

	struct FCharacterStartingStatsRowHandle StructToRowHandle(const struct FCharacterStartingStatsEnum& EnumValue);
	class FName StructToName(const struct FCharacterStartingStatsEnum& EnumValue);
	int32 StructToInt(const struct FCharacterStartingStatsEnum& EnumValue);
	struct FCharacterStartingStatsEnum RowHandleToStruct(const struct FCharacterStartingStatsRowHandle& RowHandle);
	void RemoveRowFromCharacterStartingStatsTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FCharacterStartingStatsEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FCharacterStartingStatsEnum& A, const struct FCharacterStartingStatsEnum& B);
	struct FCharacterStartingStatsEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FCharacterStartingStatsRowHandle MakeLiteralCharacterStartingStats(const struct FCharacterStartingStatsRowHandle& RowHandle);
	struct FCharacterStartingStatsRowHandle MakeCharacterStartingStatsFromIndex(int32 Index);
	struct FCharacterStartingStatsEnum MakeCharacterStartingStatsEnum(const struct FCharacterStartingStatsEnum& Enum);
	struct FCharacterStartingStatsRowHandle MakeCharacterStartingStats(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FCharacterStartingStatsEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetCharacterStartingStatsStruct(const struct FCharacterStartingStatsRowHandle& RowHandle, struct FPlayerStartingStats* CharacterStartingStats, enum class EValid* Paths);
	bool EqualEqual_FCharacterStartingStatsRowHandleFCharacterStartingStatsRowHandle(const struct FCharacterStartingStatsRowHandle& RowHandleA, const struct FCharacterStartingStatsRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FCharacterStartingStatsEnum& A, const struct FCharacterStartingStatsEnum& B);
	struct FCharacterStartingStatsRowHandle CastToCharacterStartingStatsRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakCharacterStartingStatsEnum(const struct FCharacterStartingStatsEnum& Enum, class FName* Name, int32* Index);
	void AddRowToCharacterStartingStatsTable(class FName Name, const struct FPlayerStartingStats& Data, struct FCharacterStartingStatsRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.CharacterStartingStatsTable
class UCharacterStartingStatsTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UCharacterStartingStatsTable* GetDefaultObj();

};

// 0xB0 (0x310 - 0x260)
// Class Icarus.CharacterState
class UCharacterState : public UActorState
{
public:
	FMulticastSparseDelegateProperty_            OnStaminaUpdated;                                  // 0x260(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnStaminaDepleted;                                 // 0x261(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnStaminaDepletedDuringAction;                     // 0x262(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnExperienceEvent;                                 // 0x263(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnExperienceUpdated;                               // 0x264(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	FMulticastSparseDelegateProperty_            OnLevelUpdated;                                    // 0x265(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_7225[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Stamina;                                           // 0x268(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxStamina;                                        // 0x26C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        TotalExperience;                                   // 0x270(0x4)(Edit, BlueprintVisible, Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FCharacterGrowthRowHandle             GrowthRowHandle;                                   // 0x274(0x18)(Edit, BlueprintVisible, Net, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        Level;                                             // 0x28C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, Net, ZeroConstructor, EditConst, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TMap<int32, struct FStaminaActionCostsRowHandle> StaminaTickEvents;                                 // 0x290(0x50)(NativeAccessSpecifierPrivate)
	uint8                                        Pad_7226[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	bool                                         bHasStaminaRegen;                                  // 0x300(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_7227[0xF];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCharacterState* GetDefaultObj();

	void TickStaminaEvents();
	void StopStaminaAction(const struct FStaminaActionCostsRowHandle& Action, int32 UID);
	int32 StartStaminaAction(const struct FStaminaActionCostsRowHandle& Action, bool SkipTickCost);
	bool SetupAI(int32 Level, int32 New_Health, int32 New_Stamina, int32 New_Strength, int32 New_Agility, int32 New_Perception);
	void SetStamina(int32 Amount);
	void SetExperience(int32 Amount);
	void RecalculateStaminaRegenRate();
	void RecalculateCurrentStamina();
	void OnRep_TotalExperience();
	void OnRep_Stamina();
	void OnRep_Level();
	int32 GetStamina();
	int32 GetMaxStamina();
	int32 GetLevel();
	int32 GetExperienceRequired(int32 Level);
	int32 GetExperience();
	void ClientAddedExperienceEvent(struct FExperienceEventsRowHandle& ExperienceEvent, int32 ExperienceGained);
	bool CanRegenerateStamina();
	bool CanPerformStaminaActionRow(struct FStaminaActionCostsRowHandle& StaminaAction);
	bool CanPerformStaminaAction(struct FStaminaCost& ActionCost);
	void CancelStaminaAction(int32 UID);
	void BiomeTick(float DeltaTime);
	void AddStamina(int32 Amount);
	bool AddExperienceEvent(struct FExperienceEventsRowHandle& ExperienceEvent, int32 GrantedExperience);
	void AddExperience(int32 Amount);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.CharacterTimelineLibrary
class UCharacterTimelineLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UCharacterTimelineLibrary* GetDefaultObj();

	struct FCharacterTimelineRowHandle StructToRowHandle(const struct FCharacterTimelineEnum& EnumValue);
	class FName StructToName(const struct FCharacterTimelineEnum& EnumValue);
	int32 StructToInt(const struct FCharacterTimelineEnum& EnumValue);
	struct FCharacterTimelineEnum RowHandleToStruct(const struct FCharacterTimelineRowHandle& RowHandle);
	void RemoveRowFromCharacterTimelineTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FCharacterTimelineEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FCharacterTimelineEnum& A, const struct FCharacterTimelineEnum& B);
	struct FCharacterTimelineEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FCharacterTimelineRowHandle MakeLiteralCharacterTimeline(const struct FCharacterTimelineRowHandle& RowHandle);
	struct FCharacterTimelineRowHandle MakeCharacterTimelineFromIndex(int32 Index);
	struct FCharacterTimelineEnum MakeCharacterTimelineEnum(const struct FCharacterTimelineEnum& Enum);
	struct FCharacterTimelineRowHandle MakeCharacterTimeline(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FCharacterTimelineEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetCharacterTimelineStruct(const struct FCharacterTimelineRowHandle& RowHandle, struct FCharacterTimeline* CharacterTimeline, enum class EValid* Paths);
	bool EqualEqual_FCharacterTimelineRowHandleFCharacterTimelineRowHandle(const struct FCharacterTimelineRowHandle& RowHandleA, const struct FCharacterTimelineRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FCharacterTimelineEnum& A, const struct FCharacterTimelineEnum& B);
	struct FCharacterTimelineRowHandle CastToCharacterTimelineRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakCharacterTimelineEnum(const struct FCharacterTimelineEnum& Enum, class FName* Name, int32* Index);
	void AddRowToCharacterTimelineTable(class FName Name, const struct FCharacterTimeline& Data, struct FCharacterTimelineRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.CharacterTimelineTable
class UCharacterTimelineTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UCharacterTimelineTable* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Icarus.CharacterVoicesLibrary
class UCharacterVoicesLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UCharacterVoicesLibrary* GetDefaultObj();

	struct FCharacterVoicesRowHandle StructToRowHandle(const struct FCharacterVoicesEnum& EnumValue);
	class FName StructToName(const struct FCharacterVoicesEnum& EnumValue);
	int32 StructToInt(const struct FCharacterVoicesEnum& EnumValue);
	struct FCharacterVoicesEnum RowHandleToStruct(const struct FCharacterVoicesRowHandle& RowHandle);
	void RemoveRowFromCharacterVoicesTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FCharacterVoicesEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FCharacterVoicesEnum& A, const struct FCharacterVoicesEnum& B);
	struct FCharacterVoicesEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FCharacterVoicesRowHandle MakeLiteralCharacterVoices(const struct FCharacterVoicesRowHandle& RowHandle);
	struct FCharacterVoicesRowHandle MakeCharacterVoicesFromIndex(int32 Index);
	struct FCharacterVoicesEnum MakeCharacterVoicesEnum(const struct FCharacterVoicesEnum& Enum);
	struct FCharacterVoicesRowHandle MakeCharacterVoices(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FCharacterVoicesEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetCharacterVoicesStruct(const struct FCharacterVoicesRowHandle& RowHandle, struct FCharacterVoiceData* CharacterVoices, enum class EValid* Paths);
	bool EqualEqual_FCharacterVoicesRowHandleFCharacterVoicesRowHandle(const struct FCharacterVoicesRowHandle& RowHandleA, const struct FCharacterVoicesRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FCharacterVoicesEnum& A, const struct FCharacterVoicesEnum& B);
	struct FCharacterVoicesRowHandle CastToCharacterVoicesRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakCharacterVoicesEnum(const struct FCharacterVoicesEnum& Enum, class FName* Name, int32* Index);
	void AddRowToCharacterVoicesTable(class FName Name, const struct FCharacterVoiceData& Data, struct FCharacterVoicesRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.CharacterVoicesTable
class UCharacterVoicesTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UCharacterVoicesTable* GetDefaultObj();

};

// 0x8 (0x228 - 0x220)
// Class Icarus.CheatController
class ACheatController : public AActor
{
public:
	struct FPerPlayerCheatData                   PerPlayerCheats;                                   // 0x220(0x4)(Net, NoDestructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_7265[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class ACheatController* GetDefaultObj();

	void SetVerboseDamageLoggingEnabled(bool bEnabled);
	void SetUnlockAllRecipes(bool bEnabled);
	void SetUnlimitedResourcesEnabled(bool bEnabled);
	void SetShelteredRequiredDisabled(bool bDisabled);
	void SetGodModeEnabled(bool bEnabled);
	void SetBuildingIntegrityDisabled(bool bDisabled);
	bool IsVerboseDamageLoggingEnabled(class AActor* Actor);
	bool IsUnlockAllRecipesEnabled(class AActor* Actor);
	bool IsUnlimitedResourcesEnabled(class AActor* Actor);
	bool IsShelteredRequiredDisabled(class UObject* WorldContextObject);
	bool IsGodModeEnabled(class AActor* Actor);
	bool IsBuildingIntegrityDisabled(class UObject* WorldContextObject);
};

// 0x48 (0x2A8 - 0x260)
// Class Icarus.CheatFunctionBase
class UCheatFunctionBase : public UUserWidget
{
public:
	class FString                                Name;                                              // 0x260(0x10)(BlueprintVisible, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FText                                  Description;                                       // 0x270(0x18)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FLinearColor                          TitleColour;                                       // 0x288(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FLinearColor                          AreaColor;                                         // 0x298(0x10)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UCheatFunctionBase* GetDefaultObj();

	void UpdatePreview(TArray<class FString>& Args);
	class FString GetName();
	bool ForceNoBorder();
	void Execute();
};

// 0xF0 (0x350 - 0x260)
// Class Icarus.CheatOverlayBase
class UCheatOverlayBase : public UUserWidget
{
public:
	uint8                                        Pad_7279[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnScriptQueueFinished;                             // 0x270(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_727A[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnCheatScriptFinished;                             // 0x298(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	TArray<class UCheatFunctionBase*>            CheatFunctionWidgets;                              // 0x2A8(0x10)(BlueprintVisible, ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_727B[0x98];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCheatOverlayBase* GetDefaultObj();

	void StopWaiting();
	void StartWaiting();
	void SetShow(bool bInShow);
	void SetFilteredWidgets(TArray<class UCheatFunctionBase*>& Widgets);
	bool SetCheatVariable(const class FString& Variable, const class FString& Value);
	void SetCheatFunctionList(TArray<class UClass*>& List);
	void RequestReloadCheats();
	void PreviewCommand(const class FString& CommandText);
	class FString ParseCheatLineArguments(const class FString& Line, TArray<class FString>& Args);
	void OnWaitingChanged(bool bNewWaiting);
	void OnShowChanged(bool bNewShow);
	void OnBeginPlay();
	bool IsWaiting();
	bool IsShowing();
	bool IsCheatScriptExecuting();
	void EvaluateLines(TArray<class FString>& ScriptLines);
	void Evaluate(const class FString& Script);
	void Close();
	void ClearFilteredWidgets();
	void AddCustomFunction(const class FString& Name, TArray<class FString>& ScriptLines, const class FString& Description);
	void AddCustomAutomationFunction(const class FString& Name, TArray<class FString>& ScriptLines, const class FString& Description);
	void AddCheat(class UCheatFunctionBase* Widget);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.CheatOverlayFunctionLibrary
class UCheatOverlayFunctionLibrary : public UBlueprintFunctionLibrary
{
public:

	static class UClass* StaticClass();
	static class UCheatOverlayFunctionLibrary* GetDefaultObj();

	class UCheatOverlayBase* GetCheatOverlay(class UObject* WorldContextObject);
};

// 0xD00 (0xE08 - 0x108)
// Class Icarus.ComboBoxText
class UComboBoxText : public UWidget
{
public:
	TArray<class FText>                          DefaultOptions;                                    // 0x108(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)
	class FText                                  SelectedOption;                                    // 0x118(0x18)(Edit, NativeAccessSpecifierPrivate)
	struct FComboBoxStyle                        WidgetStyle;                                       // 0x130(0x3F0)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FTableRowStyle                        ItemStyle;                                         // 0x520(0x7C8)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FMargin                               ContentPadding;                                    // 0xCE8(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                        MaxListHeight;                                     // 0xCF8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         HasDownArrow;                                      // 0xCFC(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         EnableGamepadNavigationMode;                       // 0xCFD(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, AdvancedDisplay, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_728E[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateFontInfo                        Font;                                              // 0xD00(0x58)(Edit, BlueprintVisible, BlueprintReadOnly, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FSlateColor                           ForegroundColor;                                   // 0xD58(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                         bIsFocusable;                                      // 0xD80(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_728F[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FDelegateProperty_                           OnGenerateWidgetEvent;                             // 0xD84(0x10)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_7290[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnSelectionChanged;                                // 0xD98(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnOpening;                                         // 0xDA8(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	uint8                                        Pad_7291[0x50];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UComboBoxText* GetDefaultObj();

	void SetSelectedOption(class FText Option);
	void SetSelectedIndex(int32 Index);
	bool RemoveOption(class FText& Option);
	void RefreshOptions();
	void OnSelectionChangedEvent__DelegateSignature(class FText SelectedItem, enum class ESelectInfo SelectionType);
	void OnOpeningEvent__DelegateSignature();
	bool IsOpen();
	class FText GetSelectedOption();
	int32 GetSelectedIndex();
	int32 GetOptionCount();
	class FText GetOptionAtIndex(int32 Index);
	int32 FindOptionIndex(class FText& Option);
	void ClearSelection();
	void ClearOptions();
	void AddOption(class FText& Option);
};

// 0x8 (0xD8 - 0xD0)
// Class Icarus.CombustibleComponent
class UCombustibleComponent : public UTraitComponent
{
public:
	int32                                        MillijoulesRemaining;                              // 0xD0(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7293[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UCombustibleComponent* GetDefaultObj();

	bool GetCombustibleData(struct FCombustibleData* OutData);
};

// 0x0 (0x28 - 0x28)
// Class Icarus.CombustibleLibrary
class UCombustibleLibrary : public URowLibrary
{
public:

	static class UClass* StaticClass();
	static class UCombustibleLibrary* GetDefaultObj();

	struct FCombustibleRowHandle StructToRowHandle(const struct FCombustibleEnum& EnumValue);
	class FName StructToName(const struct FCombustibleEnum& EnumValue);
	int32 StructToInt(const struct FCombustibleEnum& EnumValue);
	struct FCombustibleEnum RowHandleToStruct(const struct FCombustibleRowHandle& RowHandle);
	void RemoveRowFromCombustibleTable(class FName Name);
	void RefreshConstants();
	int32 NumRows();
	bool NotEqual_EnumName(const struct FCombustibleEnum& A, class FName B);
	bool NotEqual_EnumEnum(const struct FCombustibleEnum& A, const struct FCombustibleEnum& B);
	struct FCombustibleEnum NameToStruct(class FName NameValue);
	int32 NameToInt(class FName NameValue);
	struct FCombustibleRowHandle MakeLiteralCombustible(const struct FCombustibleRowHandle& RowHandle);
	struct FCombustibleRowHandle MakeCombustibleFromIndex(int32 Index);
	struct FCombustibleEnum MakeCombustibleEnum(const struct FCombustibleEnum& Enum);
	struct FCombustibleRowHandle MakeCombustible(class FName RowName);
	bool IsValidName(class FName NameValue);
	struct FCombustibleEnum IntToStruct(int32 IntValue);
	class FName IntToName(int32 IntValue);
	void GetCombustibleStruct(const struct FCombustibleRowHandle& RowHandle, struct FCombustibleData* Combustible, enum class EValid* Paths);
	bool EqualEqual_FCombustibleRowHandleFCombustibleRowHandle(const struct FCombustibleRowHandle& RowHandleA, const struct FCombustibleRowHandle& RowHandleB);
	bool EqualEqual_EnumEnum(const struct FCombustibleEnum& A, const struct FCombustibleEnum& B);
	struct FCombustibleRowHandle CastToCombustibleRowHandle(const struct FRowHandle& RowHandle, enum class EValid* Paths);
	void BreakCombustibleEnum(const struct FCombustibleEnum& Enum, class FName* Name, int32* Index);
	void AddRowToCombustibleTable(class FName Name, const struct FCombustibleData& Data, struct FCombustibleRowHandle* NewRow, bool bOverrideExistingRow);
};

// 0x0 (0xB8 - 0xB8)
// Class Icarus.CombustibleTable
class UCombustibleTable : public UIcarusDataTable
{
public:

	static class UClass* StaticClass();
	static class UCombustibleTable* GetDefaultObj();

};

// 0xA0 (0x580 - 0x4E0)
// Class Icarus.ConcaveHullMesh
class UConcaveHullMesh : public UProceduralMeshComponent
{
public:
	FMulticastSparseDelegateProperty_            OnMeshGenerated;                                   // 0x4E0(0x1)(InstancedReference, BlueprintAssignable, NoDestructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_72AD[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Concavity;                                         // 0x4E4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LengthThreshold;                                   // 0x4E8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bProjectToLandscape;                               // 0x4EC(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_72AE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FVector2D>                     ConcaveHullPoints;                                 // 0x4F0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FVector>                       ConcaveHullVertices;                               // 0x500(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_72B0[0x70];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UConcaveHullMesh* GetDefaultObj();

	bool IsRunningAsyncGenerate();
	void GenerateConcaveHull(TArray<struct FVector>& Points, bool bIsWorldSpace, bool bCreateConvexCollision, bool bIsAsync);
	void DebugGeneratedHullPoints(float ZOffset);
};

// 0x20 (0x280 - 0x260)
// Class Icarus.ConfirmationPopupBase
class UConfirmationPopupBase : public UUserWidget
{
public:
	FDelegateProperty_                           OnOptionAClicked;                                  // 0x260(0x10)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)
	FDelegateProperty_                           OnOptionBClicked;                                  // 0x270(0x10)(Edit, ZeroConstructor, InstancedReference, NoDestructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UConfirmationPopupBase* GetDefaultObj();

	void ShowConfirmationPopup(struct FConfirmationPopupDetails& ConfirmationPopupDetails, FDelegateProperty_ OnOptionA, FDelegateProperty_ OnOptionB);
	void SetPromptDetails(struct FConfirmationPopupDetails& ConfirmationPopupDetails);
	void OptionBClicked();
	void OptionAClicked();
	void HideConfirmationPopup();
};

// 0x50 (0x78 - 0x28)
// Class Icarus.ReplicatedConnectedPlayer
class UReplicatedConnectedPlayer : public UObject
{
public:
	struct FConnectedPlayer                      State;                                             // 0x28(0x38)(Edit, Net, EditConst, NativeAccessSpecifierPublic)
	bool                                         bLocallyInitialised;                               // 0x60(0x1)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_72B1[0x17];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
