#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xB9 (0x319 - 0x260)
// WidgetBlueprintGeneratedClass UMG_Crafting.UMG_Crafting_C
class UUMG_Crafting_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x260(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UUMG_BasicButton_2_C*                  ClearQueueButton;                                  // 0x268(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               CraftAmountBorder;                                 // 0x270(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_BasicButton_2_C*                  CraftButton;                                       // 0x278(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableText*                         CraftingAmount;                                    // 0x280(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        KeyPrompts;                                        // 0x288(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ButtonIcon_C*                     LeftButton;                                        // 0x290(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_BasicButton_2_C*                  MaxButton;                                         // 0x298(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            RecipeName;                                        // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UGridPanel*                            RequiredElementGrid;                               // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ButtonIcon_C*                     RightButton_1;                                     // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_BasicButton_2_C*                  StopButton;                                        // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_CraftingPreview_C*                UMG_CraftingPreview;                               // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_EncumbranceBarLight_C*            UMG_EncumbranceBarLight;                           // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Inventory_C*                      UMG_Inventory;                                     // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_InventoryDropZone_C*              UMG_InventoryDropZone;                             // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_Queue_C*                          UMG_Queue;                                         // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_RecipeList_C*                     UMG_RecipeList;                                    // 0x2E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FProcessorRecipesRowHandle            Recipe;                                            // 0x2F0(0x18)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	class UProcessingComponent*                  ProcessingComponent;                               // 0x308(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         UpdateTrigger;                                     // 0x310(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         QueueFull;                                         // 0x311(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4E54[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Multiplier;                                        // 0x314(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         FullUpdateRequested;                               // 0x318(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class UUMG_Crafting_C* GetDefaultObj();

	void CanQueueItem(const struct FProcessorRecipesRowHandle& ProcessorRecipe, bool* Craftable, const struct FProcessorRecipe& CallFunc_GetProcessorRecipesStruct_ProcessorRecipes, enum class EValid CallFunc_GetProcessorRecipesStruct_Paths, enum class EValid CallFunc_GetIcarusPlayerCharacter_IsValid, class AIcarusPlayerCharacter* CallFunc_GetIcarusPlayerCharacter_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, const struct FProcessingItem& K2Node_MakeStruct_ProcessingItem, class UInventory* CallFunc_GetInventory_ReturnValue, class UInventory* CallFunc_GetInventory_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess_1, TArray<class UInventory*>& K2Node_MakeArray_Array, bool CallFunc_CanQueueItem_ReturnValue);
	void Update_All_Recipes(class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class ABP_IcarusPlayerControllerSurvival_C* K2Node_DynamicCast_AsBP_Icarus_Player_Controller_Survival, bool K2Node_DynamicCast_bSuccess, class ABP_IcarusPlayerCharacterSurvival_C* CallFunc_GetIcarusPlayerCharacterBP_ReturnValue, bool CallFunc_ValidRecipe_Valid, TArray<class UInventory*>& K2Node_MakeArray_Array);
	void Selected_Recipe_Updated(const struct FProcessorRecipesRowHandle& NewRecipe, int32 ElementCount, int32 Temp_int_Loop_Counter_Variable, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Array_Index_Variable_2, class UUMG_RecipeInput_C* CallFunc_Create_ReturnValue, class UUMG_RecipeElementBase_C* Temp_wildcard_Variable, class ACharacter* CallFunc_GetPlayerCharacter_ReturnValue, TArray<struct FResourceItem>& CallFunc_CreateRecipeInputResourceData_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue, const struct FResourceItem& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, class UUMG_RecipeElementBase_C* K2Node_DynamicCast_AsUMG_Recipe_Element_Base, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Less_IntInt_ReturnValue, class UUMG_RecipeInput_C* CallFunc_Create_ReturnValue_1, bool CallFunc_EqualEqual_FProcessorRecipesRowHandleFProcessorRecipesRowHandle_ReturnValue, class ACharacter* CallFunc_GetPlayerCharacter_ReturnValue_1, TArray<struct FItemData>& CallFunc_CreateRecipeInputItemData_ReturnValue, const struct FItemData& CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_1, int32 Temp_int_Variable, int32 CallFunc_Percent_IntInt_ReturnValue, int32 CallFunc_Divide_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_2, class UGridSlot* CallFunc_AddChildToGrid_ReturnValue, bool CallFunc_IsValid_ReturnValue, class AActor* CallFunc_GetOwner_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_2, const struct FProcessorRecipe& CallFunc_GetProcessorRecipesStruct_ProcessorRecipes, enum class EValid CallFunc_GetProcessorRecipesStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_Less_IntInt_ReturnValue_2, const struct FCraftingOutput& CallFunc_Array_Get_Item_3, bool CallFunc_Array_IsValidIndex_ReturnValue, const struct FItemData& CallFunc_GetItemTemplateStruct_ItemTemplate, enum class EValid CallFunc_GetItemTemplateStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess_1, const struct FItemableData& CallFunc_GetItemableData_ItemableData, enum class EDataValid CallFunc_GetItemableData_Paths, int32 CallFunc_Array_Length_ReturnValue_3, bool K2Node_SwitchEnum_CmpSuccess_2, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, class FText CallFunc_TextToUpper_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_3);
	void PanelClosed(bool CallFunc_IsValid_ReturnValue);
	void UpdateCrafting(bool IsCrafting);
	void RefreshRecipes(class ABP_IcarusPlayerCharacterSurvival_C* Player, const struct FRecipeSetsRowHandle& CallFunc_GetRecipeSetRow_ReturnValue);
	void Initialise(class UInventory* Inventory, class UProcessingComponent* Processor, const struct FProcessingRowHandle& CallFunc_MakeProcessing_ReturnValue, const struct FProcessingData& CallFunc_GetProcessingStruct_Processing, enum class EValid CallFunc_GetProcessingStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess);
	void ElementClicked(const struct FProcessorRecipesRowHandle& Element);
	void Construct();
	void PreConstruct(bool IsDesignTime);
	void BindProcessingEvent();
	void ProcessingUpdated();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void BndEvt__UMG_BasicButton_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature(class UUMG_ButtonBase_C* Button);
	void BindInventoryEvent();
	void UpdateRecipes();
	void OnItemUpdated(class UInventory* Inventory, int32 Location);
	void QueueElementClickedHandler(int32 Location);
	void BndEvt__StopButton_K2Node_ComponentBoundEvent_1_Clicked__DelegateSignature(class UUMG_ButtonBase_C* Button);
	void UpdateCount(int32 Count);
	void BndEvt__UMG_BasicButton_3_K2Node_ComponentBoundEvent_4_Clicked__DelegateSignature(class UUMG_ButtonBase_C* Button);
	void BndEvt__CraftingAmount_K2Node_ComponentBoundEvent_5_OnEditableTextChangedEvent__DelegateSignature(class FText& Text);
	void BndEvt__CraftingAmount_K2Node_ComponentBoundEvent_6_OnEditableTextCommittedEvent__DelegateSignature(class FText& Text, enum class ETextCommit CommitMethod);
	void BndEvt__ClearQueueButton_K2Node_ComponentBoundEvent_7_Clicked__DelegateSignature(class UUMG_ButtonBase_C* Button);
	void BndEvt__RightButton_1_K2Node_ComponentBoundEvent_8_Clicked__DelegateSignature();
	void BndEvt__LeftButton_K2Node_ComponentBoundEvent_9_Clicked__DelegateSignature();
	void RequestFullUpdate();
	void ExecuteUbergraph_UMG_Crafting(int32 EntryPoint, class UUMG_KeybindPrompt_C* CallFunc_Create_ReturnValue, class UUMG_KeybindPrompt_C* CallFunc_Create_ReturnValue_1, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_1, class ABP_IcarusPlayerControllerSurvival_C* K2Node_DynamicCast_AsBP_Icarus_Player_Controller_Survival, bool K2Node_DynamicCast_bSuccess, class ABP_IcarusPlayerControllerSurvival_C* K2Node_DynamicCast_AsBP_Icarus_Player_Controller_Survival_1, bool K2Node_DynamicCast_bSuccess_1, class ABP_IcarusPlayerCharacterSurvival_C* CallFunc_GetIcarusPlayerCharacterBP_ReturnValue, class ABP_IcarusPlayerCharacterSurvival_C* CallFunc_GetIcarusPlayerCharacterBP_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, TArray<class UInventory*>& K2Node_MakeArray_Array, TArray<class UInventory*>& K2Node_MakeArray_Array_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_2, const struct FProcessorRecipesRowHandle& Temp_wildcard_Variable, class ABP_IcarusPlayerControllerSurvival_C* K2Node_DynamicCast_AsBP_Icarus_Player_Controller_Survival_2, bool K2Node_DynamicCast_bSuccess_2, class ABP_IcarusPlayerCharacterSurvival_C* CallFunc_GetIcarusPlayerCharacterBP_ReturnValue_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, bool K2Node_Event_IsDesignTime, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, bool CallFunc_IsValid_ReturnValue_1, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_3, const struct FKeybindingsRowHandle& Temp_struct_Variable, class ABP_IcarusPlayerControllerSurvival_C* K2Node_DynamicCast_AsBP_Icarus_Player_Controller_Survival_3, bool K2Node_DynamicCast_bSuccess_3, class ABP_IcarusPlayerCharacterSurvival_C* CallFunc_GetIcarusPlayerCharacterBP_ReturnValue_3, class UUMG_PhysicalKeyPrompt_C* CallFunc_Create_ReturnValue_2, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, TArray<struct FProcessingItem>& CallFunc_GetProcessingQueue_ReturnValue, const struct FProcessingItem& CallFunc_Array_Get_Item, bool CallFunc_Array_IsValidIndex_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UUMG_ButtonBase_C* K2Node_ComponentBoundEvent_Button_3, bool CallFunc_EqualEqual_IntInt_ReturnValue, const struct FKeybindingsRowHandle& Temp_struct_Variable_1, bool CallFunc_IsServer_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, class UInventory* K2Node_CustomEvent_Inventory, int32 K2Node_CustomEvent_Location_1, TArray<struct FProcessingItem>& CallFunc_GetProcessingQueue_ReturnValue_1, const struct FProcessingData& CallFunc_GetProcessingData_OutData, bool CallFunc_GetProcessingData_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_GreaterEqual_IntInt_ReturnValue, int32 CallFunc_GetQueueSize_Size, class UUMG_PhysicalKeyPrompt_C* CallFunc_Create_ReturnValue_3, bool CallFunc_BooleanOR_ReturnValue, int32 K2Node_CustomEvent_Location, class UUMG_PhysicalKeyPrompt_C* CallFunc_Create_ReturnValue_4, class UUMG_ButtonBase_C* K2Node_ComponentBoundEvent_Button_2, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_CanQueueItem_Craftable, bool CallFunc_EqualEqual_BoolBool_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_4, class ABP_IcarusPlayerControllerSurvival_C* K2Node_DynamicCast_AsBP_Icarus_Player_Controller_Survival_4, bool K2Node_DynamicCast_bSuccess_4, bool CallFunc_Not_PreBool_ReturnValue, class ABP_IcarusPlayerCharacterSurvival_C* CallFunc_GetIcarusPlayerCharacterBP_ReturnValue_4, bool CallFunc_BooleanAND_ReturnValue, const struct FKey& Temp_struct_Variable_2, bool CallFunc_IsValid_ReturnValue_3, class AActor* CallFunc_GetOwner_ReturnValue, class FText Temp_text_Variable, int32 CallFunc_Add_IntInt_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue, class FText CallFunc_Conv_StringToText_ReturnValue, int32 K2Node_CustomEvent_Count, int32 CallFunc_Clamp_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, class UUMG_ButtonBase_C* K2Node_ComponentBoundEvent_Button_1, class FText K2Node_ComponentBoundEvent_Text_1, class FText K2Node_ComponentBoundEvent_Text, enum class ETextCommit K2Node_ComponentBoundEvent_CommitMethod, bool K2Node_SwitchEnum_CmpSuccess, const class FString& CallFunc_Conv_TextToString_ReturnValue, class UUMG_ButtonBase_C* K2Node_ComponentBoundEvent_Button, int32 CallFunc_Conv_StringToInt_ReturnValue, const struct FKey& Temp_struct_Variable_3, enum class EValid CallFunc_GetIcarusPlayerCharacter_IsValid, class AIcarusPlayerCharacter* CallFunc_GetIcarusPlayerCharacter_ReturnValue, class UProcessingComponent* CallFunc_GetComponentByClass_ReturnValue, TArray<struct FProcessingItem>& CallFunc_GetProcessingQueue_ReturnValue_2, bool K2Node_SwitchEnum_CmpSuccess_1, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_NotEqual_IntInt_ReturnValue, const struct FProcessorRecipesRowHandle& CallFunc_GetRecipe_Recipe, int32 CallFunc_GetMaxCraftableStack_ReturnValue, bool CallFunc_IsVisible_ReturnValue, class APlayerController* CallFunc_GetOwningPlayer_ReturnValue_5, class FText Temp_text_Variable_1, class ABP_IcarusPlayerControllerSurvival_C* K2Node_DynamicCast_AsBP_Icarus_Player_Controller_Survival_5, bool K2Node_DynamicCast_bSuccess_5, class ABP_IcarusPlayerCharacterSurvival_C* CallFunc_GetIcarusPlayerCharacterBP_ReturnValue_5, const struct FKey& Temp_struct_Variable_4, class UHorizontalBoxSlot* CallFunc_AddChildToHorizontalBox_ReturnValue, class UHorizontalBoxSlot* CallFunc_AddChildToHorizontalBox_ReturnValue_1, class UHorizontalBoxSlot* CallFunc_AddChildToHorizontalBox_ReturnValue_2, class UHorizontalBoxSlot* CallFunc_AddChildToHorizontalBox_ReturnValue_3, class FText Temp_text_Variable_2, class UHorizontalBoxSlot* CallFunc_AddChildToHorizontalBox_ReturnValue_4, bool CallFunc_IsValid_ReturnValue_4, class AActor* CallFunc_GetOwner_ReturnValue_1);
};

}


