#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x158 (0x3B8 - 0x260)
// WidgetBlueprintGeneratedClass UMG_RecipeList.UMG_RecipeList_C
class UUMG_RecipeList_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x260(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                               CheckboxBorder;                                    // 0x268(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                ContainerIcon;                                     // 0x270(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        ContainerTipBox;                                   // 0x278(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          FilterList;                                        // 0x280(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUniformGridPanel*                     Grid;                                              // 0x288(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               MainBorder;                                        // 0x290(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UScrollBox*                            ScrollBox_0;                                       // 0x298(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UEditableTextBox*                      SearchBox;                                         // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ScaleableFrame_C*                 UMG_ScaleableFrame;                                // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UCheckBox*                             ValidOnly;                                         // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            RecipeSelected;                                    // 0x2B8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	int32                                        Count;                                             // 0x2C8(0x4)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_25C9[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FItemClassificationsIconsRowHandle> PrimaryItemTypes;                                  // 0x2D0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         RecipeAutoSelect;                                  // 0x2E0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_25D8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        Visible_Recipes_X;                                 // 0x2E4(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         ValidOnlyValue;                                    // 0x2E8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_25E3[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTagQueriesRowHandle                  SelectedQuery;                                     // 0x2EC(0x18)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	int32                                        Visible_Recipes_Y;                                 // 0x304(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	class AActor*                                LinkedActor;                                       // 0x308(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class UUMG_ListElement_C*>            RecipeElements;                                    // 0x310(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	TArray<class UUMG_RecipeElementNonInteractive_C*> RecipeElementNonInteractives;                      // 0x320(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                        Visible_Recipes_Auto_X;                            // 0x330(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	uint8                                        Pad_260B[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UUMG_RecipeElementMulti_C*>     RecipeElementsMulti;                               // 0x338(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	int32                                        Visible_Recipes_Multi_X;                           // 0x348(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	bool                                         RecipeMultiOutput;                                 // 0x34C(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2617[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRecipeSetsRowHandle                  CachedRecipeSet;                                   // 0x350(0x18)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TMap<struct FProcessorRecipesRowHandle, struct FSessionFlagsRowHandle> RecipeHighlightMap;                                // 0x368(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class UUMG_RecipeList_C* GetDefaultObj();

	void FullUpdate(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UUMG_ListElement_C* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	struct FSessionFlagsRowHandle GetHighlightFlag(const struct FProcessorRecipesRowHandle& Recipe, const struct FSessionFlagsRowHandle& CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue);
	void UpdateTrigger(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UUMG_ListElement_C* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_IsValid_ReturnValue);
	void Filter();
	void FilterAvaliable(int32 Temp_int_Array_Index_Variable, enum class EValid CallFunc_GetIcarusPlayerCharacter_IsValid, class AIcarusPlayerCharacter* CallFunc_GetIcarusPlayerCharacter_ReturnValue, class UFlagSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue, class AIcarusPlayerCharacterSurvival* K2Node_DynamicCast_AsIcarus_Player_Character_Survival, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsUnlockAllRecipesEnabled_ReturnValue, class AIcarusPlayerController* CallFunc_GetIcarusPlayerController_ReturnValue, class AIcarusPlayerState* CallFunc_GetIcarusPlayerState_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UWidget* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, class UUMG_ListElement_C* K2Node_DynamicCast_AsUMG_List_Element, bool K2Node_DynamicCast_bSuccess_1, const struct FProcessorRecipe& CallFunc_GetProcessorRecipesStruct_ProcessorRecipes, enum class EValid CallFunc_GetProcessorRecipesStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess_1, class UUMG_RecipeElementNonInteractive_C* K2Node_DynamicCast_AsUMG_Recipe_Element_Non_Interactive, bool K2Node_DynamicCast_bSuccess_2, bool CallFunc_IsRowHandleValid_ReturnValue, bool CallFunc_HasCharacterFlagPlayer_ReturnValue, bool CallFunc_HasFlagPlayer_ReturnValue, enum class EFlagsTableType CallFunc_Break_OutEnum, class FName CallFunc_Break_OutName, bool CallFunc_HasCraftingRequirements_ReturnValue, bool CallFunc_EqualEqual_NameName_ReturnValue);
	void FilterTypes(int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, int32 Temp_int_Array_Index_Variable_1, bool CallFunc_Less_IntInt_ReturnValue, class UWidget* CallFunc_Array_Get_Item, class UUMG_FilterButton_C* K2Node_DynamicCast_AsUMG_Filter_Button, bool K2Node_DynamicCast_bSuccess, bool CallFunc_EqualEqual_FTagQueriesRowHandleFTagQueriesRowHandle_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_1, class UWidget* CallFunc_Array_Get_Item_1, bool CallFunc_Less_IntInt_ReturnValue_1, class UUMG_ListElement_C* K2Node_DynamicCast_AsUMG_List_Element, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_IsVisible_ReturnValue);
	void FilterText(int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, class FText CallFunc_GetText_ReturnValue, const class FString& CallFunc_Conv_TextToString_ReturnValue, bool CallFunc_IsEmpty_ReturnValue, class FText CallFunc_GetText_ReturnValue_1, const class FString& CallFunc_Conv_TextToString_ReturnValue_1, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UWidget* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, class UUMG_ListElement_C* K2Node_DynamicCast_AsUMG_List_Element, bool K2Node_DynamicCast_bSuccess, const struct FProcessorRecipe& CallFunc_GetProcessorRecipesStruct_ProcessorRecipes, enum class EValid CallFunc_GetProcessorRecipesStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_IsVisible_ReturnValue, const struct FCraftingOutput& CallFunc_Array_Get_Item_1, bool CallFunc_Array_IsValidIndex_ReturnValue, const struct FItemData& CallFunc_GetItemTemplateStruct_ItemTemplate, enum class EValid CallFunc_GetItemTemplateStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess_1, const struct FItemableData& CallFunc_GetItemableData_ItemableData, enum class EDataValid CallFunc_GetItemableData_Paths, bool K2Node_SwitchEnum_CmpSuccess_2, const class FString& CallFunc_Conv_TextToString_ReturnValue_2, bool CallFunc_Contains_ReturnValue);
	void FilterValid(int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UWidget* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, class UUMG_ListElement_C* K2Node_DynamicCast_AsUMG_List_Element, bool K2Node_DynamicCast_bSuccess, bool CallFunc_IsVisible_ReturnValue);
	void CanCraftItem(class UObject* Widget, TArray<class UInventory*>& Inventories, class UProcessingComponent* Processing, bool* Valid, class UUMG_ListElement_C* K2Node_DynamicCast_AsUMG_List_Element, bool K2Node_DynamicCast_bSuccess, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<struct FResourceItem>& CallFunc_CreateRecipeInputResourceData_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, const struct FResourceItem& CallFunc_Array_Get_Item, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_GetResourceRecipeValidility_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, class ACharacter* CallFunc_GetPlayerCharacter_ReturnValue, TArray<struct FItemData>& CallFunc_CreateRecipeInputItemData_ReturnValue, const struct FItemData& CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_CheckRecipeValidityItems_CurrentAmount, bool CallFunc_CheckRecipeValidityItems_ReturnValue);
	void UpdateStates(class UProcessingComponent* Processing, TArray<class UInventory*>& Additional_Inventories, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UWidget* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, class UUMG_ListElement_C* K2Node_DynamicCast_AsUMG_List_Element, bool K2Node_DynamicCast_bSuccess, bool CallFunc_CanCraftItem_Valid);
	void FixLayout(int32 CurrentCount, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, bool Temp_bool_Variable, bool Temp_bool_Variable_1, int32 Temp_int_Variable, int32 K2Node_Select_Default, int32 K2Node_Select_Default_1, int32 CallFunc_Divide_IntInt_ReturnValue, int32 CallFunc_Percent_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, class UWidget* CallFunc_Array_Get_Item, bool CallFunc_Less_IntInt_ReturnValue, class UUniformGridSlot* CallFunc_SlotAsUniformGridSlot_ReturnValue, bool CallFunc_IsVisible_ReturnValue);
	void ItemClickedHandler(const struct FTagQueriesRowHandle& TagQuery);
	void On_Recipe_Selected(const struct FProcessorRecipesRowHandle& Recipe);
	void Initialise(const struct FRecipeSetsRowHandle& RecipeSet, bool AutoSelect, bool UseInput, const TArray<struct FTagQueriesRowHandle>& Queries, const TArray<struct FProcessorRecipeResult>& Recipes, const struct FRecipeSet& RecipeSetData, const struct FProcessorRecipe& RecipeData, const struct FProcessorRecipesRowHandle& Recipe, const struct FItemClassificationsIconsRowHandle& Temp_struct_Variable, const struct FRecipeSet& CallFunc_GetRecipeSetsStruct_RecipeSets, enum class EValid CallFunc_GetRecipeSetsStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess, class UUMG_FilterButton_C* CallFunc_Create_ReturnValue, int32 Temp_int_Array_Index_Variable, bool CallFunc_EqualEqual_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, TArray<struct FProcessorRecipeResult>& CallFunc_GetRecipesAndFiltersForRecipeSet_Recipes, TArray<struct FItemClassificationsIconsRowHandle>& CallFunc_GetRecipesAndFiltersForRecipeSet_ItemFilters, const struct FItemClassificationsIconsRowHandle& CallFunc_Array_Get_Item, const struct FSessionFlagsRowHandle& CallFunc_GetHighlightFlag_ReturnValue, const struct FItemClassificationsIconsData& CallFunc_GetItemClassificationsIconsStruct_ItemClassificationsIcons, enum class EValid CallFunc_GetItemClassificationsIconsStruct_Paths, int32 CallFunc_Array_Length_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess_1, const struct FSessionFlagsRowHandle& CallFunc_GetHighlightFlag_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, const struct FProcessorRecipe& CallFunc_GetProcessorRecipesStruct_ProcessorRecipes, enum class EValid CallFunc_GetProcessorRecipesStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess_2, class APlayerController* CallFunc_GetPlayerController_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_EqualEqual_FRecipeSetsRowHandleFRecipeSetsRowHandle_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, bool Temp_bool_Variable, int32 Temp_int_Array_Index_Variable_1, const struct FProcessorRecipeResult& CallFunc_Array_Get_Item_1, TSubclassOf<class UUMG_ListElement_C> Temp_class_Variable, class UVerticalBoxSlot* CallFunc_AddChildToVerticalBox_ReturnValue, int32 CallFunc_Array_Add_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, const struct FMargin& K2Node_MakeStruct_Margin, TSubclassOf<class UUMG_ListElement_C> Temp_class_Variable_1, class APlayerController* CallFunc_GetPlayerController_ReturnValue_1, TSubclassOf<class UUMG_ListElement_C> K2Node_Select_Default, class UUMG_RecipeElementNonInteractive_C* CallFunc_Create_ReturnValue_1, class UUMG_ListElement_C* CallFunc_Create_ReturnValue_2, class UUniformGridSlot* CallFunc_AddChildToUniformGrid_ReturnValue, int32 CallFunc_Array_Add_ReturnValue_1, int32 CallFunc_Array_Add_ReturnValue_2, class UUniformGridSlot* CallFunc_AddChildToUniformGrid_ReturnValue_1);
	void PreConstruct(bool IsDesignTime);
	void BndEvt__ValidOnly_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked);
	void BndEvt__SearchBox_K2Node_ComponentBoundEvent_3_OnEditableTextBoxChangedEvent__DelegateSignature(class FText& Text);
	void ExecuteUbergraph_UMG_RecipeList(int32 EntryPoint, const struct FRecipeSetsRowHandle& CallFunc_MakeLiteralRecipeSets_ReturnValue, const struct FItemClassificationsIconsRowHandle& Temp_struct_Variable, bool K2Node_Event_IsDesignTime, int32 CallFunc_Array_Add_ReturnValue, bool K2Node_ComponentBoundEvent_bIsChecked, class FText K2Node_ComponentBoundEvent_Text);
	void RecipeSelected__DelegateSignature(const struct FProcessorRecipesRowHandle& ProcessorRecipe);
};

}


