#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x788 (0x788 - 0x0)
// Function UMG_ResourceNetworkPreviewContainer.UMG_ResourceNetworkPreviewContainer_C.Update
struct UUMG_ResourceNetworkPreviewContainer_C_Update_Params
{
public:
	struct FItemData                             Item;                                              // 0x0(0x1F0)(BlueprintVisible, BlueprintReadOnly, Parm, ContainsInstancedReference)
	struct FItemStaticData                       CallFunc_GetItemsStaticStruct_ItemsStatic;         // 0x1F0(0x4D0)(None)
	enum class EValid                            CallFunc_GetItemsStaticStruct_Paths;               // 0x6C0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_15C4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateChildSize                       K2Node_MakeStruct_SlateChildSize;                  // 0x6C4(0x8)(NoDestructor)
	bool                                         K2Node_SwitchEnum_CmpSuccess;                      // 0x6CC(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_15C7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateChildSize                       K2Node_MakeStruct_SlateChildSize_1;                // 0x6D0(0x8)(NoDestructor)
	struct FFuelData                             CallFunc_GetFuelStruct_Fuel;                       // 0x6D8(0x20)(None)
	enum class EValid                            CallFunc_GetFuelStruct_Paths;                      // 0x6F8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_15CD[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FWaterData                            CallFunc_GetWaterStruct_Water;                     // 0x700(0x20)(None)
	enum class EValid                            CallFunc_GetWaterStruct_Paths;                     // 0x720(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_SwitchEnum_CmpSuccess_1;                    // 0x721(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         K2Node_SwitchEnum_CmpSuccess_2;                    // 0x722(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_15D3[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FEnergyData                           CallFunc_GetEnergyStruct_Energy;                   // 0x728(0x20)(None)
	enum class EValid                            CallFunc_GetEnergyStruct_Paths;                    // 0x748(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_15D7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FSlateChildSize                       K2Node_MakeStruct_SlateChildSize_2;                // 0x74C(0x8)(NoDestructor)
	bool                                         K2Node_SwitchEnum_CmpSuccess_3;                    // 0x754(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_15D8[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UUMG_ResourceNetworkPreview_C*         CallFunc_Create_ReturnValue;                       // 0x758(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ResourceNetworkPreview_C*         CallFunc_Create_ReturnValue_1;                     // 0x760(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                    CallFunc_AddChildToHorizontalBox_ReturnValue;      // 0x768(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                    CallFunc_AddChildToHorizontalBox_ReturnValue_1;    // 0x770(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ResourceNetworkPreview_C*         CallFunc_Create_ReturnValue_2;                     // 0x778(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UHorizontalBoxSlot*                    CallFunc_AddChildToHorizontalBox_ReturnValue_2;    // 0x780(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x4 (0x4 - 0x0)
// Function UMG_ResourceNetworkPreviewContainer.UMG_ResourceNetworkPreviewContainer_C.ExecuteUbergraph_UMG_ResourceNetworkPreviewContainer
struct UUMG_ResourceNetworkPreviewContainer_C_ExecuteUbergraph_UMG_ResourceNetworkPreviewContainer_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


