#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x40 (0x2F0 - 0x2B0)
// WidgetBlueprintGeneratedClass UMG_FieldGuideItem_Stats.UMG_FieldGuideItem_Stats_C
class UUMG_FieldGuideItem_Stats_C : public UFieldGuideItemWidgetBase
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x2B0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UVerticalBox*                          AlterationList;                                    // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          ModifierList;                                      // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          SetBonusList;                                      // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                               SetBonusSpacer;                                    // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          StatList;                                          // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_FieldGuideItems_ToolDamage_C*     ToolDamage;                                        // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       WidgetSwitcher_NA;                                 // 0x2E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UUMG_FieldGuideItem_Stats_C* GetDefaultObj();

	void PopulateStatsView(const struct FStatAfflictionsRowHandle& StatAfflication, TMap<struct FStatsEnum, int32> Stats, const struct FItemData& Item, int32 Temp_int_Variable, int32 Temp_int_Variable_1, const struct FStatAfflictionsEnum& CallFunc_IntToStruct_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, const struct FStatAfflictionsRowHandle& CallFunc_StructToRowHandle_ReturnValue, const struct FStatAfflictions& CallFunc_GetStatAfflictionsStruct_StatAfflictions, enum class EValid CallFunc_GetStatAfflictionsStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess, const struct FStatsEnum& Temp_struct_Variable, TArray<struct FStatsEnum>& CallFunc_Map_Keys_Keys, int32 CallFunc_Array_Length_ReturnValue, TArray<int32>& CallFunc_Map_Values_Values, const struct FStatsEnum& Temp_struct_Variable_1, class UUMG_ModifierDescription_Large_C* CallFunc_Create_ReturnValue, class UUMG_StatDescriptionLarge_C* CallFunc_Create_ReturnValue_1, TMap<struct FStatsEnum, int32> CallFunc_GetItemPopupStats_Stats, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable, class UUMG_ModifierDescription_Large_C* CallFunc_Create_ReturnValue_2, const struct FStatsEnum& CallFunc_Array_Get_Item, int32 CallFunc_Array_Get_Item_1, bool CallFunc_NotEqual_IntInt_ReturnValue, bool CallFunc_EqualEqual_EnumEnum_ReturnValue, bool CallFunc_HasStatDescription_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, enum class ESlateVisibility Temp_byte_Variable, const struct FItemData& K2Node_MakeStruct_ItemData, int32 CallFunc_GetChildrenCount_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable_1, const struct FItemStaticData& CallFunc_GetItemsStaticStruct_ItemsStatic, enum class EValid CallFunc_GetItemsStaticStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess_1, bool CallFunc_HasAnyChildren_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, const struct FIcarusAttachment& CallFunc_GetIcarusAttachmentsStruct_IcarusAttachments, enum class EValid CallFunc_GetIcarusAttachmentsStruct_Paths, bool CallFunc_BooleanAND_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess_2, const struct FAlterationsEnum& CallFunc_RowHandleToStruct_ReturnValue, bool CallFunc_HasAnyChildren_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue_1, const struct FArmourData& CallFunc_GetArmourData_ArmourData, enum class EDataValid CallFunc_GetArmourData_Paths, enum class ESlateVisibility Temp_byte_Variable_1, bool K2Node_SwitchEnum_CmpSuccess_3, const struct FArmourSet& CallFunc_GetArmourSetsStruct_ArmourSets, enum class EValid CallFunc_GetArmourSetsStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess_4, const struct FArmourSetBonusRowHandle& CallFunc_Array_Get_Item_2, bool CallFunc_HasAnyChildren_ReturnValue_2, int32 CallFunc_Array_Length_ReturnValue_1, bool Temp_bool_Variable, bool CallFunc_HasAnyChildren_ReturnValue_3, bool CallFunc_Not_PreBool_ReturnValue_2, enum class ESlateVisibility K2Node_Select_Default, class UPanelSlot* CallFunc_AddChild_ReturnValue, bool CallFunc_IsRowHandleValid_ReturnValue, int32 CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, int32 CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, class UUMG_ArmourSet_Large_C* CallFunc_Create_ReturnValue_3, class UUMG_FieldGuideItems_AlterationDescriptionLarge_C* CallFunc_Create_ReturnValue_4, class UVerticalBoxSlot* CallFunc_AddChildToVerticalBox_ReturnValue, class UPanelSlot* CallFunc_AddChild_ReturnValue_1, const struct FConsumableData& CallFunc_GetConsumableData_ConsumableData, enum class EDataValid CallFunc_GetConsumableData_Paths, bool K2Node_SwitchEnum_CmpSuccess_5, class UVerticalBoxSlot* CallFunc_AddChildToVerticalBox_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_1, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_2, const struct FModifierStateData& CallFunc_GetModifierStatesStruct_ModifierStates, enum class EValid CallFunc_GetModifierStatesStruct_Paths, bool CallFunc_HasAnyChildren_ReturnValue_4, bool K2Node_SwitchEnum_CmpSuccess_6, bool CallFunc_Not_PreBool_ReturnValue_3, bool CallFunc_HasAnyChildren_ReturnValue_5, bool CallFunc_Not_PreBool_ReturnValue_4, class UPanelSlot* CallFunc_AddChild_ReturnValue_2, bool CallFunc_BooleanAND_ReturnValue_2, int32 CallFunc_NumRows_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_2, bool CallFunc_BooleanAND_ReturnValue_4, const struct FItemData& K2Node_MakeStruct_ItemData_1);
	void InitFieldGuideView(const struct FItemsStaticRowHandle& ItemIn, const struct FFieldGuideCategoriesRowHandle& CategoryIn);
	void ExecuteUbergraph_UMG_FieldGuideItem_Stats(int32 EntryPoint, const struct FItemsStaticRowHandle& K2Node_Event_ItemIn, const struct FFieldGuideCategoriesRowHandle& K2Node_Event_CategoryIn);
};

}


