#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x350 (0x5D0 - 0x280)
// WidgetBlueprintGeneratedClass UMG_HabitatTerminal.UMG_HabitatTerminal_C
class UUMG_HabitatTerminal_C : public UUMG_IcarusLinkedActorPanel_C
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x280(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UUMG_BasicButton_2_C*                  BackButton;                                        // 0x288(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       BrowserSwitcher;                                   // 0x290(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_BasicButton_2_C*                  Cancel;                                            // 0x298(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_HostProspectsList_C*              DedicatedServerBrowser;                            // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               Loading;                                           // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_CloseButton_2_C*                  OpenProspectCloseButton;                           // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               OpenProspectOverlay;                               // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_OpenProspectWindow_C*             OpenProspectScreen;                                // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                            OutpostMenuSlot;                                   // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               PlanetImageBG;                                     // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               PlanetView;                                        // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_BasicButton_2_C*                  PlanetViewButton;                                  // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UNamedSlot*                            ProspectMenuSlot;                                  // 0x2E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               ProspectServerBrowser;                             // 0x2F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       ProspectTypeSwitcher;                              // 0x2F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        ProviderBox;                                       // 0x300(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_BasicButton_2_C*                  Refresh;                                           // 0x308(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_CloseButton_2_C*                  SelectedOutpostCloseButton;                        // 0x310(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               SelectedOutpostOverlay;                            // 0x318(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_OutpostSelected_C*                SelectedOutpostScreen;                             // 0x320(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_CloseButton_2_C*                  SelectedProspectCloseButton;                       // 0x328(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               SelectedProspectOverlay;                           // 0x330(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_PlanetProspectSelected_C*         SelectedProspectScreen;                            // 0x338(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_HostProspectsList_C*              ServerBrowser;                                     // 0x340(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_BasicButton_2_C*                  ServerBrowserButton;                               // 0x348(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       Switcher;                                          // 0x350(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LoadingIcon_C*                    UMG_LoadingIcon;                                   // 0x358(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_MultiToggle_C*                    UMG_MultiToggle;                                   // 0x360(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_PlanetProspectView_C*             UMG_PlanetProspectView;                            // 0x368(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            ProspectsUpdated;                                  // 0x370(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	struct FFProspectServerInfo                  Working_Prospect_Info;                             // 0x380(0x19B)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	uint8                                        Pad_6031[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class UFMODEvent*>                    BriefingAudio;                                     // 0x520(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FFMODEventInstance                    BriefingAudioEvent;                                // 0x530(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	FMulticastInlineDelegateProperty_            CloseTerminal;                                     // 0x538(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UUMG_OpenProspectWindow_C*             OpenProspectWindow;                                // 0x548(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_PasswordInput_C*                  PasswordInput;                                     // 0x550(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_OpenWorldSelection_C*             OpenWorldSelectionWindow;                          // 0x558(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FString                                GPortalLink;                                       // 0x560(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                NitradoLink;                                       // 0x570(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                SurvivalLink;                                      // 0x580(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	class FString                                StreamlineLink;                                    // 0x590(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, HasGetValueTypeHash)
	TArray<class FString>                        ProviderLinks;                                     // 0x5A0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<class UTexture2D*>                    ProviderImages;                                    // 0x5B0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TArray<enum class EStretch>                  In_Stretch;                                        // 0x5C0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)

	static class UClass* StaticClass();
	static class UUMG_HabitatTerminal_C* GetDefaultObj();

	void UpdateMatchmakingState(int32 Index, int32 Temp_int_Variable, enum class ESessionSearchType Temp_byte_Variable, enum class ESessionSearchType Temp_byte_Variable_1, class UMatchmakingSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue, enum class ESessionSearchType K2Node_Select_Default);
	void UpdateRefreshButtonState(enum class ESessionSearchType Temp_byte_Variable, class UMatchmakingSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue, bool CallFunc_IsFindDedicatedSessionsRunning_ReturnValue, bool CallFunc_IsFindFriendSessionsRunning_ReturnValue, enum class ESessionSearchType CallFunc_GetCurrentSearchType_ReturnValue, bool K2Node_Select_Default, bool CallFunc_Not_PreBool_ReturnValue);
	void ServerProviderSetup(const TArray<class FString>& Shuffled, const TArray<class UWidget*>& Children, const struct FSlateChildSize& NewLocalVar_0, int32 RandomOffset, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, class UUMG_ServerProviderButton_C* CallFunc_Create_ReturnValue, class UHorizontalBoxSlot* CallFunc_AddChildToHorizontalBox_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, const class FString& CallFunc_Array_Get_Item, int32 CallFunc_Array_Find_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue, class UTexture2D* CallFunc_Array_Get_Item_1, enum class EStretch CallFunc_Array_Get_Item_2, bool CallFunc_Array_IsValidIndex_ReturnValue_1);
	void OpenWorldProspectSelected(const struct FProspectListRowHandle& Prospect, const struct FProspectInfo& ProspectInfo, const class FString& CallFunc_Conv_NameToString_ReturnValue, const struct FFProspectServerInfo& K2Node_MakeStruct_FProspectServerInfo, const struct FProspectInfo& K2Node_MakeStruct_ProspectInfo);
	void SwitchToHostOpenWorld(bool CallFunc_IsValid_ReturnValue, class UUMG_OpenWorldSelection_C* CallFunc_Create_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, class UPanelSlot* CallFunc_SetContent_ReturnValue);
	TArray<struct FFProspectServerInfo> ConvertDedicatedServerSessions(TArray<struct FBlueprintSessionResult>& Sessions, const TArray<struct FFProspectServerInfo>& Prospects, int32 CallFunc_Array_Length_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, const struct FBlueprintSessionResult& CallFunc_Array_Get_Item, const struct FIcarusSession& CallFunc_CreateIcarusSessionFromSession_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, const struct FFProspectServerInfo& K2Node_MakeStruct_FProspectServerInfo, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Add_ReturnValue);
	void SwitchToResumeProspect();
	bool ResetProspectView(class UWidget* CallFunc_GetContent_ReturnValue, class UUMG_TalentView_Prospect_C* K2Node_DynamicCast_AsUMG_Talent_View_Prospect, bool K2Node_DynamicCast_bSuccess);
	void SwitchToHostOutpost(enum class EValid CallFunc_GetIcarusPlayerController_IsValid, class AIcarusPlayerController* CallFunc_GetIcarusPlayerController_ReturnValue, class AIcarusPlayerState* CallFunc_GetIcarusPlayerState_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class UWidget* CallFunc_GetContent_ReturnValue, bool CallFunc_EqualEqual_ObjectObject_ReturnValue);
	void SwitchToJoin();
	void SwitchToHost();
	void Log(const class FString& Description, const class FString& CallFunc_Concat_StrStr_ReturnValue);
	void OnOpened();
	void ProspectSelected(const struct FFProspectServerInfo& Prospect, bool Active);
	void ProspectClosed();
	void ClaimAndLaunchProspect(const struct FFProspectServerInfo& Prospect_Info);
	void BndEvt__Refresh_K2Node_ComponentBoundEvent_4_Clicked__DelegateSignature(class UUMG_ButtonBase_C* Button);
	void JoinProspect(const struct FFProspectServerInfo& ProspectInfo);
	void BndEvt__ServerBrowserButton_K2Node_ComponentBoundEvent_2_Clicked__DelegateSignature(class UUMG_ButtonBase_C* Button);
	void ProspectModelViewChanged(class UTalentControllerComponent* Controller);
	void TalentProspectSelected(const struct FFProspectServerInfo& ProspectInfo);
	void SetupProspectTalentScreen();
	void HideCloseButton(class UUMG_ButtonBase_C* Button);
	void OutpostModelViewChanged(class UTalentControllerComponent* Controller);
	void TalentOutpostSelected(const struct FFProspectServerInfo& ProspectInfo);
	void OutpostSelected(const struct FFProspectServerInfo& Prospect, bool Active);
	void OutpostClosed();
	void BndEvt__PlanetViewButton_K2Node_ComponentBoundEvent_1_Clicked__DelegateSignature(class UUMG_ButtonBase_C* Button);
	void ShowCloseButton_Event_0();
	void ShowOutpostCloseButton(class UUMG_ButtonBase_C* Button);
	void Opened();
	void BndEvt__UMG_HabitatTerminal_BackButton_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature(class UUMG_ButtonBase_C* Button);
	void Construct();
	void BndEvt__UMG_HabitatTerminal_UMG_MultiToggle_K2Node_ComponentBoundEvent_3_MultiToggleStateChanged__DelegateSignature(int32 PreviousToggleIndex, int32 CurrentToggleIndex);
	void OptionAClicked();
	void OptionBClicked_Event();
	void PasswordCheck();
	void ConfirmPassword();
	void CancelPassword();
	void ReturnToTopLevel();
	void CloseResumeProspect();
	void ResetOpenProspectOverlay();
	void PreConstruct(bool IsDesignTime);
	void BndEvt__UMG_HabitatTerminal_Cancel_K2Node_ComponentBoundEvent_5_Clicked__DelegateSignature(class UUMG_ButtonBase_C* Button);
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void ExecuteUbergraph_UMG_HabitatTerminal(int32 EntryPoint, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, class UUMG_PasswordInput_C* CallFunc_Create_ReturnValue, const struct FConfirmationPopupDetails& K2Node_MakeStruct_ConfirmationPopupDetails, class UMatchmakingSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue, class UMatchmakingSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue_1, enum class ESessionSearchType CallFunc_GetCurrentSearchType_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class UMatchmakingSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue_2, class UMatchmakingSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue_3, int32 Temp_int_Variable, class UMatchmakingSubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue_4, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, const struct FFProspectServerInfo& K2Node_CustomEvent_Prospect_1, bool K2Node_CustomEvent_Active_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, bool CallFunc_EqualEqual_StrStr_ReturnValue, class FName CallFunc_Conv_StringToName_ReturnValue, const struct FProspectListRowHandle& CallFunc_MakeProspectList_ReturnValue, const struct FIcarusProspect& CallFunc_GetProspectListStruct_ProspectList, enum class EValid CallFunc_GetProspectListStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess_1, const struct FFactionMission& CallFunc_GetFactionMissionsStruct_FactionMissions, enum class EValid CallFunc_GetFactionMissionsStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess_2, const struct FDialogue& CallFunc_GetDialogueStruct_Dialogue, enum class EValid CallFunc_GetDialogueStruct_Paths, const struct FFactionInfo& CallFunc_GetFactionInfoStruct_FactionInfo, enum class EValid CallFunc_GetFactionInfoStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess_3, bool K2Node_SwitchEnum_CmpSuccess_4, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_7, enum class EValid CallFunc_GetIcarusPlayerCharacter_IsValid, class AIcarusPlayerCharacter* CallFunc_GetIcarusPlayerCharacter_ReturnValue, const struct FConfirmationPopupDetails& K2Node_MakeStruct_ConfirmationPopupDetails_1, bool K2Node_SwitchEnum_CmpSuccess_5, const struct FFProspectServerInfo& K2Node_CustomEvent_Prospect_Info, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_8, const class FString& Temp_wildcard_Variable, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, class UUMG_ButtonBase_C* K2Node_ComponentBoundEvent_Button_4, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_9, class APlayerController* CallFunc_GetPlayerController_ReturnValue, const struct FFProspectServerInfo& K2Node_CustomEvent_ProspectInfo_2, class ABP_IcarusPlayerControllerSpace_C* K2Node_DynamicCast_AsBP_Icarus_Player_Controller_Space, bool K2Node_DynamicCast_bSuccess, class APlayerController* CallFunc_GetPlayerController_ReturnValue_1, class UUMG_ButtonBase_C* K2Node_ComponentBoundEvent_Button_3, class ABP_IcarusPlayerControllerSpace_C* K2Node_DynamicCast_AsBP_Icarus_Player_Controller_Space_1, bool K2Node_DynamicCast_bSuccess_1, class UTalentControllerComponent* K2Node_CustomEvent_Controller_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_10, bool CallFunc_IsValid_ReturnValue, TScriptInterface<class ITalentControllerInterface> CallFunc_GetView_self_CastInput, class UTalentViewInterface* CallFunc_GetView_ReturnValue, class UUMG_TalentView_Prospect_C* K2Node_DynamicCast_AsUMG_Talent_View_Prospect, bool K2Node_DynamicCast_bSuccess_2, class UPanelSlot* CallFunc_SetContent_ReturnValue, enum class EValid CallFunc_GetIcarusPlayerController_IsValid, class AIcarusPlayerController* CallFunc_GetIcarusPlayerController_ReturnValue, const struct FFProspectServerInfo& K2Node_CustomEvent_ProspectInfo_1, class AIcarusPlayerState* CallFunc_GetIcarusPlayerState_ReturnValue, const struct FConnectedPlayer& CallFunc_FindInitialisedConnectedPlayerByController_OutConnectedPlayer, bool CallFunc_FindInitialisedConnectedPlayerByController_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_6, class UUMG_ButtonBase_C* K2Node_CustomEvent_Button_1, class UTalentControllerComponent* K2Node_CustomEvent_Controller, const struct FFProspectServerInfo& K2Node_CustomEvent_ProspectInfo, bool CallFunc_IsValid_ReturnValue_1, TScriptInterface<class ITalentControllerInterface> CallFunc_GetView_self_CastInput_1, class UTalentViewInterface* CallFunc_GetView_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_11, class UUMG_TalentView_Outpost_C* K2Node_DynamicCast_AsUMG_Talent_View_Outpost, bool K2Node_DynamicCast_bSuccess_3, class UPanelSlot* CallFunc_SetContent_ReturnValue_1, const struct FFProspectServerInfo& K2Node_CustomEvent_Prospect, bool K2Node_CustomEvent_Active, class UUMG_ButtonBase_C* K2Node_ComponentBoundEvent_Button_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_12, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_13, class UUMG_ButtonBase_C* K2Node_CustomEvent_Button, class UDialogueSystem* CallFunc_GetDialogueSystem_ReturnValue, class UDialogueSystem* CallFunc_GetDialogueSystem_ReturnValue_1, class UDialogueSystem* CallFunc_GetDialogueSystem_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_2, bool CallFunc_IsValid_ReturnValue_3, class UDialogueSystem* CallFunc_GetDialogueSystem_ReturnValue_3, class UUMG_ButtonBase_C* K2Node_ComponentBoundEvent_Button_1, bool CallFunc_ResetProspectView_ReturnValue, int32 K2Node_ComponentBoundEvent_PreviousToggleIndex, int32 K2Node_ComponentBoundEvent_CurrentToggleIndex, enum class EValid CallFunc_GetIcarusPlayerController_IsValid_1, class AIcarusPlayerController* CallFunc_GetIcarusPlayerController_ReturnValue_1, TScriptInterface<class IUIControllerInterface_C> K2Node_DynamicCast_AsUIController_Interface, bool K2Node_DynamicCast_bSuccess_4, bool K2Node_SwitchEnum_CmpSuccess_7, class UUMG_UserInterface_Base_C* CallFunc_GetUserInterface_UserInterface, class UUMG_ConfirmationPopup_C* CallFunc_GetConfirmationWindow_ConfirmationWidget, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_14, const class FString& CallFunc_GetPasswordString_Pasword, const class FString& CallFunc_Concat_StrStr_ReturnValue, const struct FIcarusSession& K2Node_MakeStruct_IcarusSession, enum class EValid CallFunc_GetIcarusPlayerController_IsValid_2, class AIcarusPlayerController* CallFunc_GetIcarusPlayerController_ReturnValue_2, TScriptInterface<class IUIControllerInterface_C> K2Node_DynamicCast_AsUIController_Interface_1, bool K2Node_DynamicCast_bSuccess_5, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_15, class UUMG_UserInterface_Base_C* CallFunc_GetUserInterface_UserInterface_1, class UUMG_ConfirmationPopup_C* CallFunc_GetConfirmationWindow_ConfirmationWidget_1, bool K2Node_SwitchEnum_CmpSuccess_8, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_16, bool K2Node_Event_IsDesignTime, class UUMG_ButtonBase_C* K2Node_ComponentBoundEvent_Button, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_17, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_18, class UUMG_HostProspectsList_C* K2Node_Select_Default);
	void CloseTerminal__DelegateSignature();
	void ProspectsUpdated__DelegateSignature();
};

}


