#pragma once

// Dumped with Dumper-7!


#include "../SDK.hpp"

namespace SDK
{
namespace Params
{
//---------------------------------------------------------------------------------------------------------------------
// PARAMETERS
//---------------------------------------------------------------------------------------------------------------------

// 0x88 (0x88 - 0x0)
// Function UMG_DropPointInformation.UMG_DropPointInformation_C.ConvertAttributeToInfo
struct UUMG_DropPointInformation_C_ConvertAttributeToInfo_Params
{
public:
	enum class EDropAbundance                    Enum;                                              // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2D54[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Text;                                              // 0x8(0x18)(Parm, OutParm)
	bool                                         Negative;                                          // 0x20(0x1)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class EDropAbundance                    Temp_byte_Variable;                                // 0x21(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x22(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2D5D[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Temp_text_Variable;                                // 0x28(0x18)(None)
	class FText                                  Temp_text_Variable_1;                              // 0x40(0x18)(None)
	class FText                                  Temp_text_Variable_2;                              // 0x58(0x18)(None)
	class FText                                  K2Node_Select_Default;                             // 0x70(0x18)(None)
};

// 0x540 (0x540 - 0x0)
// Function UMG_DropPointInformation.UMG_DropPointInformation_C.SetAttributes
struct UUMG_DropPointInformation_C_SetAttributes_Params
{
public:
	TSoftObjectPtr<class UObject>                Temp_softobject_Variable;                          // 0x0(0x28)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class FText                                  Temp_text_Variable;                                // 0x28(0x18)(ConstParm)
	TSoftObjectPtr<class UObject>                Temp_softobject_Variable_1;                        // 0x40(0x28)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class FText                                  Temp_text_Variable_1;                              // 0x68(0x18)(ConstParm)
	TSoftObjectPtr<class UObject>                Temp_softobject_Variable_2;                        // 0x80(0x28)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class FText                                  Temp_text_Variable_2;                              // 0xA8(0x18)(ConstParm)
	TSoftObjectPtr<class UObject>                Temp_softobject_Variable_3;                        // 0xC0(0x28)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class FText                                  Temp_text_Variable_3;                              // 0xE8(0x18)(ConstParm)
	TSoftObjectPtr<class UObject>                Temp_softobject_Variable_4;                        // 0x100(0x28)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class FText                                  Temp_text_Variable_4;                              // 0x128(0x18)(ConstParm)
	TSoftObjectPtr<class UObject>                Temp_softobject_Variable_5;                        // 0x140(0x28)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class FText                                  Temp_text_Variable_5;                              // 0x168(0x18)(ConstParm)
	class UUMG_DropGroupAttribute_C*             CallFunc_Create_ReturnValue;                       // 0x180(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_DropGroupAttribute_C*             CallFunc_Create_ReturnValue_1;                     // 0x188(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_DropGroupAttribute_C*             CallFunc_Create_ReturnValue_2;                     // 0x190(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_DropGroupAttribute_C*             CallFunc_Create_ReturnValue_3;                     // 0x198(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_DropGroupAttribute_C*             CallFunc_Create_ReturnValue_4;                     // 0x1A0(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_DropGroupAttribute_C*             CallFunc_Create_ReturnValue_5;                     // 0x1A8(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_DropGroupAttribute_C*             CallFunc_Create_ReturnValue_6;                     // 0x1B0(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_DropGroupAttribute_C*             CallFunc_Create_ReturnValue_7;                     // 0x1B8(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EDropTemperature                  Temp_byte_Variable;                                // 0x1C0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2F9D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  Temp_text_Variable_6;                              // 0x1C8(0x18)(None)
	class FText                                  Temp_text_Variable_7;                              // 0x1E0(0x18)(None)
	class FText                                  Temp_text_Variable_8;                              // 0x1F8(0x18)(None)
	enum class EDropTemperature                  Temp_byte_Variable_1;                              // 0x210(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_2FA8[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UTexture2D>             Temp_softobject_Variable_6;                        // 0x218(0x28)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>             Temp_softobject_Variable_7;                        // 0x240(0x28)(UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UTexture2D>             Temp_softobject_Variable_8;                        // 0x268(0x28)(UObjectWrapper, HasGetValueTypeHash)
	class UUMG_DropGroupAttribute_C*             CallFunc_Create_ReturnValue_8;                     // 0x290(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TSoftObjectPtr<class UObject>                Temp_softobject_Variable_9;                        // 0x298(0x28)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class FText                                  Temp_text_Variable_9;                              // 0x2C0(0x18)(ConstParm)
	TSoftObjectPtr<class UObject>                Temp_softobject_Variable_10;                       // 0x2D8(0x28)(ConstParm, UObjectWrapper, HasGetValueTypeHash)
	class FText                                  Temp_text_Variable_10;                             // 0x300(0x18)(ConstParm)
	class FText                                  Temp_text_Variable_11;                             // 0x318(0x18)(ConstParm)
	struct FDropGroupCosmeticData                CallFunc_GetDropGroupsStruct_DropGroups;           // 0x330(0xC8)(None)
	enum class EValid                            CallFunc_GetDropGroupsStruct_Paths;                // 0x3F8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_SwitchEnum_CmpSuccess;                      // 0x3F9(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2FEF[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_ConvertAttributeToInfo_Text;              // 0x400(0x18)(None)
	bool                                         CallFunc_ConvertAttributeToInfo_Negative;          // 0x418(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_2FFB[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_ConvertAttributeToInfo_Text_1;            // 0x420(0x18)(None)
	bool                                         CallFunc_ConvertAttributeToInfo_Negative_1;        // 0x438(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3008[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_ConvertAttributeToInfo_Text_2;            // 0x440(0x18)(None)
	bool                                         CallFunc_ConvertAttributeToInfo_Negative_2;        // 0x458(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3010[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_ConvertAttributeToInfo_Text_3;            // 0x460(0x18)(None)
	bool                                         CallFunc_ConvertAttributeToInfo_Negative_3;        // 0x478(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_302A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_ConvertAttributeToInfo_Text_4;            // 0x480(0x18)(None)
	bool                                         CallFunc_ConvertAttributeToInfo_Negative_4;        // 0x498(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_304A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_ConvertAttributeToInfo_Text_5;            // 0x4A0(0x18)(None)
	bool                                         CallFunc_ConvertAttributeToInfo_Negative_5;        // 0x4B8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3055[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_ConvertAttributeToInfo_Text_6;            // 0x4C0(0x18)(None)
	bool                                         CallFunc_ConvertAttributeToInfo_Negative_6;        // 0x4D8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3070[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  CallFunc_ConvertAttributeToInfo_Text_7;            // 0x4E0(0x18)(None)
	bool                                         CallFunc_ConvertAttributeToInfo_Negative_7;        // 0x4F8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_NotEqual_ByteByte_ReturnValue;            // 0x4F9(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_307E[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FText                                  K2Node_Select_Default;                             // 0x500(0x18)(None)
	TSoftObjectPtr<class UTexture2D>             K2Node_Select_Default_1;                           // 0x518(0x28)(UObjectWrapper, HasGetValueTypeHash)
};

// 0x20 (0x20 - 0x0)
// Function UMG_DropPointInformation.UMG_DropPointInformation_C.AddNextAttribute
struct UUMG_DropPointInformation_C_AddNextAttribute_Params
{
public:
	class UWidget*                               Content;                                           // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable;                                // 0x8(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_Not_PreBool_ReturnValue;                  // 0x9(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3188[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UVerticalBox*                          K2Node_Select_Default;                             // 0x10(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UVerticalBoxSlot*                      CallFunc_AddChildToVerticalBox_ReturnValue;        // 0x18(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x8 (0x8 - 0x0)
// Function UMG_DropPointInformation.UMG_DropPointInformation_C.BndEvt__UMG_DropPointInformation_UMG_BasicButton_SelectDrop_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature
struct UUMG_DropPointInformation_C_BndEvt__UMG_DropPointInformation_UMG_BasicButton_SelectDrop_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature_Params
{
public:
	class UUMG_ButtonBase_C*                     Button;                                            // 0x0(0x8)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// 0x1 (0x1 - 0x0)
// Function UMG_DropPointInformation.UMG_DropPointInformation_C.PreConstruct
struct UUMG_DropPointInformation_C_PreConstruct_Params
{
public:
	bool                                         IsDesignTime;                                      // 0x0(0x1)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// 0x10C (0x10C - 0x0)
// Function UMG_DropPointInformation.UMG_DropPointInformation_C.ExecuteUbergraph_UMG_DropPointInformation
struct UUMG_DropPointInformation_C_ExecuteUbergraph_UMG_DropPointInformation_Params
{
public:
	int32                                        EntryPoint;                                        // 0x0(0x4)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         Temp_bool_Variable;                                // 0x4(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_3310[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FDelegateProperty_                           K2Node_CreateDelegate_OutputDelegate;              // 0x8(0x10)(ZeroConstructor, NoDestructor)
	enum class ESlateVisibility                  Temp_byte_Variable;                                // 0x18(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class ESlateVisibility                  Temp_byte_Variable_1;                              // 0x19(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_332F[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UUMGSequencePlayer*                    CallFunc_PlayAnimationForward_ReturnValue;         // 0x20(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMGSequencePlayer*                    CallFunc_PlayAnimationReverse_ReturnValue;         // 0x28(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_ButtonBase_C*                     K2Node_ComponentBoundEvent_Button;                 // 0x30(0x8)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_Event_IsDesignTime;                         // 0x38(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                        Pad_334E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FDropGroupCosmeticData                CallFunc_GetDropGroupsStruct_DropGroups;           // 0x40(0xC8)(None)
	enum class EValid                            CallFunc_GetDropGroupsStruct_Paths;                // 0x108(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                         K2Node_SwitchEnum_CmpSuccess;                      // 0x109(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                         CallFunc_IsValidSoftObjectReference_ReturnValue;   // 0x10A(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor)
	enum class ESlateVisibility                  K2Node_Select_Default;                             // 0x10B(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

}
}


