#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x162 (0x3C2 - 0x260)
// WidgetBlueprintGeneratedClass UMG_ResourceConnectionState.UMG_ResourceConnectionState_C
class UUMG_ResourceConnectionState_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x260(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      NotActiveAnimation;                                // 0x268(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      ProvidingAnimation;                                // 0x270(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      RecievingAnimation;                                // 0x278(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UBorder*                               BaseBacking;                                       // 0x280(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               CheckBacking;                                      // 0x288(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                CheckIcon;                                         // 0x290(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UProgressBar*                          RecievingProgressBar;                              // 0x298(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            RequiresAmountText;                                // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                ResourceIcon;                                      // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FSlateColor                           Red;                                               // 0x2B0(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                           WaterBlue;                                         // 0x2D8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UMaterialInterface*                    FLASE;                                             // 0x300(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUMG_UnlockTooltip_C*                  Tooltip;                                           // 0x308(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                Actor;                                             // 0x310(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	enum class EIcarusResourceType               Type;                                              // 0x318(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_388C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UClass*                                Trait;                                             // 0x320(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UResourceNetworkComponent*             ResourceComponent;                                 // 0x328(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash)
	struct FSlateColor                           EnergyYellow;                                      // 0x330(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                           FuelGreen;                                         // 0x358(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FSlateColor                           OxygenWhite;                                       // 0x380(0x28)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                  Tooltip_Text;                                      // 0x3A8(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         Provider;                                          // 0x3C0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         NetworkHasReceiverFlow;                            // 0x3C1(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class UUMG_ResourceConnectionState_C* GetDefaultObj();

	void UpdateTooltipText(class FText ToolTipText);
	void ResourceComponentUpdated(bool NetworkActive, bool HasNetwork, const struct FLinearColor& Temp_struct_Variable, const struct FLinearColor& Temp_struct_Variable_1, enum class EIcarusResourceType Temp_byte_Variable, const struct FSlateColor& Temp_struct_Variable_2, const struct FSlateColor& Temp_struct_Variable_3, const struct FSlateColor& Temp_struct_Variable_4, bool Temp_bool_Variable, enum class EIcarusResourceType Temp_byte_Variable_1, class UMaterialInterface* Temp_object_Variable, class UMaterialInterface* Temp_object_Variable_1, class UMaterialInterface* Temp_object_Variable_2, class UMaterialInterface* Temp_object_Variable_3, class UMaterialInterface* Temp_object_Variable_4, class UMaterialInterface* Temp_object_Variable_5, class UMaterialInterface* Temp_object_Variable_6, enum class EIcarusResourceType Temp_byte_Variable_2, const struct FLinearColor& Temp_struct_Variable_5, const struct FLinearColor& Temp_struct_Variable_6, const struct FLinearColor& Temp_struct_Variable_7, enum class EIcarusResourceType Temp_byte_Variable_3, class FText Temp_text_Variable, class FText Temp_text_Variable_1, class FText Temp_text_Variable_2, class FText Temp_text_Variable_3, class FText Temp_text_Variable_4, class FText Temp_text_Variable_5, class FText Temp_text_Variable_6, enum class EIcarusResourceType Temp_byte_Variable_4, class FText Temp_text_Variable_7, class FText Temp_text_Variable_8, class FText Temp_text_Variable_9, class FText Temp_text_Variable_10, class FText Temp_text_Variable_11, class FText Temp_text_Variable_12, class FText Temp_text_Variable_13, bool Temp_bool_Variable_1, enum class EIcarusResourceType Temp_byte_Variable_5, class FText Temp_text_Variable_14, class FText Temp_text_Variable_15, class FText Temp_text_Variable_16, class FText Temp_text_Variable_17, class FText Temp_text_Variable_18, class FText Temp_text_Variable_19, class FText Temp_text_Variable_20, enum class EIcarusResourceType Temp_byte_Variable_6, const struct FLinearColor& Temp_struct_Variable_8, const struct FLinearColor& Temp_struct_Variable_9, const struct FLinearColor& Temp_struct_Variable_10, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, class FText CallFunc_MakeLiteralText_ReturnValue, const struct FSlateColor& K2Node_Select_Default, class FText CallFunc_MakeLiteralText_ReturnValue_1, class FText K2Node_Select_Default_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, class UMaterialInterface* K2Node_Select_Default_2, const struct FLinearColor& K2Node_Select_Default_3, const struct FLinearColor& Temp_struct_Variable_11, class FText K2Node_Select_Default_4, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, class FText CallFunc_Format_ReturnValue, class FText K2Node_Select_Default_5, class FText K2Node_Select_Default_6, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_3, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_2, class FText CallFunc_Format_ReturnValue_1, class FText CallFunc_Format_ReturnValue_2, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_4, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_3, class FText CallFunc_Format_ReturnValue_3, class FText K2Node_Select_Default_7, enum class EIcarusResourceType Temp_byte_Variable_7, const struct FLinearColor& K2Node_Select_Default_8, enum class EValid CallFunc_GetTrait_Paths, class UTraitComponent* CallFunc_GetTrait_ReturnValue, class UResourceNetworkComponent* K2Node_DynamicCast_AsResource_Network_Component, bool K2Node_DynamicCast_bSuccess, bool K2Node_SwitchEnum_CmpSuccess, bool Temp_bool_Variable_2, bool CallFunc_BooleanOR_ReturnValue, class UWidgetAnimation* K2Node_Select_Default_9, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue_1, const struct FLinearColor& K2Node_Select_Default_10, enum class EValid CallFunc_GetTrait_Paths_1, class UTraitComponent* CallFunc_GetTrait_ReturnValue_1, bool K2Node_SwitchEnum_CmpSuccess_1, class UResourceNetworkComponent* K2Node_DynamicCast_AsResource_Network_Component_1, bool K2Node_DynamicCast_bSuccess_1, bool CallFunc_HasConnectedNetwork_ReturnValue, bool CallFunc_CanReceiveRequiredNetworkResourceFlow_ReturnValue, const struct FResourceNetworkData& CallFunc_GetResourceNetworkData_OutData, bool CallFunc_GetResourceNetworkData_ReturnValue);
	void ResourceComponentActiveStateChanged(bool IsActive);
	void Setup(class AActor* Actor, enum class EIcarusResourceType Type, bool Temp_bool_Variable, bool Temp_bool_Variable_1, enum class EIcarusResourceType Temp_byte_Variable, const struct FLinearColor& Temp_struct_Variable, const struct FLinearColor& Temp_struct_Variable_1, const struct FLinearColor& Temp_struct_Variable_2, enum class EIcarusResourceType Temp_byte_Variable_1, class UObject* Temp_object_Variable, class UObject* Temp_object_Variable_1, class UObject* Temp_object_Variable_2, class UObject* Temp_object_Variable_3, class UObject* Temp_object_Variable_4, class UObject* Temp_object_Variable_5, class UObject* Temp_object_Variable_6, enum class EIcarusResourceType Temp_byte_Variable_2, class UClass* Temp_class_Variable, class UClass* Temp_class_Variable_1, class UClass* Temp_class_Variable_2, class UClass* Temp_class_Variable_3, class UClass* Temp_class_Variable_4, class UClass* Temp_class_Variable_5, class UClass* Temp_class_Variable_6, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class UClass* K2Node_Select_Default, enum class EValid CallFunc_GetTrait_Paths, class UTraitComponent* CallFunc_GetTrait_ReturnValue, class UResourceNetworkComponent* K2Node_DynamicCast_AsResource_Network_Component, bool K2Node_DynamicCast_bSuccess, bool K2Node_SwitchEnum_CmpSuccess, const struct FResourceNetworkData& CallFunc_GetResourceNetworkData_OutData, bool CallFunc_GetResourceNetworkData_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, const struct FLinearColor& K2Node_Select_Default_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, class FText CallFunc_Format_ReturnValue, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, class FText CallFunc_Format_ReturnValue_1, class FText K2Node_Select_Default_2, class UObject* K2Node_Select_Default_3, bool CallFunc_IsValid_ReturnValue, const struct FSlateBrush& CallFunc_MakeBrushFromTexture_ReturnValue, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush, const struct FSlateBrush& K2Node_Select_Default_4);
	void SetHoverText(bool IsOutdoors, bool IsGreenHouse, bool Temp_bool_Variable, class FText Temp_text_Variable, class FText Temp_text_Variable_1, bool Temp_bool_Variable_1, class FText K2Node_Select_Default, class FText Temp_text_Variable_2, class FText K2Node_Select_Default_1);
	void SetStateStyle(bool Connected, float Multiplier, bool Temp_bool_Variable, float CallFunc_Subtract_FloatFloat_ReturnValue, float CallFunc_Multiply_FloatFloat_ReturnValue, int32 CallFunc_FTrunc_ReturnValue, class UMaterialInterface* Temp_object_Variable, bool CallFunc_GreaterEqual_IntInt_ReturnValue, const class FString& CallFunc_SelectString_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue, class UMaterialInterface* Temp_object_Variable_1, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, class UMaterialInterface* K2Node_Select_Default, class FText CallFunc_Conv_StringToText_ReturnValue, bool Temp_bool_Variable_1, bool Temp_bool_Variable_2, bool Temp_bool_Variable_3, class UTexture2D* Temp_object_Variable_2, class UTexture2D* Temp_object_Variable_3, class UTexture2D* K2Node_Select_Default_1, bool CallFunc_IsValid_ReturnValue, bool Temp_bool_Variable_4, const struct FSlateColor& K2Node_Select_Default_2, bool Temp_bool_Variable_5, const struct FSlateBrush& CallFunc_MakeBrushFromTexture_ReturnValue, const struct FSlateBrush& K2Node_MakeStruct_SlateBrush, const struct FSlateBrush& K2Node_Select_Default_3, const struct FLinearColor& K2Node_Select_Default_4, const struct FSlateColor& K2Node_Select_Default_5);
	void Construct();
	void ExecuteUbergraph_UMG_ResourceConnectionState(int32 EntryPoint, class UUMG_UnlockTooltip_C* CallFunc_Create_ReturnValue);
};

}


