#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xC8 (0x328 - 0x260)
// WidgetBlueprintGeneratedClass UMG_RecipeToolTip.UMG_RecipeToolTip_C
class UUMG_RecipeToolTip_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x260(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UImage*                                Divider;                                           // 0x268(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Divider_1;                                         // 0x270(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        HorizontalBox_176;                                 // 0x278(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            Name;                                              // 0x280(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               NameBorder;                                        // 0x288(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UHorizontalBox*                        OutputBox;                                         // 0x290(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            PossibleOutputs;                                   // 0x298(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                               Spacer;                                            // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                               Spacer_395;                                        // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            TextBlock_216;                                     // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_IcarusGrid_C*                     UMG_IcarusGrid;                                    // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ItemStats_C*                      UMG_ItemStats_C_3;                                 // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ResourceNetworkPreviewContainer_C* UMG_ResourceNetworkPreviewContainer;               // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ValidItemAttachments_C*           UMG_ValidItemAttachments;                          // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	struct FProcessingItem                       Recipe;                                            // 0x2D8(0x24)(Edit, BlueprintVisible, NoDestructor, ExposeOnSpawn)
	uint8                                        Pad_3369[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                LinkedActor;                                       // 0x300(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)
	TArray<class UUMG_RecipeToolTipElement_C*>   ToolTipElements;                                   // 0x308(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	bool                                         UpdateStateRecipe;                                 // 0x318(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         ShowOutput;                                        // 0x319(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                        Pad_3377[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AActor*                                CraftingActor;                                     // 0x320(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UUMG_RecipeToolTip_C* GetDefaultObj();

	void GetAlterationPreview(const struct FItemData& Item, TArray<struct FAlterationsEnum>* CraftedAlterations, TArray<struct FAlterationsEnum>& CallFunc_GetCraftingModificationAlterations_ReturnValue);
	void PreConstruct(bool IsDesignTime);
	void Construct();
	void UpdateTrigger();
	void Tick(const struct FGeometry& MyGeometry, float InDeltaTime);
	void FullUpdate();
	void ExecuteUbergraph_UMG_RecipeToolTip(int32 EntryPoint, class FText Temp_text_Variable, class FText Temp_text_Variable_1, class FText Temp_text_Variable_2, class FText Temp_text_Variable_3, class FText Temp_text_Variable_4, class FText Temp_text_Variable_5, class FText Temp_text_Variable_6, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_1, bool CallFunc_IsValid_ReturnValue, enum class EIcarusResourceType Temp_byte_Variable, int32 Temp_int_Loop_Counter_Variable_2, class UUMG_RecipeToolTipElement_C* CallFunc_Create_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_2, const struct FItemData& Temp_wildcard_Variable, const struct FItemData& Temp_wildcard_Variable_1, const struct FItemableData& CallFunc_GetItemableData_ItemableData, enum class EDataValid CallFunc_GetItemableData_Paths, bool K2Node_SwitchEnum_CmpSuccess, int32 CallFunc_GetItemPropertyValue_IntValue, enum class EDataValid CallFunc_GetItemPropertyValue_Paths, class FText CallFunc_TextToUpper_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_1, class UUMG_RecipeElementImage_C* CallFunc_Create_ReturnValue_1, const struct FItemData& Temp_wildcard_Variable_2, int32 Temp_int_Array_Index_Variable_2, int32 Temp_int_Loop_Counter_Variable_3, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 Temp_int_Array_Index_Variable_3, bool K2Node_Event_IsDesignTime, int32 Temp_int_Array_Index_Variable_4, bool CallFunc_IsRowHandleValid_ReturnValue, class UHorizontalBoxSlot* CallFunc_AddChildToHorizontalBox_ReturnValue, const struct FProcessingItem& K2Node_MakeStruct_ProcessingItem, int32 CallFunc_Array_Add_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, const struct FGeometry& K2Node_Event_MyGeometry, float K2Node_Event_InDeltaTime, int32 Temp_int_Variable, const struct FProcessorRecipe& CallFunc_GetProcessorRecipesStruct_ProcessorRecipes, enum class EValid CallFunc_GetProcessorRecipesStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess_2, bool Temp_bool_Variable, int32 Temp_int_Loop_Counter_Variable_4, int32 CallFunc_Add_IntInt_ReturnValue_4, int32 Temp_int_Loop_Counter_Variable_5, int32 CallFunc_Add_IntInt_ReturnValue_5, class APlayerController* CallFunc_GetPlayerController_ReturnValue, int32 K2Node_Select_Default, TArray<struct FResourceItem>& CallFunc_CreateRecipeInputResourceData_ReturnValue, TArray<struct FItemData>& CallFunc_CreateRecipeOutputItemData_ReturnValue, const struct FResourceItem& CallFunc_Array_Get_Item, const struct FItemData& CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_2, TArray<struct FItemData>& CallFunc_CreateRecipeInputItemData_ReturnValue, const struct FItemData& CallFunc_Array_Get_Item_2, TArray<struct FItemData>& CallFunc_CreateRecipeInputItemData_ReturnValue_1, const struct FItemData& CallFunc_Array_Get_Item_3, bool CallFunc_Array_IsValidIndex_ReturnValue, TArray<struct FItemData>& CallFunc_CreateRecipeOutputItemData_ReturnValue_1, int32 CallFunc_Array_Length_ReturnValue_3, const struct FItemData& CallFunc_Array_Get_Item_4, bool CallFunc_Less_IntInt_ReturnValue_3, bool CallFunc_Array_IsValidIndex_ReturnValue_1, TArray<struct FResourceItem>& CallFunc_CreateRecipeOutputResourceData_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue_1, const struct FResourceItem& CallFunc_Array_Get_Item_5, class APawn* CallFunc_K2_GetPawn_ReturnValue, bool CallFunc_Array_IsValidIndex_ReturnValue_2, class FText K2Node_Select_Default_1, class FText CallFunc_TextToUpper_ReturnValue_1, class UUMG_RecipeToolTipElement_C* CallFunc_Array_Get_Item_6, int32 CallFunc_Array_Length_ReturnValue_4, class UUMG_RecipeToolTipElement_C* CallFunc_Create_ReturnValue_2, bool CallFunc_Less_IntInt_ReturnValue_4, int32 CallFunc_Array_Add_ReturnValue_1, class UHorizontalBoxSlot* CallFunc_AddChildToHorizontalBox_ReturnValue_1, TArray<struct FItemData>& CallFunc_CreateRecipeOutputItemData_ReturnValue_2, const struct FItemData& CallFunc_Array_Get_Item_7, bool CallFunc_Array_IsValidIndex_ReturnValue_3, TArray<struct FAlterationsEnum>& CallFunc_GetAlterationPreview_CraftedAlterations, TArray<struct FItemData>& CallFunc_CreateRecipeOutputItemData_ReturnValue_3, const struct FItemData& CallFunc_Array_Get_Item_8, bool CallFunc_Array_IsValidIndex_ReturnValue_4, int32 Temp_int_Array_Index_Variable_5, class UUMG_RecipeToolTipElement_C* CallFunc_Array_Get_Item_9, const struct FProcessorRecipe& CallFunc_GetProcessorRecipesStruct_ProcessorRecipes_1, enum class EValid CallFunc_GetProcessorRecipesStruct_Paths_1, bool K2Node_SwitchEnum_CmpSuccess_3, const struct FCraftingOutput& CallFunc_Array_Get_Item_10, int32 CallFunc_Array_Length_ReturnValue_5, const struct FItemData& CallFunc_GetItemTemplateStruct_ItemTemplate, enum class EValid CallFunc_GetItemTemplateStruct_Paths, bool CallFunc_Less_IntInt_ReturnValue_5, bool K2Node_SwitchEnum_CmpSuccess_4, TSoftObjectPtr<class UTexture2D> CallFunc_GetItemIcon_Icon, const struct FMargin& K2Node_MakeStruct_Margin);
};

}


