#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x288 (0x4E8 - 0x260)
// WidgetBlueprintGeneratedClass UMG_CharacterInitialization.UMG_CharacterInitialization_C
class UUMG_CharacterInitialization_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x260(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UWidgetAnimation*                      TransitionFade;                                    // 0x268(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      FadeOut;                                           // 0x270(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      AmbientBackground;                                 // 0x278(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UWidgetAnimation*                      FadeIn;                                            // 0x280(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, Transient, IsPlainOldData, RepSkip, NoDestructor, HasGetValueTypeHash)
	class UUMG_BasicButton_2_C*                  BackButton;                                        // 0x288(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UOverlay*                              BackendLoadingScreen;                              // 0x290(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LoadingProgress_C*                CharacterProgress;                                 // 0x298(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       ContentSwitcher;                                   // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LoadingProgress_C*                ProfileProgress;                                   // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_LoadingProgress_C*                ProspectProgress;                                  // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_BasicButton_2_C*                  QuitToDesktopButton;                               // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_BasicButton_2_C*                  UMG_BasicButton_Settings;                          // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_CharacterCreation_C*              UMG_CharacterCreation;                             // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_CharacterSelection_C*             UMG_CharacterSelection;                            // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_RevisionNumber_C*                 UMG_RevisionNumber;                                // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SettingsMenu_C*                   UMG_SettingsMenu;                                  // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Vignette;                                          // 0x2E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	enum class ECharacterCreationMenus           CurrentState;                                      // 0x2F0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4CAF[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class ABP_PlayerPreviewManager_C*            PlayerPreviewManager;                              // 0x2F8(0x8)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FOnlineProfileCharacter>       RetrievedCharacterList;                            // 0x300(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FIcarusProfile                        RetrievedUserProfile;                              // 0x310(0x20)(Edit, BlueprintVisible, DisableEditOnInstance)
	bool                                         UserProfileRetrieved;                              // 0x330(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         ActiveProspectsRetrieved;                          // 0x331(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         CharactersRetrieved;                               // 0x332(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	bool                                         IsComplete;                                        // 0x333(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FProspectListRowHandle                JoinProspectRow;                                   // 0x334(0x18)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	uint8                                        Pad_4D13[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnCharacterChanged;                                // 0x350(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TSoftObjectPtr<class UWorld>                 Diorama_Prospect_Conifer;                          // 0x360(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                 Diorama_Prospect_Cave;                             // 0x388(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                 Diorama_Prospect_Arctic;                           // 0x3B0(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                 Diorama_Hab;                                       // 0x3D8(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                 Diorama_Abandoned;                                 // 0x400(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	bool                                         CanRetryConnection;                                // 0x428(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_4D3A[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FTimerHandle                          ConnectionTimeoutTimerHandle;                      // 0x430(0x8)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	TArray<struct FProspectInfo>                 RetrievedProspects;                                // 0x438(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	TSoftObjectPtr<class UWorld>                 Diorama_Prospect_Desert;                           // 0x448(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                 Diorama_Prospect_Grasslands;                       // 0x470(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                 Diorama_Prospect_Volcanic;                         // 0x498(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)
	TSoftObjectPtr<class UWorld>                 Diorama_Prospect_Swamp;                            // 0x4C0(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UUMG_CharacterInitialization_C* GetDefaultObj();

	void DeletePlayerTrackerSave(int32 Slot, bool AfterCreate, const class FString& SaveName, bool CallFunc_DoesSaveGameExist_ReturnValue, bool CallFunc_DeleteGameInSlot_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, const class FString& CallFunc_GetIcarusPlayerId_ReturnValue, const class FString& CallFunc_GetPlayerTrackerSaveFormat_ReturnValue);
	void ResumeCurrentActiveProspect(const struct FProspectInfo& ProspectInfo, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class ABP_IcarusPlayerControllerSpace_C* K2Node_DynamicCast_AsBP_Icarus_Player_Controller_Space, bool K2Node_DynamicCast_bSuccess);
	void Initialise();
	void CharacterCosmeticsUpdate(bool Success, const struct FOnlineProfileCharacter& UpdatedCharacter);
	void CharacterCreationResult(bool Success);
	void GetChacterSlots(TArray<int32>* ChrSlots, bool* HasCharacter, const TArray<int32>& Slots, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, const struct FOnlineProfileCharacter& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue_1, int32 CallFunc_Array_AddUnique_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue);
	TSoftObjectPtr<class UWorld> GetDioramaForCurrentCharacter(bool Temp_bool_Variable, enum class EProspectLocation Temp_byte_Variable, bool K2Node_SwitchEnum_CmpSuccess, TSoftObjectPtr<class UWorld> K2Node_Select_Default, TSoftObjectPtr<class UWorld> K2Node_Select_Default_1);
	void OnCharacterSelected(const struct FOnlineProfileCharacter& Character, class APlayerController* CallFunc_GetPlayerController_ReturnValue, class ABP_IcarusPlayerControllerSpace_C* K2Node_DynamicCast_AsBP_Icarus_Player_Controller_Space, bool K2Node_DynamicCast_bSuccess);
	void SelectCharacter(const struct FOnlineProfileCharacter& SelectedCharacter, const class FString& CallFunc_Concat_StrStr_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, const class FString& CallFunc_Conv_BoolToString_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue_1, const class FString& CallFunc_Conv_IntToString_ReturnValue_2, const class FString& CallFunc_Concat_StrStr_ReturnValue_1, const class FString& CallFunc_Concat_StrStr_ReturnValue_2, class UGameInstance* CallFunc_GetGameInstance_ReturnValue, const class FString& CallFunc_Concat_StrStr_ReturnValue_3, class UIcarusGameInstance* K2Node_DynamicCast_AsIcarus_Game_Instance, bool K2Node_DynamicCast_bSuccess, const class FString& CallFunc_Concat_StrStr_ReturnValue_4, const class FString& CallFunc_Concat_StrStr_ReturnValue_5, const class FString& CallFunc_Concat_StrStr_ReturnValue_6, const class FString& CallFunc_Concat_StrStr_ReturnValue_7, const class FString& CallFunc_Concat_StrStr_ReturnValue_8, const class FString& CallFunc_Concat_StrStr_ReturnValue_9, const class FString& CallFunc_Concat_StrStr_ReturnValue_10);
	void UpdateCharacterPreview(const struct FCharacterCosmetics& CosmeticData, TSoftObjectPtr<class UWorld> CallFunc_GetDioramaForCurrentCharacter_ReturnValue, bool CallFunc_EqualEqual_SoftObjectReference_ReturnValue, class UWidget* CallFunc_GetActiveWidget_ReturnValue, bool CallFunc_NotEqual_ObjectObject_ReturnValue, TScriptInterface<class ICustomisationWidgetInterface_C> K2Node_DynamicCast_AsCustomisation_Widget_Interface, bool K2Node_DynamicCast_bSuccess, bool CallFunc_BooleanAND_ReturnValue, const struct FPreviewCameraSettingsEnum& CallFunc_GetCameraFocus_CameraFocus);
	void NewCharacterSelected(const struct FOnlineProfileCharacter& SelectedCharacter, class UGameInstance* CallFunc_GetGameInstance_ReturnValue, class UIcarusGameInstance* K2Node_DynamicCast_AsIcarus_Game_Instance, bool K2Node_DynamicCast_bSuccess);
	void HideSettings();
	void ShowSettings();
	void BackButtonPressed(bool CallFunc_EqualEqual_ByteByte_ReturnValue, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue);
	void GenerateCharacterSelectList(bool CreateCharacterIfEmpty, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void ResetContentState();
	void SetContentState(enum class ECharacterCreationMenus State, enum class ECharacterCreationMenus PreviousSettings, bool Temp_bool_Variable, bool CallFunc_EqualEqual_ByteByte_ReturnValue, enum class ESlateVisibility Temp_byte_Variable, enum class ESlateVisibility Temp_byte_Variable_1, bool Temp_bool_Variable_1, enum class ESlateVisibility Temp_byte_Variable_2, enum class ESlateVisibility Temp_byte_Variable_3, bool Temp_bool_Variable_2, enum class ESlateVisibility Temp_byte_Variable_4, enum class ESlateVisibility Temp_byte_Variable_5, int32 CallFunc_Conv_ByteToInt_ReturnValue, enum class ESlateVisibility K2Node_Select_Default, class UUMGSequencePlayer* CallFunc_PlayAnimation_ReturnValue, bool CallFunc_EqualEqual_ByteByte_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, bool CallFunc_NotEqual_ByteByte_ReturnValue, class UWidget* CallFunc_GetActiveWidget_ReturnValue, TScriptInterface<class ICustomisationWidgetInterface_C> K2Node_DynamicCast_AsCustomisation_Widget_Interface, bool K2Node_DynamicCast_bSuccess, const struct FCharacterCosmetics& CallFunc_GetCosmeticData_CosmeticData, bool CallFunc_EqualEqual_ByteByte_ReturnValue_2, bool CallFunc_EqualEqual_ByteByte_ReturnValue_3, enum class ESlateVisibility K2Node_Select_Default_1, enum class ESlateVisibility K2Node_Select_Default_2);
	void OnFail_AA2196B04AC3B92C0431BDB2754010AC(struct FResGetCharacters& Response);
	void OnSuccess_AA2196B04AC3B92C0431BDB2754010AC(struct FResGetCharacters& Response);
	void OnFail_16D5FF39449681E05656E5AEB0E4B6EC(struct FResCreateCharacter& Response);
	void OnSuccess_16D5FF39449681E05656E5AEB0E4B6EC(struct FResCreateCharacter& Response);
	void OnFail_8DEB61DF48DB1B1A9300A098DF26F53D(struct FResDeleteCharacter& Response);
	void OnSuccess_8DEB61DF48DB1B1A9300A098DF26F53D(struct FResDeleteCharacter& Response);
	void OnFail_49458CA04D20AEFC814952AE4F767256(struct FResGetCharacters& Response);
	void OnSuccess_49458CA04D20AEFC814952AE4F767256(struct FResGetCharacters& Response);
	void OnFail_A199ABC24AC7A7F27C5A65A9B3F9E898(struct FResGetAllProspects& Response);
	void OnSuccess_A199ABC24AC7A7F27C5A65A9B3F9E898(struct FResGetAllProspects& Response);
	void OnFail_F77B8CB74F4AF05825B964AC18481892(struct FResUpdateCosmetics& Response);
	void OnSuccess_F77B8CB74F4AF05825B964AC18481892(struct FResUpdateCosmetics& Response);
	void OnFail_BEC856464A75D4A166FC988B8C7226EC(struct FResGetUserProfile& Response);
	void OnSuccess_BEC856464A75D4A166FC988B8C7226EC(struct FResGetUserProfile& Response);
	void OnFail_5EFAF01E48E09C992CF2528296819869(struct FResAbandonProspect& Response);
	void OnSuccess_5EFAF01E48E09C992CF2528296819869(struct FResAbandonProspect& Response);
	void BackSettings(class UUMG_ButtonBase_C* Button);
	void BndEvt__BackButton_K2Node_ComponentBoundEvent_1_Clicked__DelegateSignature(class UUMG_ButtonBase_C* Button);
	void Destruct();
	void QuitGame();
	void RetrieveUserProfile();
	void RetrieveCharacters();
	void OnCreateCharacterRequest(const struct FReqCreateCharacter& CharacterName, int32 NumRetries, bool SelectNewCharacter);
	void BndEvt__QuitToDesktopButton_K2Node_ComponentBoundEvent_2_Clicked__DelegateSignature(class UUMG_ButtonBase_C* Button);
	void OnCharacterDeletionRequest(const struct FOnlineProfileCharacter& Character);
	void RefreshCharacterList();
	void CheckIfAccountRetrieved();
	void BndEvt__UMG_BasicButton_Settings_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature(class UUMG_ButtonBase_C* Button);
	void RetrieveActiveProspects();
	void MoveToHAB();
	void SwapToCharacterCreate();
	void Construct();
	void UpdateConnectingProgress();
	void OnCosmeticUpdateRequest(const struct FReqUpdateCosmetics& Request, int32 Retries);
	void QuitToDesktopCancelled();
	void OnConnectMessageEvent(bool Success);
	void ConnectionTimeout();
	void OnAbandonProspectRequest(const struct FOnlineProfileCharacter& Character, const class FString& ProspectID, bool WillDelete);
	void ExecuteUbergraph_UMG_CharacterInitialization(int32 EntryPoint, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, const struct FResDeleteCharacter& Temp_struct_Variable, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, const class FString& CallFunc_Conv_BoolToString_ReturnValue, const struct FResGetCharacters& K2Node_CustomEvent_Response_9, const struct FResGetCharacters& K2Node_CustomEvent_Response_8, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, const struct FResGetCharacters& Temp_struct_Variable_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_4, const struct FResGetAllProspects& K2Node_CustomEvent_Response_7, const struct FResGetAllProspects& K2Node_CustomEvent_Response_6, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_5, const struct FResGetAllProspects& Temp_struct_Variable_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_6, const struct FResUpdateCosmetics& K2Node_CustomEvent_Response_5, const struct FResUpdateCosmetics& K2Node_CustomEvent_Response_4, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_7, const struct FResUpdateCosmetics& Temp_struct_Variable_3, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_8, const struct FResGetUserProfile& K2Node_CustomEvent_Response_3, const struct FResGetUserProfile& K2Node_CustomEvent_Response_2, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_9, const struct FResGetUserProfile& Temp_struct_Variable_4, const struct FConfirmationPopupDetails& K2Node_MakeStruct_ConfirmationPopupDetails, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_10, const struct FIcarusProfile& K2Node_MakeStruct_IcarusProfile, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_11, const struct FTimerHandle& CallFunc_K2_SetTimerDelegate_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_12, const struct FResAbandonProspect& K2Node_CustomEvent_Response_1, const struct FResAbandonProspect& K2Node_CustomEvent_Response, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_13, const struct FResAbandonProspect& Temp_struct_Variable_5, class USentrySubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue, class USentrySubsystem* CallFunc_GetGameInstanceSubsystem_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_14, class UUMG_ButtonBase_C* K2Node_CustomEvent_Button, class UUMG_ButtonBase_C* K2Node_ComponentBoundEvent_Button_2, class APlayerController* CallFunc_GetPlayerController_ReturnValue, TScriptInterface<class IUIControllerInterface_C> K2Node_DynamicCast_AsUIController_Interface, bool K2Node_DynamicCast_bSuccess, class UUMG_UserInterface_Base_C* CallFunc_GetUserInterface_UserInterface, bool CallFunc_IsValid_ReturnValue, class UUMG_ConfirmationPopup_C* CallFunc_GetConfirmationWindow_ConfirmationWidget, class ABP_PlayerPreviewManager_C* CallFunc_GetActorOfClass_ReturnValue, int32 Temp_int_Variable, bool CallFunc_IsValid_ReturnValue_1, const struct FResGetCharacters& K2Node_CustomEvent_Response_15, const struct FTransform& CallFunc_MakeTransform_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_15, class AActor* CallFunc_BeginDeferredActorSpawnFromClass_ReturnValue, class ABP_PlayerPreviewManager_C* CallFunc_FinishSpawningActor_ReturnValue, const struct FFMODEventInstance& CallFunc_PlayEvent2D_ReturnValue, const struct FResDeleteCharacter& K2Node_CustomEvent_Response_10, const struct FReqGetCharacters& K2Node_MakeStruct_ReqGetCharacters, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_16, class UGetCharactersCallbackProxyGen* CallFunc_GetCharacters_ReturnValue, class APlayerController* CallFunc_GetPlayerController_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_2, const struct FReqCreateCharacter& K2Node_CustomEvent_CharacterName, int32 K2Node_CustomEvent_NumRetries, bool K2Node_CustomEvent_SelectNewCharacter, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData, int32 CallFunc_Subtract_IntInt_ReturnValue, bool CallFunc_Greater_IntInt_ReturnValue, class UCreateCharacterCallbackProxyGen* CallFunc_CreateCharacter_ReturnValue, bool CallFunc_IsValid_ReturnValue_3, class FText CallFunc_Conv_StringToText_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_1, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_17, class FText CallFunc_Format_ReturnValue, class UUMG_ButtonBase_C* K2Node_ComponentBoundEvent_Button_1, const class FString& CallFunc_Conv_TextToString_ReturnValue, const struct FOnlineProfileCharacter& K2Node_CustomEvent_Character_1, const class FString& CallFunc_Conv_BoolToString_ReturnValue_1, const struct FReqDeleteCharacter& K2Node_MakeStruct_ReqDeleteCharacter, const class FString& CallFunc_Conv_BoolToString_ReturnValue_2, class UDeleteCharacterCallbackProxyGen* CallFunc_DeleteCharacter_ReturnValue, const class FString& CallFunc_Conv_IntToString_ReturnValue, TMap<class FString, class FString> K2Node_MakeMap_Map, bool CallFunc_IsValid_ReturnValue_4, const struct FReqGetCharacters& K2Node_MakeStruct_ReqGetCharacters_1, class UGetCharactersCallbackProxyGen* CallFunc_GetCharacters_ReturnValue_1, bool CallFunc_IsValid_ReturnValue_5, class UUMG_ButtonBase_C* K2Node_ComponentBoundEvent_Button, const struct FResDeleteCharacter& K2Node_CustomEvent_Response_11, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_BooleanAND_ReturnValue_1, TArray<int32>& CallFunc_GetChacterSlots_ChrSlots, bool CallFunc_GetChacterSlots_HasCharacter, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_18, const struct FReqGetAllProspects& K2Node_MakeStruct_ReqGetAllProspects, class UGetAllProspectsCallbackProxyGen* CallFunc_GetAllProspects_ReturnValue, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_19, bool CallFunc_IsValid_ReturnValue_6, const struct FResCreateCharacter& Temp_struct_Variable_6, bool CallFunc_IsValid_ReturnValue_7, const class FString& CallFunc_Conv_BoolToString_ReturnValue_3, const class FString& CallFunc_Conv_BoolToString_ReturnValue_4, const class FString& CallFunc_Conv_IntToString_ReturnValue_1, const class FString& CallFunc_Conv_BoolToString_ReturnValue_5, TMap<class FString, class FString> K2Node_MakeMap_Map_1, const struct FResCreateCharacter& K2Node_CustomEvent_Response_12, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_20, const struct FResCreateCharacter& K2Node_CustomEvent_Response_13, int32 Temp_int_Variable_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_21, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_22, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_23, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_24, const struct FReqUpdateCosmetics& K2Node_CustomEvent_Request, int32 K2Node_CustomEvent_Retries, int32 CallFunc_Subtract_IntInt_ReturnValue_1, bool CallFunc_Greater_IntInt_ReturnValue_1, class UUpdateCosmeticsCallbackProxyGen* CallFunc_UpdateCosmetics_ReturnValue, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_2, class FText CallFunc_Conv_StringToText_ReturnValue_1, const struct FFormatArgumentData& K2Node_MakeStruct_FormatArgumentData_3, TArray<struct FFormatArgumentData>& K2Node_MakeArray_Array_1, bool CallFunc_IsValid_ReturnValue_8, class FText CallFunc_Format_ReturnValue_1, const class FString& CallFunc_Conv_TextToString_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_25, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_26, bool K2Node_CustomEvent_Success, class ABP_PlayerPreviewManager_C* Temp_wildcard_Variable, class UIcarusMessageListeners* CallFunc_GetIcarusMessageListeners_ReturnValue, bool CallFunc_IsValid_ReturnValue_9, bool CallFunc_BooleanAND_ReturnValue_2, bool CallFunc_BooleanAND_ReturnValue_3, enum class EValid CallFunc_GetIcarusPlayerController_IsValid, class AIcarusPlayerController* CallFunc_GetIcarusPlayerController_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, const class FString& CallFunc_GetIcarusPlayerId_ReturnValue, enum class EValid CallFunc_GetIcarusPlayerController_IsValid_1, class AIcarusPlayerController* CallFunc_GetIcarusPlayerController_ReturnValue_1, const struct FReqGetUserProfile& K2Node_MakeStruct_ReqGetUserProfile, class ABP_IcarusPlayerControllerSpace_C* K2Node_DynamicCast_AsBP_Icarus_Player_Controller_Space, bool K2Node_DynamicCast_bSuccess_1, class UGetUserProfileCallbackProxyGen* CallFunc_GetUserProfile_ReturnValue, bool CallFunc_IsValid_ReturnValue_10, bool K2Node_SwitchEnum_CmpSuccess_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_27, const struct FOnlineProfileCharacter& K2Node_CustomEvent_Character, const class FString& K2Node_CustomEvent_ProspectId, bool K2Node_CustomEvent_WillDelete, const struct FReqAbandonProspect& K2Node_MakeStruct_ReqAbandonProspect, class UAbandonProspectCallbackProxyGen* CallFunc_AbandonProspect_ReturnValue, const struct FResGetCharacters& Temp_struct_Variable_7, bool CallFunc_IsValid_ReturnValue_11, const struct FResGetCharacters& K2Node_CustomEvent_Response_14);
	void OnCharacterChanged__DelegateSignature();
};

}


