#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x189 (0x3F9 - 0x270)
// WidgetBlueprintGeneratedClass UMG_TalentView_Prospect.UMG_TalentView_Prospect_C
class UUMG_TalentView_Prospect_C : public UTalentViewInterface
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x270(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UHorizontalBox*                        ArchetypeBox;                                      // 0x278(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UWidgetSwitcher*                       GraphWidgetSwitcher;                               // 0x280(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Invertedarrow;                                     // 0x288(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Invertedarrow_1;                                   // 0x290(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Invertedarrow_2;                                   // 0x298(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Invertedarrow_3;                                   // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Noise;                                             // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_PhysicalKeyPrompt_C*              Pan;                                               // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Pattern;                                           // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_PhysicalKeyPrompt_C*              Select_1;                                          // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Shadow;                                            // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Shadow_1;                                          // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_BasicButton_2_C*                  UMG_BasicButton_2;                                 // 0x2D8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_PhysicalKeyPrompt_C*              UMG_PhysicalKeyPrompt;                             // 0x2E0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_SpacePlayerInfo_C*                UMG_SpacePlayerInfo;                               // 0x2E8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_TalentFilter_C*                   UMG_TalentFilter;                                  // 0x2F0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_TerrainSelection_C*               UMG_TerrainSelection;                              // 0x2F8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TArray<class UUMG_TalentArchetype_Player_C*> Buttons;                                           // 0x300(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	class FText                                  AvailableTalents;                                  // 0x310(0x18)(Edit, BlueprintVisible, DisableEditOnInstance)
	struct FLinearColor                          FLASE;                                             // 0x328(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	FMulticastInlineDelegateProperty_            ProspectSelected;                                  // 0x338(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMap<struct FTalentsRowHandle, struct FProspectInfo> ProspectInfos;                                     // 0x348(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	TMap<class FString, struct FTalentsRowHandle> ProspectDTKeys;                                    // 0x398(0x50)(Edit, BlueprintVisible, DisableEditOnInstance)
	FMulticastInlineDelegateProperty_            ProspectListUpdated;                               // 0x3E8(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                         SelectingTerrain;                                  // 0x3F8(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

	static class UClass* StaticClass();
	static class UUMG_TalentView_Prospect_C* GetDefaultObj();

	void OnLockedMissionsUpdated(TArray<struct FTimeLockedMissionInfo>& NewLockedMissions, TArray<struct FTimeLockedMissionInfo>& RemovedLockedMissions, TMap<struct FFactionMissionsRowHandle, struct FTimeLockedMissionInfo> RemovedMissionsMap, TMap<struct FFactionMissionsRowHandle, struct FTimeLockedMissionInfo> NewMissionsMap, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable_2, int32 Temp_int_Loop_Counter_Variable_2, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Loop_Counter_Variable_3, int32 Temp_int_Loop_Counter_Variable_4, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 CallFunc_Add_IntInt_ReturnValue_4, int32 Temp_int_Array_Index_Variable_3, int32 Temp_int_Array_Index_Variable_4, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UTalentGraphWidget* K2Node_DynamicCast_AsTalent_Graph_Widget, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Less_IntInt_ReturnValue, class UTalentTreeWidget* CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Less_IntInt_ReturnValue_1, TArray<struct FTalentsRowHandle>& CallFunc_Map_Keys_Keys, const struct FTalentsRowHandle& CallFunc_Array_Get_Item_2, int32 CallFunc_Array_Length_ReturnValue_2, class UTalentWidget* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_2, class UUMG_Talent_Prospect_C* K2Node_DynamicCast_AsUMG_Talent_Prospect, bool K2Node_DynamicCast_bSuccess_1, class UUMG_Talent_Prospect_C* K2Node_DynamicCast_AsUMG_Talent_Prospect_1, bool K2Node_DynamicCast_bSuccess_2, const struct FTalent& CallFunc_GetTalentsStruct_Talents, enum class EValid CallFunc_GetTalentsStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess, const struct FTimeLockedMissionInfo& CallFunc_Array_Get_Item_3, const struct FProspectListRowHandle& CallFunc_MakeProspectList_ReturnValue, const struct FIcarusProspect& CallFunc_GetProspectListStruct_ProspectList, enum class EValid CallFunc_GetProspectListStruct_Paths, int32 CallFunc_Array_Length_ReturnValue_3, bool K2Node_SwitchEnum_CmpSuccess_1, bool CallFunc_Less_IntInt_ReturnValue_3, const struct FTimeLockedMissionInfo& CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, const struct FTimeLockedMissionInfo& CallFunc_Map_Find_Value_2, bool CallFunc_Map_Find_ReturnValue_2, const struct FTimeLockedMissionInfo& CallFunc_Array_Get_Item_4, int32 CallFunc_Array_Length_ReturnValue_4, bool CallFunc_Less_IntInt_ReturnValue_4);
	class UTalentGraphWidget* GetGraphWidget(class UWidget* CallFunc_GetActiveWidget_ReturnValue, class UTalentGraphWidget* K2Node_DynamicCast_AsTalent_Graph_Widget, bool K2Node_DynamicCast_bSuccess);
	class UTalentGraphWidget* GetGraphWidget_0(class UWidget* CallFunc_GetActiveWidget_ReturnValue, class UTalentGraphWidget* K2Node_DynamicCast_AsTalent_Graph_Widget, bool K2Node_DynamicCast_bSuccess);
	TArray<class UTalentTreeWidget*> GetTalentTreeWidgets(TSet<class UTalentTreeWidget*> Talent_Trees, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, TArray<class UTalentTreeWidget*>& CallFunc_Set_ToArray_Result, TArray<class UWidget*>& CallFunc_GetAllChildren_ReturnValue, class UWidget* CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, class UUMG_TalentGraph_C* K2Node_DynamicCast_AsUMG_Talent_Graph, bool K2Node_DynamicCast_bSuccess, bool CallFunc_Less_IntInt_ReturnValue);
	void Setup(class UTalentModelInterface* TalentModel, const struct FTalentArchetypesRowHandle& CurrentArchetype, int32 Temp_int_Array_Index_Variable, TArray<struct FTalentsRowHandle>& CallFunc_GetTalents_ReturnValue, TArray<struct FTalentArchetypesRowHandle>& CallFunc_GetArchetypes_ReturnValue, const struct FTalentArchetypesRowHandle& CallFunc_Array_Get_Item, const struct FTalentArchetypesRowHandle& CallFunc_Array_Get_Item_1, int32 CallFunc_Array_Length_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_Greater_IntInt_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue, int32 Temp_int_Loop_Counter_Variable, class UUMG_TalentGraph_C* CallFunc_Create_ReturnValue, class UPanelSlot* CallFunc_AddChild_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, class UUMG_TalentArchetype_Player_C* CallFunc_Create_ReturnValue_1, const struct FSlateChildSize& K2Node_MakeStruct_SlateChildSize, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, int32 CallFunc_Array_Add_ReturnValue, class UHorizontalBoxSlot* CallFunc_AddChildToHorizontalBox_ReturnValue);
	void OnFail_FEA0825340002E0EB468BBA81BA64A6F(struct FResGenerateProspects& Response);
	void OnSuccess_FEA0825340002E0EB468BBA81BA64A6F(struct FResGenerateProspects& Response);
	void OnClick(const struct FTalentArchetypesRowHandle& Archetype);
	void OnModelViewChanged(class UTalentModelInterface* InModel, class UTalentViewInterface* InView);
	void BndEvt__UMG_BasicButton_2_K2Node_ComponentBoundEvent_0_Clicked__DelegateSignature(class UUMG_ButtonBase_C* Button);
	void ProspectClicked(const struct FTalentsRowHandle& Talent);
	void GenerateProspects(TArray<struct FTalentsRowHandle>& ProspectTalentRowHandles);
	void BndEvt__UMG_TalentView_Prospect_UMG_TerrainSelection_K2Node_ComponentBoundEvent_4_TalentArchetypeSelected__DelegateSignature(const struct FTalentArchetypesRowHandle& Archetype);
	void UpdateTerrainSelection();
	void ReturnToTerrainSelection();
	void Construct();
	void SetSelectedArchetype(struct FTalentArchetypesRowHandle& Archetype);
	void SetEncryptedState(enum class EOnProspectAvailability Status);
	void SetIsOpenWorld(bool OpenWorld);
	void ExecuteUbergraph_UMG_TalentView_Prospect(int32 EntryPoint, class UWidget* CallFunc_GetActiveWidget_ReturnValue, bool Temp_bool_Variable, class UUMG_TalentGraph_C* K2Node_DynamicCast_AsUMG_Talent_Graph, bool K2Node_DynamicCast_bSuccess, enum class ESlateVisibility Temp_byte_Variable, int32 CallFunc_Array_Length_ReturnValue, enum class ESlateVisibility Temp_byte_Variable_1, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable_1, int32 Temp_int_Loop_Counter_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue_1, const struct FResGenerateProspects& Temp_struct_Variable, int32 Temp_int_Array_Index_Variable_2, int32 CallFunc_Array_Length_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_2, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 Temp_int_Array_Index_Variable_3, int32 Temp_int_Array_Index_Variable_4, int32 Temp_int_Loop_Counter_Variable_3, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue_3, int32 Temp_int_Array_Index_Variable_5, const struct FResGenerateProspects& K2Node_CustomEvent_Response, class UTalentTreeWidget* CallFunc_Array_Get_Item, TArray<struct FTalentsRowHandle>& CallFunc_Map_Keys_Keys, int32 CallFunc_Array_Length_ReturnValue_2, int32 Temp_int_Loop_Counter_Variable_4, int32 Temp_int_Loop_Counter_Variable_5, bool CallFunc_Less_IntInt_ReturnValue_1, int32 CallFunc_Add_IntInt_ReturnValue_4, int32 CallFunc_Add_IntInt_ReturnValue_5, int32 Temp_int_Array_Index_Variable_6, const struct FTalentsRowHandle& CallFunc_Array_Get_Item_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate, class UTalentWidget* CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, class UUMG_Talent_Prospect_C* K2Node_DynamicCast_AsUMG_Talent_Prospect, bool K2Node_DynamicCast_bSuccess_1, const struct FTalentArchetypesRowHandle& K2Node_CustomEvent_Archetype_1, class UTalentModelInterface_Const* CallFunc_GetModel_ReturnValue, class UUMG_TalentArchetype_Player_C* CallFunc_Array_Get_Item_2, TArray<struct FTalentArchetypesRowHandle>& CallFunc_GetArchetypes_ReturnValue, int32 CallFunc_Array_Find_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_3, class UTalentModelInterface* K2Node_Event_InModel, class UTalentViewInterface* K2Node_Event_InView, class UUMG_ButtonBase_C* K2Node_ComponentBoundEvent_Button, TScriptInterface<class ITalentControllerInterface> CallFunc_GetController_ReturnValue, int32 Temp_int_Array_Index_Variable_7, const struct FProspectInfo& CallFunc_Array_Get_Item_3, const struct FTalentsRowHandle& K2Node_CustomEvent_Talent, TArray<struct FTalentsRowHandle>& K2Node_CustomEvent_ProspectTalentRowHandles, const struct FTalentsRowHandle& CallFunc_Array_Get_Item_4, const struct FTalent& CallFunc_GetTalentsStruct_Talents, enum class EValid CallFunc_GetTalentsStruct_Paths, int32 CallFunc_Array_Length_ReturnValue_4, bool K2Node_SwitchEnum_CmpSuccess, bool CallFunc_Less_IntInt_ReturnValue_2, int32 Temp_int_Loop_Counter_Variable_6, const class FString& CallFunc_Conv_NameToString_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_3, int32 CallFunc_Add_IntInt_ReturnValue_6, const struct FTalentsRowHandle& CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, const struct FProspectInfo& CallFunc_Map_Find_Value_2, bool CallFunc_Map_Find_ReturnValue_2, const struct FFProspectServerInfo& K2Node_MakeStruct_FProspectServerInfo, TArray<class FString>& CallFunc_Map_Keys_Keys_1, const struct FReqGenerateProspects& K2Node_MakeStruct_ReqGenerateProspects, class UGenerateProspectsCallbackProxyGen* CallFunc_GenerateProspects_ReturnValue, class UTalentModelInterface_Const* CallFunc_GetModel_ReturnValue_1, TArray<struct FTalentArchetypesRowHandle>& CallFunc_GetArchetypes_ReturnValue_1, bool CallFunc_IsValid_ReturnValue, const struct FTalentArchetypesRowHandle& K2Node_ComponentBoundEvent_Archetype, enum class ESlateVisibility K2Node_Select_Default, const struct FTalentArchetypesRowHandle& K2Node_CustomEvent_Archetype, bool CallFunc_IsWithEditor_ReturnValue, int32 CallFunc_Array_Find_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable_7, TArray<class FString>& CallFunc_Map_Keys_Keys_2, bool CallFunc_Less_IntInt_ReturnValue_4, const class FString& CallFunc_Array_Get_Item_5, class FName CallFunc_Conv_StringToName_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_5, const struct FProspectListRowHandle& CallFunc_MakeProspectList_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_5, const struct FIcarusProspect& CallFunc_GetProspectListStruct_ProspectList, enum class EValid CallFunc_GetProspectListStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess_1, int32 CallFunc_Add_IntInt_ReturnValue_7, const class FString& CallFunc_Conv_NameToString_ReturnValue_1, const struct FProspectInfo& K2Node_MakeStruct_ProspectInfo, const struct FTalentsRowHandle& CallFunc_Map_Find_Value_3, bool CallFunc_Map_Find_ReturnValue_3, const struct FResGenerateProspects& K2Node_CustomEvent_Response_1, enum class EOnProspectAvailability K2Node_CustomEvent_Status, class UWidget* CallFunc_GetActiveWidget_ReturnValue_1, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_1, class UUMG_TalentGraph_C* K2Node_DynamicCast_AsUMG_Talent_Graph_1, bool K2Node_DynamicCast_bSuccess_2, class AGameStateBase* CallFunc_GetGameState_ReturnValue, class UTalentTreeWidget* CallFunc_Array_Get_Item_6, class AIcarusGameStateSurvival* K2Node_DynamicCast_AsIcarus_Game_State_Survival, bool K2Node_DynamicCast_bSuccess_3, TArray<struct FTalentsRowHandle>& CallFunc_Map_Keys_Keys_3, int32 CallFunc_Array_Length_ReturnValue_6, const struct FTalentsRowHandle& CallFunc_Array_Get_Item_7, bool CallFunc_Less_IntInt_ReturnValue_6, class UTalentWidget* CallFunc_Map_Find_Value_4, bool CallFunc_Map_Find_ReturnValue_4, class UUMG_Talent_Prospect_C* K2Node_DynamicCast_AsUMG_Talent_Prospect_1, bool K2Node_DynamicCast_bSuccess_4, int32 CallFunc_Array_Length_ReturnValue_7, bool CallFunc_Less_IntInt_ReturnValue_7, FDelegateProperty_ K2Node_CreateDelegate_OutputDelegate_2, TArray<struct FTimeLockedMissionInfo>& K2Node_MakeArray_Array, bool K2Node_CustomEvent_OpenWorld);
	void ProspectListUpdated__DelegateSignature();
	void ProspectSelected__DelegateSignature(const struct FFProspectServerInfo& ProspectInfo);
};

}


