#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x29C (0x4FC - 0x260)
// WidgetBlueprintGeneratedClass UMG_ItemStats.UMG_ItemStats_C
class UUMG_ItemStats_C : public UUserWidget
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x260(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	class UBorder*                               AlterationBorder;                                  // 0x268(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          AlterationList;                                    // 0x270(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               AttachmentSlot;                                    // 0x278(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UTextBlock*                            Description;                                       // 0x280(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UImage*                                Divider_2;                                         // 0x288(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               ModifierBorder;                                    // 0x290(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          ModifierList;                                      // 0x298(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               SetBonus;                                          // 0x2A0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          SetBonusList;                                      // 0x2A8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                               SetBonusSpacer;                                    // 0x2B0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UVerticalBox*                          StatList;                                          // 0x2B8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UBorder*                               StatsBorder;                                       // 0x2C0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class USpacer*                               StatsSpacer;                                       // 0x2C8(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	class UUMG_ToolDamage_C*                     UMG_ToolDamage;                                    // 0x2D0(0x8)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	bool                                         IsSetBonus;                                        // 0x2D8(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	bool                                         IsSetBonusActive;                                  // 0x2D9(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                        Pad_1D43[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FItemData                             Item;                                              // 0x2E0(0x1F0)(Edit, BlueprintVisible, DisableEditOnInstance, ContainsInstancedReference)
	struct FStatsEnum                            Affliction_Stat;                                   // 0x4D0(0x10)(Edit, BlueprintVisible, DisableEditOnInstance, HasGetValueTypeHash)
	bool                                         ConsumableModifier;                                // 0x4E0(0x1)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                        Pad_1D49[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FAlterationsEnum>              AlterationPreview;                                 // 0x4E8(0x10)(Edit, BlueprintVisible, DisableEditOnInstance)
	float                                        ArbitraryStatMultiplier;                           // 0x4F8(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn, HasGetValueTypeHash)

	static class UClass* StaticClass();
	static class UUMG_ItemStats_C* GetDefaultObj();

	void Has_Any_Visible_Stats(bool* HasStats, bool CallFunc_AnyChildrenVisible_ReturnValue, bool CallFunc_AnyChildrenVisible_ReturnValue_1, bool CallFunc_BooleanOR_ReturnValue, bool CallFunc_AnyChildrenVisible_ReturnValue_2, bool CallFunc_BooleanOR_ReturnValue_1);
	void Update_Building_Type_Stats(const struct FBuildingTypesRowHandle& BuildingTypeRow, TMap<struct FStatsEnum, int32> CallFunc_GetBuildingTypePopupStats_Stats, TArray<int32>& CallFunc_Map_Values_Values, TArray<struct FStatsEnum>& CallFunc_Map_Keys_Keys, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_HasAnyChildren_ReturnValue, int32 Temp_int_Loop_Counter_Variable, class UUMG_StatDescription_C* CallFunc_Create_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, class UPanelSlot* CallFunc_AddChild_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, int32 Temp_int_Array_Index_Variable, int32 CallFunc_Array_Get_Item, const struct FStatsEnum& CallFunc_Array_Get_Item_1, int32 CallFunc_ApplyArbitraryMultiplier_OutModifiedStat, bool CallFunc_HasStatDescription_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void ApplyArbitraryMultiplier(int32 InStat, int32* OutModifiedStat, int32 Temp_wildcard_Variable, int32 CallFunc_SignOfInteger_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue, float CallFunc_Multiply_IntFloat_ReturnValue, int32 CallFunc_FCeil_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue, bool CallFunc_BooleanAND_ReturnValue);
	void UpdateAlterations(const TArray<struct FAlterationsEnum>& CombinedAlterations, class UUMG_AlterationDescription_C* CallFunc_Create_ReturnValue, class UUMG_AlterationDescription_C* CallFunc_Create_ReturnValue_1, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Loop_Counter_Variable, bool CallFunc_EqualEqual_IntInt_ReturnValue, int32 CallFunc_Add_IntInt_ReturnValue, const struct FAlterationsEnum& CallFunc_Array_Get_Item, int32 CallFunc_Array_Length_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue, bool CallFunc_HasAnyChildren_ReturnValue, bool CallFunc_HasAnyChildren_ReturnValue_1, bool CallFunc_Not_PreBool_ReturnValue, bool CallFunc_Not_PreBool_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, int32 CallFunc_GetChildrenCount_ReturnValue, bool CallFunc_EqualEqual_IntInt_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue_1, class UVerticalBoxSlot* CallFunc_AddChildToVerticalBox_ReturnValue, class UVerticalBoxSlot* CallFunc_AddChildToVerticalBox_ReturnValue_1, TArray<struct FAlterationsEnum>& CallFunc_GetItemAlterations_Alterations, bool CallFunc_ItemMatchesQuery_ReturnValue, const struct FInventoryContainerData& CallFunc_GetInventoryContainerData_InventoryContainerData, enum class EDataValid CallFunc_GetInventoryContainerData_Paths, const struct FItemData& CallFunc_GetItemAttachment_Attachment, enum class EDataValid CallFunc_GetItemAttachment_Paths, bool K2Node_SwitchEnum_CmpSuccess, bool K2Node_SwitchEnum_CmpSuccess_1, const struct FIcarusAttachment& CallFunc_GetItemAttachmentData_Attachment, enum class EDataValid CallFunc_GetItemAttachmentData_Paths, bool K2Node_SwitchEnum_CmpSuccess_2, const struct FAlterationsEnum& CallFunc_RowHandleToStruct_ReturnValue);
	void Update(const struct FItemData& Item, TMap<struct FStatsEnum, int32> Stats, const struct FStatAfflictionsRowHandle& StatAfflication, int32 Temp_int_Variable, const struct FStatAfflictionsEnum& CallFunc_IntToStruct_ReturnValue, const struct FStatAfflictionsRowHandle& CallFunc_StructToRowHandle_ReturnValue, int32 Temp_int_Variable_1, int32 CallFunc_Add_IntInt_ReturnValue, const struct FStatAfflictions& CallFunc_GetStatAfflictionsStruct_StatAfflictions, enum class EValid CallFunc_GetStatAfflictionsStruct_Paths, class UUMG_ArmourSet_C* CallFunc_Create_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess, class UUMG_StatDescription_C* CallFunc_Create_ReturnValue_1, int32 Temp_int_Loop_Counter_Variable, int32 CallFunc_Add_IntInt_ReturnValue_1, int32 Temp_int_Array_Index_Variable, int32 Temp_int_Array_Index_Variable_1, const struct FStatsEnum& Temp_struct_Variable, int32 CallFunc_Map_Find_Value, bool CallFunc_Map_Find_ReturnValue, const struct FConsumableData& CallFunc_GetConsumableData_ConsumableData, enum class EDataValid CallFunc_GetConsumableData_Paths, bool K2Node_SwitchEnum_CmpSuccess_1, bool CallFunc_IsRowHandleValid_ReturnValue, const struct FModifierStateData& CallFunc_GetModifierStatesStruct_ModifierStates, enum class EValid CallFunc_GetModifierStatesStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess_2, class UPanelSlot* CallFunc_AddChild_ReturnValue, bool CallFunc_HasAnyChildren_ReturnValue, class UUMG_ModifierDescription_C* CallFunc_Create_ReturnValue_2, enum class EValid CallFunc_GetIcarusPlayerCharacter_IsValid, class AIcarusPlayerCharacter* CallFunc_GetIcarusPlayerCharacter_ReturnValue, class UVerticalBoxSlot* CallFunc_AddChildToVerticalBox_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_3, class UVerticalBoxSlot* CallFunc_AddChildToVerticalBox_ReturnValue_1, const struct FArmourData& CallFunc_GetArmourData_ArmourData, enum class EDataValid CallFunc_GetArmourData_Paths, int32 CallFunc_NumRows_ReturnValue, bool K2Node_SwitchEnum_CmpSuccess_4, bool CallFunc_Less_IntInt_ReturnValue, int32 CallFunc_GetEquippedArmourSet_ReturnValue, const struct FArmourSet& CallFunc_GetArmourSetsStruct_ArmourSets, enum class EValid CallFunc_GetArmourSetsStruct_Paths, bool K2Node_SwitchEnum_CmpSuccess_5, int32 Temp_int_Loop_Counter_Variable_1, const struct FArmourSetBonusRowHandle& CallFunc_Array_Get_Item, int32 CallFunc_Add_IntInt_ReturnValue_2, int32 CallFunc_Array_Length_ReturnValue, class UUMG_ModifierDescription_C* CallFunc_Create_ReturnValue_3, bool CallFunc_Less_IntInt_ReturnValue_1, class UVerticalBoxSlot* CallFunc_AddChildToVerticalBox_ReturnValue_2, const struct FStatsEnum& Temp_struct_Variable_1, TMap<struct FStatsEnum, int32> CallFunc_GetItemPopupStats_Stats, int32 CallFunc_Map_Find_Value_1, bool CallFunc_Map_Find_ReturnValue_1, TArray<int32>& CallFunc_Map_Values_Values, TArray<struct FStatsEnum>& CallFunc_Map_Keys_Keys, int32 CallFunc_Array_Get_Item_1, const struct FStatsEnum& CallFunc_Array_Get_Item_2, int32 CallFunc_ApplyArbitraryMultiplier_OutModifiedStat, bool CallFunc_EqualEqual_EnumEnum_ReturnValue, bool CallFunc_HasStatDescription_ReturnValue, bool CallFunc_NotEqual_IntInt_ReturnValue, int32 CallFunc_Array_Length_ReturnValue_1, bool CallFunc_BooleanAND_ReturnValue, bool CallFunc_Less_IntInt_ReturnValue_2);
	void BP_OnEntryReleased();
	void BP_OnItemExpansionChanged(bool bIsExpanded);
	void BP_OnItemSelectionChanged(bool bIsSelected);
	void ExecuteUbergraph_UMG_ItemStats(int32 EntryPoint, bool K2Node_Event_bIsSelected, bool K2Node_Event_bIsExpanded);
};

}


