#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x8 (0x830 - 0x828)
// Class Goat2.GGCineCameraActor
class AGGCineCameraActor : public ACineCameraActor
{
public:
	bool                                         bShouldHideUI;                                     // 0x828(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_713[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AGGCineCameraActor* GetDefaultObj();

};

// 0x58 (0x88 - 0x30)
// Class Goat2.AnimNotifyState_GGAnimationActor
class UAnimNotifyState_GGAnimationActor : public UAnimNotifyState
{
public:
	TSubclassOf<class AActor>                    AnimationActorClass;                               // 0x30(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideMesh;                                     // 0x38(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_719[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMesh*                           OverrideStaticMesh;                                // 0x40(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                         OverrideSkeletalMesh;                              // 0x48(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  SocketName;                                        // 0x50(0x8)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               RelativeLocation;                                  // 0x58(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              RelativeRotation;                                  // 0x64(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                               ActorScale;                                        // 0x70(0xC)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDropOnRagdoll;                                    // 0x7C(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRemoveOnRagdoll;                                  // 0x7D(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_71D[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DroppedLifespan;                                   // 0x80(0x4)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideRightHandActor;                               // 0x84(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideLeftHandActor;                                // 0x85(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_71F[0x2];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotifyState_GGAnimationActor* GetDefaultObj();

};

// 0x8 (0x38 - 0x30)
// Class Goat2.AnimNotifyState_GGBlockTurning
class UAnimNotifyState_GGBlockTurning : public UAnimNotifyState
{
public:
	enum class EHeadTurning                      BlockState;                                        // 0x30(0x1)(Edit, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_725[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UAnimNotifyState_GGBlockTurning* GetDefaultObj();

};

// 0x38 (0xA0 - 0x68)
// Class Goat2.BTDecorator_GGActorIsType
class UBTDecorator_GGActorIsType : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                ActorToCheck;                                      // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)
	TArray<enum class ECheckTypes>               TypesToCheck;                                      // 0x90(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGActorIsType* GetDefaultObj();

};

// 0x0 (0x68 - 0x68)
// Class Goat2.BTDecorator_GGBase
class UBTDecorator_GGBase : public UBTDecorator
{
public:

	static class UClass* StaticClass();
	static class UBTDecorator_GGBase* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGBuyerAtStall
class UBTDecorator_GGBuyerAtStall : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                CurrentEvent;                                      // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGBuyerAtStall* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGCanBeInteracted
class UBTDecorator_GGCanBeInteracted : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                InteractActor;                                     // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGCanBeInteracted* GetDefaultObj();

};

// 0x30 (0x98 - 0x68)
// Class Goat2.BTDecorator_GGCanChangeMood
class UBTDecorator_GGCanChangeMood : public UBTDecorator_GGBase
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)
	enum class EMoods                            MoodToChangeToo;                                   // 0x90(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_731[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_GGCanChangeMood* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGCanFaint
class UBTDecorator_GGCanFaint : public UBTDecorator_GGBase
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTDecorator_GGCanFaint* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGCanPanic
class UBTDecorator_GGCanPanic : public UBTDecorator_GGBase
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTDecorator_GGCanPanic* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGCanRoam
class UBTDecorator_GGCanRoam : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                VehicleToCheck;                                    // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGCanRoam* GetDefaultObj();

};

// 0x8 (0x70 - 0x68)
// Class Goat2.BTDecorator_GGCanSwitchToRoaming
class UBTDecorator_GGCanSwitchToRoaming : public UBTDecorator_GGBase
{
public:
	enum class ERoamAfterDisturbed               Reason;                                            // 0x68(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_74D[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_GGCanSwitchToRoaming* GetDefaultObj();

};

// 0x8 (0x70 - 0x68)
// Class Goat2.BTDecorator_GGChanceToSucceed
class UBTDecorator_GGChanceToSucceed : public UBTDecorator
{
public:
	float                                        ChanceToSucceed;                                   // 0x68(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_751[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_GGChanceToSucceed* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGCharacterIsRidden
class UBTDecorator_GGCharacterIsRidden : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                Character;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGCharacterIsRidden* GetDefaultObj();

};

// 0x48 (0xB0 - 0x68)
// Class Goat2.BTDecorator_GGCheckNPCIdTags
class UBTDecorator_GGCheckNPCIdTags : public UBTDecorator_GGBase
{
public:
	struct FBlackboardKeySelector                NPCToCheck;                                        // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 TagsToCheckFor;                                    // 0x90(0x20)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTDecorator_GGCheckNPCIdTags* GetDefaultObj();

};

// 0x48 (0xB0 - 0x68)
// Class Goat2.BTDecorator_GGCheckPActorIdTags
class UBTDecorator_GGCheckPActorIdTags : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                PActorToCheck;                                     // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 TagsToCheckFor;                                    // 0x90(0x20)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTDecorator_GGCheckPActorIdTags* GetDefaultObj();

};

// 0x48 (0xB0 - 0x68)
// Class Goat2.BTDecorator_GGCheckWaypointTag
class UBTDecorator_GGCheckWaypointTag : public UBTDecorator_GGBase
{
public:
	struct FBlackboardKeySelector                Waypoint;                                          // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 TagsToCheckFor;                                    // 0x90(0x20)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTDecorator_GGCheckWaypointTag* GetDefaultObj();

};

// 0x68 (0xD0 - 0x68)
// Class Goat2.BTDecorator_GGCompareFloats
class UBTDecorator_GGCompareFloats : public UBTDecorator
{
public:
	enum class EBTGGBlackboardRestart            NotifyObserver;                                    // 0x68(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class ECompareMode                      CompareMode;                                       // 0x69(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_781[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                FloatValue;                                        // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)
	bool                                         UseBlackboardFloat;                                // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_785[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                BlackboardFloat;                                   // 0xA0(0x28)(Edit, NativeAccessSpecifierPrivate)
	float                                        LiteralFloat;                                      // 0xC8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_788[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_GGCompareFloats* GetDefaultObj();

};

// 0x30 (0x98 - 0x68)
// Class Goat2.BTDecorator_GGContainerHasData
class UBTDecorator_GGContainerHasData : public UBTDecorator_GGBase
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)
	enum class EEnvContainerData                 DataToCheckFor;                                    // 0x90(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_792[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_GGContainerHasData* GetDefaultObj();

};

// 0x60 (0xC8 - 0x68)
// Class Goat2.BTDecorator_GGDistanceLessThan
class UBTDecorator_GGDistanceLessThan : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                ElementOne;                                        // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)
	bool                                         bElementOneClosestOnCollision;                     // 0x90(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_79B[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                ElementTwo;                                        // 0x98(0x28)(Edit, NativeAccessSpecifierPrivate)
	bool                                         bElementTwoClosestOnCollision;                     // 0xC0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_79E[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CompareValue;                                      // 0xC4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGDistanceLessThan* GetDefaultObj();

};

// 0x40 (0xA8 - 0x68)
// Class Goat2.BTDecorator_GGGoatHasGear
class UBTDecorator_GGGoatHasGear : public UBTDecorator_GGBase
{
public:
	struct FBlackboardKeySelector                TargetActor;                                       // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)
	TArray<class FString>                        GearToCheckFor;                                    // 0x90(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bRequireAllInArray;                                // 0xA0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7AB[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_GGGoatHasGear* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGHasActorInHand
class UBTDecorator_GGHasActorInHand : public UBTDecorator
{
public:
	enum class EAttachmentHandSlot               HandToCheck;                                       // 0x68(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_7B8[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 PActorWithTheseTags;                               // 0x70(0x20)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGHasActorInHand* GetDefaultObj();

};

// 0x30 (0x98 - 0x68)
// Class Goat2.BTDecorator_GGHasAnimState
class UBTDecorator_GGHasAnimState : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)
	enum class ENPCAnimationStates               StateToCheckFor;                                   // 0x90(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_7C9[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_GGHasAnimState* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGHasGrabCharacter
class UBTDecorator_GGHasGrabCharacter : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGHasGrabCharacter* GetDefaultObj();

};

// 0x30 (0x98 - 0x68)
// Class Goat2.BTDecorator_GGHasMood
class UBTDecorator_GGHasMood : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)
	enum class EMoods                            MoodToCheckAgainst;                                // 0x90(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_7DD[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_GGHasMood* GetDefaultObj();

};

// 0x0 (0x68 - 0x68)
// Class Goat2.BTDecorator_GGHasScaryLoc
class UBTDecorator_GGHasScaryLoc : public UBTDecorator
{
public:

	static class UClass* StaticClass();
	static class UBTDecorator_GGHasScaryLoc* GetDefaultObj();

};

// 0x30 (0x98 - 0x68)
// Class Goat2.BTDecorator_GGHasStatusEffect
class UBTDecorator_GGHasStatusEffect : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                TestActor;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)
	enum class EStatusEffectTypes                StatusEffectType;                                  // 0x90(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_7EA[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_GGHasStatusEffect* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGHeadbuttedRecently
class UBTDecorator_GGHeadbuttedRecently : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                VehicleToCheck;                                    // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGHeadbuttedRecently* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGInVehicle
class UBTDecorator_GGInVehicle : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGInVehicle* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGInWater
class UBTDecorator_GGInWater : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                Self;                                              // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGInWater* GetDefaultObj();

};

// 0x8 (0x98 - 0x90)
// Class Goat2.BTDecorator_GGIsA
class UBTDecorator_GGIsA : public UBTDecorator_BlackboardBase
{
public:
	class UClass*                                ClassToCheck;                                      // 0x90(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsA* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGIsActorInSight
class UBTDecorator_GGIsActorInSight : public UBTDecorator_GGBase
{
public:
	struct FBlackboardKeySelector                TargetActor;                                       // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsActorInSight* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGIsActorPooled
class UBTDecorator_GGIsActorPooled : public UBTDecorator_GGBase
{
public:
	struct FBlackboardKeySelector                Actor;                                             // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsActorPooled* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGIsEventEnabled
class UBTDecorator_GGIsEventEnabled : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                TargetActor;                                       // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsEventEnabled* GetDefaultObj();

};

// 0x38 (0xA0 - 0x68)
// Class Goat2.BTDecorator_GGIsEventOnCooldown
class UBTDecorator_GGIsEventOnCooldown : public UBTDecorator
{
public:
	struct FGameplayTag                          EventTag;                                          // 0x68(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCheckForActorCooldown;                            // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_868[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                CooldownActor;                                     // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsEventOnCooldown* GetDefaultObj();

};

// 0x58 (0xC0 - 0x68)
// Class Goat2.BTDecorator_GGIsFacingDirection
class UBTDecorator_GGIsFacingDirection : public UBTDecorator
{
public:
	float                                        Precision;                                         // 0x68(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_87A[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                SelfActor;                                         // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                TargetDirection;                                   // 0x98(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsFacingDirection* GetDefaultObj();

};

// 0x30 (0x98 - 0x68)
// Class Goat2.BTDecorator_GGIsGender
class UBTDecorator_GGIsGender : public UBTDecorator_GGBase
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)
	enum class EGender                           IsGender;                                          // 0x90(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_88C[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsGender* GetDefaultObj();

};

// 0x30 (0x98 - 0x68)
// Class Goat2.BTDecorator_GGIsGoatEmoting
class UBTDecorator_GGIsGoatEmoting : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                TargetActor;                                       // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)
	class UGGGoatEmote*                          EmoteToCheckFor;                                   // 0x90(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsGoatEmoting* GetDefaultObj();

};

// 0x78 (0xE0 - 0x68)
// Class Goat2.BTDecorator_GGIsGoatLicking
class UBTDecorator_GGIsGoatLicking : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                GoatActor;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)
	enum class EGoatLickCheckType                CheckType;                                         // 0x90(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8AA[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                IsLickingActor;                                    // 0x98(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 PActorIdentifierTags;                              // 0xC0(0x20)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsGoatLicking* GetDefaultObj();

};

// 0x30 (0x98 - 0x68)
// Class Goat2.BTDecorator_GGIsGoatNearLocation
class UBTDecorator_GGIsGoatNearLocation : public UBTDecorator_GGBase
{
public:
	struct FBlackboardKeySelector                TargetLocation;                                    // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)
	float                                        DistanceToLocation;                                // 0x90(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8B8[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsGoatNearLocation* GetDefaultObj();

};

// 0x30 (0x98 - 0x68)
// Class Goat2.BTDecorator_GGIsGrabbed
class UBTDecorator_GGIsGrabbed : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                CheckActor;                                        // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)
	enum class EGrabbedCheckType                 CheckType;                                         // 0x90(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8C2[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsGrabbed* GetDefaultObj();

};

// 0x30 (0x98 - 0x68)
// Class Goat2.BTDecorator_GGIsHandcuffed
class UBTDecorator_GGIsHandcuffed : public UBTDecorator_GGBase
{
public:
	struct FBlackboardKeySelector                TargetCharacter;                                   // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)
	int32                                        NumHandcuffsToCheckFor;                            // 0x90(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_8D9[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsHandcuffed* GetDefaultObj();

};

// 0x0 (0x90 - 0x90)
// Class Goat2.BTDecorator_GGIsInteractable
class UBTDecorator_GGIsInteractable : public UBTDecorator_BlackboardBase
{
public:

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsInteractable* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGIsKnockedOut
class UBTDecorator_GGIsKnockedOut : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                NPCCharacter;                                      // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsKnockedOut* GetDefaultObj();

};

// 0x50 (0xB8 - 0x68)
// Class Goat2.BTDecorator_GGIsLocationRightOf
class UBTDecorator_GGIsLocationRightOf : public UBTDecorator_GGBase
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                TargetValue;                                       // 0x90(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsLocationRightOf* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGIsMeshStationary
class UBTDecorator_GGIsMeshStationary : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsMeshStationary* GetDefaultObj();

};

// 0x30 (0x98 - 0x68)
// Class Goat2.BTDecorator_GGIsNPCEventState
class UBTDecorator_GGIsNPCEventState : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                NPCToCheck;                                        // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)
	int32                                        StateToCheck;                                      // 0x90(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class ECheckType                        CheckType;                                         // 0x94(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_94C[0x3];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsNPCEventState* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGIsNPCPerforming
class UBTDecorator_GGIsNPCPerforming : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                CurrentEvent;                                      // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsNPCPerforming* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGIsPActorOptimized
class UBTDecorator_GGIsPActorOptimized : public UBTDecorator_GGBase
{
public:
	struct FBlackboardKeySelector                TargetPActor;                                      // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsPActorOptimized* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGIsPassedOut
class UBTDecorator_GGIsPassedOut : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                Character;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsPassedOut* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGIsPerceivable
class UBTDecorator_GGIsPerceivable : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                Character;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsPerceivable* GetDefaultObj();

};

// 0x30 (0x98 - 0x68)
// Class Goat2.BTDecorator_GGIsPlayingMontage
class UBTDecorator_GGIsPlayingMontage : public UBTDecorator_GGBase
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)
	class UAnimMontage*                          Montage;                                           // 0x90(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsPlayingMontage* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGIsRagdoll
class UBTDecorator_GGIsRagdoll : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsRagdoll* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGIsRiding
class UBTDecorator_GGIsRiding : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsRiding* GetDefaultObj();

};

// 0x58 (0xC0 - 0x68)
// Class Goat2.BTDecorator_GGIsSoftRefValid
class UBTDecorator_GGIsSoftRefValid : public UBTDecorator
{
public:
	bool                                         bCheckObject;                                      // 0x68(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A07[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UObject>                SoftObject;                                        // 0x70(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSoftClassPtr<class UObject>                 SoftClass;                                         // 0x98(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsSoftRefValid* GetDefaultObj();

};

// 0x30 (0x98 - 0x68)
// Class Goat2.BTDecorator_GGIsStumbling
class UBTDecorator_GGIsStumbling : public UBTDecorator_GGBase
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)
	float                                        LastPushCheckTime;                                 // 0x90(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A1C[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsStumbling* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGIsVehicleFlipped
class UBTDecorator_GGIsVehicleFlipped : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                VehicleToCheck;                                    // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsVehicleFlipped* GetDefaultObj();

};

// 0x30 (0x98 - 0x68)
// Class Goat2.BTDecorator_GGIsVehicleInState
class UBTDecorator_GGIsVehicleInState : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                VehicleToCheck;                                    // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)
	enum class EVehicleState                     StateToCheckAgainst;                               // 0x90(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_A3D[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsVehicleInState* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGIsVendorAtStall
class UBTDecorator_GGIsVendorAtStall : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                CurrentEvent;                                      // 0x68(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTDecorator_GGIsVendorAtStall* GetDefaultObj();

};

// 0x58 (0xC0 - 0x68)
// Class Goat2.BTDecorator_GGMatchesGameplayTag
class UBTDecorator_GGMatchesGameplayTag : public UBTDecorator
{
public:
	enum class EGameplayTagCompareType           GameplayTagCompareType;                            // 0x68(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A61[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                KeyToCheck;                                        // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bOnlyUseKeyToCheckParent;                          // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A65[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 ComapreWith;                                       // 0xA0(0x20)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTDecorator_GGMatchesGameplayTag* GetDefaultObj();

};

// 0x28 (0x90 - 0x68)
// Class Goat2.BTDecorator_GGOnNavMesh
class UBTDecorator_GGOnNavMesh : public UBTDecorator_GGBase
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTDecorator_GGOnNavMesh* GetDefaultObj();

};

// 0x8 (0x70 - 0x68)
// Class Goat2.BTDecorator_GGShouldBrace
class UBTDecorator_GGShouldBrace : public UBTDecorator_GGBase
{
public:
	bool                                         bCheckForSprintingGoats;                           // 0x68(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_A8C[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_GGShouldBrace* GetDefaultObj();

};

// 0x48 (0xB0 - 0x68)
// Class Goat2.BTDecorator_GGStartledContext
class UBTDecorator_GGStartledContext : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 CompareAgainst;                                    // 0x90(0x20)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTDecorator_GGStartledContext* GetDefaultObj();

};

// 0x30 (0x98 - 0x68)
// Class Goat2.BTDecorator_GGTimeSinceMoodSet
class UBTDecorator_GGTimeSinceMoodSet : public UBTDecorator
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x68(0x28)(Edit, NativeAccessSpecifierPublic)
	float                                        TimeSinceMoodWasSet;                               // 0x90(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_AB1[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_GGTimeSinceMoodSet* GetDefaultObj();

};

// 0x8 (0x98 - 0x90)
// Class Goat2.BTDecorator_GGWasInState
class UBTDecorator_GGWasInState : public UBTDecorator_BlackboardBase
{
public:
	enum class EWasInStates                      State;                                             // 0x90(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EBTGGBlackboardRestart            NotifyObserver;                                    // 0x91(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_ADE[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTDecorator_GGWasInState* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class Goat2.BTService_GGAbortMontage
class UBTService_GGAbortMontage : public UBTService
{
public:
	class UAnimMontage*                          Montage;                                           // 0x70(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTService_GGAbortMontage* GetDefaultObj();

};

// 0x28 (0x98 - 0x70)
// Class Goat2.BTService_GGAddEffectSources
class UBTService_GGAddEffectSources : public UBTService
{
public:
	struct FGameplayTag                          SourceTag;                                         // 0x70(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 EffectTags;                                        // 0x78(0x20)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTService_GGAddEffectSources* GetDefaultObj();

};

// 0x88 (0xF8 - 0x70)
// Class Goat2.BTService_GGCheckIfValidPath
class UBTService_GGCheckIfValidPath : public UBTService
{
public:
	struct FBlackboardKeySelector                Result;                                            // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                StartKey;                                          // 0x98(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                GoalKey;                                           // 0xC0(0x28)(Edit, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavigationQueryFilter>    FilterClass;                                       // 0xE8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bProjectToNavMesh;                                 // 0xF0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B2E[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTService_GGCheckIfValidPath* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTService_GGCountFloat
class UBTService_GGCountFloat : public UBTService
{
public:
	struct FBlackboardKeySelector                FloatToCount;                                      // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)
	bool                                         CountUp;                                           // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_B46[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTService_GGCountFloat* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class Goat2.BTService_GGDisableReactions
class UBTService_GGDisableReactions : public UBTService
{
public:
	bool                                         bDisableProximityReactions;                        // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDisablePanic;                                     // 0x71(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_B5F[0x6];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTService_GGDisableReactions* GetDefaultObj();

};

// 0x50 (0xC0 - 0x70)
// Class Goat2.BTService_GGGetAnActorInView
class UBTService_GGGetAnActorInView : public UBTService
{
public:
	struct FBlackboardKeySelector                ActorValueToFill;                                  // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)
	bool                                         OnlyLookWhenEmpty;                                 // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EMoods                            OnlyLookWhileInMood;                               // 0x99(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_BDE[0x2];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        WithinDistance;                                    // 0x9C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         RandomActorInView;                                 // 0xA0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_BE4[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ChanceToSetActor;                                  // 0xA4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bCheckAgainstRecentlyGrabbed;                      // 0xA8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_BEE[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        RecentlyGrabbedDelay;                              // 0xAC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bDisregardGrabbedCharacters;                       // 0xB0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         LookForNPCs;                                       // 0xB1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         OnlyLookForRoaming;                                // 0xB2(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         OnlyLookForPassedOut;                              // 0xB3(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         IncludeKnockedOutNPCs;                             // 0xB4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         LookForGoats;                                      // 0xB5(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         LookForPhysicsActors;                              // 0xB6(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         CanGetPActorsTwice;                                // 0xB7(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         LookForInteractables;                              // 0xB8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         LookForVehicles;                                   // 0xB9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         OnlyEngineOff;                                     // 0xBA(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_C09[0x5];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTService_GGGetAnActorInView* GetDefaultObj();

};

// 0x110 (0x180 - 0x70)
// Class Goat2.BTService_GGLookForCharacter
class UBTService_GGLookForCharacter : public UBTService
{
public:
	enum class ELookForCharacter                 LookFor;                                           // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C2F[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                TargetActor;                                       // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)
	float                                        SetTargetAfterSeconds;                             // 0xA0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSetInstantlyIfKeyIsTrue;                          // 0xA4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C33[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                SetInstantlyBool;                                  // 0xA8(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                OutOfSightFor;                                     // 0xD0(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bRemoveTargetActorWhenOutOfSight;                  // 0xF8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C3E[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        WhenOutOfSightFor;                                 // 0xFC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDontSetTargetIfWearingDisguise;                   // 0x100(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C44[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                DisguiseAssetIDs;                                  // 0x108(0x28)(Edit, NativeAccessSpecifierPublic)
	TMap<class AGGCharacter*, float>             SeenCharacters;                                    // 0x130(0x50)(Protected, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBTService_GGLookForCharacter* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTService_GGLookForInteractables
class UBTService_GGLookForInteractables : public UBTService
{
public:
	struct FBlackboardKeySelector                InteractActor;                                     // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bOnlyLookWhenEmpty;                                // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C76[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	int32                                        ChanceToSet;                                       // 0x9C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTService_GGLookForInteractables* GetDefaultObj();

};

// 0x208 (0x278 - 0x70)
// Class Goat2.BTService_GGManageBoatDriving
class UBTService_GGManageBoatDriving : public UBTService
{
public:
	bool                                         bAlwaysGetOnSplines;                               // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_C8F[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                CurrentSpline;                                     // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                CurrentSplinePointIndex;                           // 0xA0(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                NextSpline;                                        // 0xC8(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                NextSplineStartIndex;                              // 0xF0(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                OffRoad;                                           // 0x118(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                VehicleDisturbed;                                  // 0x140(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                NextPoint;                                         // 0x168(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                LastPoint;                                         // 0x190(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                ReachedLastPoint;                                  // 0x1B8(0x28)(Edit, NativeAccessSpecifierPublic)
	float                                        PointMinDistance;                                  // 0x1E0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OffRoadDistance;                                   // 0x1E4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TooFarAwayDistance;                                // 0x1E8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NearestSplineMaxDistance;                          // 0x1EC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGGVehicle*                            Vehicle;                                           // 0x1F0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBlackboardComponent*                  BlackboardComp;                                    // 0x1F8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGGRoadSplineComponent*                CurrentSplineComp;                                 // 0x200(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_CBF[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UGGRoadSplineComponent*                NextSplineComp;                                    // 0x210(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        NextSplineEnterIndex;                              // 0x218(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_CC4[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UGGRoadSplineComponent*                PreviousSplineComp;                                // 0x220(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_CC8[0x50];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTService_GGManageBoatDriving* GetDefaultObj();

};

// 0x170 (0x1E0 - 0x70)
// Class Goat2.BTService_GGManageCircuitPath
class UBTService_GGManageCircuitPath : public UBTService
{
public:
	bool                                         DebugPrint;                                        // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         DebugDrawPath;                                     // 0x71(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_CD9[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                PathTarget;                                        // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                PathTargetActor;                                   // 0xA0(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                ReachedPathTarget;                                 // 0xC8(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                NextPoint;                                         // 0xF0(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                LastPoint;                                         // 0x118(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                ReachedLastPoint;                                  // 0x140(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                GoatKartsCompKey;                                  // 0x168(0x28)(Edit, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavigationQueryFilter>    NavFilter;                                         // 0x190(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PointMinDistance;                                  // 0x198(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReachedPathDistance;                               // 0x19C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanDirectSteer;                                   // 0x1A0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D00[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinDistanceToSpeedUp;                              // 0x1A4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MaxAngleConsideredStraight;                        // 0x1A8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PassedCheckpointThreshold;                         // 0x1AC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGGVehicle*                            Vehicle;                                           // 0x1B0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBlackboardComponent*                  BlackboardComp;                                    // 0x1B8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TArray<struct FGoatKartCircuitResult>        Circuit;                                           // 0x1C0(0x10)(ZeroConstructor, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	int32                                        CurrentCircuitPoint;                               // 0x1D0(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_D14[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UGGPlayerGameComp_GoatKart*            GoatKartComp;                                      // 0x1D8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTService_GGManageCircuitPath* GetDefaultObj();

};

// 0x260 (0x2D0 - 0x70)
// Class Goat2.BTService_GGManageRandomDriving
class UBTService_GGManageRandomDriving : public UBTService
{
public:
	bool                                         DebugDrawAndPrint;                                 // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         DebugDrawPath;                                     // 0x71(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         PrintRPMChanges;                                   // 0x72(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAlwaysGetOnSplines;                               // 0x73(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_D61[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                TargetLocation;                                    // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                CurrentSpline;                                     // 0xA0(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                CurrentSplinePointIndex;                           // 0xC8(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                NextSpline;                                        // 0xF0(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                NextSplineStartIndex;                              // 0x118(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                OffRoad;                                           // 0x140(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                VehicleDisturbed;                                  // 0x168(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                NextPoint;                                         // 0x190(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                LastPoint;                                         // 0x1B8(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                ReachedLastPoint;                                  // 0x1E0(0x28)(Edit, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavigationQueryFilter>    NavFilter;                                         // 0x208(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PointMinDistance;                                  // 0x210(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        OffRoadDistance;                                   // 0x214(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TooFarAwayDistance;                                // 0x218(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        NearestSplineMaxDistance;                          // 0x21C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGGVehicle*                            Vehicle;                                           // 0x220(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBlackboardComponent*                  BlackboardComp;                                    // 0x228(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UGGRoadSplineComponent*                CurrentSplineComp;                                 // 0x230(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_D94[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UGGRoadSplineComponent*                NextSplineComp;                                    // 0x240(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        NextSplineEnterIndex;                              // 0x248(0x4)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_DA0[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class UGGRoadSplineComponent*                PreviousSplineComp;                                // 0x250(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_DA3[0x50];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UNavigationPath*                       Path;                                              // 0x2A8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_DA5[0x20];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTService_GGManageRandomDriving* GetDefaultObj();

	void PathUpdated(class UNavigationPath* AffectedPath, enum class ENavPathEvent PathEvent);
};

// 0xE0 (0x150 - 0x70)
// Class Goat2.BTService_GGManageRandomRoam
class UBTService_GGManageRandomRoam : public UBTService
{
public:
	bool                                         bDebugDrawAndPrint;                                // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_DC1[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DistanceUntilNewLocation;                          // 0x74(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                MoveLocation;                                      // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                LastRoamLocation;                                  // 0xA0(0x28)(Edit, NativeAccessSpecifierPublic)
	class UEnvQuery*                             RandomLocationQuery;                               // 0xC8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGGNPC*                                ManagedNPC;                                        // 0xD0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlackboardComponent*                  BlackboardComp;                                    // 0xD8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_DD2[0x70];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTService_GGManageRandomRoam* GetDefaultObj();

};

// 0x150 (0x1C0 - 0x70)
// Class Goat2.BTService_GGManageVehiclePath
class UBTService_GGManageVehiclePath : public UBTService
{
public:
	bool                                         DebugPrint;                                        // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         DebugDrawPath;                                     // 0x71(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E2E[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                PathTarget;                                        // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                PathTargetActor;                                   // 0xA0(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                ReachedPathTarget;                                 // 0xC8(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                NextPoint;                                         // 0xF0(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                LastPoint;                                         // 0x118(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                ReachedLastPoint;                                  // 0x140(0x28)(Edit, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavigationQueryFilter>    NavFilter;                                         // 0x168(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PointMinDistance;                                  // 0x170(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ReachedPathDistance;                               // 0x174(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLookForNearbyNavMesh;                             // 0x178(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E4B[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        NearbyNavMeshRadius;                               // 0x17C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanDirectSteer;                                   // 0x180(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E4F[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	class AGGVehicle*                            Vehicle;                                           // 0x188(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBlackboardComponent*                  BlackboardComp;                                    // 0x190(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UNavigationPath*                       Path;                                              // 0x198(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_E57[0x20];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTService_GGManageVehiclePath* GetDefaultObj();

	void PathUpdated(class UNavigationPath* AffectedPath, enum class ENavPathEvent PathEvent);
};

// 0x90 (0x100 - 0x70)
// Class Goat2.BTService_GGNotifyChasedNPC
class UBTService_GGNotifyChasedNPC : public UBTService
{
public:
	float                                        NotifyDistance;                                    // 0x70(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_E78[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                TargetNPC;                                         // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FStartleDetailsSettings               StartleSettings;                                   // 0xA0(0x50)(Edit, NativeAccessSpecifierPublic)
	class AGGNPC*                                ManagedNPC;                                        // 0xF0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlackboardComponent*                  BlackboardComp;                                    // 0xF8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBTService_GGNotifyChasedNPC* GetDefaultObj();

};

// 0x80 (0xF0 - 0x70)
// Class Goat2.BTService_GGPoliceScan
class UBTService_GGPoliceScan : public UBTService
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                TargetActor;                                       // 0x98(0x28)(Edit, NativeAccessSpecifierPublic)
	float                                        ScanRadius;                                        // 0xC0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ChanceToSetGoatTarget;                             // 0xC4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ChanceToSetNPCTarget;                              // 0xC8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDrawScan;                                         // 0xCC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_EEC[0x3];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AGGCharacter*>                  BoundCharacters;                                   // 0xD0(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	class AActor*                                OwnerActor;                                        // 0xE0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlackboardComponent*                  Blackboard;                                        // 0xE8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBTService_GGPoliceScan* GetDefaultObj();

	void OnNPCAttackedActors(class AGGNPC* NPCAttacking, TArray<class AActor*>& AttackedActors);
	void OnGoatHeadbutting(class AGGGoat* GoatHeadbutting, bool bHitSomething, TArray<class AActor*>& HeadbuttedActors, bool bIsChargeHeadbutt);
};

// 0xC0 (0x130 - 0x70)
// Class Goat2.BTService_GGScanForActors
class UBTService_GGScanForActors : public UBTService
{
public:
	int32                                        ChanceToScan;                                      // 0x70(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F0F[0x4];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                ActorValueToFill;                                  // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bOnlyLookWhenEmpty;                                // 0xA0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EActorScanTypes                   ActorsToScanFor;                                   // 0xA1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPreferNearestActor;                               // 0xA2(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F1B[0x5];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class ECollisionChannel>         CollisionChannels;                                 // 0xA8(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bRequireValidPath;                                 // 0xB8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F27[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UNavigationQueryFilter>    FilterClass;                                       // 0xC0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bProjectToNavMesh;                                 // 0xC8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDrawScan;                                         // 0xC9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F2F[0x6];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                ScanLocation;                                      // 0xD0(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bUseBBScanRadius;                                  // 0xF8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F34[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                BBScanRadius;                                      // 0x100(0x28)(Edit, NativeAccessSpecifierPublic)
	float                                        ScanRadius;                                        // 0x128(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F3C[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTService_GGScanForActors* GetDefaultObj();

};

// 0x90 (0x100 - 0x70)
// Class Goat2.BTService_GGScanForCharacter
class UBTService_GGScanForCharacter : public UBTService
{
public:
	struct FBlackboardKeySelector                ActorValueToFill;                                  // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bOnlyLookWhenEmpty;                                // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPickClosestCharacter;                             // 0x99(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLookForGoats;                                     // 0x9A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLookForHumanoids;                                 // 0x9B(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bLookForAnimals;                                   // 0x9C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRequireCharacterInFront;                          // 0x9D(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOnlyLookForPassedOutNPCs;                         // 0x9E(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDrawScan;                                         // 0x9F(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                ScanLocation;                                      // 0xA0(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bUseBBScanRadius;                                  // 0xC8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F75[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                BBScanRadius;                                      // 0xD0(0x28)(Edit, NativeAccessSpecifierPublic)
	float                                        ScanRadius;                                        // 0xF8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_F79[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTService_GGScanForCharacter* GetDefaultObj();

};

// 0x20 (0x90 - 0x70)
// Class Goat2.BTService_GGSetWalkCycleOverride
class UBTService_GGSetWalkCycleOverride : public UBTService
{
public:
	TArray<class UAnimSequenceBase*>             WalkCycleOverrides;                                // 0x70(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<class UAnimSequenceBase*>             RunCycleOverrides;                                 // 0x80(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTService_GGSetWalkCycleOverride* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class Goat2.BTService_GGShouldPanic
class UBTService_GGShouldPanic : public UBTService
{
public:
	bool                                         CheckForBurning;                                   // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_FB3[0x7];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTService_GGShouldPanic* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTService_GGSpeedBoost
class UBTService_GGSpeedBoost : public UBTService
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	float                                        SpeedBoost;                                        // 0x98(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_FC3[0x4];                                      // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTService_GGSpeedBoost* GetDefaultObj();

};

// 0x38 (0xA8 - 0x70)
// Class Goat2.BTService_GGSpreadEventInRadius
class UBTService_GGSpreadEventInRadius : public UBTService
{
public:
	float                                        Radius;                                            // 0x70(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ChanceToSpread;                                    // 0x74(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         DrawSphere;                                        // 0x78(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_FEB[0x7];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                CurrentEvent;                                      // 0x80(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTService_GGSpreadEventInRadius* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class Goat2.BTService_GGSpreadPanicInRadius
class UBTService_GGSpreadPanicInRadius : public UBTService
{
public:
	float                                        Radius;                                            // 0x70(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EPanicTypes                       PanicType;                                         // 0x74(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanScareClowns;                                   // 0x75(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDrawSphere;                                       // 0x76(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_100D[0x1];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTService_GGSpreadPanicInRadius* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class Goat2.BTTask_GGAbortEvent
class UBTTask_GGAbortEvent : public UBTTaskNode
{
public:

	static class UClass* StaticClass();
	static class UBTTask_GGAbortEvent* GetDefaultObj();

};

// 0x50 (0xC0 - 0x70)
// Class Goat2.BTTask_GGAttachStallItem
class UBTTask_GGAttachStallItem : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                NPC;                                               // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                StallEvent;                                        // 0x98(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGAttachStallItem* GetDefaultObj();

};

// 0x118 (0x188 - 0x70)
// Class Goat2.BTTask_GGAttack
class UBTTask_GGAttack : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                TargetActor;                                       // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bRequireTargetHit;                                 // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideAttackVariations;                         // 0x99(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1073[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FNPCAttackVariation>           AttackVariations;                                  // 0xA0(0x10)(Edit, BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	uint8                                        Pad_1076[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FNPCAttackVariation                   SelectedVariation;                                 // 0xC0(0xA0)(NativeAccessSpecifierPrivate)
	uint8                                        Pad_107A[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UBehaviorTreeComponent*                OwnerBT;                                           // 0x178(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGGNPC*                                NPC;                                               // 0x180(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGAttack* GetDefaultObj();

	void OnGGAnimNotifyTrigger(class AGGCharacter* NotifyingNPC, class UGGAnimNotify* AnimNotify, const struct FGameplayTag& NotifyTag);
	void OnAnimationEnded(class UAnimMontage* Montage, bool Interrupted);
};

// 0xF0 (0x160 - 0x70)
// Class Goat2.BTTask_GGBikeSteerTo
class UBTTask_GGBikeSteerTo : public UBTTaskNode
{
public:
	bool                                         DebugPrint;                                        // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1088[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                NextPoint;                                         // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                LastPoint;                                         // 0xA0(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                ReachedLastPoint;                                  // 0xC8(0x28)(Edit, NativeAccessSpecifierPublic)
	float                                        YawAcceptanceRadius;                               // 0xF0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        YawSlowTurnRadius;                                 // 0xF4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SlowTurnMultiplier;                                // 0xF8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinDistanceToBack;                                 // 0xFC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LastNodeStopDistance;                              // 0x100(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeUntilInvertedInput;                            // 0x104(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InvertedInputDuration;                             // 0x108(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FeelerTraceMultiplier;                             // 0x10C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FeelerTraceMin;                                    // 0x110(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FeelerBackTraceMultiplier;                         // 0x114(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FeelerBackTraceMin;                                // 0x118(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1099[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AGGVehicle*                            Vehicle;                                           // 0x120(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_109B[0x38];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGBikeSteerTo* GetDefaultObj();

};

// 0x100 (0x170 - 0x70)
// Class Goat2.BTTask_GGBoatSteerTo
class UBTTask_GGBoatSteerTo : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                NextPoint;                                         // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                LastPoint;                                         // 0x98(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                ReachedLastPoint;                                  // 0xC0(0x28)(Edit, NativeAccessSpecifierPublic)
	float                                        YawAcceptanceRadius;                               // 0xE8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        YawSlowTurnRadius;                                 // 0xEC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SlowTurnMultiplier;                                // 0xF0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanGoBackwardsIfCloseEnough;                      // 0xF4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10C5[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MinDistanceToBack;                                 // 0xF8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LastNodeStopDistance;                              // 0xFC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeUntilInvertedInput;                            // 0x100(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InvertedInputDuration;                             // 0x104(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FeelerTraceMultiplier;                             // 0x108(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FeelerTraceMin;                                    // 0x10C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MiddleFeelerCheckInterval;                         // 0x110(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10D4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MiddleFeelerTraceMin;                              // 0x118(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MiddleFeelerTraceMax;                              // 0x11C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MiddleFeelerTraceMultiplier;                       // 0x120(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MiddleFeelerTraceTurnAdjust;                       // 0x124(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGGVehicle_Boat*                       Vehicle;                                           // 0x128(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_10DE[0x40];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGBoatSteerTo* GetDefaultObj();

};

// 0xA8 (0x118 - 0x70)
// Class Goat2.BTTask_GGCreateNPCEvent
class UBTTask_GGCreateNPCEvent : public UBTTaskNode
{
public:
	struct FGameplayTag                          EventToCreate;                                     // 0x70(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSpawnIntoOwnerArea;                               // 0x78(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSpawnIntoArea;                                    // 0x79(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10F0[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          Area;                                              // 0x7C(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10F3[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                StartNPC;                                          // 0x88(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bUseStartNPC;                                      // 0xB0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10F9[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                StartLocation;                                     // 0xB8(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bUseStartLocation;                                 // 0xE0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_10FD[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                StartActor;                                        // 0xE8(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bUseStartActor;                                    // 0x110(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1100[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGCreateNPCEvent* GetDefaultObj();

};

// 0x60 (0xD0 - 0x70)
// Class Goat2.BTTask_GGDecideFishLocation
class UBTTask_GGDecideFishLocation : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                TargetLocation;                                    // 0x98(0x28)(Edit, NativeAccessSpecifierPublic)
	float                                        DistanceInFront;                                   // 0xC0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CastAreaSize;                                      // 0xC4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        MaxTraceAttempts;                                  // 0xC8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDebug;                                            // 0xCC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1113[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGDecideFishLocation* GetDefaultObj();

};

// 0x90 (0x100 - 0x70)
// Class Goat2.BTTask_GGDefibrillate
class UBTTask_GGDefibrillate : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                TargetActor;                                       // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bRequireTargetHit;                                 // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_113E[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UAnimMontage>           SoftDefibrillateAnimation;                         // 0xA0(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DistanceFromCharacter;                             // 0xC8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Radius;                                            // 0xCC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        Height;                                            // 0xD0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1145[0x1C];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UBehaviorTreeComponent*                OwnerBT;                                           // 0xF0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGGNPC*                                NPC;                                               // 0xF8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGDefibrillate* GetDefaultObj();

	void OnGGAnimNotifyTrigger(class AGGCharacter* NotifyingNPC, class UGGAnimNotify* AnimNotify, const struct FGameplayTag& NotifyTag);
	void OnAnimationEnded(class UAnimMontage* Montage, bool Interrupted);
};

// 0x10 (0x80 - 0x70)
// Class Goat2.BTTask_GGDropAttachedActors
class UBTTask_GGDropAttachedActors : public UBTTaskNode
{
public:
	enum class EActorsToDrop                     ActorsToDrop;                                      // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBecauseOfStartle;                                 // 0x71(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSetToDropAnimationActors;                         // 0x72(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_116A[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DropLaunchVelocity;                                // 0x74(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DroppedItemLifespan;                               // 0x78(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDestroyActors;                                    // 0x7C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_116C[0x3];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGDropAttachedActors* GetDefaultObj();

};

// 0x68 (0xD8 - 0x70)
// Class Goat2.BTTask_GGDropCharacter
class UBTTask_GGDropCharacter : public UBTTaskNode
{
public:
	class UAnimMontage*                          DropMontage;                                       // 0x70(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          AnimationNotifyTag;                                // 0x78(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bThrowCharacter;                                   // 0x80(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_117C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ImpulsePower;                                      // 0x84(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPutDroppedCharacterInBBValue;                     // 0x88(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_117F[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                ValueToSet;                                        // 0x90(0x28)(Edit, NativeAccessSpecifierPublic)
	uint8                                        Pad_1180[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UBehaviorTreeComponent*                OwnerBT;                                           // 0xC8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGGNPC_Humanoid*                       NPC;                                               // 0xD0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGDropCharacter* GetDefaultObj();

	void OnGGAnimNotifyTrigger(class AGGCharacter* NotifyingNPC, class UGGAnimNotify* AnimNotify, const struct FGameplayTag& NotifyTag);
};

// 0x38 (0xA8 - 0x70)
// Class Goat2.BTTask_GGDropPickedUpActor
class UBTTask_GGDropPickedUpActor : public UBTTaskNode
{
public:
	class UAnimMontage*                          DropActorMontage;                                  // 0x70(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DistanceInFront;                                   // 0x78(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanBecomeLostObject;                              // 0x7C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSetLifespanWhenDropped;                           // 0x7D(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1192[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        LifeSpan;                                          // 0x80(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1193[0x14];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UBehaviorTreeComponent*                OwnerBT;                                           // 0x98(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGGNPC_Humanoid*                       NPC;                                               // 0xA0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGDropPickedUpActor* GetDefaultObj();

	void OnGGAnimNotifyTrigger(class AGGCharacter* NotifyingNPC, class UGGAnimNotify* AnimNotify, const struct FGameplayTag& NotifyTag);
};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTTask_GGEnableOrDisableEvent
class UBTTask_GGEnableOrDisableEvent : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                TargetActor;                                       // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bEnableTheEvent;                                   // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1199[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGEnableOrDisableEvent* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class Goat2.BTTask_GGEndInteraction
class UBTTask_GGEndInteraction : public UBTTaskNode
{
public:
	bool                                         ResetOwnBBValues;                                  // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_119E[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGEndInteraction* GetDefaultObj();

};

// 0x68 (0xD8 - 0x70)
// Class Goat2.BTTask_GGEnterOrExitVehicle
class UBTTask_GGEnterOrExitVehicle : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                CharacterKey;                                      // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                VehicleKey;                                        // 0x98(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bEnterVehicle;                                     // 0xC0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bEnterAsPassenger;                                 // 0xC1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11B5[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<int32>                                AttemptToEnterPassengerSlots;                      // 0xC8(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTTask_GGEnterOrExitVehicle* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTTask_GGFindDriveTarget
class UBTTask_GGFindDriveTarget : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                TargetLocation;                                    // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	TSubclassOf<class UNavigationQueryFilter>    NavFilter;                                         // 0x98(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTTask_GGFindDriveTarget* GetDefaultObj();

};

// 0x38 (0xA8 - 0x70)
// Class Goat2.BTTask_GGFindNewTargetLoc
class UBTTask_GGFindNewTargetLoc : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                TargetLocationKey;                                 // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)
	TSubclassOf<class UNavigationQueryFilter>    FilterClass;                                       // 0x98(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        Radius;                                            // 0xA0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_11B9[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGFindNewTargetLoc* GetDefaultObj();

};

// 0x60 (0xD0 - 0x70)
// Class Goat2.BTTask_GGFireEventCallback
class UBTTask_GGFireEventCallback : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                CurrentEvent;                                      // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                CurrentWaypoint;                                   // 0x98(0x28)(Edit, NativeAccessSpecifierPublic)
	int32                                        CallbackID;                                        // 0xC0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          CallbackTag;                                       // 0xC4(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11BD[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGFireEventCallback* GetDefaultObj();

};

// 0x70 (0xE0 - 0x70)
// Class Goat2.BTTask_GGFireGun
class UBTTask_GGFireGun : public UBTTaskNode
{
public:
	class UAnimMontage*                          ShootMontage;                                      // 0x70(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AnimPlayRate;                                      // 0x78(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11C4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AActor>                    ProjectileClass;                                   // 0x80(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                TargetActor;                                       // 0x88(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FVector                               TargetLocationAdjust;                              // 0xB0(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11C7[0x14];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UBehaviorTreeComponent*                OwnerBT;                                           // 0xD0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGGNPC_Humanoid*                       NPC;                                               // 0xD8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGFireGun* GetDefaultObj();

	void OnGGAnimNotifyTrigger(class AGGCharacter* NotifyingNPC, class UGGAnimNotify* AnimNotify, const struct FGameplayTag& NotifyTag);
};

// 0x60 (0xD0 - 0x70)
// Class Goat2.BTTask_GGFishUpActor
class UBTTask_GGFishUpActor : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                TargetLocation;                                    // 0x98(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bFishUpCharacters;                                 // 0xC0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11CE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CharacterFishUpRadius;                             // 0xC4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FishUpPower;                                       // 0xC8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11CF[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGFishUpActor* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTTask_GGForgetLostObject
class UBTTask_GGForgetLostObject : public UBTTaskNode
{
public:
	bool                                         bForgetAllLostObjects;                             // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bForgetAboutCurrent;                               // 0x71(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11D5[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                ForgetAbout;                                       // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTTask_GGForgetLostObject* GetDefaultObj();

};

// 0x50 (0xC0 - 0x70)
// Class Goat2.BTTask_GGGetAdmireGoat
class UBTTask_GGGetAdmireGoat : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                TargetActor;                                       // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                CurrentEvent;                                      // 0x98(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGGetAdmireGoat* GetDefaultObj();

};

// 0x60 (0xD0 - 0x70)
// Class Goat2.BTTask_GGGetLocationInActorBounds
class UBTTask_GGGetLocationInActorBounds : public UBTTaskNode
{
public:
	TSubclassOf<class UNavigationQueryFilter>    FilterClass;                                       // 0x70(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                AroundLocationKey;                                 // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)
	enum class EBehaviorActors                   AroundLocationActor;                               // 0xA0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_11DA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                TargetLocationKey;                                 // 0xA8(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTTask_GGGetLocationInActorBounds* GetDefaultObj();

};

// 0xA0 (0x110 - 0x70)
// Class Goat2.BTTask_GGGetLocationInRadius
class UBTTask_GGGetLocationInRadius : public UBTTaskNode
{
public:
	bool                                         bUseBBValue;                                       // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_11DE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        Radius;                                            // 0x74(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                BBRadius;                                          // 0x78(0x28)(Edit, NativeAccessSpecifierPrivate)
	bool                                         bUseBBLocation;                                    // 0xA0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_11E0[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                AroundLocationKey;                                 // 0xA8(0x28)(Edit, NativeAccessSpecifierPrivate)
	enum class EBehaviorActors                   AroundLocationActor;                               // 0xD0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_11E1[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                TargetLocationKey;                                 // 0xD8(0x28)(Edit, NativeAccessSpecifierPrivate)
	TSubclassOf<class UNavigationQueryFilter>    FilterClass;                                       // 0x100(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bDebugDrawRadius;                                  // 0x108(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_11E6[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGGetLocationInRadius* GetDefaultObj();

};

// 0x58 (0xC8 - 0x70)
// Class Goat2.BTTask_GGGetStallLoc
class UBTTask_GGGetStallLoc : public UBTTaskNode
{
public:
	bool                                         GetVendorLoc;                                      // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_11EA[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                StallKey;                                          // 0x78(0x28)(Edit, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                VectorKey;                                         // 0xA0(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGGetStallLoc* GetDefaultObj();

};

// 0x50 (0xC0 - 0x70)
// Class Goat2.BTTask_GGGetSuperstar
class UBTTask_GGGetSuperstar : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                TargetActor;                                       // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                CurrentEvent;                                      // 0x98(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGGetSuperstar* GetDefaultObj();

};

// 0x118 (0x188 - 0x70)
// Class Goat2.BTTask_GGGrabCharacter
class UBTTask_GGGrabCharacter : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                TargetActor;                                       // 0x98(0x28)(Edit, NativeAccessSpecifierPrivate)
	class UAnimMontage*                          GrabMontage;                                       // 0xC0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                ConstraintAttachSocket;                            // 0xC8(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                AttachBoneName;                                    // 0xD8(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                GoatGrabBoneName;                                  // 0xE8(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class FString                                NPCGrabBoneName;                                   // 0xF8(0x10)(Edit, ZeroConstructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        PreventUnragdollFor;                               // 0x108(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class EGrabbedCharacterAnimationType    AnimationType;                                     // 0x10C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1206[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              AngularRotationOffset;                             // 0x110(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                         bLockRotation;                                     // 0x11C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1207[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               RelativeGoatPosition;                              // 0x120(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FVector                               RelativeNPCPosition;                               // 0x12C(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bDoOverlapGrab;                                    // 0x138(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bRequireHit;                                       // 0x139(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1208[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DistanceFromCharacter;                             // 0x13C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        Height;                                            // 0x140(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        Radius;                                            // 0x144(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bDebugDrawGrab;                                    // 0x148(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_120B[0x2F];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UBehaviorTreeComponent*                OwnerBT;                                           // 0x178(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGGNPC*                                NPC;                                               // 0x180(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGGrabCharacter* GetDefaultObj();

	void OnGGAnimNotifyTrigger(class AGGCharacter* NotifyingNPC, class UGGAnimNotify* AnimNotify, const struct FGameplayTag& NotifyTag);
	void OnAnimationEnded(class UAnimMontage* Montage, bool Interrupted);
};

// 0x98 (0x108 - 0x70)
// Class Goat2.BTTask_GGHandleWaypointAnimation
class UBTTask_GGHandleWaypointAnimation : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                CurrentEvent;                                      // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                CurrentWaypoint;                                   // 0x98(0x28)(Edit, NativeAccessSpecifierPublic)
	uint8                                        Pad_1214[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UBehaviorTreeComponent*                NodeOwnerComp;                                     // 0xD0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGGNPC*                                NPC;                                               // 0xD8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGGNPCWaypoint*                        Waypoint;                                          // 0xE0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGGNPCEvent_WorldInteraction*          WIEvent;                                           // 0xE8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1216[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGHandleWaypointAnimation* GetDefaultObj();

	void OnGGAnimNotifyTrigger(class AGGCharacter* TriggeredOnNPC, class UGGAnimNotify* AnimNotify, const struct FGameplayTag& NotifyTag);
	void OnAnimationEnded(class UAnimMontage* Montage, bool Interrupted);
};

// 0x58 (0xC8 - 0x70)
// Class Goat2.BTTask_GGInteractWithActor
class UBTTask_GGInteractWithActor : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                InteractActor;                                     // 0x98(0x28)(Edit, NativeAccessSpecifierPublic)
	float                                        HeldFor;                                           // 0xC0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_121F[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGInteractWithActor* GetDefaultObj();

};

// 0x20 (0xB8 - 0x98)
// Class Goat2.BTTask_GGMatchSpeedWith
class UBTTask_GGMatchSpeedWith : public UBTTask_BlackboardBase
{
public:
	float                                        DistanceAboveToMatchSpeed;                         // 0x98(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bResetSpeedOnSucceeded;                            // 0x9C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAllowSprinting;                                   // 0x9D(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_122B[0x1A];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGMatchSpeedWith* GetDefaultObj();

};

// 0xD8 (0x148 - 0x70)
// Class Goat2.BTTask_GGMountCharacter
class UBTTask_GGMountCharacter : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                TargetActor;                                       // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UStaticMeshComponent>    SaddleComponentClass;                              // 0x98(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRemoveCurrentBackGear;                            // 0xC0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1232[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MountDuration;                                     // 0xC4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bResetTargetActor;                                 // 0xC8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1233[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          VOTag;                                             // 0xCC(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        VODelayMin;                                        // 0xD4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        VODelayMax;                                        // 0xD8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SpeedIncrease;                                     // 0xDC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UGGRadialForceComponent>   ForceCompClass;                                    // 0xE0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGGNPC_Humanoid*                       NPC;                                               // 0xE8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGGCharacter*                          OtherCharacter;                                    // 0xF0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBehaviorTreeComponent*                OwnerBT;                                           // 0xF8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  SaddleComp;                                        // 0x100(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1238[0x30];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UGGRadialForceComponent*               ForceComp;                                         // 0x138(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1239[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGMountCharacter* GetDefaultObj();

	void PlayVO();
	void Dismount();
};

// 0x130 (0x1A0 - 0x70)
// Class Goat2.BTTask_GGNotifyNPC
class UBTTask_GGNotifyNPC : public UBTTaskNode
{
public:
	enum class ENotifyNPCMode                    NotifyMode;                                        // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_123B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                NotifyAboutActor;                                  // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bNotifyAboutAnActor;                               // 0xA0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_123C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                Location;                                          // 0xA8(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bUseLocation;                                      // 0xD0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_123D[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                NPCToNotify;                                       // 0xD8(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTag                          ReactionTag;                                       // 0x100(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FNotifyParameters                     NotifyParameters;                                  // 0x108(0x38)(Edit, NativeAccessSpecifierPublic)
	float                                        ProximityNotifyRadius;                             // 0x140(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1242[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FStartleDetailsSettings               StartleSettings;                                   // 0x148(0x50)(Edit, NativeAccessSpecifierPublic)
	bool                                         bIgnoreSelf;                                       // 0x198(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1243[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGNotifyNPC* GetDefaultObj();

};

// 0x68 (0xD8 - 0x70)
// Class Goat2.BTTask_GGPickNewWaypoint
class UBTTask_GGPickNewWaypoint : public UBTTaskNode
{
public:
	enum class EPickingType                      PickingType;                                       // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1249[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                BehaviorDataContainer;                             // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)
	enum class EBehaviorActors                   GetWaypointFrom;                                   // 0xA0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_124B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                WorldInteractionEvent;                             // 0xA8(0x28)(Edit, NativeAccessSpecifierPublic)
	enum class EWIPickType                       WorldInteractionPickType;                          // 0xD0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanEditBehaviorContainer;                         // 0xD1(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bCanEditWorldInteraction;                          // 0xD2(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_124E[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGPickNewWaypoint* GetDefaultObj();

};

// 0xA0 (0x110 - 0x70)
// Class Goat2.BTTask_GGPickUpActor
class UBTTask_GGPickUpActor : public UBTTaskNode
{
public:
	class UAnimMontage*                          PickupMontage;                                     // 0x70(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                TargetActor;                                       // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)
	enum class EPickupType                       PickupType;                                        // 0xA0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1255[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                BehaviorDataContainer;                             // 0xA8(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bAttemptToUseLostObjectData;                       // 0xD0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAttachToHand;                                     // 0xD1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAttachmentHandSlot               HandSlot;                                          // 0xD2(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1257[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  AttachmentSocket;                                  // 0xD4(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECarryItemType                    CarryType;                                         // 0xDC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDropOnRagdoll;                                    // 0xDD(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanTakeDamage;                                    // 0xDE(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanBecomeLostObject;                              // 0xDF(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanDropOnStartle;                                 // 0xE0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1259[0x17];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UBehaviorTreeComponent*                OwnerBT;                                           // 0xF8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGGNPC_Humanoid*                       NPC;                                               // 0x100(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bCanEditBehaviorContainer;                         // 0x108(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bCanEditExisitingPActor;                           // 0x109(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_125C[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGPickUpActor* GetDefaultObj();

	void OnGGAnimNotifyTrigger(class AGGCharacter* NotifyingNPC, class UGGAnimNotify* AnimNotify, const struct FGameplayTag& NotifyTag);
};

// 0xA8 (0x118 - 0x70)
// Class Goat2.BTTask_GGPlayNPCAnimation
class UBTTask_GGPlayNPCAnimation : public UBTTaskNode
{
public:
	bool                                         NonBlocking;                                       // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1268[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        BlockFor;                                          // 0x74(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PlayRate;                                          // 0x78(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRandomizePlayRate;                                // 0x7C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1269[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             PlayRateRange;                                     // 0x80(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAnimationType                    AnimationType;                                     // 0x88(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_126C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimMontage*                          AnimationToPlay;                                   // 0x90(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWeightedElement_AnimMontage>  AnimationsToPickFrom;                              // 0x98(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                MontageKey;                                        // 0xA8(0x28)(Edit, NativeAccessSpecifierPublic)
	enum class ENPCAnimation                     MontageToSelect;                                   // 0xD0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_126E[0x2F];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UBehaviorTreeComponent*                NodeOwnerComp;                                     // 0x100(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AGGNPC*                                NPC;                                               // 0x108(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCanEditDefault;                                   // 0x110(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCanEditBBKey;                                     // 0x111(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCanEditNPCMontages;                               // 0x112(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_126F[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGPlayNPCAnimation* GetDefaultObj();

	void OnHeadSlotChanged(class AGGNPC_Humanoid* SetOnNPC, const class FString& OldHead, const class FString& NewHead);
	void OnAnimationTimerDone();
	void OnAnimationEnded(class UAnimMontage* Montage, bool Interrupted);
};

// 0x10 (0x80 - 0x70)
// Class Goat2.BTTask_GGPlaySound
class UBTTask_GGPlaySound : public UBTTaskNode
{
public:
	class USoundBase*                            SoundEffect;                                       // 0x70(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         AttachedToNPC;                                     // 0x78(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1274[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGPlaySound* GetDefaultObj();

};

// 0x18 (0x88 - 0x70)
// Class Goat2.BTTask_GGPlayVO
class UBTTask_GGPlayVO : public UBTTaskNode
{
public:
	struct FGameplayTag                          VoiceOverType;                                     // 0x70(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bBlocking;                                         // 0x78(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanInterruptCurrentLine;                          // 0x79(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanBeStoppedByDamage;                             // 0x7A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1285[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UBehaviorTreeComponent*                NodeOwnerComp;                                     // 0x80(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGPlayVO* GetDefaultObj();

	void OnVoiceLineFinished(class AGGNPC* NPC, const struct FGameplayTag& VOTag, bool bCouldPlayVO);
};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTTask_GGPoolActor
class UBTTask_GGPoolActor : public UBTTaskNode
{
public:
	bool                                         bPoolGrabbedActor;                                 // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_128B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                TargetActor;                                       // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTTask_GGPoolActor* GetDefaultObj();

};

// 0x58 (0xC8 - 0x70)
// Class Goat2.BTTask_GGPPickNewTargetActor
class UBTTask_GGPPickNewTargetActor : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                BehaviorDataContainer;                             // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                TargetActor;                                       // 0x98(0x28)(Edit, NativeAccessSpecifierPrivate)
	enum class EBehaviorActors                   GetActorFrom;                                      // 0xC0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_128D[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGPPickNewTargetActor* GetDefaultObj();

};

// 0x50 (0xC0 - 0x70)
// Class Goat2.BTTask_GGReachedWaypoint
class UBTTask_GGReachedWaypoint : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                CurrentEvent;                                      // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                CurrentWaypoint;                                   // 0x98(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTTask_GGReachedWaypoint* GetDefaultObj();

};

// 0x28 (0x98 - 0x70)
// Class Goat2.BTTask_GGRequestCSCommand
class UBTTask_GGRequestCSCommand : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                CurrentEvent;                                      // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGRequestCSCommand* GetDefaultObj();

};

// 0x10 (0x80 - 0x70)
// Class Goat2.BTTask_GGResetBBEntries
class UBTTask_GGResetBBEntries : public UBTTaskNode
{
public:
	TArray<struct FBlackboardKeySelector>        BlackboardEntries;                                 // 0x70(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTTask_GGResetBBEntries* GetDefaultObj();

};

// 0x0 (0x98 - 0x98)
// Class Goat2.BTTask_GGResetBBEntry
class UBTTask_GGResetBBEntry : public UBTTask_BlackboardBase
{
public:

	static class UClass* StaticClass();
	static class UBTTask_GGResetBBEntry* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTTask_GGResetConversation
class UBTTask_GGResetConversation : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                ConversationTarget;                                // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)
	bool                                         bForOtherToo;                                      // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bStopCurrentVO;                                    // 0x99(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1292[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGResetConversation* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class Goat2.BTTask_GGResetCurrentWaypoint
class UBTTask_GGResetCurrentWaypoint : public UBTTaskNode
{
public:

	static class UClass* StaticClass();
	static class UBTTask_GGResetCurrentWaypoint* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTTask_GGResetKnockedOut
class UBTTask_GGResetKnockedOut : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                NPCCharacter;                                      // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)
	bool                                         OnlyIfKnockedOut;                                  // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1294[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGResetKnockedOut* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTTask_GGResetNPCInteract
class UBTTask_GGResetNPCInteract : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                InteractCharacter;                                 // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)
	bool                                         OnlySelf;                                          // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1295[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGResetNPCInteract* GetDefaultObj();

};

// 0x28 (0x98 - 0x70)
// Class Goat2.BTTask_GGResetNPCStandupDelay
class UBTTask_GGResetNPCStandupDelay : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTTask_GGResetNPCStandupDelay* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class Goat2.BTTask_GGResetProximityReact
class UBTTask_GGResetProximityReact : public UBTTaskNode
{
public:

	static class UClass* StaticClass();
	static class UBTTask_GGResetProximityReact* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class Goat2.BTTask_GGReturnFromIdleNPC
class UBTTask_GGReturnFromIdleNPC : public UBTTaskNode
{
public:
	bool                                         bAttemptToResetCollision;                          // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bAlwaysSucceed;                                    // 0x71(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1299[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGReturnFromIdleNPC* GetDefaultObj();

};

// 0x10 (0xA8 - 0x98)
// Class Goat2.BTTask_GGRotateToFaceBBEntry
class UBTTask_GGRotateToFaceBBEntry : public UBTTask_BlackboardBase
{
public:
	float                                        Precision;                                         // 0x98(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRandomRotation;                                   // 0x9C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bClearFocusAfterSucceeded;                         // 0x9D(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInfiniteExecution;                                // 0x9E(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_129B[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CompleteAfterDuration;                             // 0xA0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_129D[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGRotateToFaceBBEntry* GetDefaultObj();

};

// 0xC0 (0x130 - 0x70)
// Class Goat2.BTTask_GGScanForActors
class UBTTask_GGScanForActors : public UBTTaskNode
{
public:
	int32                                        ChanceToScan;                                      // 0x70(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_129E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                ActorValueToFill;                                  // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)
	enum class ETaskActorScanTypes               ActorsToScanFor;                                   // 0xA0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPreferNearestActor;                               // 0xA1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12A1[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class ECollisionChannel>         CollisionChannels;                                 // 0xA8(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         bRequireValidPath;                                 // 0xB8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12A4[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UNavigationQueryFilter>    FilterClass;                                       // 0xC0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bProjectToNavMesh;                                 // 0xC8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDrawScan;                                         // 0xC9(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12A7[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                ScanLocation;                                      // 0xD0(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bUseBBScanRadius;                                  // 0xF8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12A8[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                BBScanRadius;                                      // 0x100(0x28)(Edit, NativeAccessSpecifierPublic)
	float                                        ScanRadius;                                        // 0x128(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12A9[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGScanForActors* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class Goat2.BTTask_GGSetAnimationState
class UBTTask_GGSetAnimationState : public UBTTaskNode
{
public:
	enum class ENPCAnimationStates               NewState;                                          // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12AA[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGSetAnimationState* GetDefaultObj();

};

// 0x50 (0xC0 - 0x70)
// Class Goat2.BTTask_GGSetBB_Actor
class UBTTask_GGSetBB_Actor : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                ValueToSet;                                        // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                ValueToFill;                                       // 0x98(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGSetBB_Actor* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTTask_GGSetBB_Bool
class UBTTask_GGSetBB_Bool : public UBTTaskNode
{
public:
	bool                                         Value;                                             // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_12B1[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                BoolKey;                                           // 0x78(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGSetBB_Bool* GetDefaultObj();

};

// 0x40 (0xB0 - 0x70)
// Class Goat2.BTTask_GGSetBB_Float
class UBTTask_GGSetBB_Float : public UBTTaskNode
{
public:
	float                                        Value;                                             // 0x70(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bRandomInRange;                                    // 0x74(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12B4[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector2D                             RandomRange;                                       // 0x78(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAddToCurrent;                                     // 0x80(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12B5[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                FloatKey;                                          // 0x88(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTTask_GGSetBB_Float* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTTask_GGSetBB_Int
class UBTTask_GGSetBB_Int : public UBTTaskNode
{
public:
	int32                                        Value;                                             // 0x70(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bAddToCurrent;                                     // 0x74(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12BE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                IntKey;                                            // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTTask_GGSetBB_Int* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTTask_GGSetBB_Vector
class UBTTask_GGSetBB_Vector : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                ValueToChange;                                     // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)
	bool                                         bSetToPawnLocation;                                // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_12C3[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGSetBB_Vector* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTTask_GGSetBuyerEventState
class UBTTask_GGSetBuyerEventState : public UBTTaskNode
{
public:
	int32                                        StateToSet;                                        // 0x70(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_12C4[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                StallEvent;                                        // 0x78(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGSetBuyerEventState* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTTask_GGSetCanPanic
class UBTTask_GGSetCanPanic : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                TargetActor;                                       // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bResetToDefault;                                   // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanPanic;                                         // 0x99(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12C6[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGSetCanPanic* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTTask_GGSetCanProximityReact
class UBTTask_GGSetCanProximityReact : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                TargetActor;                                       // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bResetToDefault;                                   // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanProximityReact;                                // 0x99(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_12CB[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGSetCanProximityReact* GetDefaultObj();

};

// 0x18 (0x88 - 0x70)
// Class Goat2.BTTask_GGSetCollisionProfile
class UBTTask_GGSetCollisionProfile : public UBTTaskNode
{
public:
	bool                                         bSkipWhenRagdolled;                                // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_12EC[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          CapsuleProfileTag;                                 // 0x74(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	struct FGameplayTag                          MeshProfileTag;                                    // 0x7C(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_12ED[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGSetCollisionProfile* GetDefaultObj();

};

// 0x58 (0xC8 - 0x70)
// Class Goat2.BTTask_GGSetConversationStarter
class UBTTask_GGSetConversationStarter : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                ConversationTarget;                                // 0x98(0x28)(Edit, NativeAccessSpecifierPrivate)
	enum class EConversationStates               StarterState;                                      // 0xC0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_12F4[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGSetConversationStarter* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTTask_GGSetConversationState
class UBTTask_GGSetConversationState : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                TargetNPC;                                         // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)
	enum class EConversationStates               NewState;                                          // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_12FC[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGSetConversationState* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTTask_GGSetFocus
class UBTTask_GGSetFocus : public UBTTaskNode
{
public:
	bool                                         bClearFocus;                                       // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1303[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                NewFocusKey;                                       // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTTask_GGSetFocus* GetDefaultObj();

};

// 0x38 (0xA8 - 0x70)
// Class Goat2.BTTask_GGSetLookAtOverride
class UBTTask_GGSetLookAtOverride : public UBTTaskNode
{
public:
	bool                                         bClearOverride;                                    // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_130B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                BlackboardActor;                                   // 0x78(0x28)(Edit, NativeAccessSpecifierPrivate)
	float                                        Duration;                                          // 0xA0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bResetOnRagdoll;                                   // 0xA4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bResetOnProximityReact;                            // 0xA5(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bResetOnExtremeMood;                               // 0xA6(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         bResetOnPanic;                                     // 0xA7(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGSetLookAtOverride* GetDefaultObj();

};

// 0xA8 (0x118 - 0x70)
// Class Goat2.BTTask_GGSetMood
class UBTTask_GGSetMood : public UBTTaskNode
{
public:
	enum class EMoods                            OnlySetIfMoodIs;                                   // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         ResetInteraction;                                  // 0x71(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EMoodSetType                      MoodSetType;                                       // 0x72(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EMoods                            NewMood;                                           // 0x73(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1313[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<enum class EMoods>                    RandomMoodPool;                                    // 0x78(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	bool                                         SetInteractMoodChange;                             // 0x88(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         SetSameOnSelf;                                     // 0x89(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1316[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                NewBBMood;                                         // 0x90(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         SetAsDamagedBy;                                    // 0xB8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1319[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                TargetActor;                                       // 0xC0(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                FleeFrom;                                          // 0xE8(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bCanEditInteractMoodChange;                        // 0x110(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCanEditDefault;                                   // 0x111(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCanEditRandomMood;                                // 0x112(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCanEditBBKey;                                     // 0x113(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCanEditAngryWithTar;                              // 0x114(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCanEditFleeFromLoc;                               // 0x115(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_131F[0x2];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGSetMood* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTTask_GGSetMoodFromEvent
class UBTTask_GGSetMoodFromEvent : public UBTTaskNode
{
public:
	bool                                         UseEventChance;                                    // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1324[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                CurrentEvent;                                      // 0x78(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGSetMoodFromEvent* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class Goat2.BTTask_GGSetMovementMode
class UBTTask_GGSetMovementMode : public UBTTaskNode
{
public:
	enum class EMovementMode                     NewMovementMode;                                   // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	enum class ECustomMovementModes              CustomMovementMode;                                // 0x71(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_132A[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGSetMovementMode* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class Goat2.BTTask_GGSetMoveSpeed
class UBTTask_GGSetMoveSpeed : public UBTTaskNode
{
public:
	enum class ENPCMoveMode                      MoveMode;                                          // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_132F[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGSetMoveSpeed* GetDefaultObj();

};

// 0x60 (0xD0 - 0x70)
// Class Goat2.BTTask_GGSetNPCEventState
class UBTTask_GGSetNPCEventState : public UBTTaskNode
{
public:
	int32                                        StateToSet;                                        // 0x70(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1332[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                NPCToSetOn;                                        // 0x78(0x28)(Edit, NativeAccessSpecifierPrivate)
	bool                                         bSetOnAllNPCs;                                     // 0xA0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_1334[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                Event;                                             // 0xA8(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGSetNPCEventState* GetDefaultObj();

};

// 0x78 (0xE8 - 0x70)
// Class Goat2.BTTask_GGSetObjectToAdmire
class UBTTask_GGSetObjectToAdmire : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                TargetActor;                                       // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                TargetLocation;                                    // 0x98(0x28)(Edit, NativeAccessSpecifierPrivate)
	struct FBlackboardKeySelector                CurrentEvent;                                      // 0xC0(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGSetObjectToAdmire* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTTask_GGSetPointAtActor
class UBTTask_GGSetPointAtActor : public UBTTaskNode
{
public:
	bool                                         bResetTargetToNull;                                // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_133B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                TargetActor;                                       // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTTask_GGSetPointAtActor* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTTask_GGSetRagdoll
class UBTTask_GGSetRagdoll : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bNewRagdollState;                                  // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSetPassedOut;                                     // 0x99(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_133D[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGSetRagdoll* GetDefaultObj();

};

// 0x10 (0xA8 - 0x98)
// Class Goat2.BTTask_GGSetRandomClassType
class UBTTask_GGSetRandomClassType : public UBTTask_BlackboardBase
{
public:
	TArray<TSubclassOf<class AActor>>            ClassesToChooseFrom;                               // 0x98(0x10)(Edit, ZeroConstructor, Protected, UObjectWrapper, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBTTask_GGSetRandomClassType* GetDefaultObj();

};

// 0x18 (0xB0 - 0x98)
// Class Goat2.BTTask_GGSetRandomValue
class UBTTask_GGSetRandomValue : public UBTTask_BlackboardBase
{
public:
	struct FIntVector                            IntRandomRange;                                    // 0x98(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                             FloatRandomRange;                                  // 0xA4(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanEditInt;                                       // 0xAC(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCanEditFloat;                                     // 0xAD(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCanEditVector;                                    // 0xAE(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCanEditRotator;                                   // 0xAF(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class UBTTask_GGSetRandomValue* GetDefaultObj();

};

// 0x30 (0xA0 - 0x70)
// Class Goat2.BTTask_GGSetReactInitialized
class UBTTask_GGSetReactInitialized : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                ReactInitialized;                                  // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	enum class EReactInitialized                 ValueToSet;                                        // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_134D[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGSetReactInitialized* GetDefaultObj();

};

// 0x28 (0x98 - 0x70)
// Class Goat2.BTTask_GGSetReactType
class UBTTask_GGSetReactType : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                ReactType;                                         // 0x70(0x28)(Edit, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGSetReactType* GetDefaultObj();

};

// 0x0 (0x98 - 0x98)
// Class Goat2.BTTask_GGSetSelfActor
class UBTTask_GGSetSelfActor : public UBTTask_BlackboardBase
{
public:

	static class UClass* StaticClass();
	static class UBTTask_GGSetSelfActor* GetDefaultObj();

};

// 0x28 (0x98 - 0x70)
// Class Goat2.BTTask_GGSetStumbledBy
class UBTTask_GGSetStumbledBy : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                StumbledBy;                                        // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTTask_GGSetStumbledBy* GetDefaultObj();

};

// 0x38 (0xA8 - 0x70)
// Class Goat2.BTTask_GGSetWasInState
class UBTTask_GGSetWasInState : public UBTTaskNode
{
public:
	enum class EWasInStates                      State;                                             // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         RemoveFromString;                                  // 0x71(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_135B[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                WasInStates;                                       // 0x78(0x28)(Edit, NativeAccessSpecifierPrivate)
	bool                                         ClearString;                                       // 0xA0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_135C[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGSetWasInState* GetDefaultObj();

};

// 0x138 (0x1A8 - 0x70)
// Class Goat2.BTTask_GGSpawnActor
class UBTTask_GGSpawnActor : public UBTTaskNode
{
public:
	enum class EActorSpawnType                   ActorSpawnType;                                    // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseSoftActorClass;                                // 0x71(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1367[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class AActor>                    ActorClass;                                        // 0x78(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class AActor>                  SoftActorClass;                                    // 0x80(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESpawnActorCollisionHandlingMethod CollisionHandlingMethod;                           // 0xA8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1369[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UAnimMontage*                          Montage;                                           // 0xB0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          AnimationNotifyTag;                                // 0xB8(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bPreventFromRagdollingOwner;                       // 0xC0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EActorSpawnLocationType           ActorSpawnLocationType;                            // 0xC1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_136C[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               Location;                                          // 0xC4(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                BlackboardLocation;                                // 0xD0(0x28)(Edit, NativeAccessSpecifierPublic)
	float                                        DistanceInFront;                                   // 0xF8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        HeightAdjust;                                      // 0xFC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  SocketName;                                        // 0x100(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EActorSpawnRotationType           ActorSpawnRotationType;                            // 0x108(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1370[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FRotator                              Rotation;                                          // 0x10C(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	bool                                         bAttachToHand;                                     // 0x118(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class EAttachmentHandSlot               HandSlot;                                          // 0x119(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1373[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class FName                                  AttachmentSocket;                                  // 0x11C(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ECarryItemType                    CarryType;                                         // 0x124(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bDropOnRagdoll;                                    // 0x125(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanTakeDamage;                                    // 0x126(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanBecomeLostObject;                              // 0x127(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCanDropOnStartle;                                 // 0x128(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ESameSocketAttach                 SameSocketAttachAction;                            // 0x129(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1376[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class UStaticMesh>            MeshOverride;                                      // 0x130(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bStartPhysicsSimulation;                           // 0x158(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bApplyAnInitialImpulse;                            // 0x159(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bInPawnDirection;                                  // 0x15A(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_137A[0x1];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ImpulsePower;                                      // 0x15C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               InitialImpulseDirection;                           // 0x160(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_137B[0x14];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UBehaviorTreeComponent*                OwnerBT;                                           // 0x180(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class AGGNPC*                                OwnerNPC;                                          // 0x188(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_137D[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGSpawnActor* GetDefaultObj();

	void OnGGAnimNotifyTrigger(class AGGCharacter* NotifyingNPC, class UGGAnimNotify* AnimNotify, const struct FGameplayTag& NotifyTag);
};

// 0x28 (0x98 - 0x70)
// Class Goat2.BTTask_GGStandUp
class UBTTask_GGStandUp : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                Character;                                         // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTTask_GGStandUp* GetDefaultObj();

};

// 0x68 (0xD8 - 0x70)
// Class Goat2.BTTask_GGStartInvestigating
class UBTTask_GGStartInvestigating : public UBTTaskNode
{
public:
	struct FGameplayTag                          InvestigationType;                                 // 0x70(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                ActorToInvestigate;                                // 0x78(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bUseActorToInvestigate;                            // 0xA0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_138C[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                LocationToInvestigate;                             // 0xA8(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bUseLocationToInvestigate;                         // 0xD0(0x1)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_138E[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGStartInvestigating* GetDefaultObj();

};

// 0x60 (0xF8 - 0x98)
// Class Goat2.BTTask_GGStartToPanic
class UBTTask_GGStartToPanic : public UBTTask_BlackboardBase
{
public:
	enum class EPanicTypes                       PanicType;                                         // 0x98(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSetSourceLocation;                                // 0x99(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1393[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                SourceLocation;                                    // 0xA0(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bSetSourceActor;                                   // 0xC8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1396[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                SourceActor;                                       // 0xD0(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTTask_GGStartToPanic* GetDefaultObj();

};

// 0x188 (0x1F8 - 0x70)
// Class Goat2.BTTask_GGSteerTo
class UBTTask_GGSteerTo : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                NextPoint;                                         // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                LastPoint;                                         // 0x98(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                ReachedLastPoint;                                  // 0xC0(0x28)(Edit, NativeAccessSpecifierPublic)
	float                                        YawAcceptanceRadius;                               // 0xE8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        YawSlowTurnRadius;                                 // 0xEC(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SlowTurnMultiplier;                                // 0xF0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MinDistanceToBack;                                 // 0xF4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LastNodeStopDistance;                              // 0xF8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         CanUseCarHorn;                                     // 0xFC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_139D[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        HornCD;                                            // 0x100(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        HornChance;                                        // 0x104(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeUntilInvertedInput;                            // 0x108(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InvertedInputDuration;                             // 0x10C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FeelerTraceMultiplier;                             // 0x110(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        FeelerTraceMin;                                    // 0x114(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStartleDetailsSettings               NearHitStartleSettings;                            // 0x118(0x50)(Edit, NativeAccessSpecifierPublic)
	float                                        MiddleFeelerCheckInterval;                         // 0x168(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_139E[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MiddleFeelerTraceMin;                              // 0x170(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MiddleFeelerTraceMax;                              // 0x174(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MiddleFeelerTraceMultiplier;                       // 0x178(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MiddleFeelerTraceTurnAdjust;                       // 0x17C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TimeUntilRunOverNPC;                               // 0x180(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        StopCaringFor;                                     // 0x184(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGGVehicle*                            Vehicle;                                           // 0x188(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_139F[0x68];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGSteerTo* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class Goat2.BTTask_GGStopMontage
class UBTTask_GGStopMontage : public UBTTaskNode
{
public:

	static class UClass* StaticClass();
	static class UBTTask_GGStopMontage* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class Goat2.BTTask_GGStopMovement
class UBTTask_GGStopMovement : public UBTTaskNode
{
public:

	static class UClass* StaticClass();
	static class UBTTask_GGStopMovement* GetDefaultObj();

};

// 0x28 (0x98 - 0x70)
// Class Goat2.BTTask_GGStopPanicking
class UBTTask_GGStopPanicking : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                SelfActor;                                         // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UBTTask_GGStopPanicking* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class Goat2.BTTask_GGStopTaxiRide
class UBTTask_GGStopTaxiRide : public UBTTaskNode
{
public:

	static class UClass* StaticClass();
	static class UBTTask_GGStopTaxiRide* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class Goat2.BTTask_GGStopVehicleInput
class UBTTask_GGStopVehicleInput : public UBTTaskNode
{
public:
	bool                                         ClearThrottle;                                     // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	bool                                         ClearSteering;                                     // 0x71(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_13B1[0x6];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGStopVehicleInput* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class Goat2.BTTask_GGSwitchToRoaming
class UBTTask_GGSwitchToRoaming : public UBTTaskNode
{
public:

	static class UClass* StaticClass();
	static class UBTTask_GGSwitchToRoaming* GetDefaultObj();

};

// 0x78 (0xE8 - 0x70)
// Class Goat2.BTTask_GGTaxiRide
class UBTTask_GGTaxiRide : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                TargetActor;                                       // 0x70(0x28)(Edit, Protected, NativeAccessSpecifierProtected)
	TSoftClassPtr<class UStaticMeshComponent>    SaddleComponentClass;                              // 0x98(0x28)(Edit, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bRemoveCurrentBackGear;                            // 0xC0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bResetTargetActor;                                 // 0xC1(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_13B7[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AGGNPC_Humanoid*                       NPC;                                               // 0xC8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGGGoat*                               TaxiGoat;                                          // 0xD0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UBehaviorTreeComponent*                OwnerBT;                                           // 0xD8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UStaticMeshComponent*                  SaddleComp;                                        // 0xE0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGTaxiRide* GetDefaultObj();

};

// 0x90 (0x100 - 0x70)
// Class Goat2.BTTask_GGThrowObject
class UBTTask_GGThrowObject : public UBTTaskNode
{
public:
	class UAnimMontage*                          ThrowMontage;                                      // 0x70(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FWeightedElement_ThrowingObject> ObjectsToThrow;                                    // 0x78(0x10)(Edit, ZeroConstructor, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                TargetActor;                                       // 0x88(0x28)(Edit, NativeAccessSpecifierPublic)
	float                                        ThrowForce;                                        // 0xB0(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseAdequateForce;                                 // 0xB4(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13BE[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               TargetLocationAdjust;                              // 0xB8(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        DistanceInFront;                                   // 0xC4(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        AnimPlayRate;                                      // 0xC8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13BF[0x14];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UBehaviorTreeComponent*                OwnerBT;                                           // 0xE0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGGNPC_Humanoid*                       NPC;                                               // 0xE8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGGPhysicsActor*                       PActorToThrow;                                     // 0xF0(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGGPhysicsProjectile*                  PhysProjToThrow;                                   // 0xF8(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UBTTask_GGThrowObject* GetDefaultObj();

	void OnGGAnimNotifyTrigger(class AGGCharacter* NotifyingNPC, class UGGAnimNotify* AnimNotify, const struct FGameplayTag& NotifyTag);
};

// 0x50 (0xC0 - 0x70)
// Class Goat2.BTTask_GGTriggerInstict
class UBTTask_GGTriggerInstict : public UBTTaskNode
{
public:
	struct FBlackboardKeySelector                TargetActor;                                       // 0x70(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FGameplayTag                          InstinctTag;                                       // 0x98(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSpecialOwnerNPC;                                  // 0xA0(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13C6[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          NPCIdentifierTag;                                  // 0xA4(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bSpecialTargetNPC;                                 // 0xAC(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13C7[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTag                          TargetNPCIdentifierTag;                            // 0xB0(0x8)(Edit, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ScanGoatRadius;                                    // 0xB8(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13C8[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGTriggerInstict* GetDefaultObj();

};

// 0x0 (0x70 - 0x70)
// Class Goat2.BTTask_GGUpdateLostObject
class UBTTask_GGUpdateLostObject : public UBTTaskNode
{
public:

	static class UClass* StaticClass();
	static class UBTTask_GGUpdateLostObject* GetDefaultObj();

};

// 0x8 (0x78 - 0x70)
// Class Goat2.BTTask_GGVehicleHandbrake
class UBTTask_GGVehicleHandbrake : public UBTTaskNode
{
public:
	bool                                         HandbrakeInput;                                    // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_13CC[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGVehicleHandbrake* GetDefaultObj();

};

// 0x98 (0x108 - 0x70)
// Class Goat2.BTTask_GGWait
class UBTTask_GGWait : public UBTTaskNode
{
public:
	enum class EWaitType                         WaitType;                                          // 0x70(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13D1[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        WaitTime;                                          // 0x74(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        RandomDeviation;                                   // 0x78(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13D2[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                BlackboardKey;                                     // 0x80(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bUseWaypointPreAnimationWait;                      // 0xA8(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13D4[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FBlackboardKeySelector                BBFloatDuration;                                   // 0xB0(0x28)(Edit, NativeAccessSpecifierPublic)
	struct FBlackboardKeySelector                BBFloatDeviation;                                  // 0xD8(0x28)(Edit, NativeAccessSpecifierPublic)
	bool                                         bCanEditDefault;                                   // 0x100(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCanEditBBKey;                                     // 0x101(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bCanEditFloatBBEntries;                            // 0x102(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_13D6[0x5];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UBTTask_GGWait* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Goat2.EQContext_GGCSQueryLoc
class UEQContext_GGCSQueryLoc : public UEnvQueryContext
{
public:

	static class UClass* StaticClass();
	static class UEQContext_GGCSQueryLoc* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Goat2.EQContext_GGCSQueryRot
class UEQContext_GGCSQueryRot : public UEnvQueryContext
{
public:

	static class UClass* StaticClass();
	static class UEQContext_GGCSQueryRot* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Goat2.EQContext_GGFirstCSTarget
class UEQContext_GGFirstCSTarget : public UEnvQueryContext
{
public:

	static class UClass* StaticClass();
	static class UEQContext_GGFirstCSTarget* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Goat2.EQContext_GGInteractActor
class UEQContext_GGInteractActor : public UEnvQueryContext
{
public:

	static class UClass* StaticClass();
	static class UEQContext_GGInteractActor* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Goat2.EQContext_GGLastRoamLocation
class UEQContext_GGLastRoamLocation : public UEnvQueryContext
{
public:

	static class UClass* StaticClass();
	static class UEQContext_GGLastRoamLocation* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Goat2.EQContext_GGLostObject
class UEQContext_GGLostObject : public UEnvQueryContext
{
public:

	static class UClass* StaticClass();
	static class UEQContext_GGLostObject* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Goat2.EQContext_GGPanicLocation
class UEQContext_GGPanicLocation : public UEnvQueryContext
{
public:

	static class UClass* StaticClass();
	static class UEQContext_GGPanicLocation* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Goat2.EQContext_GGPanicSourceActor
class UEQContext_GGPanicSourceActor : public UEnvQueryContext
{
public:

	static class UClass* StaticClass();
	static class UEQContext_GGPanicSourceActor* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Goat2.EQContext_GGReactActor
class UEQContext_GGReactActor : public UEnvQueryContext
{
public:

	static class UClass* StaticClass();
	static class UEQContext_GGReactActor* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Goat2.EQContext_GGReactLocation
class UEQContext_GGReactLocation : public UEnvQueryContext
{
public:

	static class UClass* StaticClass();
	static class UEQContext_GGReactLocation* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Goat2.EQContext_GGScaryLocation
class UEQContext_GGScaryLocation : public UEnvQueryContext
{
public:

	static class UClass* StaticClass();
	static class UEQContext_GGScaryLocation* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Goat2.EQContext_GGStumbledBy
class UEQContext_GGStumbledBy : public UEnvQueryContext
{
public:

	static class UClass* StaticClass();
	static class UEQContext_GGStumbledBy* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Goat2.EQContext_GGTargetActor
class UEQContext_GGTargetActor : public UEnvQueryContext
{
public:

	static class UClass* StaticClass();
	static class UEQContext_GGTargetActor* GetDefaultObj();

};

// 0x0 (0x28 - 0x28)
// Class Goat2.EQContext_GGTargetLocation
class UEQContext_GGTargetLocation : public UEnvQueryContext
{
public:

	static class UClass* StaticClass();
	static class UEQContext_GGTargetLocation* GetDefaultObj();

};

// 0x140 (0x1C0 - 0x80)
// Class Goat2.EQGenerator_FilledCircle
class UEQGenerator_FilledCircle : public UEnvQueryGenerator_ProjectedPoints
{
public:
	float                                        OuterCircleRadius;                                 // 0x80(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        InnerCircleRadius;                                 // 0x84(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	int32                                        NumberOfRings;                                     // 0x88(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        SpaceBetween;                                      // 0x8C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        ArcAngle;                                          // 0x90(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_13F0[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAIDataProviderFloatValue             OuterCircleRadiusParam;                            // 0x98(0x38)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue             InnerCircleRadiusParam;                            // 0xD0(0x38)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderIntValue               NumberOfRingsParam;                                // 0x108(0x38)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue             SpaceBetweenParam;                                 // 0x140(0x38)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	struct FAIDataProviderFloatValue             ArcAngleParam;                                     // 0x178(0x38)(Edit, DisableEditOnInstance, ContainsInstancedReference, NativeAccessSpecifierPrivate)
	TSubclassOf<class UEnvQueryContext>          CircleCenter;                                      // 0x1B0(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	TSubclassOf<class UEnvQueryContext>          ContextRotation;                                   // 0x1B8(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UEQGenerator_FilledCircle* GetDefaultObj();

};

// 0x20 (0x218 - 0x1F8)
// Class Goat2.EQTest_GGNavAreas
class UEQTest_GGNavAreas : public UEnvQueryTest
{
public:
	TArray<TSubclassOf<class UNavArea>>          NavAreas;                                          // 0x1F8(0x10)(Edit, ZeroConstructor, DisableEditOnInstance, UObjectWrapper, NativeAccessSpecifierPublic)
	struct FVector                               Extent;                                            // 0x208(0xC)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_13F5[0x4];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UEQTest_GGNavAreas* GetDefaultObj();

};

// 0x28 (0x220 - 0x1F8)
// Class Goat2.EQTest_GGStationaryNPC
class UEQTest_GGStationaryNPC : public UEnvQueryTest
{
public:
	struct FEnvOverlapData                       OverlapData;                                       // 0x1F8(0x20)(Edit, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPrivate)
	bool                                         DebugDraw;                                         // 0x218(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_13FB[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        VelocityTolerance;                                 // 0x21C(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class UEQTest_GGStationaryNPC* GetDefaultObj();

};

// 0xC0 (0x2F0 - 0x230)
// Class Goat2.GG4DArtGallery
class AGG4DArtGallery : public AActor
{
public:
	int32                                        NumPoles;                                          // 0x230(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1400[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMesh*                           PoleMesh;                                          // 0x238(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               PoleScale;                                         // 0x240(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        PoleDistanceFromCenter;                            // 0x24C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               PoleOffset;                                        // 0x250(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  PoleOneParameterName;                              // 0x25C(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  PoleTwoParameterName;                              // 0x264(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1402[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMesh*                           GateMesh;                                          // 0x270(0x8)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               GateOffset;                                        // 0x278(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FVector                               GateScale;                                         // 0x284(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class ESplineMeshAxis                   GateForwardAxis;                                   // 0x290(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1403[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USceneComponent*                       Root;                                              // 0x298(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                       PoleRoot;                                          // 0x2A0(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USceneComponent*                       ExhibitionsRoot;                                   // 0x2A8(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<class UStaticMeshComponent*>          Poles;                                             // 0x2B0(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class USplineMeshComponent*>          Gates;                                             // 0x2C0(0x10)(ExportObject, ZeroConstructor, ContainsInstancedReference, Protected, NativeAccessSpecifierProtected)
	TArray<class UMaterialInterface*>            ExhibitionMeshMaterials;                           // 0x2D0(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class UMaterialInstanceDynamic*>      ExhibitionMaterialInstances;                       // 0x2E0(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class AGG4DArtGallery* GetDefaultObj();

};

// 0xA0 (0x2D0 - 0x230)
// Class Goat2.GGPhysicsProjectile
class AGGPhysicsProjectile : public AActor
{
public:
	FMulticastInlineDelegateProperty_            OnSpecialTargetHitEvent;                           // 0x230(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, NativeAccessSpecifierPublic)
	class UGGStaticMeshComponent*                Mesh;                                              // 0x240(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UArrowComponent*                       ForwardDirectionArrow;                             // 0x248(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UProjectileMovementComponent*          ProjectileMovement;                                // 0x250(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bAddArrowTranslationToSpawnLocation;               // 0x258(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1416[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        StickToTargetOffset;                               // 0x25C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class USoundCue*                             LaunchSound;                                       // 0x260(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystem*                       LaunchParticles;                                   // 0x268(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bIgnoreOwnerWhenMoving;                            // 0x270(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPlayVehicleImpactSound;                           // 0x271(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bPlayPhysicsActorImpactSound;                      // 0x272(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EGGProjectileHitResponse          HitResponseNormalTarget;                           // 0x273(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bResolveNormalHitResponseInChildClass;             // 0x274(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bStayActiveAfterHit;                               // 0x275(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1418[0x2];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USoundCue*                             TargetHitSound;                                    // 0x278(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystem*                       TargetHitParticles;                                // 0x280(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	enum class EGGProjectileHitResponse          HitResponseSpecialTarget;                          // 0x288(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bResolveSpecialHitResponseInChildClass;            // 0x289(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1419[0x6];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class USoundCue*                             SpecialTargetHitSound;                             // 0x290(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UParticleSystem*                       SpecialTargetHitParticles;                         // 0x298(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<TSubclassOf<class AActor>>            SpecialTargets;                                    // 0x2A0(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, Protected, UObjectWrapper, NativeAccessSpecifierProtected)
	bool                                         bSpecialTargetsAreBlackList;                       // 0x2B0(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_141B[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AGGPhysicsActor_Base*                  PhysicsActor;                                      // 0x2B8(0x8)(Net, ZeroConstructor, IsPlainOldData, RepNotify, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UAudioComponent*                       LaunchAudioComponent;                              // 0x2C0(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UParticleSystemComponent*              LaunchParticlesComponent;                          // 0x2C8(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)

	static class UClass* StaticClass();
	static class AGGPhysicsProjectile* GetDefaultObj();

	class AGGPhysicsProjectile* SpawnProjectile_K2(const struct FTransform& SpawnTransform, TSubclassOf<class AGGPhysicsProjectile>& Class, class AActor* ProjectileOwner);
	void OnSpecialTargetHit_K2(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComponent, const struct FVector& NormalImpulse, struct FHitResult& Hit);
	void OnRepPhysicsActor();
	void OnNormalTargetHit_K2(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComponent, const struct FVector& NormalImpulse, struct FHitResult& Hit);
	void OnHit(class UPrimitiveComponent* HitComponent, class AActor* OtherActor, class UPrimitiveComponent* OtherComponent, const struct FVector& NormalImpulse, struct FHitResult& Hit);
	void OnAttachedActorDestroyed(class AActor* DestroyedActor);
};

// 0x60 (0x330 - 0x2D0)
// Class Goat2.GGAbominanaGoo
class AGGAbominanaGoo : public AGGPhysicsProjectile
{
public:
	class UCurveFloat*                           ChargePercentageToHitRadius;                       // 0x2D0(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          GameplayCueHitTag;                                 // 0x2D8(0x8)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	bool                                         bDebugProjectile;                                  // 0x2E0(0x1)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_141E[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        ProjectileScaleAtMaxCharge;                        // 0x2E4(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ParticleScaleAtMaxCharge;                          // 0x2E8(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          AbominanaIdentifierTag;                            // 0x2EC(0x8)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1420[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSubclassOf<class UDamageType>               DamageTypeClass;                                   // 0x2F8(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        DamageAmount;                                      // 0x300(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	float                                        ImpulseForce;                                      // 0x304(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class FName                                  BananaMeshRotationSocket;                          // 0x308(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TSubclassOf<class AGGPhysicsActor_AbominanaBanana> BananaActor;                                       // 0x310(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	int32                                        AmountOfNPCsToHit;                                 // 0x318(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	struct FGameplayTag                          InstinctTag;                                       // 0x31C(0x8)(Edit, DisableEditOnInstance, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1421[0xC];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AGGAbominanaGoo* GetDefaultObj();

};

// 0x0 (0x230 - 0x230)
// Class Goat2.GGAchievement
class AGGAchievement : public AActor
{
public:

	static class UClass* StaticClass();
	static class AGGAchievement* GetDefaultObj();

	void OnAchievementInitialize();
	bool HasMetRequirements(bool bIsClient, bool bIsMainMenu, bool bIsIsland);
	TArray<class AGGPlayerController*> GetPlayersInWorld();
};

// 0xB0 (0xE0 - 0x30)
// Class Goat2.GGAchievementSubsystem
class UGGAchievementSubsystem : public UGameInstanceSubsystem
{
public:
	uint8                                        Pad_1432[0x60];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	class UDataTable*                            AchievementDataTable;                              // 0x90(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_1433[0x18];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<class AGGAchievement*>                SpawnedAchievements;                               // 0xB0(0x10)(ZeroConstructor, Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_1434[0x20];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGGAchievementSubsystem* GetDefaultObj();

	void UnlockAchievements(const TArray<class FString>& AchievementIDs, class AGGPlayerController* PC);
	void UnlockAchievement(const class FString& AchievementID, class AGGPlayerController* PC);
	void QueryAchievements();
};

// 0x48 (0x2A8 - 0x260)
// Class Goat2.GGActionHintBarEntry
class UGGActionHintBarEntry : public UUserWidget
{
public:
	struct FActionHintStruct                     ActionHint;                                        // 0x260(0x40)(BlueprintVisible, BlueprintReadOnly, NativeAccessSpecifierPublic)
	bool                                         bIsEdgePosition;                                   // 0x2A0(0x1)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1436[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        MobileSidePaddingPercentage;                       // 0x2A4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UGGActionHintBarEntry* GetDefaultObj();

	void OnHintUpdated();
};

// 0xA8 (0x308 - 0x260)
// Class Goat2.GGUserWidget
class UGGUserWidget : public UUserWidget
{
public:
	struct FGameplayTag                          WidgetTag;                                         // 0x260(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowFocusMarkerOnHover;                           // 0x268(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowFocusMarkerOnFocusMobile;                     // 0x269(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFocusOnHover;                                     // 0x26A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1465[0x5];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	FMulticastInlineDelegateProperty_            OnWidgetInteracted;                                // 0x270(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnWidgetHovered;                                   // 0x280(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnWidgetUnhovered;                                 // 0x290(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnWidgetDoubleClicked;                             // 0x2A0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnWidgetToggled;                                   // 0x2B0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnWidgetAddedToFocusPath;                          // 0x2C0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnWidgetRemovedFromFocusPath;                      // 0x2D0(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	class FName                                  ReturnActionMapping;                               // 0x2E0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  ExitActionMapping;                                 // 0x2E8(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  InteractActionMapping;                             // 0x2F0(0x8)(BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UWidget*                               FocusMarker;                                       // 0x2F8(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1469[0x8];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGGUserWidget* GetDefaultObj();

	void SetFocusToWidget();
	void SetEffectSource(const struct FGameplayTag& InEffectTag, const struct FGameplayTag& InSourceTag, bool bEnabled);
	void OnSetIsEnabled(bool bInIsEnabled);
	void OnFocusMarkerEnabled(bool bEnabled, bool bPrevious);
	bool IsMenuPathInteractable();
	bool HasFocus();
	class UGGMenuUserWidget* GetTopMenu();
	class AGGGoat* GetOwningGGPlayerPawn();
	class AGGPlayerController* GetOwningGGPlayer();
	class UGGLocalPlayer* GetOwningGGLocalPlayer();
	class UGGMenuUserWidget* GetNearestMenuParent();
	class UWidget* GetInitialWidgetFocus();
	class UGGMenuComponent* GetGGMenuComponent();
	void EventOnWidgetInteracted(class UGGUserWidget* Widget, const struct FPointerEvent& PointerEvent, const struct FKeyEvent& KeyEvent);
};

// 0x18 (0x320 - 0x308)
// Class Goat2.GGMenuComponentUserWidget
class UGGMenuComponentUserWidget : public UGGUserWidget
{
public:
	bool                                         bGiveFocusOnSpawn;                                 // 0x308(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1473[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UGGMenuUserWidget*                     OwningTab;                                         // 0x310(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGGUserWidget*                         SpawningWidget;                                    // 0x318(0x8)(BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UGGMenuComponentUserWidget* GetDefaultObj();

	bool RemoveWidget();
	void OnAssignedParentView(class UGGMenuUserWidget* InTab, class UGGUserWidget* InSpawningWidget);
	class UGGMenuUserWidget* GetOwningTab();
	class UGGMenuUserWidget* GetOwningMenu();
};

// 0x78 (0x398 - 0x320)
// Class Goat2.GGActionHintBarUserWidget
class UGGActionHintBarUserWidget : public UGGMenuComponentUserWidget
{
public:
	TArray<struct FActionHintStruct>             ActionHints;                                       // 0x320(0x10)(BlueprintVisible, ZeroConstructor, NativeAccessSpecifierPublic)
	TArray<struct FActionHintStruct>             BaseHints;                                         // 0x330(0x10)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UGGActionHintBarEntry>   EntryWidgetClass;                                  // 0x340(0x28)(Edit, BlueprintVisible, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	FMulticastInlineDelegateProperty_            OnActionHintWidgetInteracted;                      // 0x368(0x10)(ZeroConstructor, InstancedReference, BlueprintAssignable, BlueprintCallable, NativeAccessSpecifierPublic)
	class UHorizontalBox*                        LeftHints;                                         // 0x378(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHorizontalBox*                        CenterHints;                                       // 0x380(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UHorizontalBox*                        RightHints;                                        // 0x388(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bShowBaseHints;                                    // 0x390(0x1)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1494[0x7];                                     // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGGActionHintBarUserWidget* GetDefaultObj();

	void UpdateHint(const struct FActionHintStruct& Hint);
	void RebuildHints();
	void OnActionHintEntryCreated(class UGGActionHintBarEntry* EntryWidget);
	TArray<class UGGActionHintBarEntry*> GetEntries(class FName ActionName);
	void ActionHintWidgetInteracted(class UGGUserWidget* Widget, const struct FActionHintStruct& Hint);
};

// 0x118 (0x420 - 0x308)
// Class Goat2.GGNotificationUserWidget
class UGGNotificationUserWidget : public UGGUserWidget
{
public:
	uint8                                        Pad_14B4[0x20];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FGameplayTagContainer                 IncludedTags;                                      // 0x328(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 ExcludedTags;                                      // 0x348(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FGameplayTagContainer                 IgnoredContentTags;                                // 0x368(0x20)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FAdvancedNotificationTagRuleset       AdvancedRules;                                     // 0x388(0x10)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	uint8                                        Pad_14B5[0x10];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	struct FNotification                         CurrentNotification;                               // 0x3A8(0x60)(Protected, NativeAccessSpecifierProtected)
	uint8                                        Pad_14B6[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGGNotificationUserWidget* GetDefaultObj();

	void UpdateWidgetBlueprint(const struct FNotification& Notification);
	void ShowWidgetBlueprint(const struct FNotification& Notification);
	bool ShouldClearQueue(const struct FNotification& Notification);
	void PurgeWidget();
	void OnNotificationDispatched(const struct FGameplayTag& Tag, const struct FNotification& Notification);
	bool IsWidgetReady(const struct FNotification& Notification);
	void HideWidgetBlueprint();
	void HideWidget(enum class ENotificationRemovalReason Reason);
	float GetWidgetDurationExplicit(class UUserWidget* Widget, const struct FNotification& Notification, enum class ENotificationDurationType Type);
	bool GetCurrentNotificationMatchesID(const class FString& NotificationID);
	void ClearWidgetBlueprint();
	void ClearWidget(enum class ENotificationRemovalReason Reason);
};

// 0x40 (0x460 - 0x420)
// Class Goat2.GGNotificationContainerWidget
class UGGNotificationContainerWidget : public UGGNotificationUserWidget
{
public:
	class UDataTable*                            WidgetClassesDataTable;                            // 0x420(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSubclassOf<class UUserWidget>               DefaultWidgetClass;                                // 0x428(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPanelWidget*                          WidgetContainer;                                   // 0x430(0x8)(Edit, BlueprintVisible, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bFillWidgetContainer;                              // 0x438(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14BD[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        DefaultClearTimerDuration;                         // 0x43C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UUserWidget*                           ActiveWidget;                                      // 0x440(0x8)(ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	uint8                                        Pad_14BE[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGGNotificationContainerWidget* GetDefaultObj();

	void ForceClear();
};

// 0x0 (0x460 - 0x460)
// Class Goat2.GGActionUserWidget
class UGGActionUserWidget : public UGGNotificationContainerWidget
{
public:

	static class UClass* StaticClass();
	static class UGGActionUserWidget* GetDefaultObj();

};

// 0x28 (0x50 - 0x28)
// Class Goat2.GGActorFactoryAssetUserData
class UGGActorFactoryAssetUserData : public UAssetUserData
{
public:
	TSoftClassPtr<class AActor>                  BlueprintToSpawn;                                  // 0x28(0x28)(Edit, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)

	static class UClass* StaticClass();
	static class UGGActorFactoryAssetUserData* GetDefaultObj();

};

// 0x88 (0xB8 - 0x30)
// Class Goat2.GGAggregatedNPCTickSystem
class UGGAggregatedNPCTickSystem : public UWorldSubsystem
{
public:
	uint8                                        Pad_14C6[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FGGAggregatedTick>             CharacterTicks;                                    // 0x38(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TArray<class AGGCharacter*>                  CharactersToRemove;                                // 0x48(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_14C8[0x40];                                    // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FGGAggregatedTick>             CachedCharacterTicks;                              // 0x98(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	uint8                                        Pad_14C9[0x10];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class UGGAggregatedNPCTickSystem* GetDefaultObj();

	void SetActive(bool bShouldBeActive);
};

// 0x28 (0x360 - 0x338)
// Class Goat2.GGAIController
class AGGAIController : public AAIController
{
public:
	class UBehaviorTreeComponent*                BehaviorTreeComp;                                  // 0x338(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBlackboardComponent*                  BlackboardComp;                                    // 0x340(0x8)(Edit, ExportObject, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	class UBehaviorTree*                         RoamingTree;                                       // 0x348(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14CF[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class AGGNPC*                                ControlledNPC;                                     // 0x358(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AGGAIController* GetDefaultObj();

	void SwitchToRoaming();
	void StopBehavior();
	void StartBehavior();
	void SetNotChasingActor();
	class AGGNPC* GetControlledGGNPC();
};

// 0x8 (0x368 - 0x360)
// Class Goat2.GGAIController_Animal
class AGGAIController_Animal : public AGGAIController
{
public:
	class AGGNPC_Animal*                         ControlledAnimal;                                  // 0x360(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AGGAIController_Animal* GetDefaultObj();

	class AGGNPC_Animal* GetControlledAnimal();
};

// 0x288 (0x5E8 - 0x360)
// Class Goat2.GGAIController_Humanoid
class AGGAIController_Humanoid : public AGGAIController
{
public:
	float                                        SightRadius;                                       // 0x360(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        LoseSightRadius;                                   // 0x364(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        PeripheralVisionAngleDegrees;                      // 0x368(0x4)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14EC[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UGGNPCInteractDataAsset*               InteractDataAsset;                                 // 0x370(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FStartleDetailsSettings               PanickedNPCStartleSettings;                        // 0x378(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FStartleDetailsSettings               PassedOutNPCStartleSettings;                       // 0x3C8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FStartleDetailsSettings               BurningActorStartleSettings;                       // 0x418(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FStartleDetailsSettings               DangerousObjectStartleSettings;                    // 0x468(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	struct FStartleDetailsSettings               BraceForImpactStartleSettings;                     // 0x4B8(0x50)(Edit, BlueprintVisible, NativeAccessSpecifierPublic)
	float                                        BraceForImpactDotCompare;                          // 0x508(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	int32                                        ChanceToBraceForImpact;                            // 0x50C(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ForgetBraceIgnoreAfter;                            // 0x510(0x4)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_14EE[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<class AGGGoat*, float>                  IgnoreGoatsForBrace;                               // 0x518(0x50)(Protected, NativeAccessSpecifierProtected)
	class UGGNPCManager*                         NPCManager;                                        // 0x568(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UAISenseConfig_Sight*                  SightConfig;                                       // 0x570(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_14EF[0x8];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TArray<struct FInteractionCooldownElement>   InteractionCooldowns;                              // 0x580(0x10)(ZeroConstructor, NativeAccessSpecifierPrivate)
	TMap<class AGGNPC*, float>                   RecentlySeenPukingNPCs;                            // 0x590(0x50)(NativeAccessSpecifierPrivate)
	class AGGNPC_Humanoid*                       ControlledHumanoid;                                // 0x5E0(0x8)(Edit, ZeroConstructor, EditConst, IsPlainOldData, NoDestructor, Protected, HasGetValueTypeHash, NativeAccessSpecifierProtected)

	static class UClass* StaticClass();
	static class AGGAIController_Humanoid* GetDefaultObj();

	void TargetPerceptionUpdated(class AActor* UpdatedActor, const struct FAIStimulus& Stimulus);
	void SetSightEnabled(bool bNewEnabled);
	void PerceptionUpdated(TArray<class AActor*>& UpdatedActors);
	void NPCPerceptionUpdated(class AGGNPC_Humanoid* UpdatedNPC, const struct FAIStimulus& Stimulus);
	bool JoinEvent(class AGGNPCEvent* EventToStart, bool CalledFromEvent);
	bool IsSightEnabled();
	void GoatPerceptionUpdated(class AGGGoat* UpdatedGoat, const struct FAIStimulus& Stimulus);
	class AGGNPCEvent* GetCurrentEvent();
	class AGGNPC_Humanoid* GetControlledHumanoid();
	void AbortEvent(bool CalledFromEvent);
};

// 0x78 (0x2A8 - 0x230)
// Class Goat2.GGAlternateMovementCamera
class AGGAlternateMovementCamera : public AActor
{
public:
	class USceneComponent*                       SceneRootComponent;                                // 0x230(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class UCameraComponent*                      CameraComponent;                                   // 0x238(0x8)(Edit, BlueprintVisible, ExportObject, BlueprintReadOnly, ZeroConstructor, EditConst, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	float                                        GoatRotationSpeed;                                 // 0x240(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               TopDownOffset;                                     // 0x244(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              TopDownCameraRotation;                             // 0x250(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                        TopDownInterpSpeed;                                // 0x25C(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               SideScrollerOffset;                                // 0x260(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              SideScrollerCameraRotation;                        // 0x26C(0xC)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	float                                        SideScrollerInterpSpeed;                           // 0x278(0x4)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ELSRotationMode                   RotationModeOverride;                              // 0x27C(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	enum class ELSInAirRotationMode              InAirRotationModeOverride;                         // 0x27D(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideRotationMode;                             // 0x27E(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bOverrideInAirRotationMode;                        // 0x27F(0x1)(Edit, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class AGGPlayerController*                   ControlledPlayer;                                  // 0x280(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	class AGGGoat*                               ControlledGoat;                                    // 0x288(0x8)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPrivate)
	uint8                                        Pad_150B[0x18];                                    // Fixing Size Of Struct [ Dumper-7 ]

	static class UClass* StaticClass();
	static class AGGAlternateMovementCamera* GetDefaultObj();

	void StartPlayerControl(class AGGPlayerController* Player, enum class EAlternateMode AlternateMode, float CameraBlendInTime);
	void SetStaticCameraLocation(const struct FVector& Location, float InterpSpeed);
	void ResetStaticCameraLocation();
	void ResetPlayerControl(float CameraBlendOutTime);
	bool IsPlayerControlled();
	bool HasStaticCameraLocation();
};

// 0x730 (0x760 - 0x30)
// Class Goat2.GGAlternativeGoatDataAsset
class UGGAlternativeGoatDataAsset : public UDataAsset
{
public:
	class FName                                  AltGoatName;                                       // 0x30(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGameplayTag                          AltGoatTag;                                        // 0x38(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UGGGoatGearInfoDataAsset*              AltGoatDefaultBaa;                                 // 0x40(0x8)(Edit, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                         BodyMesh;                                          // 0x48(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicsAsset*                         PhysicsAssetOverride;                              // 0x50(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UPhysicsAsset*                         RagdollPhysicsAssetOverride;                       // 0x58(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TSoftClassPtr<class UAnimInstance>           AnimationBP;                                       // 0x60(0x28)(Edit, DisableEditOnInstance, Protected, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierProtected)
	TArray<struct FMatElement>                   DefaultMaterialOverrides;                          // 0x88(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FVector                               MeshRelativeLocation;                              // 0x98(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FRotator                              MeshRelativeRotation;                              // 0xA4(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, NativeAccessSpecifierPublic)
	struct FVector                               MeshRelativeLocationAsDriver;                      // 0xB0(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               MeshRelativeLocationAsPassenger;                   // 0xBC(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               MeshRelativeLocationAsRider;                       // 0xC8(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1517[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TMap<TSoftClassPtr<class AGGVehicle>, struct FGGAltGoatMeshTransformsForVehicles> MeshTransformsForVehicles;                         // 0xD8(0x50)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NativeAccessSpecifierPublic)
	struct FVector                               HeadOffsetMarginUnderwater;                        // 0x128(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CapsuleHalfSize;                                   // 0x134(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CapsuleRadius;                                     // 0x138(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bHideHornsComp;                                    // 0x13C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1519[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UStaticMesh*                           DefaultHorn;                                       // 0x140(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                         ShellEffectMeshOverride;                           // 0x148(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        VisualizerCameraArmLength;                         // 0x150(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               VisualizerRelativeLocation;                        // 0x154(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UAnimMontage*                          BrakingMontage;                                    // 0x160(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  FollowBoneName;                                    // 0x168(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  PelvisBoneName;                                    // 0x170(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class FName                                  FloatingBoneName;                                  // 0x178(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bUseDifferentRelativeLocationsWithZoom;            // 0x180(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_151C[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	struct FVector                               RelativeCameraBoomLocation;                        // 0x184(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector                               RelativeZoomedInCameraBoomLocation;                // 0x190(0xC)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_151D[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UCurveFloat*                           RelativeZoomLocationCurve;                         // 0x1A0(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FVector2D                             CameraBoomMinMaxLength;                            // 0x1A8(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        CameraBoomInitialTargetLength;                     // 0x1B0(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        GoatTranslucencyDistance;                          // 0x1B4(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        InAirDistanceCheck;                                // 0x1B8(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_151F[0x4];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	TSoftObjectPtr<class ULevelSequence>         WalkInLevelSequence;                               // 0x1C0(0x28)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, UObjectWrapper, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	struct FGGLimbBones                          LimbBones;                                         // 0x1E8(0x38)(Edit, BlueprintVisible, BlueprintReadOnly, DisableEditOnInstance, NoDestructor, NativeAccessSpecifierPublic)
	TArray<class FName>                          EarBones;                                          // 0x220(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	class FName                                  FallbackGrabBoneName;                              // 0x230(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<class UAnimMontage*>                  BuyGearMontages;                                   // 0x238(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                         bUseGFur;                                          // 0x248(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1520[0x7];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	class UMaterialInterface*                    DefaultGFurMaterial;                               // 0x250(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class USkeletalMesh*                         GFurGrowMesh;                                      // 0x258(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	class UFurSplines*                           DefaultGFurSplines;                                // 0x260(0x8)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	TArray<struct FFurLod>                       GFurLODs;                                          // 0x268(0x10)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, NativeAccessSpecifierPublic)
	bool                                         bUseCapsuleShadows;                                // 0x278(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCastCapsuleDirectShadow;                          // 0x279(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCastCapsuleIndirectShadow;                        // 0x27A(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCastCapsuleDirectShadowMobile;                    // 0x27B(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	bool                                         bCastCapsuleIndirectShadowMobile;                  // 0x27C(0x1)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	uint8                                        Pad_1523[0x3];                                     // Fixing Size After Last Property  [ Dumper-7 ]
	float                                        CapsuleIndirectShadowMinVisibility;                // 0x280(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        TurnRate;                                          // 0x284(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        SprintTurnRate;                                    // 0x288(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        MidAirTurnRate;                                    // 0x28C(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
	float                                        ForwardSpeed;                                      // 0x290(0x4)(Edit, BlueprintVisible, BlueprintReadOnly, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash, NativeAccessSpecifierPublic)
