#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0x1988 (0x2428 - 0xAA0)
// AnimBlueprintGeneratedClass SABP_DirectionBlending.SABP_DirectionBlending_C
class USABP_DirectionBlending_C : public ULSAnimInstanceDirectionBlending
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0xAA0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0xAA8(0x30)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_SubInput_5;                          // 0xAD8(0x118)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_17;                 // 0xBF0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_16;                 // 0xC18(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_15;                 // 0xC40(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_14;                 // 0xC68(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_13;                 // 0xC90(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_12;                 // 0xCB8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_11;                 // 0xCE0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_10;                 // 0xD08(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_9;                  // 0xD30(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_8;                  // 0xD58(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_7;                  // 0xD80(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_6;                  // 0xDA8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_5;                  // 0xDD0(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_4;                  // 0xDF8(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_3;                  // 0xE20(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_2;                  // 0xE48(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult_1;                  // 0xE70(0x28)(None)
	struct FAnimNode_TransitionResult            AnimGraphNode_TransitionResult;                    // 0xE98(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_23;                    // 0xEC0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_22;                    // 0xEE8(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_21;                    // 0xF10(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_20;                    // 0xF38(0x28)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_5;                     // 0xF60(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_5;                       // 0xFB0(0x30)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_19;                    // 0xFE0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_18;                    // 0x1008(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_17;                    // 0x1030(0x28)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_4;                     // 0x1058(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_16;                    // 0x10A8(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_4;                       // 0x10D0(0x30)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_15;                    // 0x1100(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_14;                    // 0x1128(0x28)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_3;                     // 0x1150(0x50)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_13;                    // 0x11A0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_12;                    // 0x11C8(0x28)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_3;                       // 0x11F0(0x30)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_11;                    // 0x1220(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_10;                    // 0x1248(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_9;                     // 0x1270(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_8;                     // 0x1298(0x28)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_2;                     // 0x12C0(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_2;                       // 0x1310(0x30)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_7;                     // 0x1340(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_6;                     // 0x1368(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_5;                     // 0x1390(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_4;                     // 0x13B8(0x28)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend_1;                     // 0x13E0(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult_1;                       // 0x1430(0x30)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_3;                     // 0x1460(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_2;                     // 0x1488(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_1;                     // 0x14B0(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose;                       // 0x14D8(0x28)(None)
	struct FAnimNode_MultiWayBlend               AnimGraphNode_MultiWayBlend;                       // 0x1500(0x50)(None)
	struct FAnimNode_StateResult                 AnimGraphNode_StateResult;                         // 0x1550(0x30)(None)
	struct FAnimNode_StateMachine                AnimGraphNode_StateMachine;                        // 0x1580(0xB0)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_5;                    // 0x1630(0x158)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_4;                    // 0x1788(0x158)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_3;                    // 0x18E0(0x158)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_2;                    // 0x1A38(0x158)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_1;                    // 0x1B90(0x158)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose;                      // 0x1CE8(0x158)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_SubInput_4;                          // 0x1E40(0x118)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_SubInput_3;                          // 0x1F58(0x118)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_SubInput_2;                          // 0x2070(0x118)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_SubInput_1;                          // 0x2188(0x118)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_SubInput;                            // 0x22A0(0x118)(None)
	struct FAnimNode_Inertialization             AnimGraphNode_Inertialization;                     // 0x23B8(0x70)(None)

	static class UClass* StaticClass();
	static class USABP_DirectionBlending_C* GetDefaultObj();

	void AnimGraph(const struct FPoseLink& F_Movement, const struct FPoseLink& B_Movement, const struct FPoseLink& FL_Movement, const struct FPoseLink& BL_Movement, const struct FPoseLink& FR_Movement, const struct FPoseLink& BR_Movement, struct FPoseLink* AnimGraph);
	void ExecuteUbergraph_SABP_DirectionBlending(int32 EntryPoint);
};

}


