#pragma once

// Dumped with Dumper-7!


namespace SDK
{
//---------------------------------------------------------------------------------------------------------------------
// CLASSES
//---------------------------------------------------------------------------------------------------------------------

// 0xD5C0 (0xD890 - 0x2D0)
// AnimBlueprintGeneratedClass MPCPostAnimation.MPCPostAnimation_C
class UMPCPostAnimation_C : public USexyProceduralCharacterAnimation
{
public:
	struct FPointerToUberGraphFrame              UberGraphFrame;                                    // 0x2D0(0x8)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_101;                      // 0x2D8(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_100;                      // 0x3E0(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_99;                       // 0x4E8(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_98;                       // 0x5F0(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_97;                       // 0x6F8(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_96;                       // 0x800(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_95;                       // 0x908(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_94;                       // 0xA10(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_93;                       // 0xB18(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_92;                       // 0xC20(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_91;                       // 0xD28(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_90;                       // 0xE30(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_89;                       // 0xF38(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_88;                       // 0x1040(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_87;                       // 0x1148(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_86;                       // 0x1250(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_85;                       // 0x1358(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_84;                       // 0x1460(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_83;                       // 0x1568(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_82;                       // 0x1670(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_81;                       // 0x1778(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_80;                       // 0x1880(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_79;                       // 0x1988(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_78;                       // 0x1A90(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_77;                       // 0x1B98(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_76;                       // 0x1CA0(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_75;                       // 0x1DA8(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_74;                       // 0x1EB0(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_73;                       // 0x1FB8(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_72;                       // 0x20C0(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_71;                       // 0x21C8(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_70;                       // 0x22D0(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_69;                       // 0x23D8(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_68;                       // 0x24E0(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_67;                       // 0x25E8(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_66;                       // 0x26F0(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_65;                       // 0x27F8(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_64;                       // 0x2900(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_63;                       // 0x2A08(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_62;                       // 0x2B10(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_61;                       // 0x2C18(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_60;                       // 0x2D20(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_59;                       // 0x2E28(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_58;                       // 0x2F30(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_57;                       // 0x3038(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_56;                       // 0x3140(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_55;                       // 0x3248(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_54;                       // 0x3350(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_53;                       // 0x3458(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_52;                       // 0x3560(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_51;                       // 0x3668(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_50;                       // 0x3770(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_49;                       // 0x3878(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_48;                       // 0x3980(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_47;                       // 0x3A88(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_46;                       // 0x3B90(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_45;                       // 0x3C98(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_44;                       // 0x3DA0(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_43;                       // 0x3EA8(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_42;                       // 0x3FB0(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_41;                       // 0x40B8(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_40;                       // 0x41C0(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_39;                       // 0x42C8(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_38;                       // 0x43D0(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_37;                       // 0x44D8(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_36;                       // 0x45E0(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_35;                       // 0x46E8(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_34;                       // 0x47F0(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_33;                       // 0x48F8(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_32;                       // 0x4A00(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_31;                       // 0x4B08(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_30;                       // 0x4C10(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_29;                       // 0x4D18(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_28;                       // 0x4E20(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_27;                       // 0x4F28(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_26;                       // 0x5030(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_25;                       // 0x5138(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_24;                       // 0x5240(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_23;                       // 0x5348(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_22;                       // 0x5450(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_21;                       // 0x5558(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_20;                       // 0x5660(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_19;                       // 0x5768(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_18;                       // 0x5870(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_17;                       // 0x5978(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_16;                       // 0x5A80(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_15;                       // 0x5B88(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_14;                       // 0x5C90(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_13;                       // 0x5D98(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_12;                       // 0x5EA0(0x108)(None)
	uint8                                        Pad_A05[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_TwoBoneIK                   AnimGraphNode_TwoBoneIK_1;                         // 0x5FB0(0x1E0)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_80;                       // 0x6190(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_79;                       // 0x6298(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_78;                       // 0x63A0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_77;                       // 0x64A8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_76;                       // 0x65B0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_75;                       // 0x66B8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_74;                       // 0x67C0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_73;                       // 0x68C8(0x108)(None)
	struct FAnimNode_LinkedInputPose             AnimGraphNode_SubInput;                            // 0x69D0(0x118)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_72;                       // 0x6AE8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_71;                       // 0x6BF0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_70;                       // 0x6CF8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_69;                       // 0x6E00(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_68;                       // 0x6F08(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_67;                       // 0x7010(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_66;                       // 0x7118(0x108)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_2;                    // 0x7220(0x158)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_7;             // 0x7378(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_6;             // 0x7398(0x20)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_11;                       // 0x73B8(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_10;                       // 0x74C0(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_9;                        // 0x75C8(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_8;                        // 0x76D0(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_7;                        // 0x77D8(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_6;                        // 0x78E0(0x108)(None)
	uint8                                        Pad_A1E[0x8];                                      // Fixing Size After Last Property  [ Dumper-7 ]
	struct FAnimNode_Fabrik                      AnimGraphNode_Fabrik;                              // 0x79F0(0x190)(None)
	struct FAnimNode_LegIK                       AnimGraphNode_LegIK_3;                             // 0x7B80(0xF8)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_65;                       // 0x7C78(0x108)(None)
	struct FAnimNode_LegIK                       AnimGraphNode_LegIK_2;                             // 0x7D80(0xF8)(None)
	struct FAnimNode_CopyBone                    AnimGraphNode_CopyBone_5;                          // 0x7E78(0xF0)(None)
	struct FAnimNode_CopyBone                    AnimGraphNode_CopyBone_4;                          // 0x7F68(0xF0)(None)
	struct FAnimNode_CopyBone                    AnimGraphNode_CopyBone_3;                          // 0x8058(0xF0)(None)
	struct FAnimNode_CopyBone                    AnimGraphNode_CopyBone_2;                          // 0x8148(0xF0)(None)
	struct FAnimNode_CopyBone                    AnimGraphNode_CopyBone_1;                          // 0x8238(0xF0)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_64;                       // 0x8328(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_63;                       // 0x8430(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_62;                       // 0x8538(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_61;                       // 0x8640(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_60;                       // 0x8748(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_5;                        // 0x8850(0x108)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose_1;                    // 0x8958(0x158)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_5;                     // 0x8AB0(0x28)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_4;                        // 0x8AD8(0x108)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_2;                   // 0x8BE0(0xA0)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_4;                     // 0x8C80(0x28)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_7;             // 0x8CA8(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_5;             // 0x8CC8(0x20)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_6;             // 0x8CE8(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_4;             // 0x8D08(0x20)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool_1;                   // 0x8D28(0xA0)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_5;             // 0x8DC8(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_3;             // 0x8DE8(0x20)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_2;             // 0x8E08(0x20)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_3;                        // 0x8E28(0x108)(None)
	struct FAnimNode_SaveCachedPose              AnimGraphNode_SaveCachedPose;                      // 0x8F30(0x158)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_3;                     // 0x9088(0x28)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_2;                     // 0x90B0(0x28)(None)
	struct FAnimNode_BlendListByBool             AnimGraphNode_BlendListByBool;                     // 0x90D8(0xA0)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_1;             // 0x9178(0x20)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose_1;                     // 0x9198(0x28)(None)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace;               // 0x91C0(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_59;                       // 0x91E0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_58;                       // 0x92E8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_57;                       // 0x93F0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_56;                       // 0x94F8(0x108)(None)
	struct FAnimNode_CopyBone                    AnimGraphNode_CopyBone;                            // 0x9600(0xF0)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_4;             // 0x96F0(0x20)(None)
	struct FAnimNode_TwoBoneIK                   AnimGraphNode_TwoBoneIK;                           // 0x9710(0x1E0)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_55;                       // 0x98F0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_54;                       // 0x99F8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_53;                       // 0x9B00(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_52;                       // 0x9C08(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_51;                       // 0x9D10(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_50;                       // 0x9E18(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_49;                       // 0x9F20(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_48;                       // 0xA028(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_47;                       // 0xA130(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_46;                       // 0xA238(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_45;                       // 0xA340(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_44;                       // 0xA448(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_43;                       // 0xA550(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_42;                       // 0xA658(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_41;                       // 0xA760(0x108)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_3;             // 0xA868(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_40;                       // 0xA888(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_39;                       // 0xA990(0x108)(None)
	struct FAnimNode_UseCachedPose               AnimGraphNode_UseCachedPose;                       // 0xAA98(0x28)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_2;             // 0xAAC0(0x20)(None)
	struct FAnimNode_LegIK                       AnimGraphNode_LegIK_1;                             // 0xAAE0(0xF8)(None)
	struct FAnimNode_LegIK                       AnimGraphNode_LegIK;                               // 0xABD8(0xF8)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_38;                       // 0xACD0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_37;                       // 0xADD8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_36;                       // 0xAEE0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_35;                       // 0xAFE8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_34;                       // 0xB0F0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_33;                       // 0xB1F8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_32;                       // 0xB300(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_31;                       // 0xB408(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_30;                       // 0xB510(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_29;                       // 0xB618(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_2;                        // 0xB720(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint_1;                        // 0xB828(0x108)(None)
	struct FAnimNode_Constraint                  AnimGraphNode_Constraint;                          // 0xB930(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_28;                       // 0xBA38(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_27;                       // 0xBB40(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_26;                       // 0xBC48(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_25;                       // 0xBD50(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_24;                       // 0xBE58(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_23;                       // 0xBF60(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_22;                       // 0xC068(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_21;                       // 0xC170(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_20;                       // 0xC278(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_19;                       // 0xC380(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_18;                       // 0xC488(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_17;                       // 0xC590(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_16;                       // 0xC698(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_15;                       // 0xC7A0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_14;                       // 0xC8A8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_13;                       // 0xC9B0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_12;                       // 0xCAB8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_11;                       // 0xCBC0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_10;                       // 0xCCC8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_9;                        // 0xCDD0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_8;                        // 0xCED8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_7;                        // 0xCFE0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_6;                        // 0xD0E8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_5;                        // 0xD1F0(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_4;                        // 0xD2F8(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_3;                        // 0xD400(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_2;                        // 0xD508(0x108)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone_1;                        // 0xD610(0x108)(None)
	struct FAnimNode_Root                        AnimGraphNode_Root;                                // 0xD718(0x30)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_1;             // 0xD748(0x20)(None)
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace;               // 0xD768(0x20)(None)
	struct FAnimNode_ModifyBone                  AnimGraphNode_ModifyBone;                          // 0xD788(0x108)(None)

	static class UClass* StaticClass();
	static class UMPCPostAnimation_C* GetDefaultObj();

	void AnimGraph(const struct FPoseLink& InPose, struct FPoseLink* AnimGraph);
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MPCPostAnimation_AnimGraphNode_ModifyBone_B15F45704015C8D2D1F1BC8CDB615E12();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MPCPostAnimation_AnimGraphNode_ModifyBone_182339DA44B4AA3BE1E530A982198A0E();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MPCPostAnimation_AnimGraphNode_ModifyBone_CB41667F4F0A303412F89992E1B94187();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MPCPostAnimation_AnimGraphNode_ModifyBone_509689B74109F377925D18AB34E556B8();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MPCPostAnimation_AnimGraphNode_ModifyBone_53B5A84B4973277D9E04B28DE1902B86();
